{"title": "Furry Webcomics", "content": "A webcomic which uses the Funny Animal as the basic guideline for their characters. Furry Webcomics typically have the characters acknowledge that they are animals in some way — i.e. the story would be different if the characters were just drawn as humans. Othertimes the characters are animals simply for aesthetic reasons.\n\nA sub trope of Furry Comic. Generally overlaps with World of Funny Animals.\n• 70-Seas: A fantasy comic about a pirate, a ninja, and a prophet's adventures on a planet made of islands that drift on the ocean's current.\n• AGENCY: A Massive Multiplayer Crossover comic starring Sandy Cheeks and Shadow the Hedgehog as they search for DW Read, Fox, and Marcus McCloud, who have been kidnapped by a mysterious organization.\n• Alone, Together: A webcomic created by Steven A. Gallacci, the creator of Albedo: Erma Felna EDF. The main protagonist is a mouse soldier named Jerom, who ends stranded in a island with a rabbit soldier girl named Danni and their respective countries are in war towards each other.\n• Altermeta: A Slice of Life webcomic, with fantasy elements, such as the fact that the main characters are Kuvrahks.\n• The Annals Of Hearthstone: Set in the world of Hearthstone, two teams of heroes fight against the threat of the Cartel; Christian apologist undertones abound.\n• Ape, Not Monkey: a webcomic about the interaction of a group of characters holding a number of different beliefs, written from an atheist, skeptical perspective.\n• At The Heart Of It All (hosted here ): If you liked Concession you might like this. By the same artist, but simplistic art. On hiatus since 2010.\n• At Arm's Length: A fantasy-comedy comic focusing on a trio of woman who try to balance their domestic issues and their goals in life. Oh yeah, they\u0092re also secretly four-armed magical beings from another dimension who fight threats to Earth. Jokes at the expense of pop culture and thrashed villains ensue...\n• The Awkward Yeti: A Slice of Life webcomic about a Yeti named Lars and the different discussions he has with his organs, specifically Heart and Brain.\n• Ballerina Mafia: By the same person who ran Concession and At The Heart Of It All . Set in more or less the same world as Concession, but light-hearted, gag-a-day and usually with more simplistic art.\n• Bar'd: Sprite comic about misadventures of the staff of a bar.\n• Bear Nuts: If The Care Bears and the Happy Tree Friends had kids and sent the offspring to live in a zoo.\n• Becoming Blizzard: A gay bear comes to term with his homosexuality and starts exploring the many aspects of it.\n• The Bedfellows: A humorous comic following the absurd antics of two Mix-and-Match Critter roommates. Later adapted into a webtoon.\n• Better Days: A furry, Objectivist webcomic notable for its chronic use and Deconstruction of many, many tropes, including, among other things, Brother\u0096Sister Incest. Ended.\n• Beyond The Veil: A deposed galactic emperor is brought back in the body of a woman. And wants her Empire back.\n• Beyond the Western Deep: Redwall-inspired tale about trying to keep the world from plunging back into war.\n• Bitter Coffee (hosted here ): A (mostly) 4 panel gag-a-day about an aspirant anthropomorphic feline comic artist who also deals things with his neighborhood, friends, and pop culture.\n• Bittersweet Candy Bowl: A high school Love Dodecahedron comic, kind of furry but more cartoony.\n• Black Tapestries: A fantasy comic about an immortal werefox and the constant conflicts between humans and anthros.\n• Blade of Toshubi: An After the End comic where furries have replaced humans.\n• Blade Under Mask: A web comic set in a world inspired by feudal Japan with anthropomorphic anthropoids, it's focus is on the life of a orchid mantis named Nae who dreams of being a geisha, but is facing challenges from her own mind.\n• Blue Crash Kit: Three superheroes contend with quite frankly insane goings on. Also, Polyamory .\n• Boomer Express: A funny, lighthearted but action-packed comic involving two young adult kangaroos and their adventures fighting monsters, demons, mad scientists and their work schedules.\n• Bridgettes Belly (hosted here ): Dramatic story about a mouse with a really flexible waistband.\n• Broken Plot Device: Follow the surreal, amusing, and generally just weird lives of seven acquaintances — one isn't precisely anyone's friend — in the Byron Factory apartments. Unfortunately the comic's owner has decided to stop updating the comic and start a 'free lance art site' .\n• Buddies In Big Places: (hosted here ) A daily furry soap opera, with sketchy art. It covers the sometimes interconnected lives of a huge cast, with numerous stories. Is frequently not safe for work.\n• The Bug Pond: The slice-of-life adventures of a group of insects living at a pond in the midwest.\n• Bug Pudding: Tales from the critters of Lake Tuberville, GA. Reminiscent of Pogo and Looney Tunes.\n• Buster Wilde Weerwolf, a comedy that features a straight human who turns into a \"weerwolf\" during the night.\n• By the Saints: A black and white comic with a distinctive penciled look. Imagine if the American Civil War (or something very much like it) was being fought by anthropomorphic foxes. The main character, Thad, is in a moral dilemma because he has forsaken his own countrymen to go and fight for the other side for idealistic reasons.\n• Canis: Short, 14 page comic Deconstructing the many amateur comics on Deviant ART and romanticism of wolves in general.\n• CaribbeanBlue: The story of a human-turned-cat and his two Cat Girl friends taking a relaxing vacation at an island resort, but things get complicated when they are pulled into a local legend of the famed \"Nekocat Savior\".\n• Cigarro & Cerveja: The tales of a chain-smoking hare named Cigarro and her friend Cerveja, a beer-drinking Canada Goose.\n• Carpe Diem: A furry comic with a predominantly male, blatantly gay cast (except for Josh), including a middle aged panda.\n• Carry On: Slice of Life webcomic about a hyena who works for a big city newspaper.\n• Catena: A household full of anthropomorphic cats has wacky adventures. No, really. Also better than it sounds.\n• Cats N' Cameras : The misadventures and exploits of the staff of a small camera shop... and porn studio. Plus a quick reference to The Dukes of Hazzard. Saying it's NSFW from time to time is not an exaggeration at all.\n• Webcomic/Caribbean Blue: Cats and Cat Girls in adventures in the tropics.\n• Caves And Critters: Follows several teams of furry adventurers through a mostly Standard Fantasy Setting as they fight evil, help people, and become embroiled in a conspiracy of world-spanning proportions.\n• The Chanterelleand May Life: A hellaciously cute pink bunny and her bovine best friend wreak bloody havoc across the enchanted kingdom of Toxic Tampa Bay.\n• CHEVALIER: Fantasy fairy tale adventure about a blacksmith mouse in a fairy tale realm trying to fulfill his dreams of high adventure, save a kidnapped princess, stop a war between 2 kingdoms, and become a hero. (hosted here )\n• Cherry's Cure: A human girl domesticated by vampires strives to save her furry friends who have gone feral. Finished.\n• Chicken Wings: Comedy about a dumb, but enthusiastic pilot from a small air charter.\n• The Class Menagerie: A comedy about 7 college freshmen sharing a floor of a dilapidated dorm. Ended.\n• Closed Gate: The adventures of a runaway otter slave in the empire known as the Union who tries to find out the truth about the colonization of his island and the disappearance of his father. He eventually discovers a dark secret behind the Union\u0092s expansionism.\n• Cloudscratcher: A high-flyin', Diesel Punk flavoured Genre Throwback to the likes of Don Bluth films and 90s Disney cartoons (TaleSpin most prominently), with content no stronger than what would be allowed in said cartoons. Come join the crew of the Cloudscratcher as they battle against the forces of the Margoth Empire!\n• Coach Random: Originally a comic in a college newsletter. Its main characters are all dogs (with a rarely-appearing frog and a few humans thrown in).\n• Code Name: Hunter: In a parallel world with Furries but no humans, An age old barrier in London designed to prevent magic entering the world had been broken by German bombing in WWII and a secrete British Government Agency develops around it to police the magic and maintain the Masquerade. Focuses on two agents, Hunter and Gypsy. Also in dead-tree format.\n• Coming Up Violet: The sequel and Spin-Off to Fur Will Fly. This time the focus shifts from Brad to the Cute Kid from FWF (three guesses what her name is) and her circle of friends. A constantly improving art style and an engaging use of tropes makes it so that this sequel grows a beard instead of a shark. Not updated since 2010: seems to have died right in the middle of a conversation. Such a sad and common fate for webcomics.\n• Commander Kitty: A weekly Web Comic by Scotty Arsenault featuring the misadventures of a cast of Funny Animals IN SPACE!!!\n• Concession: A comic centering on the lives of a group of furries working at a movie theater concession stand... At first. Notable for having a lot of Shocking Moments and defining \"NOT SAFE FOR WORK\" on multiple levels. Ended.\n• Corgi Quest: An Interactive Comic about a party of welsh corgi adventurers exploring a dungeon and accomplishing nothing in particular beyond shenanigans.\n• Cosmic Hero: A webcomic about a space officer, where most aliens are furries.\n• Counter Rose (hosted here ): Science Fiction series in which a nine tailed scientist fox named Juichi is pursued on suspicion that he is the descendant of a goddess who created his world, currently controlled by the Baal, led by the angel Reciful. His destiny is to restore his people to heaven by collecting nine colour-restoring roses. A few side stories also feature, including prequel series Jacos' Story (currently offline, sadly). Last updated in 2012.\n• Coyote Bison:is an old fashioned Western comedy about the meanest coyote in Wyoming, a very confused buffalo and a soul-haunting chicken. It written and drawn by Shenjay and her boyfriend, Alex García, as co-writer.\n• Crikey Duck: A webcomic centering around three American duck criminals hiding in Australia from a Mafia boss who they had robbed.\n• Crimson Flag: A fantasy comic about a world inhabited by multiple species of fox (Reyn)\n• also on the same server is Ye Gods which runs on more comedy than CF.\n• Critter Coven: Slice of Life comedy featuring a cast of real-life witches in a World of Funny Animals.\n• Critterlopers: A polar bear, a tough mouse, a psychotic duck and other animals infiltrate and try to take down the human world. '\n• Crossed Claws: A comic in progress about a rabbit named Ria who befriends a cat named Sandy.\n• Crossing-Over: A furry webcomic about a ferret named Cliff who prowls at night wearing a mask.\n• Cross Time Cafe: A webcomic featuring cast members from half a dozen webcomics able to interact outside their normal continuities.\n• The Cyantian Chronicles: A Science Fiction Soap Opera featuring furries as technologically advanced aliens. The Chronicles are composed of a handful of different webcomic series at different times and places in the continuity; the most prominent of these are Akaelae and Campus Safari.\n• Daily Grind: Action-Adventure inspired by the old radio shows of the 1930s and '40s.\n• Dan and Mab's Furry Adventures: A light-hearted animesque Furry series originally based on characters on a MUD the author was a regular member of. Despite its origins, it is a well-written and consistently funny series with a surprisingly detailed Back Story (much of it only given in an extended world description presented as a set of separate webpages).\n• Dandy and Company: A webcomic featuring a cast of talking dogs and their human owners.\n• The Dawn Chapel: An anthology of short stories on a loosely connected theme of fantasy adventures, fairy tales, and folklore.\n• Deer Me: A Slice of Life work about two deer and one horse roommates and the crazy shenanigans they come across.\n• The Depths: Leilani Perierre is a wild, seductive sea otter of the South Pacific islands, caught up in epic adventure, romance, and perils in the early 20th century. ADULTS ONLY for Nudity, strong sexual content, and violence.\n• Digger: In a strange fantasy world, a wombat is unwittingly manipulated by dark magical forces into digging a portal between worlds. In her efforts to get home, she makes strange friends and dangerous enemies, and helps discover a bizarre plot involving a grotesque cult and the corpse of their god. Ended March 17, 2011.\n• Dimension Twist (hosted here ) It's featured/Hosted on Deviant Art .\n• Dinosaur Comics: Not actually a furry comic in any sense, as it contains no anthropomorphized animals at all! Notable for being the probably only comic in existence to only ever use the same six panels (containing exactly three dinosaurs), despite having literally thousands of strips at this point.\n• Divided Sky: A group of fighters based off the Zodiac must fight people turned into robots. Add in a bunch of Lampshade Hanging, a relationship between two hybrids, and a mute lion, and you've got Divided Sky. On indefinite hiatus with the site taken offline.\n• DNA: A story about some people who shouldn't exist, and how they deal with that.\n• Dog's Days of Summer: An adult interactive webcomic set on the fictional Bendigo Beach in Australia, the premise was about Diego the dingo's day to day life as he and his friends try to woo the tourists as well as deal with Diego's ex-boyfriend from last summer.\n• Down the Hatch: An adult webcomic exploring the odd and sometimes violent relationship between a man-eating, firebending Youkai and a would-be victim, the human Noah.\n• Draconia Chronicles: Series telling the story of a centuries long war between the Dragons of the Dragonlands and the Tigers of the Tiger Territories. Unique in that it's only the females of the two races that are anthropomorphic.\n• Dragon City: About humanoid dragons. They evolved from raptors back in the Cretaceous and fled underground when the dinosaurs were wiped out. The comic takes place in current day Earth where the dragons are still living beneath the Earth. According to them, though, they are not humanoid dragons, but humans are dragonoid apes. And hey, if you like time traveling tons of movie quotes and puns this is for you.\n• Dreamkeepers: A fantasy graphic novel series where unique creatures called Dreamkeepers live in the Dreamworld and keep hordes of nightmare monsters from invading our minds as we sleep. Not technically a webcomic, but most fans learned about the series through the internet, the books are independently sold through the internet, and there is a promotional webcomic on the webpage that serves as a prologue (or prelude, if you will) to the series.\n• Drugs & Kisses A webcomic detailing the lives of a group of stoners.\n• Druids: A furry web comic based on the Warcraft setting and lore. It explores the unusual and erotic relationship two druids from the opposite sides of a War. The story focuses mainly on the relationship between Kinar, a Worgen and Serid, a Tauren. The comic starts with Kinar and Serid first meeting at the dawn of their relationship. This comic is intended for Mature audiences only and is not safe for work.\n• Dust Bunny Mafia: Dangerously cute Criminals with their own mobster families, similar to Looney Tunes. Updates Tuesdays and Fridays.\n• The Dynamite Twins and Friends: Part of the larger Color World Universe, it is a series of not only webcomics, but is also a transmedia franchise that includes feature comics and animations. It is about two twin foxes with supernatural abilities, and they go and have crazy adventures while learning about the world around them.\n• Bunny and Bear: A Spin-Off featuring two best friends in a forest town.\n• Ebin and May: A furry webcomic with politics and romance.\n• The End Of Things: A furry comic about three friends in their last year of college, all of whom are struggling to figure out where the fit in the world, and one of whom has more problems than he lets on...\n• Evon: The bear sorceress, Evon, travels with the warrior rat, Herodotus, to avoid being captured by an evil organization that want to use her powers to take over the world. All the while they face adventure, danger and a little romance.\n• Exterminatus Now is what happens when you mix Sonic the Hedgehog, Warhammer 40,000, and a truckload of Black Comedy. Sonic-like characters working for the equivalent of the Warhammer 40,000 Inquisition. And yes, they use the line.\n• The Eye of Ramalach: The adventures of an archeologist and a mysterious artifact.\n• Fabuland Housewives is a PHOTO-webcomic with Funny Animal characters. How does this work? The characters are toys, from the LEGO Fabuland theme, to be precise.\n• Faux Pas: Randy the red fox and the other main characters are studio animals, which means they have picked up lots of human characteristics. Some Carnivore Confusion and lots of fun, professionally drawn, suitable for all ages. And it's 1312 comic strips long! (as of 6/5/2011)\n• Felicia, Sorceress of Katara: Mixed media comedic fantasy series about a vain and vindictive vixen sorceress. Some of the earlier webcomic arcs are now print-only.\n• Femmegasm This follows the unusual lives of June July and Shelly Mander, whatever it may be.\n• Fite! The comic is as it sounds, straight to the comics\n• Fighting Dreamers A comic where the Dreamer forms of housecats fight dimension destroying monsters on a regular basis.\n• Fletcher Apts: A humorous, full-color comic about three friends from high school who share an apartment and deal with stress, women, random craziness and each other as they slog through that crazy, messed-up chicken fight called 'Life'. In Fletcher Apts., there is never a dull moment. Oh, and there's also \"Goat Jesus\". Rated Web-M for language and the occasional boobie.\n• Fluffy and Mervin: gag-three-times-a-week webcomic about a cat and a mouse who don't spend their time chasing one another.\n• Forest Hill: A Slice of Life comic featuring a group of friends, their families, and the roller coaster that is life.\n• The Foxfire Chronicles: A dramatic and serious piece featuring transformations, Magic, and interplanetary intrigue. Plus, for a little while, it takes place in Chernobyl . However as to save time this rebooted comic is now here and this'll take you to the most recent page.\n• Foxy Flavored Cookie`: The story of a human who gets bitten and turned into a fox, which results in amnesia and having to join the large community of \"lycans\" living secretly underground.\n• Freefall: A squid, a doggy, and a robot walk into a spaceship... Originally a print comic with softer science, now online with hard sci-fi and a lot of rather touching plot points. Safe for work.\n• Furmentation: Hamster-centric webcomic focusing on misadventures including magic schools, submarines, demon invasions, and old school references.\n• FurPiled: A Slice of Life comic about a husky named Husky and his friends.\n• Furr: A series about three Warrior Cats, a wolf pup, a genre-savvy alien vixen, and their odd adventures.\n• Furry Experience: A Slice of Life comic about three college house-mates.\n• Furthia High: A comic about the last human on a world of furries attending high school while trying to figure out if he (Kale) was born naturally or born a fox, and (recently mentioned) the furries have found a way to reverse the process used to turn them furry in the first place! Really good: plot, colors, sharpness of the comic frame words etc... and characters.\n• Fur Will Fly: A human is zapped into a dimension of anthropomorphic animals by an interdimensional experiment gone wrong. Completed.\n• The Fuzzy Princess: A comedy comic about a cat princess from another world who gets stranded on Earth.\n• Fuzzy Things: A comic about the adventures of eight kids on a planet both mundane and futuristic. It started life as an action comedy with occasional bouts of seriousness before pressing the Reset Button and becoming what it is now.\n• Generation 17 (hosted here ): A sci-fi comic following Marianne the cat, Joshua the hedgehog, and a bunch of other characters trying to get out of a futuristic jail... And also figuring out where they are, how they ended up in there, what are those weird gems grafted in their bodies, and where the hell are their clothes. Very Not Safe for Work.\n• The Golden Week: The story of a budding relationship between a lion reporter and a dalmatian high school student.\n• Gon-E'choo!: The story of a '40s-era alligator waking up in the '80s and befriending a young otter.\n• Grand Hunter (hosted here ): A comic about anthropomorphic characters drawn in a Sonic the Hedgehog type style in a story that has elements of One Piece, Fairy Tail, and other famous stories. Join a cast of characters that include a summoner of magic monsters, a pyro-mage, a kung-fu genius, and a self-proclaimed demon of the Netherworld as they travel the world in search of fun and adventure.\n• The Heroes Of Middlecenter: After the people of Middlecenter are turned into statues by the evil Lord Baltimore, the four heroes must save everybody, for a start. OFFLINE.\n• Hamsta Powah: A comic about a group of rodents trying to find a place in the world while saving it from an ancient evil. Combines comedy and fluffy cuteness with surprisingly kickass action and good character development across the entire cast.\n• Harkovast: Set in a swords and sorcery fantasy world where every country is populated by a different race of anthropomorphic creatures, but now this world is coming under threat by a dark army from the West known only as The Nameless. The tone is (mostly) fairly serious, with a lot of bloody violence. It is also noticeable for being mostly hand drawn and coloured, using pens and coloured pencils.\n• Havoc Inc: An interstellar shipping company run by a gay couple. One of the \"classic\" pre-internet furry comics being posted online by Radiocomix.\n• Here, Wolf: A sarcastic wolf faces prejudice when he dates a human.\n• Housepets!: The daily lives of Peanut Butter the dog and Grape Jelly the cat, and other humans and pets of Babylon Garden.\n• The Hunters Of Salamanstra: Hosted here. A wolf-girl follows her sister's footsteps in hunting strange monsters that plague the Kingdom of Salamanstra.\n• Ice Eevee: Deep in Coastal Kalos, a young Glaceon finds a huge city and starts rebuilding his life better than it was before.\n• Ichabod The Optimistic Canine: A Welsh Corgi takes an optimistic approach towards the challenges of life.\n• ICQ (hosted here ): Three very different people move in together and deal with each other and life in general in a fictional college town.\n• I Mew: A smartphone that turns the owner into a cat.\n• Inherit the Earth continues the storyline of a light-hearted Adventure Game. It is set in a Low Fantasy world where Uplifted Animals have built medieval societies based around extremely advanced technology following the unexplained disappearance of humanity.\n• In Our Shadow 50,000 years after humanity's extinction a numbat and a wallaby strive to find a way to free their people from the overwhelming might of the Rat Empire.\n• Irrational Fears: A chupacabra's journey to face the monsters under her bed.\n• Jack: A darker comic aimed for mature audiences (aka gore, nudity, strong language, etc. aren't avoided; in short, Not Safe for Work). The main character, Jack, is the Sin of Wrath, serving as The Grim Reaper. The comic mainly focuses on separate story arcs of normal people living in a Crapsack World and their problematic situations (often related to impending death), but occasionally you get arcs that dwell deeper into Jack's mysterious past and the constant powerclash between Heaven and Hell — and sometimes both types of arcs mix together as furries in the living world are played as puppets by higher forces. Also justifies why furries exist and humans don't (anymore). It's extremely complicated and hard to follow, but if you got the time, reread it and it makes WAY more sense each reread. Oh, and it's 1464 comic pages long and gaining as of 6/5/2011.\n• Jack Legend : A fox has a great ancestry of heroes and masters of their crafts. As the last member of his family line, it is up to Jack (with the help of his sheepish sidekick Buddy) to find his own glory, and make his ancestry proud.\n• Katinka by J.B.Pawstep. As the author describes it, \"Katinka is a story about animals living on different planets. But the planet the dogs were supposed to rule are under attack! Silver, Katinka`s Father and King of her Planet, is a great Warrior and helps his Dog-Friends in Need. The Attacker remains unkown, so Katinka and her new Friends went off to find out who initiated the Attack and how they can prevent Attacks. A long Journey lays ahead, full of colorful Characters and dangerous Adventures in which Katinka and her Friends will be quested to recreate a Planet, that was once known as Paneruga.\n• Rework The Dead (hosted here ), by the same author as Jack, is a Zombie Apocalypse comic... . Again, so far from safe for work it can't poke at it with a very long stick. Expect terrors from both, but also positive moments.\n• The Katbox: A collection of several different webcomics.\n• Kemono Cafe: Hosts several webcomics, such as Las Lindas, Knighthood, * Addictive Science, Tinaofthe South, I Mew, Paprika, Caribbean Blue, Practice Makes Perfect ,Rascals, and The Eyeof Ramalach\n• The Kenny Chronicles: The life of a teenage fox 115-116 years in the future.\n• Kevin & Kell: The oldest Web-exclusive comic. Set in a world of anthropomorphic animals, this strip centers around the day to day life of family formed from the mixed marriage of a rabbit (Kevin) and a wolf (Kell), but often ranges far afield in its satire of human behavior.\n• Isla Aukate: An island of furries are embroiled with a war with aliens.\n• Lackadaisy: An all-feline answer to The Untouchables, set at a St. Louis speakeasy during Prohibition. A rather weird case of Furries Are Easier to Draw — the characters are canonically human, but are (usually) drawn as cats, simply because the artist's better at expressing emotions that way.\n• Las Lindas: centers around Mora Linda, a female cow who runs a family farm, and the hijinx that ensue between herself and her rivals, co-workers, and other acquaintances. (There are also has several bonus comics related to the main strip that flesh out side stories or, in the case of bonus comic Breasts Are the Best, provide nothing but fanservice.)\n• Last Res0rt: A furry violinist volunteers for a lethal Reality Show set in The Future in order to save her Mad Scientist friend, but finds out she's also a vampire. A majority of the characters are furries, including a few Taur species, but there's also some humans and plenty of Half Human Hybrids thrown in as well.\n• Latchkey Kingdom: Starts as a Zelda parody, quickly gets more unique.\n• Laugh-Out-Loud Cats AKA Hobotopia: Antics of 2 feline hobos who speak like LOLCats. Daily, single-panel.\n• The Legend of Lucy: A comic about a pig bounty hunter.\n• Little Tales: a slice of life webcomic that features the experiences of the author as told via furry avatars. Also had the side comic of The Man Who Was Thursday.\n• Loon Land: Meet the alien Lana Loon and the terrestrial Mike Moon and follow their troublesome courtship. A feathery comic about sex, love, relationships, dating, gender politics, porn and more.\n• Maple Park Misadventures (hosted here ): A Slice of Life comic about two eighth graders, Max Lascerna and Ethan Merullo, attending their first year of high school at the titular Maple Park High School. Updates on weekends, usually.\n• Marco And Marty: A Slice of Life comic about a cat and dog going to college.\n• Murry Purry Fresh And Furry: A slice of life comedy about furries working retail in a porn store.\n• My Little Python: An edutainment webcomic about cute, anthropomorphic snakes that act like kids and do what kids do, also with some nerd references, especially to Microsoft Windows.\n• Nature of Nature's Art: A character drama with horror and deep themes, conveniently disguised as a comic about animals who fight each other with supernatural kung-fu. Set in an alternate universe. Big words are involved.\n• Newshounds: A long-running webcomic about a team of dogs (and a cat and a rat) who work in the media industry with their owner Lorna.\n• Nicole and Derek: Spin-Offspring sequel to both Namir Deiter and You Say It First.\n• Off-White: A fantasy webcomic revolving around a wolf who is the reincarnation of Sköll, the wolf who chases and attempts to eat the sun each day in Norse Mythology.\n• The Order of the Black Dog: An alternate universe ruled by furries where Egypt is a superpower and Concession characters are gender-flipped. And when eldritch horrors awaken from their eons-long slumber.\n• Original Life: The much lighter-toned sequel to Jay Naylor's previous comic Better Days, detailing the life of the last comic's main cast of characters after they have settled down and formed families of their own. It especially focuses on the three children of Fisk and Elizabeth, namely Abigail, Thomas, and Janie. The Comic has recently gone slightly astray though going back to resemble Better Days, though it is now censored.\n• Outside Interference: A newspaper-strip style comic hosted on DeviantArt, revolving around the everyday lives and random incidents of a slowly-expanding group of 'anthropomorphic British cartoon animals. Mostly Slice of Life.\n• Ozy and Millie: In the present day Pacific Northwest, two anthropomorphic fox children, both lovable misfits who are being raised by single parents, become friends while dealing with their not-always-friendly classmates. One of the parents is an eccentric but kindly dragon, adding a note of fantasy to the proceedings. Influenced by Peanuts, Pogo, and Calvin and Hobbes, but has a flavor all its own.\n• The Packrat: The now monthly told tales of a severely synthesizer-addicted rodent. Made by Dave Lovelace, the creator of Retarded Animal Babies. The current strips, but not all past strips, are also available in the Keyboards Magazine.\n• Pandect: Drama/comedy. Set about 20-50 years in the future in Asia, posits the existence of Aces (animals who have earned human souls and can take human appearance). Aces are always completely animal or completely human, so this is not a furry comic in the classic sense.\n• Panthera: A webcomic about a group of high school teens who transform into Big Cats in order to help their chemistry teacher wage war on some kind of \"Evil Organization\". Better that it sounds. Good artwork.\n• Paprika: The prequel and sequel to Caribbean Blue.\n• Peter and Company: Everybody thinks Peter is crazy and talking to an imaginary friend. Actually Seth is his guardian angel. Updates are infrequent, because an animated adaptation is in the works.\n• Plush and Blood: A webcomic featuring stuffed animals battling for the future of all plush kind.\n• Poppy O'Possum: An opossum with Super Strength tries to make a decent, quiet life her her and her daughter in a World of Funny Animals where opossums are victims of Fantastic Racism.\n• Precocious: A webcomic built around a rather large group of superintelligent canine and feline children who live in two separate neighborhoods. The main characters are known for being completely insane in one way or another. Not very serious and very funny, the comic is about children mad scientists in every day situations. They sort of just happen to be furries.\n• Prequel: Inspired by MS Paint Adventures, very possibly a fan prequel to Oblivion. A Khajiit girl tries to make a new start in life, but can't get anything done right one way or another.\n• The Pride of Life: A webcomic about a dog-like teenager named Kedamono, who, after eating a legendary fruit, transforms into a 'superbeast' and gains super powers. He quickly finds out that this isn't necessarily a good thing. Largely a comedy with fantasy elements.\n• Professor Amazing and the Incredible Golden Fox: Isla Grace receives a fox-shaped engagement ring from her husband-to-be, Parker, which gifts her with the ability to transform into a fox (both anthropomorphic and full fox versions). She then feels it's only appropriate to put her new powers to use in the service of her community.\n• Purple Pussy: A comic about an angry Straw Feminist cat and her friends. Someone once described it as \"Hello Kitty as a drunk, jaded slut\"; it's pretty big on swearing, violence, sex and Toilet Humor.\n• Raine Dog: A comic about an anthropomorphic dog by the creator of Ozy and Millie, which is darker and plottier than its predecessor.\n• Rank Amateur: An alien spacecraft launches from spacedock with a new Mission Controller. It get's a hull breach in Hyperspace, the crew discovers a stowaway feline GELF on board, and during repairs they come across a small shuttle with one passenger, an engineer. Just as things start to look up, the Kizantikiran's mision is changed dramatically - keeping plans for a dimension-gutting superweapon out of the wrong hands... or paws.\n• Rascals: A slice-of-life involving a group of 20-year-old anthros and the Usagi family.\n• Raven Wolf: About a world inhabited by two different kinds of furries: The Domestics and the Wilds. And the struggles between the two.\n• Realm Of Owls: Comedic fictional documentaries about owl people's life and habits; how their uniquely silly culture works, why they named their largest city Buffet, who has the power in the city and what creatures and equally weird cultures share the world with them.\n• Red Space Blues: A Bunny girl who never wanted to be anything but a botanist, becomes a intergalactic mercenary instead.\n• Reel Fiction (hosted here ): A bear, a gorilla, a bunny and a fox jump from 'verse to 'verse.\n• Ralph Hayes, Jr. writes an assortment of comics and is one of the most notable conservative Christian furries on the net.\n• Nip and Tuck: A webcomic based in the southern states. Features somewhat chaotic fox twin brothers.\n• Tales of the Questor: A sword and sorcery strip, with a strong element of C. S. Lewis' Christian allegory style ala The Chronicles of Narnia, about a young raccoon boy who lives his dream to be a Questor, a professional adventurer. Raccoons with paranormal powers have been hiding in their Steam Punk enclave from the rest of The Dung Ages world for generations. Until teenage Quentyn went searching for lost Lux devices into a bigger world populated with humans, elves, fey, dwarves, bats/goblins, bulldogs/ogres... Sometimes a humorous adventure, sometimes a more dramatic story about maturing.\n• Tally Ho: The adventures of a sly, laid-back fox and his old, senile Bassett Hound friend.\n• The Probability Bomb: A Kickstarter-funded crossover between Tales of the Questor and Quentyn Quinn, Space Ranger.\n• The Eyeof Ramalach: Adventurers searching for a buried treasure, they find an Eldritch Abomination.\n• Quentyn Quinn, Space Ranger: A futuristic action/adventure sequel/spinoff to Tales of the Questor IN SPACE! Stars a distant descendant of Quentin Quinn. Much higher on Author Tracts and Mary Sues.\n• Relations: A Queer Romance story taking place during the 1950's \"Lavender Scare\" in Califonia with most of the cast being anthro cats.\n• The Roomies: A cat guy moves to the big city and bumps into two cat girls who just so happen to be in need of another roommate.\n• Running Wild: A girl escapes from her home to start a new life. (Sadly ended less than a dozen pages in, presumably to be printed.)\n• Sabrina Online: The long-running furry slice-of-life tales of a quiet skunk web designer. Unable to find another job after she was replaced at work by a clip-art library, she finds work as webmaster for a porn studio, run by the flirtatious Zig Zag. However, the tone is gently restrained, with an uncomfortable heroine only now growing used to this bizarre job, while her friends (including her living Transformers toys!) around her have their own antics. The main storyline ended in September 2016. As of mid-2018, the follow-up strips appear on Patreon more or less weekly and are reposted on the old site monthly in batches of 3-4 — roughly at the same rate as the original strip.\n• Sandusky: The story of a man, his dog and the mountain lion they found sitting on the front porch of their apartment one evening.\n• Savestate: The adventures of brother and sister dogs in video games.\n• Scalie Schoolie: A comic about the reptile students and teachers in an all-girl, all-reptile school\n• Scurry: The story of a colony of Nearly Normal Animal mice, struggling to survive in an abandoned suburb.\n• The Secret Lives Of Flowers: The life of a redneck weasel in a post apocalyptic world.\n• Sequential Art: The adventures of four unlikely housemates. Must be seen to be believed.\n• SERGOM: The misadventures of eight employees of SERGOM, a company that sells flying vehicles.\n• Sheldon The Tiny Dinosaur who Thinks he's a Turtle: Cute, tiny critters make creative use of mundane objects to suit their diminutive sizes.\n• Shortcats: It follows the adventures of Zee Furlong when he discovers that he can \"Undo\". It takes place in a Shortcut-cats populated Universe.\n• Sometime After (hosted here ): This is the story of what happens after the \"happily ever after\" for some of the world\u0092s most beloved characters. Although they\u0092ve all had their moment in the spot-light, their lives continued well after their stories ended. This is that story\n• Sounds Like a Melody: A homeless alleycat survives by playing the guitar on the streets\n• Sparklecare: A cat named Barry wakes up at a really crapsaccharine hospital with psychotic-yet-cheerful doctors and incredibly disturbing diseases and treatments.\n• Spartans and Marshmallows: A crossover in which The Master Chief crash lands in an anthropomorphic version of Equestria, whereupon he moves in with Rarity and Sweetie Belle. Hilarity Ensues.\n• S.S.D.D: Four idiots who share a house in Britain, one of whom is an anarchist who will take over the world unless stopped by some time travelers.\n• Stockholm Cat Syndrome: The exploits of Zakona Kat, an aspiring artist who wants to be popular. However, her introverted nature prevents her from fully achieving this.\n• Stolen Generation: The indigenous Marsupial races of Australia were pushed to the brink of extinction 200 years ago, how they are back to get revenge and have the technological superiority to do it. It can be read online here, and is the first installment of a larger series that also contains a sequel Restored Generation, as well as prequels Witch Hunter Slayer, Industrial Revelations, and Divergent Timeline\n• Stripy Six: a comic about pets that is a newspaper style gag-per-day comic, and doubles as Christian Author Tract.\n• The Stupiders: A G-rated Funny Animal webcomic that takes place in a world populated by idiots and fools, thanks to extreme over vaccination. Surprisingly, society hasn't yet crumbled.\n• The Suburban Jungle: The adventures (and misadventures) of a supermodel tigress who must take temp jobs to pay the rent.\n• Now has a sequel called The Suburban Jungle: Rough Housing.\n• Suicide for Hire: A mouse and a fox go into the business of assisted suicide.\n• Supermegatopia, a furry Affectionate Parody of Super Heroes. The site also includes Crushed: The Doomed Kitty Adventures, a similar parody of the RPG Verse, and several other series.\n• Tails of Lanschilandia: The zany, heavily cartoon-influenced adventures of Lanschi the duck and other Funny Animals in a semi-mediaeval Schizo Tech Fantasy setting, where they confront monsters and an alien Evil Sorcerer.\n• Tiger Knight Comics (hosted here ): Three connected humorous series by the same author:\n• Tinaofthe South: A furry tale of the Old West.\n• College Catastrophe: A slice of college life. Inspired by The Class Menagerie, but with less plot and no angst at all. Ended.\n• Nine to Nine: Its direct sequel. A year after graduation the cast is brought to the same city by their jobs.\n• Swords and Sausages: A Heroic Fantasy being filmed by two of Nine to Nine characters.\n• Tamberlane: A comic about a clumsy bat attempting to take care of a human child.\n• Three Jaguars: Three anthromorphic jaguars personify (so to speak) aspects of the writer/artist's life, and how they conflict.\n• Tony Comics: The life of a brown bear who deals with all kind of quirky everyday situations.\n• Tooboe Bookmark: Two gay friends end up swapping bodies and try to figure out why while attempting to live their life as the other.\n• Transmission: Twin red squirrel brothers who are English expats who work in the United States. Fixing cars.\n• Turner Academy: A webcomic featuring a group of canine characters and their (mis)adventures at a boarding school focusing on the arts.\n• Twin Dragons: A comic focusing on Kai and Kaya Romera, a pair of twin teenagers in a world much like our own but where, for the past 16 years, children have been born as \"Hybrids\", where they have the traits of an animal to some degree, the twins being part-dragon, fire breath and all.\n• TwoKinds: An Interspecies Romance story set in a fantasy world that's strangely reminiscent of BattleTech without the Humongous Mecha. The story focuses on a party of adventurers that's trying to make it to a safe zone to live out the rest of their lives in a continent that's quickly falling apart into chaos, thanks in part to a trio of sapient magical masks deciding to play a game of Civilization with the the three races. The comic starts off rocky but manages to find its place and excel around chapter 7, introducing a surprising amount of political intrigue and character complexity along the way.\n• Uber Quest: The newest addition to The Kat Box, it is a fantasy webcomic that runs on RPG rules.\n• Umlaut House: Furry series which actually justifies it (they were originally human, but a plague around the time of the fall of the Roman Empire caused them all to mutate into anthropomorphic animal forms). Originally meant to be a mix of college humor and Spy Drama/Mad Scientist pastiche, the college part went out the door quickly and the rest got overtaken by the characters' sex lives. Features two distinct series.\n• Urban Jungle: A webcomic about Zack, the only human who works in an office full of animals, althought he was Raised by Wolves. He does developer support for a pharmaceutical software company. Single, thirty-something, and hanging on to the last shreds of his optimism. Mostly office and geek humor.\n• Verlore Geleentheid: \"Lost Opportunity\" in English, a comic in Afrikaans about a guy who is accidentally transported to a planet exactly like South Africa save for being populated by dog-like aliens. Also there's a 10000 year old schoolgirl who wants to find and destroy for nuking her homeworld in the distant past. English translation now available.\n• The World of Vicki Fox: A wholesome Slice of Life comic about a nice fox girl and her friends.\n• Vigil: A horror comic centering around a trio of characters with some mental issues. The art style is particularly unique.\n• Vinci and Arty: Slice of Life comic about gay partners who share a house together in suburban Pennsylvania.\n• Vulperra: The comic takes place in the world of Vulperra and mostly tells the stories of the hero Flash Gauntlet, who travels from place to place to solve problems with his magical gauntlets. There are also various one shot stories of different characters in different places that come between the Flash Gauntlet's adventures.\n• Wereworld: A human cyborg comes to a planet of magic, dragons and werebeasts to find a cure, since his implants are failing. His former evil masters want him dead and his AI assistant back. Often NSFW.\n• The Whiteboard: Billed as \"Alaska's Coolest Paintball Webcomic,\" it features the mis-adventures of a polar bear and his furry friends who enjoy playing paintball and making machines much, much more powerful than they should be. The artist, Doc Nickel (who is, more or less, personified as the polar bear), has admitted that he can't draw people. Thus, humans appear as undetailed heads which hover over their bodies, and are usually the cause of most of Doc's headaches as they bring in paintball guns broken because of the way they were misused and expect Doc to perform a miracle in fixing them. More likely is some Percussive Maintenance on their head, courtesy of a mallet. Plus from time to time an EXPLOSION!!!\n• Wombania: Genetically-engineered wombats take over the life of a twenty-something bachelor.\n• Work Sucks: 2 Animal-Kin work in their new boss's home, a giant air-whale, trying to survive paycheck to paycheck (literally!)\n• Wuffle: A comedy about everyday life of a Big Nice Wolf farmer from Gingerbread Village. Aimed at all ages, trying to be like nostalgic comic strips of old. Declared finished Feb 2017, but will still update a couple times a year.\n• Wurr: A pack of mutant hellhounds look for a new home after their territory is taken over.\n• X Dragoon: Two anthropomorphic dragons from the planet Gan-Mah land on Earth and try to stop the villainous Emperor Krad and Dr. Scar from finding the XGem first, along with the help of their human allies.\n• You Say It First: It describes itself as \"a slice-of-life comedy with dramatic elements. It's a love story about what happens after you get the girl. It's a business adventure/romance webcomic.\" All of those things are true at various times in the strip's run. It's the sequel to Unlike Minerva, by the same couple who make Namir Deiter. Ended.\n• Yuck Heads: A comedy webcomic about two Funny Animal mongooses that live in a town called Yuckufo.\n• Zodiac: Zodiac follows a twelve-man band of superheroes from the team's formation.\n• Zoo La La: A slice of life webcomic featuring a cast of several teen anthros and a handful of human characters\n• Zoophobia: A young woman with a fear of animals is hired by a school whose staff and students are mostly Talking Animals and similar supernatural beings.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/FurryWebcomics?from=Main.NotableFurryWebcomics", "media_links": ["/pmwiki/pmwiki.php/Webcomic/TwentyFirstCenturyFox", "/pmwiki/pmwiki.php/Webcomic/ThirtyTwoKickUp", "/pmwiki/pmwiki.php/Webcomic/SeventySeas", "/pmwiki/pmwiki.php/Webcomic/AAndHClub", "/pmwiki/pmwiki.php/Webcomic/AddictiveScience", "/pmwiki/pmwiki.php/Webcomic/AGENCY", "/pmwiki/pmwiki.php/WesternAnimation/SpongebobSquarepants", "/pmwiki/pmwiki.php/VideoGame/ShadowTheHedgehog", "/pmwiki/pmwiki.php/WesternAnimation/Arthur", "/pmwiki/pmwiki.php/VideoGame/StarFox", "/pmwiki/pmwiki.php/Webcomic/AloneTogether", "/pmwiki/pmwiki.php/ComicBook/AlbedoErmaFelnaEDF", "/pmwiki/pmwiki.php/Webcomic/Altermeta", "/pmwiki/pmwiki.php/Webcomic/TheAnnalsOfHearthstone", "/pmwiki/pmwiki.php/Webcomic/Anthronauts", "/pmwiki/pmwiki.php/Webcomic/AntiBunny", "/pmwiki/pmwiki.php/Webcomic/ApeNotMonkey", "/pmwiki/pmwiki.php/Webcomic/AtTheHeartOfItAll", "/pmwiki/pmwiki.php/Webcomic/Concession", "/pmwiki/pmwiki.php/Webcomic/AtArmsLength", "/pmwiki/pmwiki.php/Webcomic/TheAwkwardYeti", "/pmwiki/pmwiki.php/Webcomic/BadlyDrawnKitties", "/pmwiki/pmwiki.php/Webcomic/BallerinaMafia", "/pmwiki/pmwiki.php/Webcomic/Concession", "/pmwiki/pmwiki.php/Webcomic/Bard", "/pmwiki/pmwiki.php/Webcomic/BearNuts", "/pmwiki/pmwiki.php/Franchise/CareBears", "/pmwiki/pmwiki.php/Webcomic/BecomingBlizzard", "/pmwiki/pmwiki.php/Webcomic/TheBedfellows", "/pmwiki/pmwiki.php/Webcomic/BedlamGenesis", "/pmwiki/pmwiki.php/Webcomic/BetterDays", "/pmwiki/pmwiki.php/Webcomic/BeyondTheVeil", "/pmwiki/pmwiki.php/Webcomic/BeyondTheWesternDeep", "/pmwiki/pmwiki.php/Literature/Redwall", "/pmwiki/pmwiki.php/Webcomic/BitterCoffee", "/pmwiki/pmwiki.php/Webcomic/BittersweetCandyBowl", "/pmwiki/pmwiki.php/Webcomic/BlackTapestries", "/pmwiki/pmwiki.php/Webcomic/BladeOfToshubi", "/pmwiki/pmwiki.php/Webcomic/BladeUnderMask", "/pmwiki/pmwiki.php/Webcomic/BlueCrashKit", "/pmwiki/pmwiki.php/Webcomic/BoomerExpress", "/pmwiki/pmwiki.php/Webcomic/BridgettesBelly", "/pmwiki/pmwiki.php/Webcomic/BrokenPlotDevice", "/pmwiki/pmwiki.php/Webcomic/BuddiesInBigPlaces", "/pmwiki/pmwiki.php/Webcomic/TheBugPond", "/pmwiki/pmwiki.php/Webcomic/BugPudding", "/pmwiki/pmwiki.php/WesternAnimation/LooneyTunes", "/pmwiki/pmwiki.php/Webcomic/BusterWildeWeerwolf", "/pmwiki/pmwiki.php/Webcomic/ByTheSaints", "/pmwiki/pmwiki.php/Webcomic/Canis", "/pmwiki/pmwiki.php/Website/DeviantART", "/pmwiki/pmwiki.php/Webcomic/CaribbeanBlue", "/pmwiki/pmwiki.php/Webcomic/CigarroAndCerveja", "/pmwiki/pmwiki.php/Webcomic/CarpeDiem", "/pmwiki/pmwiki.php/Webcomic/CarryOn", "/pmwiki/pmwiki.php/Webcomic/CatLegend", "/pmwiki/pmwiki.php/Webcomic/Catena", "/pmwiki/pmwiki.php/Webcomic/CatsNCameras", "/pmwiki/pmwiki.php/Series/TheDukesOfHazzard", "/pmwiki/pmwiki.php/Webcomic/CavesAndCritters", "/pmwiki/pmwiki.php/Webcomic/TheChanterelleandMayLife", "/pmwiki/pmwiki.php/Webcomic/CheapThrills", "/pmwiki/pmwiki.php/Webcomic/CHEVALIER", "/pmwiki/pmwiki.php/Webcomic/CherrysCure", "/pmwiki/pmwiki.php/Webcomic/ChickenWings", "/pmwiki/pmwiki.php/Webcomic/ChroniclesOfLoth", "/pmwiki/pmwiki.php/Webcomic/ChuckAndBeans", "/pmwiki/pmwiki.php/Webcomic/TheClassMenagerie", "/pmwiki/pmwiki.php/Webcomic/ClosedGate", "/pmwiki/pmwiki.php/Webcomic/Cloudscratcher", "/pmwiki/pmwiki.php/Creator/DonBluth", "/pmwiki/pmwiki.php/WesternAnimation/TaleSpin", "/pmwiki/pmwiki.php/Webcomic/CoachRandom", "/pmwiki/pmwiki.php/Webcomic/CodeNameHunter", "/pmwiki/pmwiki.php/Webcomic/ComingUpViolet", "/pmwiki/pmwiki.php/Webcomic/FurWillFly", "/pmwiki/pmwiki.php/Webcomic/CommanderKitty", "/pmwiki/pmwiki.php/Webcomic/Concession", "/pmwiki/pmwiki.php/Webcomic/ControlYourOffspring", "/pmwiki/pmwiki.php/Webcomic/CorgiQuest", "/pmwiki/pmwiki.php/Webcomic/CosmicHero", "/pmwiki/pmwiki.php/Webcomic/CounterRose", "/pmwiki/pmwiki.php/Webcomic/CoyoteBison", "/pmwiki/pmwiki.php/Webcomic/CoyoteVille", "/pmwiki/pmwiki.php/WesternAnimation/LooneyTunes", "/pmwiki/pmwiki.php/Webcomic/CrikeyDuck", "/pmwiki/pmwiki.php/Webcomic/CrimsonFlag", "/pmwiki/pmwiki.php/Webcomic/YeGods", "/pmwiki/pmwiki.php/Webcomic/CritterCoven", "/pmwiki/pmwiki.php/Webcomic/CrowCillers", "/pmwiki/pmwiki.php/Webcomic/CrossTimeCafe", "/pmwiki/pmwiki.php/Webcomic/CtrlR", "/pmwiki/pmwiki.php/Webcomic/Curtailed", "/pmwiki/pmwiki.php/Webcomic/TheCyantianChronicles", "/pmwiki/pmwiki.php/Webcomic/DailyGrind", "/pmwiki/pmwiki.php/Webcomic/DanAndMabsFurryAdventures", "/pmwiki/pmwiki.php/Webcomic/DandyAndCompany", "/pmwiki/pmwiki.php/Webcomic/TheDawnChapel", "/pmwiki/pmwiki.php/Webcomic/DeerMe", "/pmwiki/pmwiki.php/Webcomic/TheDepths", "/pmwiki/pmwiki.php/Webcomic/Digger", "/pmwiki/pmwiki.php/Webcomic/DimensionTwist", "/pmwiki/pmwiki.php/Webcomic/DinosaurComics", "/pmwiki/pmwiki.php/Webcomic/DividedSky", "/pmwiki/pmwiki.php/Webcomic/DNATheWebcomic", "/pmwiki/pmwiki.php/Webcomic/DocRat", "/pmwiki/pmwiki.php/Webcomic/DogsDaysOfSummer", "/pmwiki/pmwiki.php/Webcomic/DownTheHatch", "/pmwiki/pmwiki.php/Webcomic/DraconiaChronicles", "/pmwiki/pmwiki.php/Webcomic/DragonCity", "/pmwiki/pmwiki.php/Webcomic/Dreamkeepers", "/pmwiki/pmwiki.php/Webcomic/DrugsAndKisses", "/pmwiki/pmwiki.php/Webcomic/Druids", "/pmwiki/pmwiki.php/Webcomic/DustBunnyMafia", "/pmwiki/pmwiki.php/WesternAnimation/LooneyTunes", "/pmwiki/pmwiki.php/Webcomic/TheDynamiteTwinsAndFriends", "/pmwiki/pmwiki.php/Franchise/ColorWorldUniverse", "/pmwiki/pmwiki.php/Franchise/TheDynamiteTwinsAndFriends", "/pmwiki/pmwiki.php/Webcomic/BunnyAndBear", "/pmwiki/pmwiki.php/Webcomic/EbinAndMay", "/pmwiki/pmwiki.php/Webcomic/TheEndOfThings", "/pmwiki/pmwiki.php/Webcomic/Evon", "/pmwiki/pmwiki.php/Webcomic/ExterminatusNow", "/pmwiki/pmwiki.php/VideoGame/SonicTheHedgehog", "/pmwiki/pmwiki.php/TabletopGame/Warhammer40000", "/pmwiki/pmwiki.php/Franchise/SonicTheHedgehog", "/pmwiki/pmwiki.php/TabletopGame/Warhammer40000", "/pmwiki/pmwiki.php/Webcomic/TheEyeOfRamalach", "/pmwiki/pmwiki.php/Webcomic/FabulandHousewives", "/pmwiki/pmwiki.php/Toys/Fabuland", "/pmwiki/pmwiki.php/Webcomic/FauxPas", "/pmwiki/pmwiki.php/Webcomic/FeliciaSorceressOfKatara", "/pmwiki/pmwiki.php/Webcomic/Femmegasm", "/pmwiki/pmwiki.php/Webcomic/Fite", "/pmwiki/pmwiki.php/Webcomic/FightingDreamers", "/pmwiki/pmwiki.php/Webcomic/FletcherApts", "/pmwiki/pmwiki.php/Webcomic/FluffyAndMervin", "/pmwiki/pmwiki.php/Webcomic/ForestHill", "/pmwiki/pmwiki.php/Webcomic/TheFoxfireChronicles", "/pmwiki/pmwiki.php/Webcomic/FoxyFlavoredCookie", "/pmwiki/pmwiki.php/Webcomic/Freefall", "/pmwiki/pmwiki.php/Webcomic/Furmentation", "/pmwiki/pmwiki.php/Webcomic/FurPiled", "/pmwiki/pmwiki.php/Webcomic/Furr", "/pmwiki/pmwiki.php/Literature/WarriorCats", "/pmwiki/pmwiki.php/Webcomic/FurryExperience", "/pmwiki/pmwiki.php/Webcomic/FurthiaHigh", "/pmwiki/pmwiki.php/Webcomic/FurWillFly", "/pmwiki/pmwiki.php/Webcomic/TheFuzzyPrincess", "/pmwiki/pmwiki.php/Webcomic/FuzzyThings", "/pmwiki/pmwiki.php/Webcomic/GeneCatlow", "/pmwiki/pmwiki.php/Webcomic/Generation17", "/pmwiki/pmwiki.php/Webcomic/TheGoldenWeek", "/pmwiki/pmwiki.php/Webcomic/GonEChoo", "/pmwiki/pmwiki.php/Webcomic/GrandHunter", "/pmwiki/pmwiki.php/VideoGame/SonicTheHedgehog", "/pmwiki/pmwiki.php/Manga/OnePiece", "/pmwiki/pmwiki.php/Manga/FairyTail", "/pmwiki/pmwiki.php/Webcomic/Grant", "/pmwiki/pmwiki.php/Webcomic/TheHeroesOfMiddlecenter", "/pmwiki/pmwiki.php/Webcomic/HamstaPowah", "/pmwiki/pmwiki.php/Webcomic/Harkovast", "/pmwiki/pmwiki.php/ComicBook/HavocInc", "/pmwiki/pmwiki.php/Webcomic/HereWolf", "/pmwiki/pmwiki.php/Webcomic/HodgesPond", "/pmwiki/pmwiki.php/Webcomic/Hotblood", "/pmwiki/pmwiki.php/Webcomic/Housepets", "/pmwiki/pmwiki.php/Webcomic/TheHuntersOfSalamanstra", "/pmwiki/pmwiki.php/Webcomic/IceEevee", "/pmwiki/pmwiki.php/Webcomic/IchabodTheOptimisticCanine", "/pmwiki/pmwiki.php/Webcomic/ICQ", "/pmwiki/pmwiki.php/Webcomic/IMew", "/pmwiki/pmwiki.php/VideoGame/InheritTheEarth", "/pmwiki/pmwiki.php/Webcomic/InOurShadow", "/pmwiki/pmwiki.php/Webcomic/IrrationalFears", "/pmwiki/pmwiki.php/Webcomic/JackDavidHopkins", "/pmwiki/pmwiki.php/Webcomic/JackLegend", "/pmwiki/pmwiki.php/Webcomic/Katinka", "/pmwiki/pmwiki.php/Webcomic/Knighthood", "/pmwiki/pmwiki.php/Webcomic/MUTE", "/pmwiki/pmwiki.php/Webcomic/ReworkTheDead", "/pmwiki/pmwiki.php/Webcomic/KarateBears", "/pmwiki/pmwiki.php/Webcomic/TheKatbox", "/pmwiki/pmwiki.php/Webcomic/KemonoCafe", "/pmwiki/pmwiki.php/Webcomic/LasLindas", "/pmwiki/pmwiki.php/Webcomic/Knighthood", "/pmwiki/pmwiki.php/Webcomic/AddictiveScience", "/pmwiki/pmwiki.php/Webcomic/TinaoftheSouth", "/pmwiki/pmwiki.php/Webcomic/IMew", "/pmwiki/pmwiki.php/Webcomic/Paprika", "/pmwiki/pmwiki.php/Webcomic/CaribbeanBlue", "/pmwiki/pmwiki.php/Webcomic/PracticeMakesPerfect", "/pmwiki/pmwiki.php/Webcomic/Rascals", "/pmwiki/pmwiki.php/Webcomic/TheEyeofRamalach", "/pmwiki/pmwiki.php/Webcomic/TheKennyChronicles", "/pmwiki/pmwiki.php/Webcomic/KevinAndKell", "/pmwiki/pmwiki.php/Webcomic/Lackadaisy", "/pmwiki/pmwiki.php/Film/TheUntouchables", "/pmwiki/pmwiki.php/Webcomic/LasLindas", "/pmwiki/pmwiki.php/Webcomic/LastRes0rt", "/pmwiki/pmwiki.php/Webcomic/LatchkeyKingdom", "/pmwiki/pmwiki.php/Webcomic/LaughOutLoudCats", "/pmwiki/pmwiki.php/Webcomic/TheLegendOfLucy", "/pmwiki/pmwiki.php/Webcomic/LittleTales", "/pmwiki/pmwiki.php/Literature/TheManWhoWasThursday", "/pmwiki/pmwiki.php/Webcomic/LoonLand", "/pmwiki/pmwiki.php/Webcomic/MapleParkMisadventures", "/pmwiki/pmwiki.php/Webcomic/MarcoAndMarty", "/pmwiki/pmwiki.php/Webcomic/MurryPurryFreshAndFurry", "/pmwiki/pmwiki.php/Webcomic/MyLittlePython", "/pmwiki/pmwiki.php/Webcomic/NamirDeiter", "/pmwiki/pmwiki.php/Webcomic/NatureOfNaturesArt", "/pmwiki/pmwiki.php/Webcomic/Newshounds", "/pmwiki/pmwiki.php/Webcomic/NicoleAndDerek", "/pmwiki/pmwiki.php/Webcomic/OffWhite", "/pmwiki/pmwiki.php/Myth/NorseMythology", "/pmwiki/pmwiki.php/Webcomic/TheOrderOfTheBlackDog", "/pmwiki/pmwiki.php/Webcomic/Concession", "/pmwiki/pmwiki.php/Webcomic/OriginalLife", "/pmwiki/pmwiki.php/Webcomic/BetterDays", "/pmwiki/pmwiki.php/Webcomic/Outrim", "/pmwiki/pmwiki.php/Webcomic/OutsideInterference", "/pmwiki/pmwiki.php/Website/DeviantArt", "/pmwiki/pmwiki.php/Webcomic/Outworld", "/pmwiki/pmwiki.php/Website/DeviantArt", "/pmwiki/pmwiki.php/Webcomic/OzyAndMillie", "/pmwiki/pmwiki.php/Webcomic/ThePackrat", "/pmwiki/pmwiki.php/Webcomic/Pandect", "/pmwiki/pmwiki.php/Webcomic/Panthera", "/pmwiki/pmwiki.php/Webcomic/Paprika", "/pmwiki/pmwiki.php/Webcomic/PeterAndCompany", "/pmwiki/pmwiki.php/Webcomic/Pinch", "/pmwiki/pmwiki.php/Webcomic/PlungerPup", "/pmwiki/pmwiki.php/Webcomic/PlushAndBlood", "/pmwiki/pmwiki.php/Webcomic/PoppyOPossum", "/pmwiki/pmwiki.php/Webcomic/PracticeMakesPerfect", "/pmwiki/pmwiki.php/Webcomic/Precocious", "/pmwiki/pmwiki.php/Webcomic/Prequel", "/pmwiki/pmwiki.php/Webcomic/MSPaintAdventures", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsIVOblivion", "/pmwiki/pmwiki.php/Webcomic/ThePrideOfLife", "/pmwiki/pmwiki.php/Webcomic/ProfessorAmazingAndTheIncredibleGoldenFox", "/pmwiki/pmwiki.php/Webcomic/Profiles", "/pmwiki/pmwiki.php/Webcomic/ProjectFuture", "/pmwiki/pmwiki.php/Webcomic/PurplePussy", "/pmwiki/pmwiki.php/Webcomic/RaeTheDoe", "/pmwiki/pmwiki.php/Webcomic/RaineDog", "/pmwiki/pmwiki.php/Webcomic/OzyAndMillie", "/pmwiki/pmwiki.php/Webcomic/RankAmateur", "/pmwiki/pmwiki.php/Webcomic/Rascals", "/pmwiki/pmwiki.php/Webcomic/RavenWolf", "/pmwiki/pmwiki.php/Webcomic/RealmOfOwls", "/pmwiki/pmwiki.php/Webcomic/RedSpaceBlues", "/pmwiki/pmwiki.php/Webcomic/ReelFiction", "/pmwiki/pmwiki.php/Creator/RalphHayesJr", "/pmwiki/pmwiki.php/Webcomic/GoblinHollow", "/pmwiki/pmwiki.php/Webcomic/NipAndTuck", "/pmwiki/pmwiki.php/Webcomic/TalesOfTheQuestor", "/pmwiki/pmwiki.php/Creator/CSLewis", "/pmwiki/pmwiki.php/Literature/TheChroniclesOfNarnia", "/pmwiki/pmwiki.php/Webcomic/TallyHo", "/pmwiki/pmwiki.php/Webcomic/TheProbabilityBomb", "/pmwiki/pmwiki.php/Website/Kickstarter", "/pmwiki/pmwiki.php/Webcomic/TalesOfTheQuestor", "/pmwiki/pmwiki.php/Webcomic/QuentynQuinnSpaceRanger", "/pmwiki/pmwiki.php/Webcomic/TheEyeofRamalach", "/pmwiki/pmwiki.php/Webcomic/QuentynQuinnSpaceRanger", "/pmwiki/pmwiki.php/Webcomic/RunningWild", "/pmwiki/pmwiki.php/Webcomic/SabrinaOnline", "/pmwiki/pmwiki.php/Franchise/Transformers", "/pmwiki/pmwiki.php/Webcomic/Sandusky", "/pmwiki/pmwiki.php/Webcomic/Savestate", "/pmwiki/pmwiki.php/Webcomic/ScalieSchoolie", "/pmwiki/pmwiki.php/Webcomic/Scurry", "/pmwiki/pmwiki.php/Webcomic/TheSecretLivesOfFlowers", "/pmwiki/pmwiki.php/Webcomic/SequentialArt", "/pmwiki/pmwiki.php/Webcomic/SERGOM", "/pmwiki/pmwiki.php/Webcomic/Shortcats", "/pmwiki/pmwiki.php/Webcomic/SometimeAfter", "/pmwiki/pmwiki.php/Webcomic/SoundsLikeAMelody", "/pmwiki/pmwiki.php/Webcomic/Sparklecare", "/pmwiki/pmwiki.php/Webcomic/SpartansAndMarshmallows", "/pmwiki/pmwiki.php/Franchise/Halo", "/pmwiki/pmwiki.php/WesternAnimation/MyLittlePonyFriendshipIsMagic", "/pmwiki/pmwiki.php/Webcomic/SSDD", "/pmwiki/pmwiki.php/Webcomic/StockholmCatSyndrome", "/pmwiki/pmwiki.php/Webcomic/StolenGeneration", "/pmwiki/pmwiki.php/Webcomic/RestoredGeneration", "/pmwiki/pmwiki.php/Webcomic/WitchHunterSlayer", "/pmwiki/pmwiki.php/Webcomic/IndustrialRevelations", "/pmwiki/pmwiki.php/Webcomic/DivergentTimeline", "/pmwiki/pmwiki.php/Webcomic/StripySix", "/pmwiki/pmwiki.php/Webcomic/StubbleTrouble", "/pmwiki/pmwiki.php/Webcomic/StupidFox", "/pmwiki/pmwiki.php/Webcomic/TheStupiders", "/pmwiki/pmwiki.php/Webcomic/TheSuburbanJungle", "/pmwiki/pmwiki.php/Webcomic/SuicideForHire", "/pmwiki/pmwiki.php/Webcomic/Supermegatopia", "/pmwiki/pmwiki.php/Webcomic/TailsOfLanschilandia", "/pmwiki/pmwiki.php/Webcomic/TinaoftheSouth", "/pmwiki/pmwiki.php/Webcomic/TheClassMenagerie", "/pmwiki/pmwiki.php/Webcomic/ThreeJaguars", "/pmwiki/pmwiki.php/Webcomic/TonyComics", "/pmwiki/pmwiki.php/Webcomic/TooboeBookmark", "/pmwiki/pmwiki.php/Webcomic/Transmission", "/pmwiki/pmwiki.php/Webcomic/TurnerAcademy", "/pmwiki/pmwiki.php/Webcomic/TwinDragons", "/pmwiki/pmwiki.php/Webcomic/TwoKinds", "/pmwiki/pmwiki.php/TabletopGame/BattleTech", "/pmwiki/pmwiki.php/VideoGame/Civilization", "/pmwiki/pmwiki.php/Webcomic/TwoLumps", "/pmwiki/pmwiki.php/Webcomic/UberQuest", "/pmwiki/pmwiki.php/Webcomic/TheKatBox", "/pmwiki/pmwiki.php/Webcomic/UmlautHouse", "/pmwiki/pmwiki.php/Webcomic/UrbanJungle", "/pmwiki/pmwiki.php/Webcomic/VerloreGeleentheid", "/pmwiki/pmwiki.php/Webcomic/TheWorldOfVickiFox", "/pmwiki/pmwiki.php/Webcomic/Vigil", "/pmwiki/pmwiki.php/Webcomic/VinciAndArty", "/pmwiki/pmwiki.php/Webcomic/Vulperra", "/pmwiki/pmwiki.php/Webcomic/Wereworld", "/pmwiki/pmwiki.php/Webcomic/TheWhiteboard", "/pmwiki/pmwiki.php/Webcomic/Wombania", "/pmwiki/pmwiki.php/Webcomic/WoodsForTheTrees", "/pmwiki/pmwiki.php/Webcomic/WorkSucks", "/pmwiki/pmwiki.php/Webcomic/WorldOfFizz", "/pmwiki/pmwiki.php/Webcomic/Wuffle", "/pmwiki/pmwiki.php/Webcomic/Wurr", "/pmwiki/pmwiki.php/Webcomic/XDragoon", "/pmwiki/pmwiki.php/Webcomic/YouSayItFirst", "/pmwiki/pmwiki.php/Webcomic/NamirDeiter", "/pmwiki/pmwiki.php/Webcomic/YuckHeads", "/pmwiki/pmwiki.php/Webcomic/Zodiac", "/pmwiki/pmwiki.php/Webcomic/ZooLaLa", "/pmwiki/pmwiki.php/Webcomic/Zoophobia"], "non_media_links": ["/pmwiki/pmwiki.php/Main/FunnyAnimal", "/pmwiki/pmwiki.php/Main/FurryWebcomics", "/pmwiki/pmwiki.php/Main/FurryReminder", "/pmwiki/pmwiki.php/Main/FurriesAreEasierToDraw", "/pmwiki/pmwiki.php/Main/FurryComic", "/pmwiki/pmwiki.php/Main/WorldOfFunnyAnimals", "/pmwiki/pmwiki.php/Main/FightingSeries", "/pmwiki/pmwiki.php/Main/MassiveMultiplayerCrossover", "/pmwiki/pmwiki.php/Main/SliceOfLife", "/pmwiki/pmwiki.php/Main/OurDragonsAreDifferent", "/pmwiki/pmwiki.php/Main/FilmNoir", "/pmwiki/pmwiki.php/WebComic/AskACat", "http://heart.concessioncomic.com/index.php?pid=20071124", "/pmwiki/pmwiki.php/Main/MultiArmedAndDangerous", "/pmwiki/pmwiki.php/Main/SliceOfLife", "http://heart.concessioncomic.com/index.php", "/pmwiki/pmwiki.php/WebAnimation/HappyTreeFriends", "/pmwiki/pmwiki.php/Main/MixAndMatchCritter", "/pmwiki/pmwiki.php/Main/Deconstruction", "/pmwiki/pmwiki.php/Main/BrotherSisterIncest", "http://bitter-coffee.smackjeeves.com/", "/pmwiki/pmwiki.php/Main/LoveDodecahedron", "/pmwiki/pmwiki.php/Main/AfterTheEnd", "http://en.m.wikipedia.org/wiki/Polyamory", "http://bridgette.keenspace.com/", "/pmwiki/pmwiki.php/Main/Jerkass", "http://lizzie-bean.com/", "http://www.bibp.com/", "/pmwiki/pmwiki.php/ComicStrip/Pogo", "/pmwiki/pmwiki.php/Main/PunBasedTitle", "/pmwiki/pmwiki.php/Main/Deconstructing", "/pmwiki/pmwiki.php/Main/CatGirl", "/pmwiki/pmwiki.php/Main/MistakenForGay", "/pmwiki/pmwiki.php/Main/SliceOfLife", "/pmwiki/pmwiki.php/Main/NSFW", "/pmwiki/pmwiki.php/Main/AnAdventurerIsYou", "/pmwiki/pmwiki.php/Main/StandardFantasySetting", "http://www.theduckwebcomics.com/Chevalier", "http://www.shoeboxblog.com/?cat=1279", "/pmwiki/pmwiki.php/Main/DieselPunk", "/pmwiki/pmwiki.php/Main/GenreThrowback", "/pmwiki/pmwiki.php/Main/LaResistance", "/pmwiki/pmwiki.php/Main/TheEmpire", "/pmwiki/pmwiki.php/Main/SpinOff", "/pmwiki/pmwiki.php/Main/CuteKid", "/pmwiki/pmwiki.php/Main/GrowingTheBeard", "/pmwiki/pmwiki.php/Main/JumpingTheShark", "/pmwiki/pmwiki.php/Main/WebComic", "/pmwiki/pmwiki.php/Main/FunnyAnimal", "/pmwiki/pmwiki.php/Main/InSpace", "/pmwiki/pmwiki.php/Main/KudzuPlot", "/pmwiki/pmwiki.php/Main/ShockingMoments", "/pmwiki/pmwiki.php/Main/NOTSAFEFORWORK", "/pmwiki/pmwiki.php/Main/InteractiveComic", "http://www.counter-rose.com/", "/pmwiki/pmwiki.php/Main/ScienceFiction", "/pmwiki/pmwiki.php/Main/SdrawkcabName", "/pmwiki/pmwiki.php/Main/Prequel", "/pmwiki/pmwiki.php/Main/TheWildWest", "/pmwiki/pmwiki.php/Tropers/Shenjay", "/pmwiki/pmwiki.php/Main/SliceOfLife", "/pmwiki/pmwiki.php/Main/WorldOfFunnyAnimals", "/pmwiki/pmwiki.php/WebComic/CrossedClaws", "/pmwiki/pmwiki.php/WebComic/CrossingOver", "/pmwiki/pmwiki.php/Main/ScienceFiction", "/pmwiki/pmwiki.php/Main/SoapOpera", "/pmwiki/pmwiki.php/Main/FurryComic", "/pmwiki/pmwiki.php/Main/ActionAdventure", "/pmwiki/pmwiki.php/Main/Animesque", "/pmwiki/pmwiki.php/Main/BackStory", "/pmwiki/pmwiki.php/Main/AllThereInTheManual", "/pmwiki/pmwiki.php/Main/FunnyAnimal", "/pmwiki/pmwiki.php/Main/SliceOfLife", "http://dimension-twist.deviantart.com/", "http://www.deviantart.com/", "/pmwiki/pmwiki.php/Main/LampshadeHanging", "/pmwiki/pmwiki.php/Main/CerebusSyndrome", "/pmwiki/pmwiki.php/Main/SliceOfLife", "/pmwiki/pmwiki.php/Main/Youkai", "/pmwiki/pmwiki.php/Main/HumanoidFemaleAnimal", "/pmwiki/pmwiki.php/Main/IncrediblyLamePun", "/pmwiki/pmwiki.php/Main/TheStoner", "/pmwiki/pmwiki.php/Main/Criminals", "/pmwiki/pmwiki.php/Main/TheMafia", "/pmwiki/pmwiki.php/Main/SpinOff", "/pmwiki/pmwiki.php/Main/BlackComedy", "/pmwiki/pmwiki.php/Main/BuiltWithLego", "/pmwiki/pmwiki.php/Main/CarnivoreConfusion", "http://home.comcast.net/~x8099/thomasblue/comics.html", "/pmwiki/pmwiki.php/Main/NotableGagPerDayWebcomics", "/pmwiki/pmwiki.php/Main/SubvertedTrope", "/pmwiki/pmwiki.php/Main/SliceOfLife", "http://en.wikipedia.org/wiki/Chernobyl_disaster", "http://www.ariannia.com/", "/pmwiki/pmwiki.php/Main/SliceOfLife", "/pmwiki/pmwiki.php/Main/ShapedLikeItself", "/pmwiki/pmwiki.php/Main/IntelligentGerbil", "/pmwiki/pmwiki.php/Main/SliceOfLife", "/pmwiki/pmwiki.php/Main/ResetButton", "http://generation17.petitesymphony.com/", "/pmwiki/pmwiki.php/Main/LaserGuidedAmnesia", "/pmwiki/pmwiki.php/Main/OntologicalMystery", "/pmwiki/pmwiki.php/Main/BioAugmentation", "/pmwiki/pmwiki.php/Main/ArsonMurderAndJaywalking", "/pmwiki/pmwiki.php/Main/NotSafeForWork", "http://grandhunter.darkspeeds.com/", "/pmwiki/pmwiki.php/Main/TheWildWest", "http://salamanstra.keenspot.com/", "http://www.icq-comic.com/", "/pmwiki/pmwiki.php/Main/AdventureGame", "/pmwiki/pmwiki.php/Main/LowFantasy", "/pmwiki/pmwiki.php/Main/UpliftedAnimal", "/pmwiki/pmwiki.php/Main/MagicFromTechnology", "/pmwiki/pmwiki.php/Main/AfterTheEnd", "/pmwiki/pmwiki.php/Main/NotSafeForWork", "/pmwiki/pmwiki.php/Main/SevenDeadlySins", "/pmwiki/pmwiki.php/Main/TheGrimReaper", "/pmwiki/pmwiki.php/Main/CrapsackWorld", "http://rtd.vitenka.com/Rtd1/", "/pmwiki/pmwiki.php/Main/ZombieApocalypse", "/pmwiki/pmwiki.php/Main/NotSafeForWork", "/pmwiki/pmwiki.php/WebComic/IslaAukate", "/pmwiki/pmwiki.php/Main/TheRoaringTwenties", "/pmwiki/pmwiki.php/Main/FurriesAreEasierToDraw", "/pmwiki/pmwiki.php/Main/SideStoryBonusArt", "/pmwiki/pmwiki.php/Main/Fanservice", "/pmwiki/pmwiki.php/Main/DeadlyGame", "/pmwiki/pmwiki.php/Main/RealityShow", "/pmwiki/pmwiki.php/Main/TheFuture", "/pmwiki/pmwiki.php/Main/MadScientist", "/pmwiki/pmwiki.php/Main/HalfHumanHybrid", "/pmwiki/pmwiki.php/Main/Hobos", "/pmwiki/pmwiki.php/WebOriginal/LOLCats", "http://mpmisadventures.cfw.me/", "/pmwiki/pmwiki.php/Main/SliceOfLife", "/pmwiki/pmwiki.php/Main/SliceOfLife", "/pmwiki/pmwiki.php/Main/SesquipedalianLoquaciousness", "/pmwiki/pmwiki.php/Main/SpinOffspring", "/pmwiki/pmwiki.php/Main/SliceOfLife", "/pmwiki/pmwiki.php/ComicStrip/Peanuts", "/pmwiki/pmwiki.php/ComicStrip/Pogo", "/pmwiki/pmwiki.php/ComicStrip/CalvinAndHobbes", "/pmwiki/pmwiki.php/WebAnimation/RetardedAnimalBabies", "/pmwiki/pmwiki.php/Main/CyberPunk", "/pmwiki/pmwiki.php/Main/Dystopia", "/pmwiki/pmwiki.php/Main/SuperStrength", "/pmwiki/pmwiki.php/Main/WorldOfFunnyAnimals", "/pmwiki/pmwiki.php/Main/FantasticRacism", "/pmwiki/pmwiki.php/Main/CatFolk", "/pmwiki/pmwiki.php/Main/BlessedWithSuck", "/pmwiki/pmwiki.php/Main/DanAndMabsFurryAdventures", "/pmwiki/pmwiki.php/Main/DarkerAndEdgier", "/pmwiki/pmwiki.php/Main/MissionControl", "/pmwiki/pmwiki.php/Main/MeaningfulName", "http://splurd.com/comics/about.php?comic=8", "/pmwiki/pmwiki.php/Main/WitchSpecies", "/pmwiki/pmwiki.php/Main/SteamPunk", "/pmwiki/pmwiki.php/Main/TheDungAges", "/pmwiki/pmwiki.php/Main/FunctionalMagic", "/pmwiki/pmwiki.php/Main/OurFairiesAreDifferent", "/pmwiki/pmwiki.php/Main/TheFairfolk", "/pmwiki/pmwiki.php/Main/OurMonstersAreWeird", "/pmwiki/pmwiki.php/Main/InSpace", "/pmwiki/pmwiki.php/Main/AuthorTract", "/pmwiki/pmwiki.php/Main/MarySue", "/pmwiki/pmwiki.php/WebComic/Relations", "/pmwiki/pmwiki.php/Main/QueerRomance", "/pmwiki/pmwiki.php/WebComic/TheRoomies", "/pmwiki/pmwiki.php/Main/NearlyNormalAnimal", "/pmwiki/pmwiki.php/WebComic/SheldonTheTinyDinosaur", "/pmwiki/pmwiki.php/Main/RidiculouslyCuteCritter", "/pmwiki/pmwiki.php/Main/PunnyName", "http://www.sometimeaftercomic.com", "/pmwiki/pmwiki.php/Main/CrapsaccharineWorld", "/pmwiki/pmwiki.php/Main/HilarityEnsues", "http://stolengen.smackjeeves.com/comics/214146/page-1/", "/pmwiki/pmwiki.php/Main/TalkingAnimal", "/pmwiki/pmwiki.php/Main/AuthorTract", "/pmwiki/pmwiki.php/Main/SpinOffspring", "/pmwiki/pmwiki.php/Main/AffectionateParody", "/pmwiki/pmwiki.php/Main/SuperHero", "/pmwiki/pmwiki.php/Main/RPGVerse", "/pmwiki/pmwiki.php/Main/SchizoTech", "/pmwiki/pmwiki.php/Main/EvilSorcerer", "http://www.tigerknight.com/", "/pmwiki/pmwiki.php/WebComic/Tamberlane", "/pmwiki/pmwiki.php/Main/InterspeciesRomance", "/pmwiki/pmwiki.php/Main/HumongousMecha", "/pmwiki/pmwiki.php/Main/FiveRaces", "/pmwiki/pmwiki.php/Main/JustifiedTrope", "/pmwiki/pmwiki.php/Main/DarkAgeEurope", "/pmwiki/pmwiki.php/Main/WackyCollege", "/pmwiki/pmwiki.php/Main/SpyDrama", "/pmwiki/pmwiki.php/Main/MadScientist", "/pmwiki/pmwiki.php/Main/RaisedByWolves", "/pmwiki/pmwiki.php/Main/Geek", "/pmwiki/pmwiki.php/Main/SliceOfLife", "/pmwiki/pmwiki.php/Main/NiceGirl", "/pmwiki/pmwiki.php/Main/SliceOfLife", "/pmwiki/pmwiki.php/Main/FurriesAreEasierToDraw", "/pmwiki/pmwiki.php/Main/PercussiveMaintenance", "/pmwiki/pmwiki.php/Main/DropTheHammer", "/pmwiki/pmwiki.php/Main/GentleGiant", "/pmwiki/pmwiki.php/Main/NiceGuy", "/pmwiki/pmwiki.php/Main/NobleWolf", "/pmwiki/pmwiki.php/Main/FarmBoy", "/pmwiki/pmwiki.php/Main/Arcadia", "/pmwiki/pmwiki.php/Main/MacGuffin", "/pmwiki/pmwiki.php/Main/UnlikeMinerva", "/pmwiki/pmwiki.php/WebComic/ZooAcademy", "/pmwiki/pmwiki.php/Main/LionsandTigersandHumansOhMy", "/pmwiki/pmwiki.php/Main/TalkingAnimal"]}