{"title": "The Invisible Band", "content": "Sometimes musicians are... facially unfortunate. It's not their fault, but that doesn't mean you should pander to them by putting them in the video, oh no. After all, who wants to watch a bunch of ugly, hairy types leaping around when you can replace them with oiled-up catalogue models and whiz-bang CGI.\n\nAs a result you get videos in which the people who made the music are conspicuously absent, having been replaced with any number of other, more visually interesting things.\n\nThis is particularly popular in dance music videos; since dance music fans tend to buy songs they like rather than stick closely to any particular artist, there's less impetus to build up a \"brand\" by making the artist's face (and name) well-known. Additionally, as the artist very rarely contributes vocals there's very little reason to have them on-camera.\n\nNot to be confused with a Travis album. Compare Anonymous Band, where the musicians can be seen but their physical appearance is downplayed rather than hidden.\n• An odd example is \"Light Aircraft On Fire\" by The Auteurs, in which lead singer Luke Haines becomes the bass player while an actor pretends to sing the lyrics.\n• Daft Punk have made a habit of never appearing in-person in their videos; in addition, they always wear full-body costumes at every public appearance, including live performances. Their reason for doing this, according to them, is to make their concerts about the music and not the musicians.\n• In the video to the Satellite song \"Lighten Up the Load\", Satellite himself only appears at the very end of the video, in a Talky Bookend.\n• Frank Farian did this twice:\n• Probably the most infamous example of this is the Milli Vanilli scandal; the actual singers were great, but middle-aged and not good-looking.\n• In Boney M, the lead male vocals were performed not by Bobby Ferrell, the purported male lead in concert, but by Farian himself.\n• Although Elton John is normally very visible in his videos, and is overall very performance-oriented, for the video \"I Want Love\", Robert Downey Jr. lip synchs the song. Similarly, Justin Timberlake portrays a younger Elton (with an eerie resemblance to the real thing, circa 1975) in the clip for \"This Train Don't Stop There Anymore\". Elton John declared in 2000 that he didn't want to do videos anymore. He specifically told the director of \"I Want Love\" that he did not want to appear in the video.\n• Appears instead of the band in Oasis in the video to \"The Importance of Being Idle\".\n• The music video for Carly Rae Jepsen's \"I Really Like You\" features Tom Hanks lip-syncing the words while Jepsen sings. She does appear in the video, though, but only far after the beginning and mostly in crowd scenes.\n• Semi-example: For the first few minutes of The Grateful Dead's \"Touch of Grey\", the band are replaced by skeleton puppets. Around the three-quarter mark, someone finally gets one of the drummers' leg back from a dog, plugs it into the socket, and the skeletons flash into the actual band. Also notable for actually being shot at a Grateful Dead concert. The fans stayed for three hours, dutifully singing along to the same song seventy times and loudly applauding the puppets. (And then they shot the video.)\n• Partly mocked and partly averted by Paul Simon's \"You Can Call Me Al\". The entire video is Paul Simon and Chevy Chase sitting next to each other while Chase lipsyncs the song, and Simon silently and morosely acts almost as a butler or gofer for him.\n• Poking fun at the convention: In the video for Pavement's \"Shady Lane,\" the head of lead singer Stephen Malkmus is rendered invisible while his body continues performing the song.\n• The Replacements' \"Bastards Of Young\". Just a single shot of a stereo system playing the song, slowly panning out to also include someone listening to it (and kicking the stereo over at the end).\n• The members of the Jon Spencer Blues Explosion are replaced by actors (Winona Ryder, Giovanni Ribisi, and John C. Reilly) in their video for \"Talk About the Blues.\"\n• During Pink Floyd's live performances of The Wall in 1980 and 1981, the band was at times replaced by a quartet of identically-dressed stand-ins, wearing life masks molded from the band members' faces. This one has a deeper meaning, as per the themes of The Wall.\n• In Starflyer 59's \"I Win\" video, the entire band is replaced by anonymous younger actors. The rest of the video is a mishmash of performance and Concept Video; it's played so straight that anyone who hadn't seen the band before wouldn't know the difference (it didn't help that their previous two albums had no pictures of the band).\n• The band Gorillaz did not appear as the band in public for some time. There are effectively two versions of the band - the animated characters presented as \"Gorillaz\", and Damon Albarn, Tom Tom Club and the group of unknowns that actually records the music. Performances tend to hide the musicians behind screens, showing them only in silhouette. By Plastic Beach, however, the musicians now perform live fully visible. Damon decided playing behind the screen was too much of a hassle and the animated holograms were too expensive and risky. Murdoc explains it by how hard leaving Plastic Beach is, how he doesn't have his visa, or other reoccurring excuses, while calling Damon and the other musicians \"a bunch of imposters\". This is even shown in the O2 priority walk where Damon and the actual musicians are let on the stage and the fictional band is stopped by the bodyguards.\n• Another mega-example: Studio Killers, a band that consists of three animated characters: Cherry, Goldie Foxx and Dyna Mink. Speculations as to who the real members behind the characters are have arisen, but none of the rumours have been officially confirmed.\n• Vocaloid is perhaps the most extreme example of all, as the human vocalists are not only absent from music videos and \"live\" shows, they also never performed the songs, which are assembled on a computer from libraries of recorded syllables.\n• Donald Fagen's \"New Frontier\" video only features him as a picture on the wall.\n• They Might Be Giants' video for \"With the Dark\" has them portrayed by small action figures. They end up being killed and taxidermized by a giant squid.\n• A somewhat extreme inversion of this trope is the Nine Inch Nails video for \"Into the Void,\" which consisted for the most part of extreme close-ups of frontman Trent Reznor's face, hair, eyes, and skin.\n• KoRN's video for \"Twisted Transistor\" replaces the actual band members (Jonathan Davis, Fieldy, David Silveria, and Munky) with four famous rappers (Lil Jon, Xzibit, David Banner, and Snoop Dogg, respectively) for a This Is Spın̈al Tap-style mockumentary. The actual musicians only appear at the end of the video as music company executives.\n• Serj Tankian only appears in two of his twelve videos for his solo album Elect the Dead.\n• George Michael did this on purpose for the videos for singles from Listen Without Prejudice Vol. 1, as he didn't want to objectify his person and he was in the middle of arguing with his record label. Due to this, \"Praying for Time\" features just a static background and the lyrics being shown on screen (there's a good reason you haven't seen it, ever). For the more famous \"Freedom '90\", David Fincher decided to throw in a bunch of models.\n• The video for C+C Music Factory's single, \"Gonna Make You Sweat (Everybody Dance Now)\", substituted young, attractive, (and most distinctly) slim Zelma Davis for the actual vocalist, Martha Wash (who was distinctly not young or slim). She sued for credit on the album, won, and which eventually led to vocal credits in albums and music videos mandatory.\n• C+C's record label tried to refute the charges by having Davis perform the song live (most notably on The Arsenio Hall Show). It backfired spectacularly: Davis' thin, reedy voice sounded nothing like the voice on the song, strengthening Wash's case that much more.\n• Norman Cook (aka Fatboy Slim) doesn't like to appear in his videos. He does however appear in some form in most of them - either as a photograph, a cardboard cutout or a painting of himself. For example, there's a portrait of him hung on a hotel wall in \"Weapon of Choice\", and the video for \"The Joker\" (which stars a bunch of kittens) features a miniscule \"MISSING HUMAN, ANSWERS TO 'NORMAN'\" poster hanging on a streetlight.\n• The Chemical Brothers likewise make brief cameos while remaining otherwise absent from their music videos. They're the skeletons exiting the car at the end of the \"Hey Boy Hey Girl\" video, for example.\n• Parodied by the video for Blues Traveler's \"Runaround\". It starts out seeming like a straight example, with a group of actors miming the song instead of the band (most noticeably, a young, thin Adam Duritz lookalike is standing in for John Popper). However, the whole music video is ultimately a parody of this trope, complete with references to The Wizard of Oz, in which a Dorothy stand-in and her companions discover that the band performing the song is miming and lip-synching and the real band is playing from behind a curtain, and they are eventually revealed.\n• \"Another Way To Die\" by Disturbed in order to get the Green Aesop across is the first video of theirs to not feature any band members. It instead depicts a wasteland destroyed by humanity's treatment of the earth interplayed with images of the current earth and things such as oil spills and smoke stacks.\n• Many of the \"faces\" of Eurobeat artists are not the actual singers. For example, Bazooka Girl was depicted as Cristiana Cucchi, but the vocals on the recordings were performed by a singer known only as \"R.\".\n• BT's \"Somnambulist(Simply Being Loved)\" features JC Chasez as the vocalist, but the video depicts BT himself lipsynching. Ditto for \"Suddenly\", where the real vocalist was Christian Burns.\n• As a possible parody of the use of this trope for sex appeal, Von Sudenfed's \"Fledermaus Can't Get It\" replaces Mark E. Smith with a trio of drag queens, who lip-sync to the song while wearing various makeup and outfits.\n• Similar to the Milli Vanilli and C+C examples, Technotronic's Pump up the Jam album cover and music video substituted Zairean model Felly for the real female vocalist, Ya Kid K, due to the latter appearing too tomboyish..\n• In the video for Kraftwerk's \"The Robots\", the band members are replaced by animatronic replicas.\n• The Comic Relief version of \"Is This The Way To Amarillo?\" It's not even a cover version; it's a Tony Christie re-release with a video in which Peter Kay pretends to be singing.\n• The British band The Alan Parsons Project rarely appeared on camera. The video for their song \"Don't Answer Me\" paid homage to Andy Warhol.\n• The Beastie Boys video for \"Make Some Noise\" features Seth Rogen, Elijah Wood, and Danny McBride lip-syncing to the song and dressed as Mike D, Ad Rock, and MCA (respectively) from the \"(You Gotta) Fight for Your Right (To Party!)\" video. The video functions as a sort of sequel to the earlier video, and features the Beastie Boys in brief cameos portraying other characters.\n• In live performances of Katy Perry's \"Last Friday Night (TGIF)\", Kathy Beth Terry is sometimes portrayed by Angela Hudson (her sister).\n• Trey Parker and Matt Stone's band DVDA did a version of \"What Would Brian Boitano Do?\" for the South Park: Bigger, Longer & Uncut soundtrack album. When the label wanted a video made for the song, they didn't want to be in it, so the band were played by some actors.\n• Wiley's \"Wearing My Rolex\" - rumor had it Wiley was supposed to be in it, but he hated the Fight Fur Your Right to Party-like concept so much he refused to get on camera and they had to make his video without him.\n• R.E.M. has quite a few examples, undoubtedly stemming from the band members' refusal to lip-synch in videos in their early years.\n• \"It's The End Of The World As We Know It (And I Feel Fine)\": A skateboarding kid rummages through a house of junk.\n• \"Fall On Me\" consists of nothing but black & white stock footage, with the lyrics superimposed in red.\n• \"Crush With Eyeliner\" also kind of applies: Members of the band are briefly seen looking on, but the main focus of the video is a group of Japanese teenagers either miming to the song (complete with guitars, a mic and a drum kit), dancing around, or generally participating in wacky antics.\n• The video for R.E.M.'s final single, \"We All Go Back to Where We Belong\", focuses solely on Kirsten Dunst, with none of the band members appearing.\n• The Rubber Bandits; sure they're in the music videos, but always hidden by the iconic plastic bag mask.\n• The Melvins' already Surreal Music Video for \"The Talking Horse\" features elements of the scenery lip-syncing the lyrics instead of the band - trees, skyscrapers, and newspaper boxes for instance. Vocalist Buzz Osborne gets a cameo of sorts, though - his picture graces a cologne ad on the side of a bus stop.\n• The video for The Format's \"Dog Problems\" portrays the plot of the song using hands with clothes on - For instance the lip-syncing (finger-syncing?) hand representing Nate Ruess has a tiny Nice Hat.\n• The Cure's \"Boys Don't Cry\" has kids playing the song while the band appears only in shadow behind them.\n• Similarly, Queen's \"The Miracle\" has a quartet of kid lookalikes until the very end, when the real band shows up.\n• Coheed and Cambria's \"The Broken.\" Its just a huge sci-fi battle.\n• A trademark of Black Moth Super Rainbow, usually coupled with Surreal Music Video. The \"Windshield Smasher\" video may or may not be an exception: It prominently features five figures in matching outfits and creepy masks who look like they might be portrayed by the band members, but could just be actors.\n• Monty Python's Flying Circus had a video of \"Yummy Yummy Yummy\" performed on a Top of the Pops-style set by Jackie Charlton and the Tonettes. The band members are implied to be hidden inside packing crates, which the camera dramatically pans around as if it were a Performance Video.\n• Linkin Park's \"Lost in the Echo \" qualifies as well (the first for the band, in fact.)\n• The video for \"No Future Shock\" features a deranged dance marathon somewhere between They Shoot Horses, Don't They? and Shortbus. TV on the Radio does not appear in it.\n• Coldplay has done some bizarre variants on this, including a miniaturized performance of \"Life In Technicolor\" with marionette versions of the bandmembers, and \"Paradise\" which inexplicably has them all wearing pink elephant costumes.\n• Mumford & Sons' video for \"Hopeless Wanderer\" looks like a typical \"band performing the song in an appropriate natural setting\" video at first glance, but either their backs are to the camera, or their faces are blurred out by lens flare and other techniques. Eventually, it becomes apparent that comic actors Jason Sudeikis, Ed Helms, Jason Bateman, and Will Forte are standing in for the actual band members, make the video a form of Self-Deprecation on the band's part as they proceed to ham it up by getting a little too into their emotional performance of the song.\n• Duran Duran's \"Girl Panic\" video features the song being mimed by a quintet of supermodels interspersed with segments in which the models, in character as the band members, are interviewed by the actual band members portraying music journalists.\n• Imagine Dragons doesn't appear in the Animated Music Video for \"Warriors\", and only make a cameo in the video for \"I Bet My Life\". Additionally, a few videos on their pre-Vevo YouTube channel consist of simply the band singing while random clips play.\n• On the recording of Erasure's \"Breathe\" and the rest of the Nightbird album, the female backing vocals were performed by Jill Seifers Walsh, the wife of guitarist Steve Walsh, but the video depicts Valerie Chalmers as the backup singer instead.\n• Another Europop group pulling a Milli Vanilli was Whigfield, whose Face of the Band was purported as Sannie Carlson, but whose vocals were actually recorded by Annerley Gordon.\n• The music video for Pirates of the Mississippi's \"Feed Jake\" does not feature the band at all, and was supposedly the first Country Music video to do this. Instead, it features two men who are childhood friends, loosely relating to the narrator's theme of not fitting in.\n• Lonestar's \"Mr. Mom\" is an Animated Music Video retelling the song's story via cartoons.\n• Most of the Superorganism videos for their self-titled album: \"Something For Your M.I.N.D.\" and \"It's All Good\" play with it a little by having Orono Noguchi's disembodied mouth superimposed over surreal imagery while lip-syncing. So far \"Everybody Wants To Be Famous\" is the only video to prominently feature any band members miming, and even then it's just Orono, who wears a pair of dark sunglasses throughout.\n• Newton's cover of Jigsaw's \"Sky High\", in its initial 1994 single release, did not have frontman Billy Myers performing vocals, instead reusing Des Dyer's vocals from the original song. A re-recorded version with Myers on vocals was released on his/their 1997 album Sweetest Secret.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/TheInvisibleBand", "media_links": ["/pmwiki/pmwiki.php/Music/Travis", "/pmwiki/pmwiki.php/Music/DaftPunk", "/pmwiki/pmwiki.php/Music/MilliVanilli", "/pmwiki/pmwiki.php/Music/EltonJohn", "/pmwiki/pmwiki.php/Creator/RobertDowneyJr", "/pmwiki/pmwiki.php/Music/JustinTimberlake", "/pmwiki/pmwiki.php/Music/Oasis", "/pmwiki/pmwiki.php/Music/CarlyRaeJepsen", "/pmwiki/pmwiki.php/Creator/TomHanks", "/pmwiki/pmwiki.php/Music/TheGratefulDead", "/pmwiki/pmwiki.php/Music/PaulSimon", "/pmwiki/pmwiki.php/Creator/ChevyChase", "/pmwiki/pmwiki.php/Music/Pavement", "/pmwiki/pmwiki.php/Music/TheReplacements", "/pmwiki/pmwiki.php/Creator/WinonaRyder", "/pmwiki/pmwiki.php/Creator/GiovanniRibisi", "/pmwiki/pmwiki.php/Creator/JohnCReilly", "/pmwiki/pmwiki.php/Music/PinkFloyd", "/pmwiki/pmwiki.php/Music/TheWall", "/pmwiki/pmwiki.php/Music/Starflyer59", "/pmwiki/pmwiki.php/Music/Gorillaz", "/pmwiki/pmwiki.php/Music/Blur", "/pmwiki/pmwiki.php/Music/TomTomClub", "/pmwiki/pmwiki.php/Music/StudioKillers", "/pmwiki/pmwiki.php/Music/Vocaloid", "/pmwiki/pmwiki.php/Music/TheyMightBeGiants", "/pmwiki/pmwiki.php/Music/NineInchNails", "/pmwiki/pmwiki.php/Music/KoRN", "/pmwiki/pmwiki.php/Music/LilJon", "/pmwiki/pmwiki.php/Music/SnoopDogg", "/pmwiki/pmwiki.php/Film/ThisIsSpinalTap", "/pmwiki/pmwiki.php/Creator/GeorgeMichael", "/pmwiki/pmwiki.php/Creator/DavidFincher", "/pmwiki/pmwiki.php/Series/TheArsenioHallShow", "/pmwiki/pmwiki.php/Music/FatboySlim", "/pmwiki/pmwiki.php/Music/TheChemicalBrothers", "/pmwiki/pmwiki.php/Music/BluesTraveler", "/pmwiki/pmwiki.php/Music/CountingCrows", "/pmwiki/pmwiki.php/Film/TheWizardOfOz", "/pmwiki/pmwiki.php/Music/Disturbed", "/pmwiki/pmwiki.php/Music/TheFall", "/pmwiki/pmwiki.php/Music/Kraftwerk", "/pmwiki/pmwiki.php/Creator/PeterKay", "/pmwiki/pmwiki.php/Music/TheAlanParsonsProject", "/pmwiki/pmwiki.php/Creator/AndyWarhol", "/pmwiki/pmwiki.php/Music/BeastieBoys", "/pmwiki/pmwiki.php/Creator/SethRogen", "/pmwiki/pmwiki.php/Creator/ElijahWood", "/pmwiki/pmwiki.php/Creator/DannyMcBride", "/pmwiki/pmwiki.php/Music/KatyPerry", "/pmwiki/pmwiki.php/Creator/TreyParkerAndMattStone", "/pmwiki/pmwiki.php/WesternAnimation/SouthParkBiggerLongerAndUncut", "/pmwiki/pmwiki.php/Music/REM", "/pmwiki/pmwiki.php/Creator/KirstenDunst", "/pmwiki/pmwiki.php/Music/Melvins", "/pmwiki/pmwiki.php/Music/TheCure", "/pmwiki/pmwiki.php/Music/Queen", "/pmwiki/pmwiki.php/Music/CoheedAndCambria", "/pmwiki/pmwiki.php/Series/MontyPythonsFlyingCircus", "/pmwiki/pmwiki.php/Series/TopOfThePops", "/pmwiki/pmwiki.php/Music/LinkinPark", "/pmwiki/pmwiki.php/Film/TheyShootHorsesDontThey", "/pmwiki/pmwiki.php/Film/Shortbus", "/pmwiki/pmwiki.php/Music/TVOnTheRadio", "/pmwiki/pmwiki.php/Music/Coldplay", "/pmwiki/pmwiki.php/Music/MumfordAndSons", "/pmwiki/pmwiki.php/Creator/JasonSudeikis", "/pmwiki/pmwiki.php/Creator/EdHelms", "/pmwiki/pmwiki.php/Creator/JasonBateman", "/pmwiki/pmwiki.php/Creator/WillForte", "/pmwiki/pmwiki.php/Music/DuranDuran", "/pmwiki/pmwiki.php/Music/ImagineDragons", "/pmwiki/pmwiki.php/Music/Erasure", "/pmwiki/pmwiki.php/Music/Lonestar"], "non_media_links": ["/pmwiki/pmwiki.php/JustForFun/IThoughtItMeant", "/pmwiki/pmwiki.php/Main/AnonymousBand", "/pmwiki/pmwiki.php/Main/TalkyBookend", "/pmwiki/pmwiki.php/Main/PerformanceVideo", "/pmwiki/pmwiki.php/Main/ConceptVideo", "https://www.youtube.com/watch?v=0HalCyn7z74", "/pmwiki/pmwiki.php/Main/NotHelpingYourCase", "/pmwiki/pmwiki.php/Main/TheManBehindTheCurtain", "/pmwiki/pmwiki.php/Main/GreenAesop", "/pmwiki/pmwiki.php/Main/GaiasLament", "https://www.youtube.com/watch?v=iG-CLFPU6RY", "/pmwiki/pmwiki.php/UsefulNotes/ComicRelief", "/pmwiki/pmwiki.php/Main/FightFurYourRightToParty", "/pmwiki/pmwiki.php/Main/SurrealMusicVideo", "/pmwiki/pmwiki.php/Main/NiceHat", "/pmwiki/pmwiki.php/Main/SurrealMusicVideo", "/pmwiki/pmwiki.php/Main/PerformanceVideo", "https://www.youtube.com/watch?v=co4YpHTqmfQ", "/pmwiki/pmwiki.php/Main/TrueArtIsIncomprehensible", "/pmwiki/pmwiki.php/Main/SelfDeprecation", "/pmwiki/pmwiki.php/Main/LargeHam", "/pmwiki/pmwiki.php/Main/AnimatedMusicVideo", "https://www.youtube.com/user/ImagineDragons/featured", "/pmwiki/pmwiki.php/Main/FaceOfTheBand", "/pmwiki/pmwiki.php/Main/CountryMusic", "/pmwiki/pmwiki.php/Main/AnimatedMusicVideo"]}