{"title": "Hollywood Web Cam", "content": "Webcams and Video Phones are amazing communication tools. More than just hearing a familiar voice, you can see the face of the person you're talking to, see the sparkle in their eyes, view their reaction to your Incredibly Lame Pun. It's almost like being in the same room with the person on the other end.\n\nIn Hollywood, a webcam really is like being in the same room with the other person.\n\nTo be fair, most such depictions of the Hollywood Web Cam are easily justified. For example, webcams are commercially available which boast 1080p resolution, justifying the high-res webcam shots usually shown on film. Further, even though in real life many people still have to contend with some noticable lag when using the Internet, this is removed from fiction because the gaps in conversation would be distracting, even annoying. Generally, this trope tends to be averted in horror films, or shows with high-risk stakes, as magically, whenever the webcam is recording someone who has important information, the webcam's shoddiness starts to make itself known.\n\nMore difficult to explain away is the common occurrence that the person on the other end of the webcam call will turn her head back and forth when talking to two or more people on this end, as if glancing back and forth between them. In reality, unless she is watching a wall-sized monitor which displays a wide-angle shot of the location she's calling to, this means she's on the other end, turning her head back and forth looking at absolutely nothing.\n\nIn a similar vein, if the (non-diagetic) camera is filming the computer from an off angle such as a 3/4 shot, the face on the computer screen will be turned to match that angle (see page image). In reality, this again means that the person on the other end is now looking off to the side, at absolutely nothing. Try walking a large semi-circle around your television during a news broadcast and see if the face on the screen rotates appropriately.\n\nAgain, though, this is not necessarily a bad thing. The whole \"three-dimensional face on a flat screen\" thing is probably an attempt to avoid a trip into the Uncanny Valley. After all, when you walked that semi-circle around your TV (admit it, you did), didn't it look creepy to have that face always looking directly at you? The reason the face doesn't change with the angle is because, of course, it's a flat image; but, although we know intellectually that this is correct, emotionally it just rubs the wrong way. The Hollywood Web Cam solves this by giving us a 3D face on the screen; it's an Acceptable Break From Reality. And this doesn't even take into account any Applied Phlebotinum which can inject a bit of Fridge Brilliance into the procedings.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/HollywoodWebCam", "media_links": ["/pmwiki/pmwiki.php/Series/TheBigBangTheory", "/pmwiki/pmwiki.php/Franchise/StarTrek", "/pmwiki/pmwiki.php/Franchise/Digimon", "/pmwiki/pmwiki.php/ComicBook/MyBoyfriendIsAMonster", "/pmwiki/pmwiki.php/Film/TwoThousandOneASpaceOdyssey", "/pmwiki/pmwiki.php/Creator/DisneyChannel", "/pmwiki/pmwiki.php/Film/AustinPowersInternationalManOfMystery", "/pmwiki/pmwiki.php/Film/AirplaneIITheSequel", "/pmwiki/pmwiki.php/Film/Unfriended", "/pmwiki/pmwiki.php/Series/TheBigBangTheory", "/pmwiki/pmwiki.php/Series/StarTrekTheNextGeneration", "/pmwiki/pmwiki.php/Series/BabylonFive", "/pmwiki/pmwiki.php/Series/MysteryScienceTheater3000", "/pmwiki/pmwiki.php/Film/ThisIslandEarth", "/pmwiki/pmwiki.php/Series/AttackOfTheShow", "/pmwiki/pmwiki.php/Series/TheGoodWife", "/pmwiki/pmwiki.php/Series/CSINY", "/pmwiki/pmwiki.php/Series/NedsDeclassifiedSchoolSurvivalGuide", "/pmwiki/pmwiki.php/Series/DoctorWho", "/pmwiki/pmwiki.php/Webcomic/Paranatural", "/pmwiki/pmwiki.php/WesternAnimation/StarWarsTheCloneWars", "/pmwiki/pmwiki.php/WesternAnimation/StevenUniverse"], "non_media_links": ["/pmwiki/pmwiki.php/Main/SpockSpeak", "/pmwiki/pmwiki.php/Main/VideoPhone", "/pmwiki/pmwiki.php/Main/IncrediblyLamePun", "/pmwiki/pmwiki.php/Main/AcceptableBreaksFromReality", "/pmwiki/pmwiki.php/Main/TropesAreNotBad", "/pmwiki/pmwiki.php/Main/UncannyValley", "/pmwiki/pmwiki.php/Main/AcceptableBreaksFromReality", "/pmwiki/pmwiki.php/Main/AppliedPhlebotinum", "/pmwiki/pmwiki.php/Main/FridgeBrilliance", "/pmwiki/pmwiki.php/Main/VideoPhone", "/pmwiki/pmwiki.php/Main/UnbuiltTrope", "/pmwiki/pmwiki.php/Main/FridgeLogic", "/pmwiki/pmwiki.php/Main/AppliedPhlebotinum", "/pmwiki/pmwiki.php/UsefulNotes/Venezuela", "/pmwiki/pmwiki.php/Recap/DoctorWhoS5E7TheWheelInSpace", "/pmwiki/pmwiki.php/Videogame/StarWarsTheOldRepublic", "/pmwiki/pmwiki.php/Main/RuleOfFunny", "/pmwiki/pmwiki.php/Main/NoodleIncident"]}