{"title": "Multiple Persuasion Modes", "content": "Games that allow you to use in-game social skills to advance the plot (such as Role-Playing Games and games that offer the full Combat, Diplomacy, Stealth spectrum) usually determine whether you succeed or fail at a persuasion attempt by checking your Player Character's Charisma stat or Persuasion skill score against a predetermined difficulty level of convincing the specific Non-Player Character (which may be influenced by their Relationship Values). However, some games spice it up a little by offering multiple modes of persuasion, which may be more or less appropriate under specific circumstances, have different effects besides persuasion itself, and be tied to different skill scores.\n• Convince. This mode appeals to the better in people, stressing voluntary cooperation and good relationships, so an exceptional success at it may improve Relationship Values. Can be further subdivided into two sub-modes:\n• Charm appeals to the NPC's emotions and feelings, and is thus best used on impulsive and emotional individuals.\n• Reason appeals to the NPC's logic and interests, therefore it is best used on rational and contemplative characters.\n• Intimidate. This mode instead draws on people's fears to make them do or not do a specific thing. Regardless of whether the persuasion attempt succeeds, it commonly reduces the Relationship Values because no one likes to be treated this way. Two sub-modes can be distinguished:\n• Threaten. The PC outright threatens the NPC with violence if they don't comply or acts as a Threatening Mediator. If it fails, the dialogue is likely to end right there and give way to combat.\n• Browbeat. Instead of direct threats, the NPC is made aware of objective consequences of their refusal to help (e.g. by pointing at a mutual bigger threat) until they give in.\n• Seduce. This mode draws on the sexual or romantic attraction of the NPC towards the PC, so the former's sexuality and the latter's good looks may be contributing factors in whether the persuasion attempt succeeds. May overlap with Charm or unlock Optional Sexual Encounters.\n• Bribe. Instead of swaying the NPC with just words, the PC can instead try to soften them up with Global Currency. The morality of the target may determine whether the attempt succeeds and the amount of currency offered may affect its effectiveness.\n• Supernatural. In speculative settings, an option to use supernatural abilities (such as Compelling Voice, Jedi Mind Trick, Charm Person, or another form of Mind Control) in NPC dialogue may be present. Some NPCs may be resistant to such abilities, however.\n\nBluff or Lie is often presented as its own persuasion mode, but it is actually very different from the rest: by using it, a PC tries to pass a falsehood off as truth to an NPC, which may compel them to act on this information without the PC actually directing them to do so. What makes it different from other modes is its situational usage: the NPC must be a priori ready to act on the information, and a successful lie simply points them in a direction beneficial to the PC.\n\nCompare Persuasion Minigame, where a persuasion attempt is framed as a Mini-Game, rather than a background skill check, although such a minigame may itself offer multiple persuasion modes as mechanical options.\n• Dungeons & Dragons has the Diplomacy/Persuasion and Intimidate skills. Their main difference is that Diplomacy increases a target's disposition but is no guarantee they will aid you (as even allies have limits on what they are willing to do), and Intimidate forces a target to comply but typically turns them against you. There is also the Bluff/Deception skill, which lets you tell a lie that might convince the person naturally, and various magical spells such as Charm Person or Suggestion that do the job for you.\n• GURPS has the skills Carousing, Diplomacy, the Enthrallment group (Captivate, Persuade, Suggest, and Sway Emotions) done by fantasy bards, Erotic Art, Fast-Talk, Hypnotism, Leadership, Merchant, Musical Influence (cinematic), and Public Speaking.\n• In Eclipse Phase, Intimidation and Persuasion are different skills, Intimidation covering threats while Persuasion is a catch-all for any other way to convince someone to do something.\n• Shadowrun has Interrogation, Intimidation either a weak form of Interrogation or a strong arm version of Negotiation depending on how you play it , Negotiation and different ratings of Etiquette for different environments (corporate, tribal, online...).\n• Ironclaw has a short comic in the main rulebook demonstrating how to convince a man to light a candle using the skills of Deceit \"It's very dark in here. You are likely to be eaten by a grue.\" , Gossip, Inquiry, Leadership, Negotiation, and Presence \"Light this thing now, or I'll stick it in a spot that never gets any light!\" .\n• In Hc Svnt Dracones, the Coercion proficiency is used to manipulate others through trickery, or threats. Actually browbeating someone is covered by Intimidate. Express is for getting across information or negotiating, though if a character is lying they can substitute Deception.\n• Paranoia. Early editions have Bootlicking (sucking up), Bribery (say it with money), Con (as in Con Game), Fast Talk, Interrogation, Intimidation, Motivation (i.e. leadership), Oratory (convincing a group of people) and Spurious Logic (for use on robots and The Computer).\n• Call of Cthulhu has Bargain (to determine prices), Credit Rating (for purposes of finances and trust), Fast Talk (to obtain temporary agreement) and Persuade (general convincing).\n• Classic Traveller has Administration (dealing with bureaucracies), Bribery, Carousing (being sociable, mingling), Instruction (teaching), Interrogation, Leadership (controlling groups), Liaison (Administration plus Streetwise), Recruiting (hiring personnel) and Streetwise (dealing with the lower classes, workers and the underworld).\n• Champions 4th Edition has the skills Bribery, Bureaucratics (dealing with bureaucrats/red tape), Conversation (extracting information casually), High Society (dealing with the wealthy and high class), Interrogation (torture, drugs, mind control etc.), Knowledge/Culture (when dealing with members of that culture), Oratory (speaking to an audience), Persuasion (convincing/influencing individuals), Seduction (gaining trust with companionship and favors, not necessarily sexual), Streetwise (dealing with the underside of society) and Trading (business bargaining).\n• The Old World of Darkness game line has three social attributes (Appearance, Charisma and Manipulation) and several social abilities (Expression, Intimidation, Subterfuge, Etiquette, Streetwise and occasionally Instruction and/or Leadership). Potentially, any attribute and ability can be combined, allowing the use of social attributes with non-social abilities (e.g to impress with prowess at something) and vice versa (e.g to intimidate using brute strength). The New World of Darkness replaces Appearance with Composure, which refers to a character's aptitude at not being swayed.\n• A Song Of Ice And Fire has a variation on this - as part of its tabletop Persuasion Minigame, you can use one of seven techniques in every round (bargain, charm, convince, incite, intimidate, seduce, taunt). If they're used honestly they're based on Persuasion, and otherwise they're based on Deception.\n• Apocalypse World actually has different mechanics for different persuasion modes, namely with the Go Aggro and Seduce or Manipulate basic moves. Go Aggro is an Intimidate attempt, where a PC threatens another character with violence if they don't do something for them: if the player rolls well, the target has a choice of either complying or forcing the PC's hand and sucking up the damage (once the dice are rolled, the player can no longer pull the blow). Seduce or Manipulate, meanwhile, is an umbrella move for several modes (Charm, Reason, Seduce, Browbeat) and works by presenting the other character with some leverage (a promise, a good reason, sexual favors, verbal threats) and a demand: if you roll well, they comply, if not, they may ask for more.\n• Blades in the Dark has three action ratings that can be used for making NPCs do what you want: Command, Sway, and Consort. With Command, you straight-up order a person to do something, offering as leverage either authority (even if it's a pretend one, like a stolen police badge), or fear (thus covering both Threaten or Browbeat types). Sway, on the other hand, covers all situations where you need to induce a quick and temporary change of mind, e.g. to make an NPC help you this one time or let you go based on a lie, etc. (thus, covering the gamut of Charm, Reason, Seduce, Bribe, and Bluff); you do still need specific leverage to make it work, though, like a good argument, a convincing lie, cold coin, or just your dashing good looks. Consort, meanwhile, has the prime purpose of establishing and reaping benefits from long-term relationships, regardless whether friendly, romantic, or professional, and its only required \"leverage\" is some time with the NPC in a relatively non-hostile environment (essentially, the rule of thumb of whether to use Consort or the other two is to ask: do I care about this NPC in the long-term?). Finally, you can always use the Attune action to try to interface with the NPC's brain directly through the ghost field, but it is very, very ill-advised.\n• Arcanum: Of Steamworks & Magick Obscura uses the Persuasion skill throughout most quests and represents both the ability to convince someone that your course of action is correct and the ability to convince someone of a bluff. On a few occasions, a sufficient Strength stat can also be used for intimidation to pass a situation, such as convincing a quest NPC to give you an item or convincing a belligerent man to leave you alone.\n• Diplomacy in Crusader Kings mostly comes down to getting another character to like you enough to agree to whatever you're proposing (or at least that's the aspect the player has the greatest ability to affect most of the time). There are however a multitude of ways to improve someone's opinion of you: Sending them gifts of gold is the most straight-forward and reliable, but you can also send you chancellor to improve relations, marry one of your close family members to one of theirs, or in the case of your own vassals and courtiers, grant them landed titles, honorary titles or council positions. Among other things.\n• Dungeons & Dragons Online follows the tabletop game in that your characters may invest points into various social skills (Bluff, Diplomacy, Intimidate). These actually have uses in battle (not quite this trope), but may also come up in conversation with NPCs where conversation options allow use of these skills to avoid/trigger a fight or otherwise complete some optional quest objective.\n• The Elder Scrolls:\n• Daggerfall has separate skills (Etiquette and Streetwise) which give you different persuasive dialogue options in conversation. Etiquette gives you the \"POLITE\" tone, while Streetwise gives you the \"BLUNT\" tone. NPCs are weighted to react more positively to to one option or the other, depending on their class/faction associations/social status.\n• Morrowind offers several persuasion options, with your success dictated by your Speechcraft skill and Personality attribute. The first option is to Admire, which is a straight attempt to make raise the NPC's disposition. The second option is to Intimidate, which threatens the NPC for a temporary disposition increase. (Speak to that NPC again after and their disposition will be lower than it originally was.) The third option is to Taunt, which lowers the NPC's disposition and may goad them into attacking you. (Useful for getting around murder charges, since you can then kill them in self-defense.) Finally, you can Bribe the NPC, which results in a permanent increase to their disposition.\n• For Oblivion, the series shifts to a Persuasion Minigame which allows the player to Joke, Admire, Boast, and Coerce. Or just Bribe them for a quick fix.\n• Skyrim returns to dialogue-based skill checks in two different flavors. Persuade is determined solely by Speechcraft skill. Intimidate takes into account both Speechcraft skill and player level.\n• The Knights of the Old Republic series has the Persuade Skill Score, which unlocks additional and often more beneficial persuasion options in dialogue trees. It also lets the PCs take the Force Persuade feat—basically the Jedi mind trick from the Star Wars movies, which works wonders on simple-minded individuals but is useless on intelligent and non-sentient life forms.\n• Vampire: The Masquerade \u0096 Bloodlines has three social skills that unlock additional dialogue tree options: Persuasion, Intimidation, and Seduction. Before the patches, good Intimidation opportunities were few and far in-between, so Persuasion was the main mode. Additionally, two vampiric Disciplines (magical spells, in essence), Malkavians' Dementation and Ventrue's Dominate, can be used in dialogue to persuade NPCs.\n• A Dance with Rogues features the classic D&D Diplomacy, Intimidation, and Bluff skills, but supplements them with the custom \"Arts of Love\" skill, which represents the Princess' knowledge of the love-making and sexual experience and can be used to have her way with many, many male NPCs (and some females) when other options fail.\n• In the Mass Effect series, the Paragon/Renegade dialogue options double as persuasion attempts. Paragon options generally fall under the Convincing sub-types (emotional or rational), while Renegade ones are either Browbeating or outright Threats, depending on the target. In Mass Effect, the Paragon/Renegade options are directly tied to their own separate Skill Scores, Charm (Paragon) and Intimidate (Renegade), that you have to have a certain amount of points in to unlock the options. Mass Effect 2 removes the Charm/Intimidate skills and instead makes the dialogue options directly tied to how many Paragon/Renegade points you already have. Mass Effect 3 has a separate \"Reputation\" meter which unlocks both Paragon and Renegade options.\n• Deus Ex: Human Revolution features a complex Dialogue Tree-based Persuasion Minigame for its \"social boss battles\", which involves determining the NPC's personality type (Alpha, Beta, or Omega) during an initial exchange, then choosing the correct persuasion mode to get their cooperation. Alphas like being appeased (basically, a Reason mode with a touch of humility), Betas are susceptible to Charm (usually in the form of buttering them up or playing to their ego), while Omegas give in to pressure/intimidation quickly.\n• Divinity: Original Sin features three modes that can be chosen in any persuasion attempt: Intimidate, Charm, and Reason. They are all based on the same skill (Charisma), however, so the only difference they make is the slight bonus or penalty you get in the subsequent Rock\u0096Paper\u0096Scissors-based Persuasion Minigame, based on how appropriate the chosen mode in the given circumstances.\n• Wasteland 2 has three social skills, named Hard Ass, Kiss Ass, and Smart Ass. These generally correspond to the Intimidate, Charm, and Reason modes, respectively.\n• Pillars of Eternity lacks dedicated persuasion skills, so some dialogue branches instead require certain attribute values to unlock—most commonly Resolve (which, being a mix of classic Wisdom and Charisma, mainly opens the Charm options), but also Intellect (Convince options), Perception (noticing lies), and sometimes even Might (Intimidate options). Additionally, towards the end of Act II, it becomes possible to draw upon your established reputation in some dialogues: NPCs are, for instance, much more inclined to believe you if you have the Honest or Benevolent reputations (which are also leveled, so you may not be honest or benevolent enough to pass a reputation check).\n• Many people think that a Pacifist Run in Undertale requires being incredibly nice to everyone you meet. However, it is just as possible to beat up monsters until they surrender, and still achieve the same results.\n• Jade Empire has Charm, Intimidate and Intuition (Reason) stats for speech checks, which are tied to a combination of your main stats and can be boosted with Essence Gems.\n• Fallout: Dialogue options for persuasion are most often based on the Speech skill (except in Fallout 4, which has no Skills, and instead uses Charisma almost entirely), but there's usually at least one other option, which can be based on any Skill, stat, Perk, or whatever else fits the situation.\n• Charisma score can sometimes be used to Charm, though such checks were much more common in 1 and 2 than the 3D games.\n• Speech is most commonly used to Reason, but other Skills or Intelligence are as well. Generally, the point it to either have the knowledge to make your argument, or display your competence and thus trustworthiness. For instance, a man in Fallout: New Vegas will give you some dynamite to defend Goodsprings with if you have the Explosives skill to convince him you won't blow your own allies up. These same Skills are often used to Lie as well, where most Skills give you enough knowledge for a convincing lie, and Speech lets you get away with sometime entirely made up.\n• High Strength can sometimes be used to Threaten. Although sometimes even that is based on Speech.\n• Seduction is an occasional option, usually based on Charisma score in 1 or 2, and possessing the Lady Killer/Black Widow/Confirmed Bachelor/Cherchez La Femme perk in Fallout 3 or New Vegas. Optional Sexual Encounters are often a result (or just a means at something else).\n• Bribery is quite common, and often the other methods are just a way to save money.\n• One planned concept for Fallout: Van Buren was to split Speech into Persuasion (covering Reason, Charm, Intimidate) and Deception (covering Bluff and Lie). Each would be used in dialogue, but also be used to keep party members in check and to disguise yourself, respectively.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/MultiplePersuasionModes", "media_links": ["/pmwiki/pmwiki.php/TabletopGame/DungeonsAndDragons", "/pmwiki/pmwiki.php/TabletopGame/GURPS", "/pmwiki/pmwiki.php/TabletopGame/EclipsePhase", "/pmwiki/pmwiki.php/TabletopGame/Shadowrun", "/pmwiki/pmwiki.php/TabletopGame/Ironclaw", "/pmwiki/pmwiki.php/TabletopGame/HcSvntDracones", "/pmwiki/pmwiki.php/TabletopGame/Paranoia", "/pmwiki/pmwiki.php/TabletopGame/CallOfCthulhu", "/pmwiki/pmwiki.php/TabletopGame/Traveller", "/pmwiki/pmwiki.php/TabletopGame/Champions", "/pmwiki/pmwiki.php/TabletopGame/OldWorldOfDarkness", "/pmwiki/pmwiki.php/TabletopGame/NewWorldOfDarkness", "/pmwiki/pmwiki.php/TabletopGame/ASongOfIceAndFire", "/pmwiki/pmwiki.php/TabletopGame/ApocalypseWorld", "/pmwiki/pmwiki.php/TabletopGame/BladesInTheDark", "/pmwiki/pmwiki.php/VideoGame/ArcanumOfSteamworksAndMagickObscura", "/pmwiki/pmwiki.php/VideoGame/CrusaderKings", "/pmwiki/pmwiki.php/VideoGame/DungeonsAndDragonsOnline", "/pmwiki/pmwiki.php/Franchise/TheElderScrolls", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsIIDaggerfall", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsIIIMorrowind", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsIVOblivion", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsVSkyrim", "/pmwiki/pmwiki.php/VideoGame/KnightsOfTheOldRepublic", "/pmwiki/pmwiki.php/Franchise/StarWars", "/pmwiki/pmwiki.php/VideoGame/VampireTheMasqueradeBloodlines", "/pmwiki/pmwiki.php/VideoGame/ADanceWithRogues", "/pmwiki/pmwiki.php/Franchise/MassEffect", "/pmwiki/pmwiki.php/VideoGame/MassEffect1", "/pmwiki/pmwiki.php/VideoGame/MassEffect2", "/pmwiki/pmwiki.php/VideoGame/MassEffect3", "/pmwiki/pmwiki.php/VideoGame/DeusExHumanRevolution", "/pmwiki/pmwiki.php/VideoGame/DivinityOriginalSin", "/pmwiki/pmwiki.php/VideoGame/Wasteland2", "/pmwiki/pmwiki.php/VideoGame/PillarsOfEternity", "/pmwiki/pmwiki.php/VideoGame/Undertale", "/pmwiki/pmwiki.php/VideoGame/Fallout", "/pmwiki/pmwiki.php/VideoGame/Fallout4", "/pmwiki/pmwiki.php/VideoGame/Fallout1", "/pmwiki/pmwiki.php/VideoGame/Fallout2", "/pmwiki/pmwiki.php/VideoGame/FalloutNewVegas", "/pmwiki/pmwiki.php/VideoGame/Fallout3", "/pmwiki/pmwiki.php/VideoGame/FalloutVanBuren"], "non_media_links": ["/pmwiki/pmwiki.php/Main/SkillScoresAndPerks", "/pmwiki/pmwiki.php/Main/RolePlayingGame", "/pmwiki/pmwiki.php/Main/CombatDiplomacyStealth", "/pmwiki/pmwiki.php/Main/PlayerCharacter", "/pmwiki/pmwiki.php/Main/TheSixStats", "/pmwiki/pmwiki.php/Main/NonPlayerCharacter", "/pmwiki/pmwiki.php/Main/RelationshipValues", "/pmwiki/pmwiki.php/Main/RelationshipValues", "/pmwiki/pmwiki.php/Main/RelationshipValues", "/pmwiki/pmwiki.php/Main/ThreateningMediator", "/pmwiki/pmwiki.php/Main/EnemyMine", "/pmwiki/pmwiki.php/Main/OptionalSexualEncounter", "/pmwiki/pmwiki.php/Main/GlobalCurrency", "/pmwiki/pmwiki.php/Main/CompellingVoice", "/pmwiki/pmwiki.php/Main/JediMindTrick", "/pmwiki/pmwiki.php/Main/CharmPerson", "/pmwiki/pmwiki.php/Main/MindControl", "/pmwiki/pmwiki.php/Main/ImmuneToMindControl", "/pmwiki/pmwiki.php/Main/PersuasionMinigame", "/pmwiki/pmwiki.php/Main/MiniGame", "/pmwiki/pmwiki.php/Main/ConGame", "/pmwiki/pmwiki.php/Main/PersuasionMinigame", "/pmwiki/pmwiki.php/Main/ManipulativeBastard", "/pmwiki/pmwiki.php/UsefulNotes/Dice", "/pmwiki/pmwiki.php/Main/PersuasionMinigame", "/pmwiki/pmwiki.php/Main/SkillScore", "/pmwiki/pmwiki.php/Main/AllMenArePerverts", "/pmwiki/pmwiki.php/Main/EvenTheGirlsWantHer", "/pmwiki/pmwiki.php/Main/KarmaMeter", "/pmwiki/pmwiki.php/Main/SkillScore", "/pmwiki/pmwiki.php/Main/NoPointsForNeutrality", "/pmwiki/pmwiki.php/Main/DialogueTree", "/pmwiki/pmwiki.php/Main/PersuasionMinigame", "/pmwiki/pmwiki.php/Main/RockPaperScissors", "/pmwiki/pmwiki.php/Main/PersuasionMinigame", "/pmwiki/pmwiki.php/Main/TheSixStats", "/pmwiki/pmwiki.php/Main/Strength", "/pmwiki/pmwiki.php/Main/KarmaMeter", "/pmwiki/pmwiki.php/Main/PacifistRun", "/pmwiki/pmwiki.php/Videogame/JadeEmpire", "/pmwiki/pmwiki.php/Main/FirstTown", "/pmwiki/pmwiki.php/Main/BavarianFireDrill", "/pmwiki/pmwiki.php/Main/GayOption", "/pmwiki/pmwiki.php/Main/OptionalSexualEncounter", "/pmwiki/pmwiki.php/Main/MoraleMechanic"]}