{"title": "Retail Riot", "content": "A brawl breaks out between customers in a store over items that are in limited supply.\n\nIn comedic works, this is likely due to a big sale offering great deals, or due to an item that absolutely everyone simply has to have for Christmas or a Christmas-like holiday whose true meaning has been cheapened by commercialism. In more serious situations, it can be the result of mobs desperate to hoard survival materials before an impending disaster (usually an apocalypse, a storm, or if there's a violent protest that leads to looting), though the \"hoarding survival materials for a disaster\" scenario can also be Played for Laughs, as seen in It's Always Sunny in Philadelphia and The Simpsons. It can also show up in advertisements, where customers are so eager to get their hands on the advertised product that they'll fight each other over it.\n\nThis can sadly be Truth in Television, as there have been cases of people being injured or even killed at large sales events such as Black Friday.\n• The entire plot of Ben-To is hot-blooded fights over half-priced bento.\n• In Crayon Shin-chan, Mitzy often finds herself beating the crap out of other women just to get her hands on anything on sale. One time, it was over bulk-packaged eggs. Most of them ended up smashed on the ground during the chaos.\n• In the Eureka Seven episode Vivid Bit, The episode briefly cuts to short scenes of Hilda gets into massive brawls in a store over the sale of toilet paper and toothpaste\n• In episde 15 of Hugtto! Pretty Cure, Ruru was sent to the store that was having a sale on eggs for the first 20 customers. But she had to outrun a bunch of frantic women in order to get to them.\n• Misty from the Pokémon anime fights over an item of clothing with a larger woman while in Celadon City.\n• Occurs several times in Sailor Moon.\n• In the first episode, the Monster of the Week nearly sells Usagi a cursed diamond ring. However, when it loudly announces the absurdly large discount on the price, Usagi gets knocked to the ground by a crowd of women rushing to buy the ring for themselves.\n• In episode 16, a fabric shop is filled with women struggling with each other over material to use in a wedding dress competition.\n• Jingle All the Way: There's a brawl over the Turbo Man action figure.\n• In Hannah Montana: The Movie, Hannah Montana and Tyra Banks ruin the shoe dept. of a Belk store over a pair of boots.\n• The opening sequence of Krampus features herds of berserk customers trampling each other for Christmas gifts in dreamy slow-motion. It establishes that the spirit of giving just isn't what it used to be.\n• The French novel Au Bonheur des Dames features one deliberately engineered by the store's owner\" by piling up various cheap items to nearly block the front door, the shrunken entrance makes it look like people are clamoring to get inside, which only attracts more people to see what the fuss is all about. On one big opening day it nearly sparks a riot until the police intervene, which of course causes more people to come in.\n• In Life as We Knew It, when everyone is stocking up for The End of the World as We Know It, Miranda uses a shopping cart to attack a woman who is trying to steal a food item from Mrs. Nesbitt.\n• On Friends, Monica tries to save money for her wedding by getting her dress from an outlet warehouse. Lots of women show up and when the doors open it's a pretty aggressive situation. Monica, Rachel, and Phoebe bring whistles so they can find each other.\n• In a Christmas episode of The Jack Benny Show, a mob of housewives is shown in a store with merchandise (clothing) flying everywhere. Jack crawls out from beneath them and makes sarcastic commentary on holiday shopping.\n• On Lie to Me, the B-Plot for \"Black Friday\" involves the team trying to figure out what caused a fight to break out in front of a store.\n• The Full House episode \"I've Got a Secret\" has a scene with Danny, Jesse and Joey trying to buy a Mighty Mutant Super Fortress playset for Michelle and her club, only it's such a hot-selling toy that the three men encounter such a riot at a toy store.\n• Malcolm in the Middle: Lois takes the boys to a basement sale at Hannings in the \"If Boys Were Girls\" episode to buy their clothes for the next year. When they arrive, it is a screaming melee of people fighting over the clothes on sale. Lois: All right, we\u0092re going in. You see anything your size, you grab it and hold onto it, no matter what anyone tries to do to you. Protect your heads. Don\u0092t trust anyone. \n\nMalcolm: What are you trying to do? Scare us? \n\nLois: Yes, fear is good. It's an 80% off sale. Fear will keep you alive.\n• The Golden Girls had a scene talking about this once, with Dorothy making it sound like everyone else was doing the pushing and pulling and hitting, and then she says she still got what she was after.\n• In an episode of Bones the Victim of the Week was a Bridezilla, and Booth & Bones go to the bridal shop where she bought her dress when they happen to be having their one-day-a-year sale. Wedding dresses all over the place and future brides fighting over them.\n• One episode of How I Met Your Mother referred to a particular shoe sale as a \"feeding frenzy.\" A flashback shows women literally fighting over the shoes, and upon losing a pair Lily tells the other women that \"she'd made the list, bitch.\"\n• The Black Friday episode of Superstore: The mob of customers actually broke down the front door seconds before it opened.\n• The Nanny: In the season 4 episode \"The Bird's Nest\", Fran gets in a fight with another shopper over a green sweater at the Loehmann's Semi\u0096Annual Red Star Clearance. It eventually turns out the woman is Brighton's science teacher, and Fran gives her the sweater as a bribe to get him an extension on his science project.\n• Implied to have been the case in an episode of Punky Brewster, at the height of the Cabbage Patch Kids craze. Henry goes to the store to get CP dolls for Punky, Cherie, and Margaux, but the crowd and demand is such that he's only able to get one doll. The episode focuses more on the friction this creates in the girls' friendship, but Henry's beleaguered expression and visible exhaustion when he returns from the shopping trip makes it clear that he had to contend with this trope.\n• This Garfield has triple-coupon day at the supermarket leading to the shoppers racing each other with their carts. (Which may remind people of how they played Supermarket Sweep.)\n• Frequently seen in Retail on Black Friday, the rest of the run-up to Christmas, and sales. One Christmas strip had Cooper terrified of putting a limited number of this year's Must Have Toy on the shelves, in case the customers tore him apart trying to get it.\n• The whole premise of Team Starkid's Horror Comedy musical Black Friday.\n• Occurs in this strip of Exterminatus Now.\n• Seen in this Sluggy Freelance strip.\n• Homestar Runner: In \"Toikey TV\", Bubs runs an ad for a Black Friday sale at the concession stand. Bubs: Line forms at 1 AM! Doors open at 2 AM! Shoving and trampling starts promptly at 2:05, followed by tear gas and riot police at 2:15. Come on, moms! You know you want to beat each other up over some stupid kids' toy! And if you draw blood, you just might make it onto this year's edition of Mommy Fights!\n• Satirized by this article in The Onion.\n• One comic strip on Not Always Right showed \"Why dealing with customers is worse than a Zombie Apocalypse\". It states that \"Zombies will never attack each other, even when supplies are scarce\" while \"Customers will attack each other, especially when supplies are scarce\".\n• Occurs in The Simpsons:\n• In the episode Grift of the Magi, there was a riot thrown by customers desperate to get the new toy \"Funzo\". The marketing executives responsible watched the footage while celebrating the launch in a hot tub, and are happy that there was only \"three seconds between thinking about buying and rioting\".\n• In another episode, there's a run at the Kwik-E-Mart when a hurricane is about to come through. Lisa gets put in a shopping cart by a crazy lady who feels Lisa's head and thinks she's a pineapple. Earlier in the same episode, Kent Brockman is covering the arrival of the hurricane, which has been named Hurricane Barbara. He then says that if you think it's sexist to name a destructive storm after a woman, you obviously havent seen \"the gals clawing for merchandise at a clearance sale\". Marge: Hmm, thats true, but he shouldnt SAY it.\n• When the new Malibu Stacy was released, Lisa apologized to Marge because she was about to go a bit crazy, then jumped right into the crowd of girls fighting over the new doll.\n• An episode of King of the Hill when a tornado is about to come through. Mega Lo Mart shelves are emptied by customers and fighting over merchandise including a bundle pack of oil filters Hank is trying to buy (which he only need one).\n• An episode of Dexter's Laboratory revolved around Dexter's Mom fighting another mother over an item (washing gloves) on sale. Mom won.\n• One episode of the 1999 Woody Woodpecker series had him and Wally Walrus fighting over the last action figure in the store for their respective nephews (and niece, in Woody's case). They end up breaking it, but there's a new must have toy the kids want anyway.\n• South Park had an entire trilogy based on this. The first episode was simply called \"Black Friday\" and played out like a satire on how people go crazy trying to find the \"must-have\" gift of the Christmas shopping season and an homage to the Game Of Thrones books.\n• One episode of Darkwing Duck began with the titular hero in a wheelchair, apparently due to some sort of skiing accident. Launchpad then comments that he was lucky only his legs got broken- \"I told you things got rough at those ski shop sales!\"\n• The Fairly Oddparents When Timmy switches bodies with his mother due to a bet with Wanda, he has to do all the things his mother does every day. One of the tasks was to buy clothes, which he thought would be completely boring. Boy, was he wrong!\n• Les Sisters: The episode \u0093Sisters Soldes\u0094 had Marine, Wendy, Sandrine, Rachel and Rachel\u0092s mother, along with several other characters, go to a clothing store\u0092s annual sale with this trope in full effect: Rachel and Wendy get into a rough physical fight for a dress, the security guard gets trampled by crowds, etc. Marine uses the trope to her advantage by making a fake announcement about discount prices on the intercom so a huge crowd of people trample Rachel and her mom in an attempt to get the discount.\n• An Al Brodax Popeye cartoon had Olive at a department store involved in such a scene. She buys something, decides she doesn't want it, then gets Popeye to get a refund for which he has to cut red tape lengthwise. When one of the items Popeye is thrown turned out to be the only one left, the women clamoring for it are out for his head on a platter.\n• OK K.O.! Let's Be Heroes: In \"Super Black Friday\" Rad, Enid, and K.O. are subject to crowds of crazed holiday shoppers on Shucksgiving, with K.O. getting trampled underfoot, Enid having to fend off the horde with her scanning gun, and Rad getting mistaken for a Blorby by a little girl. Fortunately, Mr. Gar decides to make it up to his employees by coming by after the sale with Carol and some of her home-made pie.\n• As mentioned above, Black Friday is infamous for this in the USA.\n• Weirdly inverted for 2015's British Black Friday. The American-style Black Friday only played out in earnest for the first time in the previous year (with this trope ensuing) As a reaction: security was stricter, one major supermarket avoided Black Friday altogether, and hardly anyone actually bothered turning up to the sales. Some news outlets reported how unexpectedly empty and calm Black Friday was!", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/RetailRiot", "media_links": ["/pmwiki/pmwiki.php/Anime/EurekaSeven", "/pmwiki/pmwiki.php/Series/ItsAlwaysSunnyInPhiladelphia", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/LightNovel/BenTo", "/pmwiki/pmwiki.php/Anime/CrayonShinChan", "/pmwiki/pmwiki.php/Anime/EurekaSeven", "/pmwiki/pmwiki.php/Anime/HugttoPrettyCure", "/pmwiki/pmwiki.php/Anime/Pokemon", "/pmwiki/pmwiki.php/Anime/SailorMoon", "/pmwiki/pmwiki.php/ComicBook/GorskyAndButch", "/pmwiki/pmwiki.php/Film/JingleAllTheWay", "/pmwiki/pmwiki.php/Series/HannahMontana", "/pmwiki/pmwiki.php/Film/Krampus", "/pmwiki/pmwiki.php/Literature/LifeAsWeKnewIt", "/pmwiki/pmwiki.php/Series/Friends", "/pmwiki/pmwiki.php/Series/TheJackBennyShow", "/pmwiki/pmwiki.php/Series/LieToMe", "/pmwiki/pmwiki.php/Series/FullHouse", "/pmwiki/pmwiki.php/Series/MalcolmInTheMiddle", "/pmwiki/pmwiki.php/Series/TheGoldenGirls", "/pmwiki/pmwiki.php/Series/Bones", "/pmwiki/pmwiki.php/Series/HowIMetYourMother", "/pmwiki/pmwiki.php/Series/Superstore", "/pmwiki/pmwiki.php/Series/TheNanny", "/pmwiki/pmwiki.php/Series/PunkyBrewster", "/pmwiki/pmwiki.php/Toys/CabbagePatchKids", "/pmwiki/pmwiki.php/Series/SupermarketSweep", "/pmwiki/pmwiki.php/Creator/TeamStarkid", "/pmwiki/pmwiki.php/Theatre/BlackFriday", "/pmwiki/pmwiki.php/Webcomic/ExterminatusNow", "/pmwiki/pmwiki.php/Webcomic/PennyArcade", "/pmwiki/pmwiki.php/Webcomic/SluggyFreelance", "/pmwiki/pmwiki.php/Website/TheOnion", "/pmwiki/pmwiki.php/Website/NotAlwaysRight", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/WesternAnimation/KingOfTheHill", "/pmwiki/pmwiki.php/WesternAnimation/DextersLaboratory", "/pmwiki/pmwiki.php/WesternAnimation/WoodyWoodpecker", "/pmwiki/pmwiki.php/WesternAnimation/SouthPark", "/pmwiki/pmwiki.php/WesternAnimation/DarkwingDuck", "/pmwiki/pmwiki.php/WesternAnimation/TheFairlyOddparents", "/pmwiki/pmwiki.php/WesternAnimation/LesSisters", "/pmwiki/pmwiki.php/WesternAnimation/OKKOLetsBeHeroes"], "non_media_links": ["/pmwiki/pmwiki.php/WebVideo/DragonBallZAbridged", "/pmwiki/pmwiki.php/Main/PlayedForLaughs", "/pmwiki/pmwiki.php/Main/TruthInTelevision", "/pmwiki/pmwiki.php/Main/Anime", "/pmwiki/pmwiki.php/Main/MonsterOfTheWeek", "/pmwiki/pmwiki.php/Main/ComicBooks", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/TheMovie", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/TheEndOfTheWorldAsWeKnowIt", "/pmwiki/pmwiki.php/Main/LiveActionTelevision", "/pmwiki/pmwiki.php/Main/VictimOfTheWeek", "/pmwiki/pmwiki.php/Main/Bridezilla", "/pmwiki/pmwiki.php/Main/NewspaperComics", "https://garfield.com/comic/1985/09/15", "/pmwiki/pmwiki.php/ComicStrip/Garfield", "/pmwiki/pmwiki.php/ComicStrip/Retail", "/pmwiki/pmwiki.php/Main/Theatre", "/pmwiki/pmwiki.php/Main/HorrorComedy", "/pmwiki/pmwiki.php/Main/WebComics", "http://exterminatusnow.co.uk/2010-12-15/comic/the-b-team/on-the-other-side/", "http://www.penny-arcade.com/comic/2013/08/19", "http://www.sluggy.com/comics/archives/daily/971221", "/pmwiki/pmwiki.php/Main/WebOriginal", "/pmwiki/pmwiki.php/WebAnimation/HomestarRunner", "http://www.theonion.com/articles/42-million-dead-in-bloodiest-black-friday-weekend,30517/", "http://notalwaysright.com/coming-soon-to-not-always-right-a-zombie-apocalypse/16132", "/pmwiki/pmwiki.php/Main/ZombieApocalypse", "/pmwiki/pmwiki.php/Main/NoZombieCannibals", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/HereWeGoAgain", "/pmwiki/pmwiki.php/Main/Trilogy", "/pmwiki/pmwiki.php/ComicStrip/Popeye", "/pmwiki/pmwiki.php/Main/YouMeanXmas", "/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/UsefulNotes/ChristmasInAmerica"]}