{"title": "Paradiegetic Gameplay", "content": "Paradiegetic (noun): From Greek πέρα para- meaning \"Beyond\" and diegetic meaning \"The confines of the medium\".\n\nMost games you can beat without having to get up from your chair, provided you don't need to use the bathroom. Sometimes, though, a puzzle's solution involves something that isn't in the game itself, and beating it will require you to do something that isn't just pressing buttons on your keyboard or controller. Maybe it involves a phone number you have to call, or you need to fiddle with the date and time in Windows settings, or press the \"eject\" button on your CD drive. This is where this trope comes in.\n\nThese types of puzzles may lead to Guide Dang It! since most people often don't expect this sort of gameplay.\n\nSometimes these types of puzzles are done as a form of Copy Protection, having Feelies bundled with a physical copy of the game with an answer to a puzzle to prevent those who downloaded the game on the Internet to solve it and continue.\n\nExtrinsic Go-First Rule is a subtrope. See also Breaking the Fourth Wall and Logging onto the Fourth Wall, which is similar however is simply Played for Laughs or as an Easter Egg. Also see Unexpectedly Realistic Gameplay and Unexpected Gameplay Change. The Other Wiki calls it a pervasive game .\n• The Boktai cartridge had a special sensor on it that determined the amount of ambient light. In order to keep your vampire-killing weapons charged up with sunlight, you had to play in the sunlight sometimes but not all the time, as the designers didn't want players getting heatstroke.\n• Closing the Nintendo DS while playing the Duck Amuck Licensed Game would result in Daffy shouting at you about a monster. Opening it up would begin a minigame where you close the DS again and use the L and R buttons to help Daffy chase after the beast (who turns out to be Gossamer). Arbitrarily, you could only try this once per day; after that it would go into Sleep Mode as normal.\n• In Doki Doki Literature Club! you defeat Monika by deleting her character file. Monika is also doing this in-universe; she rewrites the game's script to make her romantic rivals seem undesirable or deletes them entirely if she considers them too much of a threat.\n• In Fez you have to use a smartphone with a QR code reader to solve certain puzzles.\n• Hotel Dusk: Room 215 had a puzzle you solved by closing and opening the DS.\n• One level in Karoshi 2 involves putting a music CD into your CD tray so that an in-game radio would push the crate towards you.\n• Kirbys Tilt And Tumble had Waggle before waggle was a thing. Instead of controlling Kirby with the gamepad, you had to physically tilt the console to get him to roll in the correct direction (powered by a sensor in the cartridge itself).\n• In the Famicom Disk System version of The Legend of Zelda, the Pols Voice enemy is killed by yelling in the microphone in the Famicom's second controller. Each Japanese rerelease changes it so Pols Voice can be killed with a different method, such as pressing Select 4 times in the GBA version, or pressing L and R to virtually \"switch\" to the second controller and yell into the 3DS's microphone in the 3DS version. In all English releases, including the NES version, the enemy is instead weak to arrows.\n• In The Legend of Zelda: Phantom Hourglass, at one point you're required to transfer a seal on the DS's top screen to its corresponding location on the map on your lower screen by closing your DS and reopening it.\n• The Nintendo DS version of Nine Hours, Nine Persons, Nine Doors has an upside-down Sudoku puzzle that requires you to turn your DS upside down. Throughout the game, the top screen represents Junpei's perspective and the bottom represents Akane, who is the actual protagonist. Turning the DS indicates that you are temporarily taking control of Junpei so that he can solve the puzzle.\n• Two of the bosses in Merry Gear Solid 2, The Milkman and The Postman , are beaten by, respectively, setting your computer clock forward by a week, and dragging a file from the game's directory into the game window.\n• Metal Gear:\n• The first Metal Gear Solid had you get a person's contact frequency from the back of the CD case.\n• Metal Gear Solid 2 had a boss who hijacked your controller input and thus could read your actions, so you had to move the controller to a different port.\n• In Metal Gear Solid 3: Snake Eater, you can \"kill\" The End by saving the game and then waiting for one real-life week (or, more commonly, fiddling with your system's date). When you load your game, The End will be dead from old age.\n• In the Monster Rancher PlayStation games, Monsters are created from \"saucer stones\". In-game, these are artifacts from which the monsters are generated in a lab; out of game, the player has to put a different CD or game disc into the PlayStation, which generates the monster's stats from its subcode data. Later games in the line add different input methods, like the DS microphone and touchscreen.\n• Pokémon Ruby and Sapphire: The infamous puzzle to get all three of the legendary golems has a lot of this. In addition to needing very specific pokemon, which have to be in specific places in your party, you need to be able to read braille in text form to follow the clues in each of the chambers.\n• Save the Date will always result in a bad ending unless you edit one of the game files to make yourself a \"hacker\" .\n• The MMORPG The Secret World is so loaded with these that they gave you a working in-game web browser. You may have to look up the ISBNs of fictional books, type a handwritten note in Romanian into Google Translate (unless you already speak it), look up the sheet music to a medieval song, or consult a specific Bible verse.\n• The solution to last level of the mobile puzzle game Shadowmatic required the player to scan a QR code that is the solution to the penultimate level, which led to a website that gave a hint.\n• At the end of Simon the Sorcerer 3D you find a computer where you are supposed to insert a CD. However, within the game you cannot interact with the computer to open its CD drive. The solution is to open this on your own physical computer.\n• One of the achievements in The Stanley Parable requires you to not play the game for five years. Another requires you to leave the game on all day on a Tuesday.\n• To obtain the secret code in StarTropics, you're supposed to make the invisible ink on one of the game's Feelies appear. Good luck if you rented the game or bought a used copy.\n• The final puzzle in System's Twilight is to reboot the system, which is solved by quitting the game, and then reopening it.\n• Takeshi's Challenge involves singing Japanese karaoke three times, in addition to a treasure-map puzzle where the player is either supposed to let the game sit out for at least five minutes (but no more than ten!) after soaking the map in water or leave the game sitting for an hour to let the map sit in the sun.\n• In the flash web game This Is the Only Level, several stages require going to the credits or refreshing the page in order to continue.\n• In Who Framed Roger Rabbit there's a 1-800 number that you're supposed to call. There's no telephone in the game though, and you're supposed to actually call the number using a landline or cell. The number, of course, now connects to something completely different.\n• The X-Men game for Sega Genesis requires you to perform a soft reset on the console before you can enter the final level.\n• The last Text Adventure in the Zork series, Zork Zero, consisted half of stock puzzles and half of this as a form of Copy Protection. The solution to puzzle after puzzle was simply to pull a specific bit of trivia out of the game's Feelies and type it in. This was especially disappointing since many of the tasks that seemed to be clever puzzles, like finally getting to play Double Fanucci, had their only solutions printed in the documentation.\n• To solve the last puzzle in Thimbleweed Park, the player is asked to go online and watch the kickstarter video for the game .\n• One of The Talos Principle's most obscure puzzles presents you with a non-interactive QR code that can only be read by scanning it with an external device, like a smartphone or the like. This gives you an ASCII code sequence that you need to run through an external converter in order to make sense of, and then you can finally attempt to solve the puzzle proper.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/ParadiegeticGameplay", "media_links": ["/pmwiki/pmwiki.php/VideoGame/Boktai", "/pmwiki/pmwiki.php/WesternAnimation/DuckAmuck", "/pmwiki/pmwiki.php/VisualNovel/DokiDokiLiteratureClub", "/pmwiki/pmwiki.php/VideoGame/Fez", "/pmwiki/pmwiki.php/VideoGame/HotelDuskRoom215", "/pmwiki/pmwiki.php/VideoGame/Karoshi", "/pmwiki/pmwiki.php/VideoGame/KirbysTiltAndTumble", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaI", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaPhantomHourglass", "/pmwiki/pmwiki.php/VisualNovel/NineHoursNinePersonsNineDoors", "/pmwiki/pmwiki.php/VideoGame/MetalGear", "/pmwiki/pmwiki.php/VideoGame/MetalGearSolid", "/pmwiki/pmwiki.php/VideoGame/MetalGearSolid2", "/pmwiki/pmwiki.php/VideoGame/MetalGearSolid3SnakeEater", "/pmwiki/pmwiki.php/VideoGame/MonsterRancher", "/pmwiki/pmwiki.php/VideoGame/PokemonRubyAndSapphire", "/pmwiki/pmwiki.php/VideoGame/SaveTheDate", "/pmwiki/pmwiki.php/VideoGame/TheSecretWorld", "/pmwiki/pmwiki.php/VideoGame/SimonTheSorcerer", "/pmwiki/pmwiki.php/VideoGame/TheStanleyParable", "/pmwiki/pmwiki.php/VideoGame/StarTropics", "/pmwiki/pmwiki.php/VideoGame/SystemsTwilight", "/pmwiki/pmwiki.php/VideoGame/TakeshisChallenge", "/pmwiki/pmwiki.php/VideoGame/ThisIsTheOnlyLevel", "/pmwiki/pmwiki.php/VideoGame/WhoFramedRogerRabbit", "/pmwiki/pmwiki.php/VideoGame/XMen1993", "/pmwiki/pmwiki.php/VideoGame/Zork", "/pmwiki/pmwiki.php/VideoGame/ZorkZero", "/pmwiki/pmwiki.php/VideoGame/TheTalosPrinciple"], "non_media_links": ["/pmwiki/pmwiki.php/Main/GuideDangIt", "/pmwiki/pmwiki.php/Main/CopyProtection", "/pmwiki/pmwiki.php/Main/Feelies", "/pmwiki/pmwiki.php/Main/ExtrinsicGoFirstRule", "/pmwiki/pmwiki.php/Main/BreakingTheFourthWall", "/pmwiki/pmwiki.php/Main/LoggingOntoTheFourthWall", "/pmwiki/pmwiki.php/Main/PlayedForLaughs", "/pmwiki/pmwiki.php/Main/EasterEgg", "/pmwiki/pmwiki.php/Main/UnexpectedlyRealisticGameplay", "/pmwiki/pmwiki.php/Main/UnexpectedGameplayChange", "/pmwiki/pmwiki.php/Wiki/TheOtherWiki", "https://en.wikipedia.org/wiki/Pervasive_game", "/pmwiki/pmwiki.php/UsefulNotes/NintendoDS", "/pmwiki/pmwiki.php/Main/LicensedGame", "/pmwiki/pmwiki.php/Main/Minigame", "/pmwiki/pmwiki.php/Main/Waggle", "/pmwiki/pmwiki.php/UsefulNotes/NintendoDS", "/pmwiki/pmwiki.php/Videogame/MerryGearSolid", "/pmwiki/pmwiki.php/Main/Mon", "/pmwiki/pmwiki.php/UsefulNotes/NintendoDS", "/pmwiki/pmwiki.php/Main/BilingualBonus", "/pmwiki/pmwiki.php/Main/Feelies", "/pmwiki/pmwiki.php/Main/UnwinnableByMistake", "/pmwiki/pmwiki.php/Main/TextAdventure", "/pmwiki/pmwiki.php/Main/StockPuzzle", "/pmwiki/pmwiki.php/Main/CopyProtection", "/pmwiki/pmwiki.php/Main/Feelies", "/pmwiki/pmwiki.php/Videogame/ThimbleweedPark"]}