{"title": "Tiger by the Tail", "content": "Everyone became aware of a rattling noise. Nobby was spinning the morningstar round and round on the end of its chain, except that because the spiky ball was a very heavy spiky ball, and because the difference between Nobby and a dwarf was species rather than height, it was more a case of both of them orbiting around each other. If he let go, it was an even chance that the target would be hit by a spiky ball or an unexploded Corporal Nobbs. Neither prospect pleased.\n\nA character (possibly with the best of intentions) has started or gotten involved in something which has become dangerous or taken an evil turn, but which they cannot just stop doing or walk away from without facing terrible consequences. This can be a case of either Gone Horribly Wrong or Gone Horribly Right depending on the circumstances. The idiom comes from the idea that if you catch a tiger by the tail, you can never let go unless you want to be eaten. Also known as \"riding a tiger\" from the Chinese idiom \"riding a tiger and unable to get off.\"\n\nPerhaps the character started a protest movement that has become violently fanatical, and would execute them as a traitor if they tried to mitigate its behavior. Maybe they stumbled into a MacGuffin and the government is now after them until they Clear Their Name, or they jumped into the pilot seat of a Humongous Mecha to repel the alien invasion, only to find It Won't Turn Off, and has Crush. Kill. Destroy! tendencies it would love to try out on them if they ever try to disembark.\n\nUnlike with I've Come Too Far and Sunk Cost Fallacy, it's not a matter of the character not wanting their efforts or expenses to go to waste. It's that they will die or otherwise suffer terribly if they don't carry on. If a good guy gets into this situation (and the work isn't cynical,) there will usually turn out to be a third option, or outside intervention to help him.\n\nSee also Godzilla Threshold, which can involve knowingly getting into this; and \"Fawlty Towers\" Plot and Crime After Crime, which can be this depending on the circumstances (although the former is usually more lighthearted in the stakes.) This can sometimes be a Morton's Fork if disaster from stopping or carrying on seems equally inevitable.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/TigerByTheTail", "media_links": ["/pmwiki/pmwiki.php/Disney/TheJungleBook", "/pmwiki/pmwiki.php/Creator/TerryPratchett", "/pmwiki/pmwiki.php/ComicBook/TheLeagueOfExtraordinaryGentlemen", "/pmwiki/pmwiki.php/Disney/TheJungleBook", "/pmwiki/pmwiki.php/Film/TheGuilty", "/pmwiki/pmwiki.php/Literature/Discworld", "/pmwiki/pmwiki.php/Literature/ASongOfIceAndFire", "/pmwiki/pmwiki.php/Series/ThePeopleVOJSimpson", "/pmwiki/pmwiki.php/Series/TheWalkingDead", "/pmwiki/pmwiki.php/TabletopGame/Ravenloft", "/pmwiki/pmwiki.php/VideoGame/BioShockInfinite", "/pmwiki/pmwiki.php/Franchise/TheElderScrolls", "/pmwiki/pmwiki.php/Literature/TheElderScrollsInUniverseBooks", "/pmwiki/pmwiki.php/VideoGame/DragonAgeInquisition"], "non_media_links": ["/pmwiki/pmwiki.php/Main/VisualPun", "/pmwiki/pmwiki.php/Discworld/MenAtArms", "/pmwiki/pmwiki.php/Main/GoneHorriblyWrong", "/pmwiki/pmwiki.php/Main/GoneHorriblyRight", "/pmwiki/pmwiki.php/Main/StumbledIntoThePlot", "/pmwiki/pmwiki.php/Main/MacGuffin", "/pmwiki/pmwiki.php/Main/ClearTheirName", "/pmwiki/pmwiki.php/Main/HumongousMecha", "/pmwiki/pmwiki.php/Main/ItWontTurnOff", "/pmwiki/pmwiki.php/Main/CrushKillDestroy", "/pmwiki/pmwiki.php/Main/IveComeTooFar", "/pmwiki/pmwiki.php/Main/SunkCostFallacy", "/pmwiki/pmwiki.php/Main/TakeAThirdOption", "/pmwiki/pmwiki.php/Main/GodzillaThreshold", "/pmwiki/pmwiki.php/Main/FawltyTowersPlot", "/pmwiki/pmwiki.php/Main/CrimeAfterCrime", "/pmwiki/pmwiki.php/Main/MortonsFork", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Discworld/GuardsGuards", "/pmwiki/pmwiki.php/Discworld/MenAtArms", "/pmwiki/pmwiki.php/Main/EpicFlail", "/pmwiki/pmwiki.php/Main/TheFairFolk", "https://elderscrolls.fandom.com/wiki/Sacred_Witness", "/pmwiki/pmwiki.php/Main/MurderInc", "/pmwiki/pmwiki.php/Main/CallingCard", "/pmwiki/pmwiki.php/Videogame/Brink", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/ColdEquation"]}