{"title": "No Flow Portal", "content": "Portals are sometimes helpful. Sometimes they're unreliable, or dangerous. Sometimes, though, they're just weirdly selective.\n\nNo Flow Portal is a strange effect where a portal immersed in whatever medium — a liquid, like a body of water, or a different kind of atmosphere — or exposed to conditions which would otherwise affect the other side of the portal, for some reason doesn't let it through even when the portal is working. The Hero can swim into the portal on one side and walk out of it the other side, yet the body of water he swam in remains as stolidly fixed as if it were up against glass. The hero could even cause an explosion next to a portal, and the people on the other side won't even feel a breeze.\n\nThis trope isn't restricted to water, though water is one of the easiest ways to show it in action in fiction. Different atmospheric conditions can be strangely shy about crossing the portal barrier. This is obvious enough with two completely different atmospheres, but for a few more observant viewers, this trope may manifest itself in a case where the atmospheres are the same but one is blowing across or even into the portal on one side and having no effect on the other side. What you'd expect to happen in the former is that the air would get sucked through the portal as the wind creates an area of lower pressure in the other world. Even sand may fall victim to this trope - Sand Is Water, for a given definition of 'water' - though in this case the portal is more likely to be just partly submerged in the sand rather than completely smothered by it.\n\nThe opposite of this trope, naturally, would be where the conditions do affect things on the other side of the portal. A portal which lead straight to a Lethal Lava Land, for instance, would be pretty toasty on the other side if Convection Schmonvection was done away with. If combined with Time Travel, this trope's aversion is usually closely allied with San Dimas Time.\n\nSometimes, an inexplicably fierce whirlwind sucks in everything on one side of the portal. This is quite common in fantasy works where the portal in question leads to somewhere nefarious and supernatural, though it'll always be less about thermal currents and fluid dynamics and more about looking impressive - how else to make a portal look foreboding and scary?\n\nFor those of us who like to dwell on this sort of thing, it often leads to a Fridge Logic moment when you wonder why biological matter (which itself contains a lot of fluids, including water) can pass through but a body of water can't. MS T3k Mantra is usually enough to dismiss it.\n\nMay be justified by A Wizard Did It. Not to be confused with Portal Pool, which is where a body of water is the portal.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/NoFlowPortal", "media_links": ["/pmwiki/pmwiki.php/Film/PacificRim", "/pmwiki/pmwiki.php/LightNovel/GoblinSlayer", "/pmwiki/pmwiki.php/Creator/DavidWeber", "/pmwiki/pmwiki.php/Literature/HellsGate", "/pmwiki/pmwiki.php/Literature/Spin", "/pmwiki/pmwiki.php/Literature/SwordOfTruth", "/pmwiki/pmwiki.php/Creator/PhilipJoseFarmer", "/pmwiki/pmwiki.php/Literature/WorldOfTiers", "/pmwiki/pmwiki.php/Series/Angel", "/pmwiki/pmwiki.php/Series/Primeval", "/pmwiki/pmwiki.php/Series/StargateSG1", "/pmwiki/pmwiki.php/Series/StargateAtlantis", "/pmwiki/pmwiki.php/TabletopGame/DungeonsAndDragons", "/pmwiki/pmwiki.php/TabletopGame/ForgottenRealms", "/pmwiki/pmwiki.php/TabletopGame/EclipsePhase", "/pmwiki/pmwiki.php/VideoGame/Portal2", "/pmwiki/pmwiki.php/VideoGame/Spyro2RiptosRage", "/pmwiki/pmwiki.php/VideoGame/SpyroYearOfTheDragon", "/pmwiki/pmwiki.php/Webcomic/AwkwardZombie", "/pmwiki/pmwiki.php/Webcomic/Concerned", "/pmwiki/pmwiki.php/WesternAnimation/GeneratorRex", "/pmwiki/pmwiki.php/WesternAnimation/RickAndMorty", "/pmwiki/pmwiki.php/WesternAnimation/TransformersPrime"], "non_media_links": ["/pmwiki/pmwiki.php/Main/PortalSlam", "/pmwiki/pmwiki.php/Main/TeleFrag", "/pmwiki/pmwiki.php/Main/ArtisticLicensePhysics", "/pmwiki/pmwiki.php/Main/TheHero", "/pmwiki/pmwiki.php/Main/ViewersAreGeniuses", "/pmwiki/pmwiki.php/Main/SandIsWater", "/pmwiki/pmwiki.php/Main/LethalLavaLand", "/pmwiki/pmwiki.php/Main/ConvectionSchmonvection", "/pmwiki/pmwiki.php/Main/TimeTravel", "/pmwiki/pmwiki.php/Main/SanDimasTime", "/pmwiki/pmwiki.php/Main/RuleOfPerception", "/pmwiki/pmwiki.php/Main/FridgeLogic", "/pmwiki/pmwiki.php/Main/MST3kMantra", "/pmwiki/pmwiki.php/Main/AWizardDidIt", "/pmwiki/pmwiki.php/Main/PortalPool", "/pmwiki/pmwiki.php/Fanfic/DungeonKeeperAmi", "/pmwiki/pmwiki.php/Main/JustifiedTrope", "/pmwiki/pmwiki.php/Main/ZigZaggingTrope", "/pmwiki/pmwiki.php/Main/HiveMind", "/pmwiki/pmwiki.php/Main/Averted", "/pmwiki/pmwiki.php/Main/Averted", "/pmwiki/pmwiki.php/Main/FeatheredFiend", "/pmwiki/pmwiki.php/Main/InvokedTrope", "/pmwiki/pmwiki.php/Main/AWizardDidIt", "/pmwiki/pmwiki.php/Main/PortalNetwork", "/pmwiki/pmwiki.php/Main/SufficientlyAdvancedTechnology", "/pmwiki/pmwiki.php/Videogame/CrashBandicoot3Warped", "/pmwiki/pmwiki.php/Main/WarpZone", "/pmwiki/pmwiki.php/Main/GrimyWater", "/pmwiki/pmwiki.php/Main/GhibliHills", "/pmwiki/pmwiki.php/Main/SlippySlideyIceWorld", "/pmwiki/pmwiki.php/Main/AvertedTrope", "http://www.awkwardzombie.com/index.php?page=0&comic=091310", "/pmwiki/pmwiki.php/Main/MarsNeedsWater", "/pmwiki/pmwiki.php/Main/InvokedTrope"]}