{"title": "Grenade Spam", "content": "In most shooting games; whether they be first person, third person or otherwise, grenades would be one of the weapons available for use. Now, grenades are designed to hurt and kill, and prove to be very effective methods against the enemy. As one of the characters in the Australian TV series Fire put it, lobbing a grenade is the best and quickest way to split up a platoon.\n\nNow not every game that has grenades would see the enemy use them, though many of them do. They are usually a One-Hit Kill for the player, and most games that use them would also remember that the AI also has guns, and make use of them accordingly.\n\nHowever that is not this trope. Grenade Spam is when more grenades are used than a soldier can conceivably carry, to the point that there are more grenades than bullets used. This can sometimes result in incredible frustration in multiplayer and single player alike, as it is seen as a cheap tactic, especially when the computer infinitely spawns grenades out of thin air.\n\nSee also Throw Down the Bomblet if spamming grenades is an individual's Weapon of Choice.\n• Battlefield 2 was infamous for grenade spam - especially on Strike At Karkand. Players would spawn with 4 grenades which they could chuck one after another, then refill instantly from an ammo pack on the ground, which lead to entire squads of players standing on opposite sides of a fence throwing as many grenades onto the other side as they could. Some later games took measures to avoid this, such as giving a more significant cooldown on ammo packs to stop grenade refreshing, or reducing the amount of grenades carried - Battlefield 3 limits players to two grenades on-hand as a maximum from a specialization, it's otherwise just one.\n• However, the Battlefield 3 map Operation Metro is known for its choke point in the middle of the map. This leads many players to simply find a (relatively) safe place near an ammo box and lob grenades - more often than not with a grenade launcher. It's also hilarious.\n• The Call of Duty games are notorious for this. Beginning with the first Modern Warfare game grenades would be spawned onto the map at a not even remotely fair rate, causing a frequent nicknaming of the game Grenade of Grenade 4: Grenade Grenade , or Grenade of Grenade 4: More Grenades. It got so bad that advertising for the sequel included a Public Service Announcement about grenade spam. This PSA purported to be funded by the fictional organisation Fight Against Grenade Spam. This use of a homophobic slur (seemingly a deliberate nod to the term's widespread usage in the games' multiplayer matches) garnered some controversy, and the ad was eventually pulled . Naturally, Battlefield: Bad Company took the mickey out of the PSA.\n• The trope is not so bad in games outside the Modern Warfare series or in multiplayer, but it can feel like there's a helicopter with an infinite grenade launcher constantly targeting you. The PC version had it even worse, as you could have fifty players per server (compared to just 18 in the console versions), leading to horrible yet amazing things like this .\n• Among the series, World at War is notorious for being the grenade spammiest game . It's not uncommon to have a minimum of three grenades around you at a given moment. Oh, and injured enemies close to dying will often pull out a grenade when you get close, just for good measure. There is even a late level of the American campaign where a Japanese soldier crouching over the ledge of a castle with a box nearby overlooking the direction of your advance will literally stay there and keep tossing grenades toward you until you get close enough for him to abandon the tactic and shoot at you with his rifle. Fortunately, there are two possible paths for you to advance toward him, because you'll be running from one of those paths very frequently.\n• Critical Miss parodies this in Call of Duty: Black Ops multiplayer with \"The Stoning of Saint Bluntninja \".\n• Fallout: New Vegas has dynamite spam when the player is at an extremely low level. The Powder Gangers, likely the first human enemies a player will encounter, are armed with about 3 sticks of good ol' TNT apiece... and will throw them en masse. Now, while dynamite is actually the weakest of the game's explosive weapons, it's still plenty strong enough to cripple and severely damage a low-level player. If you abuse V.A.T.S. (or are just an extremely good shot), you can shoot the dynamite in their hands or hanging from their belt and cause the explosion to kill them, but you void the experience for killing them normally if you do so.\n• Note that if you have enough skillpoints to Explosives, it's possible to equip a group of friendly NPCs with dynamite to use against the Powder Gangers in an early quest. Careful how close you get to the bad guys when your friends start tossing.\n• Not to mention the existence of a Grenade Machinegun. Take on the Boomers with one if you need to see your screen filled with as many explosions as possible.\n• While the weakest explosive, dynamite is still tremendously useful, even on late game. With good stealth, you can drop it in the enemy's pocket (reverse pickpocketing them) and it should kill the enemy without fail. Dynamite is preferable for this purpose since while any explosive will kill in 1 hit if you do this, dynamite is the cheapest explosive you can get and it also has smaller blast radius than a grenade or mine, so you are less likely to get caught in the explosion while trying to do this.\n• In Fallout 4, Raiders, Gunners, and Super Mutants have developed a bad habit of endlessly spamming Molotov Cocktails as well as grenades, both of which can One-Hit Kill on Survival difficulty, with incredible accuracy.\n• Halo:\n• The Catch Skull makes every enemy start throwing a ton of grenades at you.\n• Halo: Combat Evolved Anniversary offers a rare opportunity for the player character, with an infinite ammo skull. There is also another skull that gives those explosions a much bigger blast radius. Caution is advised.\n• The original version of Combat Evolved for the original Xbox also had an option for turning on unlimited grenades in multiplayer (but only when played Split Screen on a single console for processing and network communication reasons). The description on the setting screen noted that it tends to lead to chaotic and messy matches.\n• Being a passenger on a Gungoose in Halo 5: Guardians grants them an infinite reservoir of frag grenades. This can be combined with the Grenadier perk in Warzone games for devastating explosive effect, especially in and around confined objective areas.\n• Hedgewars: The Ball Launcher was made for this. A continuous barrage of 50 timed, colorful grenades that don't stop coming until the first one explodes, bouncing all over the map. Good planning will let you kill anything, but anything less than that will wreck both teams.\n• Mass Effect 3 has grenades used to a ludicrous degree on multiplayer gold maps. This with the high level of Nintendo Hard enemies makes playing an exercise in pleasure and pain. The single-player enemies' usage of grenades can seem pretty spammy as well, especially on higher difficulties.\n• This is even worse with the introduction of Geth Bombers. A typical attack results in about 6 bombs being dispensed in a small area. In later waves, when more than one spawn, you could be busy trying to not be killed by a prime, only to suddenly have dozens of grenades at your feet with nowhere to run.\n• A non-multiplayer version: the console versions of the Metal Slug games give you back all your grenades when you die, so a good tactic against bosses is to throw all your grenades at them, die, throw all your grenades, etc. (since they do a lot more damage than whatever weapon you have equipped).\n• Junkrat from Overwatch is built around this. His main weapon is the Frag Launcher, which fires 5 grenades at a medium rate of fire before having to reload. Unlike most grenade launchers, the Frag Launcher's grenades only explode when they directly hit an enemy rather exploding on any impact, meaning choke points guarded by Junkrat have a lot of grenades going around. For even more grenades, a custom game with 12 Junkrats can be played.\n• The SuperDragon from Perfect Dark is really bad for this, being a repeating grenade launcher with a large magazine and a fast reload. In addition, enemies tend to drop five rounds when they die, meaning you end up with more grenades than you can plausibly use in a single level.\n• Quake:\n• Ogres do this on Nightmare difficulty in the first game.\n• Ditto for Gunners in Quake II, with their four-shot-burst grenade launchers. It gets worse in certain source ports that improve their AI so they account for vertical angle when firing, dramatically increasing their accuracy and range. In Quake IV he got a much needed nerf, and can only launch one (though more powerful) grenade after a conspicuously long and noisy wind-up.\n• The player isn't excluded from the list, on the other hand. The grenade launcher in Quake fires more than one grenade per second and features Bottomless Magazines, while the one in Quake IV has a very similar rate of fire, a generous magazine capacity of 8 grenades, and a very quick reload interval. In Quake II, it's a less powerful tactic, as the launcher needs two whole seconds to reload every individual grenade, and launching them by hand has a surprisingly long warmup animation and is even slower to throw multiple ones. It's still very much feasible if you have the height advantage, though.\n• Resident Evil 5 is a borderline case when grenades come into play. For a game that only has a few enemies that shoot, the grenade exclusive mercenaries that make constant use of them become a little jarring on Professional Mode.\n• Luchadore specialists in Saints Row: The Third carry grenade launchers, which shoot out about twenty at a time. Even though these grenades aren't that powerful, being near them when they detonate causes the player character to stagger about for a moment.\n• Soldier of Fortune II already was \"Grenade of Grenade\" half a decade before Modern Warfare rolled by. Mooks do this liberally starting with the Colombia mission. The All-Seeing A.I., on top of some other cheats, allows terrorists to know exactly where you are and the perfect arc to toss a nade so it lands on your feet and one hit kills you dead. One reviewer even joked that by the end of the game, the player would know the word for \"grenade\" in several different languages, and he's not wrong. To boot, two things worsen things: there's no Grenade Hot Potato on the player's part (the mooks can Catch and Return, but not you), and you can't return the spamming favor, since Mullins for some reason has the most sluggish animations possible to equip a grenade, pull the pin, and throw it, taking more than two seconds per toss.\n• An unusually intentional and controlled example occurs in Splatoon, which has amongst its varied ink weaponry explosive sub weapons like ink grenades and ink bombs (as in, water bombs filled with ink). While the use of these weapons is usually limited by using up a big chunk of the Inkling's ink supply when thrown, the Special Weapon called Bomb Rush (replaced in Splatoon 2 by the nearly-identical Bomb Launcher) grants unlimited use of these weapons for a limited time. As the game puts it: \"Bombs away!\"\n• Star Wars: Battlefront has mooks that are infamous for their reliance on grenade spam. The Vanguard and Soldier classes take it to an almost-trollish level, chucking grenades left and right 'till the character finally eats it. Hilariously, they aren't necessarily good at it; it's not uncommon for AI mooks to grenade themselves.\n• Perhaps the map most well known for this is Jabba's Palace. On the lower levels, there is a corridor between the sewers and the Palace proper that was usually impassable due to grenade spam. This is because the corridor was between two control points, and thus, between two Gonk droids that continually refilled ammo within a radius, including grenades, which the AI just loved to throw into the corridor. In summary, a narrow corridor between two infinite reserves of grenades between two groups of AI that only threw grenades instead of shooting.\n• The Tantive IV is also pretty bad when it comes to grenade spam since the entire map is made of narrow corridors. You can easily kill an average of three people per grenade on this map, and if you're lucky, not all of them will be allies. Now multiply that by several dozen bots all throwing grenades at the same time for results that are both frustrating and hilarious. Ironically, this also makes the mission where you re-enact the raid at the beginning of A New Hope much harder than it was in the movie since the Imperial troops will inevitably get pelted by grenades as soon as the door is breached.\n• Grenade spam is also the go-to strategy for most bots when it comes to dealing with vehicles. Drive a tank into the middle of an enemy held command post, and you'll quickly get over a dozen grenades thrown in your general direction.\n• This is mostly avoided in Star Wars Battlefront (2015) since most grenades are relatively rare pick-ups or equipment with cool-down time, but an exception is made for the Hero Bossk. One of Bossk's abilties allows him to make his Targeting Rifle fire an unlimited amount of grenades for several seconds. Bossk somehow manages to lug around this wave of grenades while still being one of the fastest characters in the game.\n• Any mook armed with hand grenades or a grenade launcher in the Syphon Filter series, including the Final Boss of the first game, will do this. Being anywhere in the blast radius is an One-Hit Kill.\n• Team Fortress Classic had problems with this due to every class being given grenades and the incentive to spam them whenever death seemed inevitable. Grenades were restricted to one class (and then only from a Grenade Launcher) in Team Fortress 2 to prevent this. Some would say it failed, or even further encouraged it until the single class it was given to had been further nerfed.\n• Still, a common strategy for Demomen is to use their Stickybomb Launcher, which has excellent damage and splash range for spam. While holding down the detonate button, mashing the launch button will spam stickybombs and make them detonate once they are primed, at a rate of 1 stickybomb per 0.8 seconds, for a total of 8 stickybombs before requiring a reload.\n• Of course, as every spammable weapon the game has, Mann Vs Machine takes it to new, insane levels. Human demomen can increase their clip size and fire rate, meaning they can deploy more grenades more quickly before they have to reload. Then there's a group of giant Demobots that can fire a huge slew of grenades in quick sucession, and they tend to come in groups. The end result usually sounds like *popopopopopopopop-BOOMBOOMBOOM*\n• A certain breed of Elite Mooks in TRON: Evolution will repeatedly throw out groups of grenades that make getting close impossible without taking too much damage. Since most of your attacks are ranged this isn't as bad as it sounds, but it's still annoying.\n• The True Lies video game for the Super Nintendo was as bad, or even worse, than Call of Duty. You begin to notice this on the second level in a mall, where there are scores of civilians you cannot shoot. The Crimson Jihad have no such issues however and will happily gun down and bomb everything in sight. Common enemies can throw a grenade a second, and drop one when they die. Advanced enemies are suicide bombers, use grenade launchers and mines, adding to the fun.\n• In the Co-op mode of Uncharted 3: Drake's Deception some enemy bosses have a perk that allows them to lob about ten grenades with a single throw, or have a cluster grenade perk. Oh... And they are CPU enemies and thus have unlimited ammo.\n• In the original Mercenaries there are a few grenade machine gun emplacements (see Real Life below) scattered around Korea that the player can use. If one clears the game by capturing all 52 High Value Targets rather than killing them, it unlocks a \"Cheaters Weapon Set\" for New Game+ that includes a portable version for all your Stuff Blowing Up needs.\n• XCOM: Enemy Unknown:\n• For players, the game mostly averts this trope, with a rather restrictive limit of one grenade for most soldiers per mission, and a non-modified maximum of three depending on upgrades (\"Tactical Rigging\" in particular lets soldiers carry two grenades, even on Rookies and XCOM Base Security). Players love to boast about liberally using each and every one of these grenades to flush enemies out of cover and secure kills that may be missed from shots, however, invoking this feeling with squads of six soldiers even as grenades quickly run dry until the next mission.\n• The EXALT Operatives and Heavies all carry a frag grenade, or an alien grenade in case of Elites. If you've hacked one of their relays, which disables their primary weapons, they'll throw them in droves unless they're in a bad spot and feel it's better to fall back to reload.\n• \"Deep Pockets\" gives Supports an extra inventory slot in the core game, so they can carry a grenade alongside their usual Medikit. The Heavy's \"Grenadier\" ability gives a grenade in the loadout two \"charges\" and increases their damage by 1, so alien grenades hurt just like regular rockets. Enemy Within changes things a bit with the \"Tactical Rigging\" Foundry upgrade giving the Deep Pockets effect to all units that can carry items (i.e. not MEC Troopers and S.H.I.V.s), so a Heavy with Grenadier can carry four rocket-like alien grenades that unlike rockets, don't take two action points to use (so they can be lobbed after moving or, if the Heavy has Bullet Swarm, firing) and have no \"10%\" chance to miss. It gets even more ridiculous if the \"Training Roulette\" Second Wave option is enabled and a soldier (of any class) gets both Deep Pockets and Grenadier \u0096 how does six enhanced bomblets sound to you?\n• In Metal Gear Solid 2: Sons of Liberty, the otherwise useless RGB6 owes its one-time usefulness during the battle with Vamp to this. When Vamp dives into the water you can pound a bunch of grenade rounds into it which will, whether they hit him or not, deplete his oxygen meter and force him to the surface as a gasping stunned free target (and if they do hit him, they empty about an eighth of his health). Because you will never use this weapon before or ever again after this battle, you'll have a full supply of grenades which you can spam with reckless abandon.\n• Hayato Gokudera from Katekyō Hitman Reborn! loves this trope. His arsenal is filled of dynamites.\n• In Die Hard 2, Captain Stuart and his men have John trapped in the plane that was used to transport the general they were to rescue. They toss about twenty grenades into the cockpit to blow it up, forcing McClane to scramble for the ejector seat.\n• In a multiplayer online shooter shown in an episode of CSI, a player opposing the epileptic Body of the Week started spamming flashbangs to try and give him a seizure.\n• In an episode of Strike Back the team is pursuing a courier who has a satchel of grenades with him. He keeps tossing them behind him which causes the team members chasing him to constantly dive behind cover. It is a very effective tactic and he gets away.\n• Strike Legion allows players to take an automatic underbarrel Grenade Launcher on some weapons. This can fire any kind of grenade available to Legionaires, up to and including singularity grenades.\n• Grenade machine guns, which are Exactly What It Says on the Tin.\n• Milder forms of this trope are used for infantry tactics in assaulting enemy positions, pioneered in World War I and still utilized to this day - the same reason video gamers hate being a victim of it makes it a very desirable thing to be be the one using in real life, since soldiers of course prefer winning their battles as easily as possible. However, soldiers will need to coordinate their grenade reserves for such a tactic, and grenade saturation in infantry tactics tend to be more based around ensuring the enemy is Pinned Down for allies to flank and close in to enemy positions (then probably using a grenade upon the enemy position with actually expected lethal intent) rather than just lobbing grenades at the enemy repeatedly in hopes of killing the enemy if you throw enough of them in their direction, as throwing grenades accurately with any sort of distance is not the easiest task for everyone.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/GrenadeSpam", "media_links": ["/pmwiki/pmwiki.php/VideoGame/CallOfDuty", "/pmwiki/pmwiki.php/VideoGame/ModernWarfare", "/pmwiki/pmwiki.php/VideoGame/BattlefieldBadCompany", "/pmwiki/pmwiki.php/Webcomic/CriticalMiss", "/pmwiki/pmwiki.php/VideoGame/CallOfDutyBlackOps", "/pmwiki/pmwiki.php/VideoGame/FalloutNewVegas", "/pmwiki/pmwiki.php/VideoGame/Fallout4", "/pmwiki/pmwiki.php/Franchise/Halo", "/pmwiki/pmwiki.php/VideoGame/HaloCombatEvolved", "/pmwiki/pmwiki.php/VideoGame/Halo5Guardians", "/pmwiki/pmwiki.php/VideoGame/Hedgewars", "/pmwiki/pmwiki.php/VideoGame/MassEffect3", "/pmwiki/pmwiki.php/VideoGame/MetalSlug", "/pmwiki/pmwiki.php/VideoGame/Overwatch", "/pmwiki/pmwiki.php/VideoGame/PerfectDark", "/pmwiki/pmwiki.php/VideoGame/Quake", "/pmwiki/pmwiki.php/VideoGame/QuakeI", "/pmwiki/pmwiki.php/VideoGame/QuakeII", "/pmwiki/pmwiki.php/VideoGame/QuakeIV", "/pmwiki/pmwiki.php/VideoGame/QuakeI", "/pmwiki/pmwiki.php/VideoGame/QuakeIV", "/pmwiki/pmwiki.php/VideoGame/QuakeII", "/pmwiki/pmwiki.php/VideoGame/ResidentEvil5", "/pmwiki/pmwiki.php/VideoGame/SaintsRowTheThird", "/pmwiki/pmwiki.php/VideoGame/SoldierOfFortune", "/pmwiki/pmwiki.php/VideoGame/Splatoon", "/pmwiki/pmwiki.php/VideoGame/Splatoon2", "/pmwiki/pmwiki.php/VideoGame/StarWarsBattlefront", "/pmwiki/pmwiki.php/Film/ANewHope", "/pmwiki/pmwiki.php/VideoGame/StarWarsBattlefront2015", "/pmwiki/pmwiki.php/VideoGame/SyphonFilter", "/pmwiki/pmwiki.php/VideoGame/TeamFortressClassic", "/pmwiki/pmwiki.php/VideoGame/TeamFortress2", "/pmwiki/pmwiki.php/VideoGame/TronEvolution", "/pmwiki/pmwiki.php/Film/TrueLies", "/pmwiki/pmwiki.php/VideoGame/Uncharted3DrakesDeception", "/pmwiki/pmwiki.php/VideoGame/Mercenaries", "/pmwiki/pmwiki.php/VideoGame/XCOMEnemyUnknown", "/pmwiki/pmwiki.php/VideoGame/MetalGearSolid2SonsOfLiberty", "/pmwiki/pmwiki.php/Manga/KatekyoHitmanReborn", "/pmwiki/pmwiki.php/Film/DieHard2", "/pmwiki/pmwiki.php/Series/CSI", "/pmwiki/pmwiki.php/Series/StrikeBack", "/pmwiki/pmwiki.php/TabletopGame/StrikeLegion"], "non_media_links": ["/pmwiki/pmwiki.php/Main/OneHitKill", "/pmwiki/pmwiki.php/Main/ThisIsNotThatTrope", "/pmwiki/pmwiki.php/Main/HyperspaceArsenal", "/pmwiki/pmwiki.php/Main/ThrowDownTheBomblet", "/pmwiki/pmwiki.php/Main/WeaponOfChoice", "/pmwiki/pmwiki.php/Videogame/Battlefield", "/pmwiki/pmwiki.php/Main/AbridgedArenaArray", "/pmwiki/pmwiki.php/Videogame/Battlefield3", "http://media.gamerevolution.com/images/misc/modern-warfare-grenade-spam.jpg", "https://www.youtube.com/watch?v=Td352xP-NZ8", "/pmwiki/pmwiki.php/Main/PublicServiceAnnouncement", "/pmwiki/pmwiki.php/Main/FunWithAcronyms", "http://www.joystiq.com/2009/11/01/infinity-ward-pulls-fight-against-grenade-spam-ad-in-light-of/", "https://www.youtube.com/watch?v=K2Qpui1hYBw", "/pmwiki/pmwiki.php/Main/ParanoiaFuel", "https://www.youtube.com/watch?v=DK4WXnfOiLU", "http://retoucher07030.deviantart.com/art/Call-Of-Duty-Grenade-Wallpaper-104423279", "/pmwiki/pmwiki.php/Main/TakingYouWithMe", "http://www.escapistmagazine.com/articles/view/comics/critical-miss/8417-Lapidation-Pro", "/pmwiki/pmwiki.php/Main/MoreDakka", "/pmwiki/pmwiki.php/Main/MolotovCocktail", "/pmwiki/pmwiki.php/Main/OneHitKill", "/pmwiki/pmwiki.php/Main/HarderThanHard", "/pmwiki/pmwiki.php/Main/ImprobableAimingSkills", "/pmwiki/pmwiki.php/Main/VideoGameRemake", "/pmwiki/pmwiki.php/Main/SplitScreen", "/pmwiki/pmwiki.php/Main/DifficultButAwesome", "/pmwiki/pmwiki.php/Main/NintendoHard", "/pmwiki/pmwiki.php/Main/ArtificialBrilliance", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Main/FromBadToWorse", "/pmwiki/pmwiki.php/Main/Nerf", "/pmwiki/pmwiki.php/Main/BottomlessMagazines", "/pmwiki/pmwiki.php/Main/HarderThanHard", "/pmwiki/pmwiki.php/Main/TheAllSeeingAI", "/pmwiki/pmwiki.php/Main/TheComputerIsACheatingBastard", "/pmwiki/pmwiki.php/Main/OneHitKill", "/pmwiki/pmwiki.php/Main/CallingYourAttacks", "/pmwiki/pmwiki.php/Main/GrenadeHotPotato", "/pmwiki/pmwiki.php/Main/CatchAndReturn", "/pmwiki/pmwiki.php/Administrivia/TropesAreTools", "/pmwiki/pmwiki.php/Main/ManaMeter", "/pmwiki/pmwiki.php/Main/LimitBreak", "/pmwiki/pmwiki.php/Main/SuspiciouslySimilarSubstitute", "/pmwiki/pmwiki.php/Main/ArtificialStupidity", "/pmwiki/pmwiki.php/Main/ArtificialStupidity", "/pmwiki/pmwiki.php/Main/ArtificialStupidity", "/pmwiki/pmwiki.php/Main/HeroShooter", "/pmwiki/pmwiki.php/Main/FinalBoss", "/pmwiki/pmwiki.php/Main/OneHitKill", "/pmwiki/pmwiki.php/Main/GrenadeLauncher", "/pmwiki/pmwiki.php/Main/EliteMooks", "/pmwiki/pmwiki.php/Main/NewGamePlus", "/pmwiki/pmwiki.php/Main/StuffBlowingUp", "/pmwiki/pmwiki.php/Main/NewMeat", "/pmwiki/pmwiki.php/Main/RedShirt", "/pmwiki/pmwiki.php/Main/EliteMook", "/pmwiki/pmwiki.php/Main/PowerUpLetdown", "/pmwiki/pmwiki.php/Main/NotCompletelyUseless", "/pmwiki/pmwiki.php/Main/AnimeAndManga", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/PrecisionFStrike", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/BodyOfTheWeek", "/pmwiki/pmwiki.php/Main/TabletopGames", "/pmwiki/pmwiki.php/Main/MoreDakka", "/pmwiki/pmwiki.php/Main/GrenadeLauncher", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Main/EarthShatteringKaboom", "/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/Main/ExactlyWhatItSaysOnTheTin", "/pmwiki/pmwiki.php/UsefulNotes/WorldWarI", "/pmwiki/pmwiki.php/Main/PinnedDown"]}