{"title": "Historical Longevity Joke", "content": "Alice makes fun of Bob's age by suggesting that he was alive during a time period that's well beyond living memory. For example:\n\nThis could also work with Alice being a very naive character who doesn't realize how insulting she's being. Alternatively, it could involve Bob making a self-deprecating joke of this nature when he's made to feel old:\n\nIf the usage of this trope is followed by the revelation that Bob is Really 700 Years Old and was actually living back then, it's a Subverted Trope. If it was previously established that Bob is Really 700 Years Old, this trope does not apply at all. It is also not just any joke about Bob being old, but has to include some reference to him being alive during a period in which no living person could have lived.\n• In The Boondocks, Riley once asked his grandfather Robert if he remembers traveling on a slave ship from Africa to America centuries ago, to which Granddad replied, \"I'm not that old!\".\n• Calvin and Hobbes: Calvin once asked his dad if dinosaurs were around when he was young. His dad confirms it before his mother tells him Calvin's grades are already bad enough.\n• In The Emperor's New Groove, Emperor Kuzco describes his elderly adviser Yzma as being living proof that \"dinosaurs once roamed the earth\". This is just one of many jokes about how unfathomably ancient she is.\n• One episode of The Drew Carey Show has Drew helping a senior member of the Winfred-Louder board write a speech. Drew suggests throwing in a joke about how the board member has been around for so long that he can remember when they used to great each other by saying \"Hail Caesar!\"\n• Midsomer Murders: Barnaby once asks his sergeant how old he thinks Barnaby is. He replies that he's done speed dating, not carbon dating.\n• 3rd Rock from the Sun: Dick: Wait a second, you had a youth, too?! Dick: Well, what was it like, or can you still remember? Mary: It was wonderful. We lived in log cabins we built ourselves. Oh, and when Mr. Lincoln came to town, we were all aflutter!\n• An episode of Cheers had Cliff write a joke for The Tonight Show to be delivered by Johnny Carson on Doc Severinsen's birthday. The joke is \"Doc is so old that on his first birthday, he didn't blow out the candles. They didn't have fire yet.\" Only Lilith finds it funny.\n• Mystery Science Theater 3000: In the opening of Space Mutiny, Mike whips out his encyclopedia set from high school so Crow and Tom Servo can research ancient Rome. But the bots instead complain that the encyclopedia is out-of-date: Mike: Oh, come on, they're not that old. They're fine. Servo: Oh yeah? It mentions the lightbulb as a \"charming theory.\" Crow: Yeah! And Congress is spelled with an \"f.\" What is it, Congreff? Mike: Well, I used them when I was a kid. They seemed fine then. Crow: The periodic table has three elements in it, Mike! Servo: There's a volume for the letter epsilon. Servo: It's got a picture of Stonehenge!\n• Two and a Half Men: When Alan tells Charlie the husband of one of his hookups is at the door, Charlie mentions he should've told him \"he was a Civil War veteran.\"\n• Another episode has Alan dating an older woman, who Charlie describes as \"richer than God. Which she probably knew since he was this tall\".\n• A common gag in True Jackson, VP with Lulu seeing anyone over 25 as old. Amanda being her normal target like asking if when she went to sleepovers she wasn't afraid that a pterodactyl would take her.\n• Happened Once per Episode in el Doctor Chapatín. When someone made a comment about his age, the doctor would angrily ask if he is implying that he is old. The man would deny it, just to make a worse comment about his age. Something tells me that you are the doctor that healed Cuauhtémoc's feet\n• On The Nanny, Niles occasionally makes these kinds of jokes about C.C. For example: C.C.: The world was a different place when I was a girl. \n\nNiles: Yes, they thought it was flat.\n• One episode of Frasier has Daphne's mother Gertrude complain about how people these days drive so recklessly, and how back in her day, everyone's driving was much better. Cue Roz's young daughter Alice innocently asking \"Is that because you rode on dinosaurs?\"\n• Buffy the Vampire Slayer. Giles is often on the receiving end of this, being an older Stuffy Brit librarian among the younger Scoobies. Giles: I'll be back in the Middle Ages [section of the library]. Jenny: Did you ever leave?\n• In Private Eye, the elderly journalists Bill Deedes and Alistair Cooke would frequently feature in such jokes (such as Deedes being the editor of Haaretz at the time of Christ's birth).\n• In Uncharted 3: Drake's Deception, while Drake and his older friend Sully (who's in his 50s) are exploring rural France, they come across the ruined remains of an old car from the 1920s, so Drake jokingly tells Sully that it's \"your first car\". Sully is somehow able to identify the exact year and model of that car.\n• In the The Annoying Orange TV show, Orange loves making jokes about Grandpa Lemon's age.\n• In \"The Day The Store Stood Still\" Grandpa Lemon is recounting a story that involves the beginning of the universe, Orange adds \"you were in preschool\".\n• Subverted in \"Founding Fruits\" where Orange jokes Grandpa Lemon only knew the history of the fruit version of the American Revolution because he was alive during that time, only to be shocked when Grandpa Lemon reveals he was indeed alive back then and is actually the still living Benjamin Franklemon, making him over 200 years old.\n• In one episode of Squirrel Boy, Rodney evidently believes that Bob's childhood was during the time of cavemen.\n• On The Proud Family, Oscar claims that Suga Mama is so old she survived some of the greatest disasters in the history of mankind: the Hindenburg, the Titanic, the meteor that wiped out the dinosaurs, and 30 years of The Jeffersons reruns.\n• Rugrats subjects Grandpa Lou to a few jokes like this: Lou: Antiques, huh! Back in my day, we had no use for antiques! \n\nDidi: But Pop, I thought back in your day, there were no antiques. \n\n(Didi giggles) \n\nLou: (angrily) Very funny! A fella could bust a gut around here!\n• This joke from \"Reptar on Ice\"... Lou: In my day, dinosaurs didn't skate around with a bunch of ninnies in costumes. Stu: (to Didi) In his day, the dinosaurs were real.\n• In The Loud House episode \"No Spoilers\", when Lincoln and his sisters try to throw their mother a surprise party without Leni's involvement (since Leni always spoils the surprise), Luan makes jokes about how old their mom's getting, such as her social security number being 1, and all the guests from her first birthday being extinct. Lori is not amused.\n• Recess: When Miss Grotke gives the kids a project to do on ancient civilizations: TJ: Ancient civilizations? Like back when \n\n(all the kids burst into laughter) \n\nMiss Grotke: Actually, TJ, we're going to go back thousands of years, not : Ancient civilizations? Like back when Miss Finster was a kid?(all the kids burst into laughter): Actually, TJ, we're going to go back thousands of years, not hundreds . ( she starts laughing too\n• During the 2008 presidential election, political comedians often made these sort of jokes about John McCain. They became such a meme that McCain made some about himself during an appearance on The Tonight Show.\n• Ronald Reagan also made one of these jokes at his own expense. During the 1992 Republican National Convention, he combined it with the \"you're no Jack Kennedy\" meme, saying of Bill Clinton, \"This fellow they've nominated claims he's the new Thomas Jefferson. Well, let me tell you something. I knew Thomas Jefferson. He was a friend of mine. And Governor, you're no Thomas Jefferson.\"", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/HistoricalLongevityJoke", "media_links": ["/pmwiki/pmwiki.php/Series/Chespirito", "/pmwiki/pmwiki.php/TabletopGame/Poker", "/pmwiki/pmwiki.php/Disney/TheEmperorsNewGroove", "/pmwiki/pmwiki.php/Series/TheDrewCareyShow", "/pmwiki/pmwiki.php/Series/MidsomerMurders", "/pmwiki/pmwiki.php/Series/ThirdRockFromTheSun", "/pmwiki/pmwiki.php/Series/Cheers", "/pmwiki/pmwiki.php/Series/TheTonightShow", "/pmwiki/pmwiki.php/Series/MysteryScienceTheater3000", "/pmwiki/pmwiki.php/Series/TwoAndAHalfMen", "/pmwiki/pmwiki.php/Series/TrueJacksonVP", "/pmwiki/pmwiki.php/Series/Chespirito", "/pmwiki/pmwiki.php/Series/TheNanny", "/pmwiki/pmwiki.php/Series/Frasier", "/pmwiki/pmwiki.php/Series/BuffyTheVampireSlayer", "/pmwiki/pmwiki.php/VideoGame/Uncharted3DrakesDeception", "/pmwiki/pmwiki.php/WesternAnimation/SquirrelBoy", "/pmwiki/pmwiki.php/WesternAnimation/TheProudFamily", "/pmwiki/pmwiki.php/Series/TheJeffersons", "/pmwiki/pmwiki.php/WesternAnimation/Rugrats", "/pmwiki/pmwiki.php/WesternAnimation/TheLoudHouse", "/pmwiki/pmwiki.php/WesternAnimation/Recess", "/pmwiki/pmwiki.php/Series/TheTonightShow"], "non_media_links": ["/pmwiki/pmwiki.php/Main/TheThreeWiseMen", "/pmwiki/pmwiki.php/UsefulNotes/TheAmericanCivilWar", "/pmwiki/pmwiki.php/UsefulNotes/AbrahamLincoln", "/pmwiki/pmwiki.php/Main/ReallySevenHundredYearsOld", "/pmwiki/pmwiki.php/Main/SubvertedTrope", "/pmwiki/pmwiki.php/Main/ReallySevenHundredYearsOld", "/pmwiki/pmwiki.php/Main/ComicStrips", "/pmwiki/pmwiki.php/ComicStrip/TheBoondocks", "/pmwiki/pmwiki.php/ComicStrip/CalvinAndHobbes", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/AnimatedFilms", "/pmwiki/pmwiki.php/Main/EvilOldFolks", "/pmwiki/pmwiki.php/Main/EvilChancellor", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Recap/MysteryScienceTheater3000S08E20SpaceMutiny", "/pmwiki/pmwiki.php/Main/TheDitz", "/pmwiki/pmwiki.php/Main/JerkWithAHeartOfGold", "/pmwiki/pmwiki.php/Main/OncePerEpisode", "/pmwiki/pmwiki.php/Main/DistinctionWithoutADifference", "https://en.wikipedia.org/wiki/Cuauht%C3%A9moc", "/pmwiki/pmwiki.php/Main/StuffyBrit", "/pmwiki/pmwiki.php/Main/Magazines", "/pmwiki/pmwiki.php/Magazine/PrivateEye", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/WebOriginal", "/pmwiki/pmwiki.php/WebVideo/TheAnnoyingOrange", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/Jerkass", "/pmwiki/pmwiki.php/Main/SassyBlackWoman", "/pmwiki/pmwiki.php/Main/ArsonMurderAndJaywalking", "/pmwiki/pmwiki.php/Main/ArsonMurderAndJaywalking", "/pmwiki/pmwiki.php/Recap/RugratsS2E4ShowdownAtTeeterTotterGulchMirrorland", "/pmwiki/pmwiki.php/Recap/RugratsS2E10ReptarOnIceFamilyFeud", "/pmwiki/pmwiki.php/Recap/TheLoudHouseS2E21NoLaughingMatterNoSpoilers", "/pmwiki/pmwiki.php/Main/CannotKeepASecret", "/pmwiki/pmwiki.php/Main/SternTeacher", "/pmwiki/pmwiki.php/Main/TheMiddleAges", "/pmwiki/pmwiki.php/Main/ActuallyPrettyFunny", "/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/Main/MemeAcknowledgment", "/pmwiki/pmwiki.php/UsefulNotes/RonaldReagan", "/pmwiki/pmwiki.php/Memes/USPolitics", "/pmwiki/pmwiki.php/UsefulNotes/BillClinton", "/pmwiki/pmwiki.php/UsefulNotes/ThomasJefferson"]}