{"title": "Not Big Enough for the Two of Us", "content": "\n• M*A*S*H: Colonel Potter says this while fighting over a Sears catalogue with Hawkeye. He also says it when another character drunkenly rides his horse. Col. Potter: Dupree, I don't want to see you near this horse or my camp ever again. In fact, this war ain't big enough for the two of us!\n• Night Court episode \"Harry on Trial\" Judge Willard: On July 12th of this year, didn't the defendant, claiming quote, \"This courtroom ain't big enough for the two of us,\" unquote, squirt you in the face with a water pistol in open court?\n• Even Stevens episode \"Short Story\" Louis Stevens: Now listen, the school ain't big enough for the both of us, so you just get out of here.\n• The Gene Autry Show episode \"Feuding Friends\" Pat Buttram: I told you before, Autry, no town is going to be big enough for the both of us. Gene Autry: Then you better find yourself another town. : Then you better find yourself another town. Pat Buttram: I will not! I found this one first. Gene Autry: I'm stayin' here tonight. You can do what you want. Pat Buttram: And I'm doin' it - right now! [Slugs Autry in the jaw]\n• Played for Laughs in one episode of El Chavo del ocho. Don Ramón is fed up with Chavo's antics, and tells him that the vecindad is not big enough for the two of them to continue living in it. Don Ramón: So it's that, either you leave, or I do. Chavo: One of us... has to leave? Chavo: (turns around and starts to walk away towards the entrance. Then he turns around again) Shall I get a taxi for you?\n• Horrible Histories: Henry VII's song: Spent a long time fighting pretenders to the throne \n\nLambert Simbel and Perkin Warbeck said my throne was their own \n\nThey claimed they'd been the princes in the tower, their rule delayed \n\nI said \"This crown ain't big enough for the three of us!\" and had one SLAYED!\n• Blackadder. In \"Duel and Duality\", Edmund Blackadder is trying to contact his mad Scottish cousin McAdder, but they keep missing each other in order to save on special effects. When they finally meet up... Edmund Blackadder: Look, did you tell him to be here or not? Mrs. Miggins: I did, you just keep missing each other. I can't imagine why. McAdder: I'll tell you why. It's because there's no coffee shop in England big enough for two Blackadders! (enters) I'll tell you why. It's because there's no coffee shop in England big enough for two Blackadders!\n• Star Trek: Voyager. In \"Darkling\", the Emergency Medical Hologram finds himself in a Jekyll & Hyde situation. He tampers with his personality subroutines, and unfortunately creates an evil EMH who sets out to destroy the good part of himself. Kes: The mobile emitter contains both your programs. If you damage it you could both be destroyed. Evil EMH: There's not enough room inside for both of us. One must die. I deserve to exist more than your Doctor does.\n• Blake's 7. In the end of \"Dawn of the Gods\", Master Computer Orac is not happy that Evil Genius Lord Thaarn escaped. Orac: It is intolerable! There is insufficient room in the galaxy for his intellect and mine. Tarrant: I don't know. He did have one redeeming feature. He didn't like computers.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/NotBigEnoughForTheTwoOfUs", "media_links": ["/pmwiki/pmwiki.php/Series/MASH", "/pmwiki/pmwiki.php/Series/NightCourt", "/pmwiki/pmwiki.php/Series/HomeAndAway", "/pmwiki/pmwiki.php/Series/EvenStevens", "/pmwiki/pmwiki.php/Series/TheGeneAutryShow", "/pmwiki/pmwiki.php/Music/GeneAutry", "/pmwiki/pmwiki.php/Series/SesameStreet", "/pmwiki/pmwiki.php/Series/BuffyTheVampireSlayer", "/pmwiki/pmwiki.php/Series/JesusOfNazareth", "/pmwiki/pmwiki.php/Series/SecretGarden", "/pmwiki/pmwiki.php/Series/ElChavoDelOcho", "/pmwiki/pmwiki.php/Series/HorribleHistories", "/pmwiki/pmwiki.php/Series/Blackadder", "/pmwiki/pmwiki.php/Series/StarTrekVoyager", "/pmwiki/pmwiki.php/Series/BlakesSeven", "/pmwiki/pmwiki.php/Series/DoctorWho", "/pmwiki/pmwiki.php/Series/CobraKai"], "non_media_links": ["/pmwiki/pmwiki.php/Main/SoapOpera", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/WouldHurtAChild", "/pmwiki/pmwiki.php/Main/PlayedForLaughs", "/pmwiki/pmwiki.php/Main/ActingForTwo", "/pmwiki/pmwiki.php/Main/WalkInChimeIn", "/pmwiki/pmwiki.php/Main/JekyllAndHyde", "/pmwiki/pmwiki.php/Main/AIIsACrapshoot", "/pmwiki/pmwiki.php/Main/MasterComputer", "/pmwiki/pmwiki.php/Main/EvilGenius"]}