{"title": "Show the Folks at Home", "content": "Often when there is some element in a Game Show that is hidden from the contestants' view or knowledge, the home audience will get a \"sneak peek\" at the gameplay element in question. In some instances, the host will sometimes remind viewers to look away if they are playing along, with an audible indicator to let the viewer know when it is okay to resume watching.\n\nPlease note that this is only to reveal a certain key component of gameplay, not all instances of game questions being shown on-screen.\n• On the first few episodes of Classic Concentration, the rebus solution would be revealed to the audience superimposed over the numbered squares. Also, Alex Trebek would often use this exact phrase at the end of a round, saying \"Let's show the folks at home how [contestant] solved the puzzle.\"\n• The Jack Narz version of Concentration did this with the rebus solutions before the actual rebus was shown in the Double Play Bonus Round.\n• The price of the items offered in \"Clock Game\" on The Price Is Right. The audience also sees the prices, hence why the host asks for silence (a rarity on Price as it's one of the few shows that actually allows the audience to help the contestant come up with an answer, if not the only show). This is to avoid helping the contestant in this case, and at least one person had to be escorted out of the audience for failing to comprehend this simple rule.\n• The location of the \"Stinger\" on The $1,000,000 Chance of a Lifetime.\n• The answer to the clues on Double Dare (1976) .\n• The contestant's secret and the Secret Slime Action on Figure It Out.\n• The passwords on the Password series.\n• The approximate location of the hidden object when a room is searched on the Toffler and UK versions of Finders Keepers. The cameramen on the Eure version would occasionally zoom in on the hidden object's location if the contestants were searching the wrong part of the room.\n• The Secret Square on The Hollywood Squares.\n• The identity of the \"Red Herring\" in the Locker Room during Season 2 of Think Fast.\n• Wheel of Fortune: What is hidden behind the \"Mystery Wedge\" when the wheel landed on it is superimposed over the overhead shot for a few moments while Pat spiels about the decision.\n• Possible Trope Namer - John Daly and Garry Moore would actually say the phrase as the contestants' occupations/secrets were revealed on What's My Line? and I've Got a Secret. What's My Line? experimented a couple of times with not showing the occupation, but it didn't stick, because a big part of the fun of the show was the audience being \"in the know\" when the panel wasn't. (For example, it would be amusing if the panel asked \"Could this be used by both men and women?\" for a product that was intended for use by animals.)\n• The first contestant's answers in the Fast Money bonus round of Family Feud.\n• Briefly used on the syndicated Deal or No Deal.\n• On the 1960s Camouflage, a contestant reaching 30 points in score saw a picture of the object she had to locate and trace. The object was similarly shown to the studio and home audiences.\n• The names on You Don't Say!! At least once per show, however, the name would be replaced with \"Guess Who?\" or a set of question marks.\n• Whose Line Is It Anyway? would often include games where the contestant is trying to guess what another contestant is suppose to acting like, with subtitles revealing the answer for viewers at home.\n• An odd variation occurred during NBC's coverage of the 2012 Summer Olympics where, attempting to mesh live updates with pre-taped and edited footage, they would occasionally flash medal updates on-screen, while the commentator advised those who didn't want to be spoiled to look away. Unfortunately, they usually went ahead and spoiled the results in their promos anyway, but you have to give them something for the effort.\n• This is actually a pretty common occurrence worldwide with Olympic coverage, such that \"If you don't want to know the results, look away now\" became a Catchphrase in many countries.\n• Parodied on radio quiz I'm Sorry I Haven't a Clue, which tells the listeners that the studio audience are seeing the answer on the \"Laser Display Board\", but really uses a runner with a bit of card. For the Folks At Home themselves, there's a \"Mystery Voice\".\n• Starting in 1999, televised poker events made use of a \"pocket cam\" to get a peek at the players' face-down cards for the benefit of TV viewers.\n• In Bargain Hunt, the viewers at home will get a sneak peak at what the auctioneer thinks of the items the teams bought, and more importantly what the auctioneer thinks of the expert's \"bonus item\" that the team may or may not go with. Usually this is the auctioneer saying just exactly how badly the item in question is going to do.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/ShowTheFolksAtHome", "media_links": ["/pmwiki/pmwiki.php/Series/Concentration", "/pmwiki/pmwiki.php/Series/ThePriceIsRight", "/pmwiki/pmwiki.php/Series/TheOneMillionChanceOfALifetime", "/pmwiki/pmwiki.php/Series/DoubleDare1976", "/pmwiki/pmwiki.php/Series/FigureItOut", "/pmwiki/pmwiki.php/Series/Password", "/pmwiki/pmwiki.php/Series/FindersKeepers", "/pmwiki/pmwiki.php/Series/FunHouse", "/pmwiki/pmwiki.php/Series/TheHollywoodSquares", "/pmwiki/pmwiki.php/Series/Starcade", "/pmwiki/pmwiki.php/Series/ThinkFast", "/pmwiki/pmwiki.php/Series/WheelOfFortune", "/pmwiki/pmwiki.php/Series/WhatsMyLine", "/pmwiki/pmwiki.php/Series/IveGotASecret", "/pmwiki/pmwiki.php/Series/FamilyFeud", "/pmwiki/pmwiki.php/Series/DealOrNoDeal", "/pmwiki/pmwiki.php/Series/YouDontSay", "/pmwiki/pmwiki.php/Series/WhoseLineIsItAnyway", "/pmwiki/pmwiki.php/Radio/ImSorryIHaventAClue", "/pmwiki/pmwiki.php/Series/BargainHunt"], "non_media_links": ["/pmwiki/pmwiki.php/Main/GameShow", "/pmwiki/pmwiki.php/Main/BonusRound", "/pmwiki/pmwiki.php/Main/CoveredInGunge", "/pmwiki/pmwiki.php/Main/BonusSpace", "/pmwiki/pmwiki.php/Main/TropeNamer", "/pmwiki/pmwiki.php/UsefulNotes/OlympicGames", "/pmwiki/pmwiki.php/Main/CatchPhrase", "/pmwiki/pmwiki.php/Main/TakeOurWordForIt"]}