{"title": "Morality Ballad", "content": "And you'll find at the end \n\nThat a suitable moral lies there.\" Pierre: A Cautionary Tale in Five Chapters and a Prologue \"Read this story, my friend,And you'll find at the endThat a suitable moral lies there.\"\n\nA song that tells a story and An Aesop; often this is a cautionary tale. These ballads can be preachy parables, snarky yarns, tragic tear-jerkers, or anything in between.\n\nContrast with Murder Ballad, compare with Protest Song and Let Me Tell You a Story. Teenage Death Songs are frequently examples.\n• \"The Bells of Notre Dame\" from Disney's The Hunchback of Notre Dame.\n• Hilariously parodied in the W.C. Fields short The Fatal Glass of Beer. Accompanied only by his zither (while wearing his mittens), Fields sings a lugubrious ballad about the evils of alcohol in which a young man who drinks a single glass of beer staggers out in the street and breaks a Salvation Army girl's tambourine. He gets his just desserts by getting kicked in the head by the girl in \"a move she learned before she got saved\".\n• \"Press Conference Rag\" (We Both Reached For The Gun) from Chicago is a Black Comedy parody of the tale. The contents are a pretty standard story about a poor girl who through no fault of her own turned to the bad and murdered her lover in self-defense, but it is presented as a more-or-less fictional sob story Amoral Attorney Billy Flynn is feeding the press to drum up sympathy and attention for his client Roxie.\n• Maurice Sendak's picture book Pierre, adapted from Herman Melville's source, as quoted above. This was set to music in Really Rosie and later covered by The Dresden Dolls.\n• The Oompa Loompa songs from Charlie and the Chocolate Factory and Charlie And The Great Glass Elevator.\n• Alice in Wonderland contains numerous parodies of nursery rhymes meant to teach children good behavior, almost all since long-forgotten.\n• Jimmie Dodd would usually sing one at the end of The Mickey Mouse Club.\n• \"The Farmer On The Dole\" by P.D.Q. Bach.\n• The vast majority of Harry Chapin's songs are Morality Ballads of one degree or another, including \"Cat's In The Cradle.\", \"The Rock\" and \"Flowers Are Red\".\n• \"One Tin Soldier\" by Coven tells how the people in a valley murder the people on a mountain for an unspecified treasure, which turns out to be \"peace\", essentially moralizing against greed and war at the same time.\n• \"In the Ghetto\" performed by Elvis Presley on his album From Elvis in Memphis is a plea to do something about poverty in the ghettos. People born poor will have children who grew up in poverty and raise other children in poverty.\n• Of course, the '60s were full of Morality Ballads, and Bob Dylan made a career off of them. Among others, there's 'Like a Rolling Stone'.\n• And it even predates Bob Dylan. Both Woody Guthrie and Pete Seeger made a career out of straddling the line between Morality Ballad and Protest Song.\n• The Chad Mitchell Trio has both straight and parody examples of Morality Ballads. Their 'Mighty Day on Campus' album includes the darkly comic Lizzie Borden (\"You can't chop your papa up in Massachusetts. Massachusetts is a far cry from New York\"), but also includes 'Johnny' (based on 'Johnny I hardly knew ye', about a soldier who returns home from the war crippled).\n• \"Silas Stingy\", a song John Entwistle wrote for The Who, tells the story of a Scrooge whose obsession with securing his fortune leads to some ironic karma.\n• Many Christian Rock tunes that are not \"praise songs\" fall under this category.\n• \"The Yeah Yeah Yeah Song\" by The Flaming Lips, about the abuse of power.\n• \"Boombox\" by The Lonely Island. It ends by saying it's a cautionary tale: the Boombox is not a toy.\n• The song \"Cocaine Blues\" (written by \"Red\" Arnall, originally recorded by W. A. Nichol's Western Ace, and is best known from the version by Johnny Cash) seems to be a parody: it revels in rebellion and substance abuse before admonishing listeners not to touch alcohol and cocaine in the very last line.\n• \"Cigarettes and Whiskey and Wild Wild Women\", originally by the Sons of the Pioneers, is another parody example.\n• Not technically a ballad: Alice Cooper's \"Hey Stoopid\" is a Hair Metal song about avoiding the pitfalls of the rock 'n roll lifestyle.\n• \"Another Day In Paradise\" by Phil Collins focuses on the plight of the homeless.\n• \"Runaway Love\" by Ludacris, about the lives of various runaways and the circumstances leading to them running away.\n• \"Brenda's Got a Baby\" by Tupac Shakur, which details how a 12-year-old girl became pregnant (then driven to prostitution and killed by one of her johns) because her family and her society were not looking out for her.\n• Steve Taylor didn't write very many of these considering he's a Christian artist, but \"Jenny\" is unequivocally an example.\n• Another example so perfect as to border on parody is The Kinks' \"Alcohol\", from Muswell Hillbillies, which even opens with the line \"Here's a story about a sinner...\"\n• Steve Martin's parodic \"Grandmother's Song\" starts as a straight example, but turns into Word Salad Lyrics starting at the end of the second verse: Be thoughtful and trustful and childlike \n\nBe witty and happy and wise \n\nBe honest and love all your neighbors \n\nBe obsequious, purple and clairvoyant...\n• W. S. Gilbert seems to have enjoyed making light of the preachy variety:\n• The poems \"Gentle Jane\" and \"Teasing Tom\" in Patience belong to the Victorian genre of morality poems for children. They're not much even as parodies, but they serve to poke fun at the lovesick maidens' aesthetic tastes.\n• Sir Joseph's song \"When I was a lad\" in H.M.S. Pinafore. It ends with a Spoof Aesop: \"Stick close to your desks and never go to sea, \n\nAnd you may all be rulers of the Queen's Navee!\"\n• \"There lived a King\" from The Gondoliers is a more serious example.\n• In the musical Lady In The Dark, Liza Elliott is on trial before a circus (such things can happen in a Dream Sequence) for being unable to Make Up Her Mind about which of two men she wants to marry. For her defense, she offers \"The Saga Of Jenny\", which points a moral with which they cannot quarrel.\n• Stephen Sondheim's Assassins: All the \"Ballad\" numbers:\n• \"The Ballad of Guiteau\" starts with \"Come all ye Christians and learn from a sinner: Charley Guiteau.\" It switches between the narrator singing about Guiteau, Guiteau singing about the importance of working hard and trusting God, and Guiteau singing a song \u0097 by the actual Guiteau \u0097 about how glad he is to be going to the Lordy.\n• \"The Ballad of Czolgosz\" sounds like a happy ballad delivering a simple moral about working hard and overcoming adversity to \"work your way to the head of the line\". This is subverted as huge amounts of Lyrical Dissonance apply. It's actually the story of a guy killing President McKinley for somewhat sympathetic reasons.\n• The Balladeer frames \"The Ballad of Booth\" as the tragic story of a nice guy who went crazy due to some personal issues. Of course, Booth hears him and objects to the Balladeer's moral and to how the Balladeer characterizes his motives.\n• The verses of \"Simple Joys\" from Pippin.\n• \"Meeskite\" from Cabaret: Moral, moral, \n\nYes, indeed, the story has a moral, moral, \n\nThough you're not a beauty, it is nevertheless quite true \n\nThere may be beautiful things in you.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/MoralityBallad", "media_links": ["/pmwiki/pmwiki.php/Literature/PierreACautionaryTaleInFiveChaptersAndAPrologue", "/pmwiki/pmwiki.php/Creator/Disney", "/pmwiki/pmwiki.php/Disney/TheHunchbackOfNotreDame", "/pmwiki/pmwiki.php/Creator/WCFields", "/pmwiki/pmwiki.php/Film/Chicago", "/pmwiki/pmwiki.php/Creator/MauriceSendak", "/pmwiki/pmwiki.php/Creator/HermanMelville", "/pmwiki/pmwiki.php/Literature/CharlieAndTheChocolateFactory", "/pmwiki/pmwiki.php/Literature/AliceInWonderland", "/pmwiki/pmwiki.php/Series/TheMickeyMouseClub", "/pmwiki/pmwiki.php/Music/PDQBach", "/pmwiki/pmwiki.php/Music/HarryChapin", "/pmwiki/pmwiki.php/Music/ElvisPresley", "/pmwiki/pmwiki.php/Music/FromElvisInMemphis", "/pmwiki/pmwiki.php/Music/BobDylan", "/pmwiki/pmwiki.php/Music/WoodyGuthrie", "/pmwiki/pmwiki.php/Music/PeteSeeger", "/pmwiki/pmwiki.php/Music/TheWho", "/pmwiki/pmwiki.php/Music/FlamingLips", "/pmwiki/pmwiki.php/Music/TheLonelyIsland", "/pmwiki/pmwiki.php/Music/JohnnyCash", "/pmwiki/pmwiki.php/Music/AliceCooper", "/pmwiki/pmwiki.php/Music/PhilCollins", "/pmwiki/pmwiki.php/Music/Ludacris", "/pmwiki/pmwiki.php/Music/TupacShakur", "/pmwiki/pmwiki.php/Music/SteveTaylor", "/pmwiki/pmwiki.php/Music/TheKinks", "/pmwiki/pmwiki.php/Music/MuswellHillbillies", "/pmwiki/pmwiki.php/Creator/SteveMartin", "/pmwiki/pmwiki.php/Creator/WSGilbert", "/pmwiki/pmwiki.php/Theatre/Patience", "/pmwiki/pmwiki.php/Theatre/HMSPinafore", "/pmwiki/pmwiki.php/Theatre/TheGondoliers", "/pmwiki/pmwiki.php/Music/StephenSondheim", "/pmwiki/pmwiki.php/Theatre/Assassins", "/pmwiki/pmwiki.php/Theatre/Pippin", "/pmwiki/pmwiki.php/Theatre/Cabaret"], "non_media_links": ["/pmwiki/pmwiki.php/Main/AnAesop", "/pmwiki/pmwiki.php/Main/MurderBallad", "/pmwiki/pmwiki.php/Main/ProtestSong", "/pmwiki/pmwiki.php/Main/LetMeTellYouAStory", "/pmwiki/pmwiki.php/Main/TeenageDeathSongs", "/pmwiki/pmwiki.php/Main/DryCrusader", "/pmwiki/pmwiki.php/Main/BlackComedy", "/pmwiki/pmwiki.php/Main/AmoralAttorney", "/pmwiki/pmwiki.php/Main/WeirdAlEffect", "/pmwiki/pmwiki.php/Main/MoralityBallad", "/pmwiki/pmwiki.php/Main/MoralityBallad", "/pmwiki/pmwiki.php/Main/ProtestSong", "/pmwiki/pmwiki.php/Main/TheScrooge", "/pmwiki/pmwiki.php/Main/ChristianRock", "/pmwiki/pmwiki.php/Main/WithGreatPowerComesGreatInsanity", "/pmwiki/pmwiki.php/Main/HairMetal", "/pmwiki/pmwiki.php/Main/WordSaladLyrics", "/pmwiki/pmwiki.php/Main/SpoofAesop", "/pmwiki/pmwiki.php/Main/DreamSequence", "/pmwiki/pmwiki.php/Main/TheDitherer", "/pmwiki/pmwiki.php/Main/BettyAndVeronica", "/pmwiki/pmwiki.php/Main/LyricalDissonance", "/pmwiki/pmwiki.php/Main/BreakingTheFourthWall"]}