{"title": "Crowd Panic", "content": "Someone shoots, crowd panics. Someone says there's a bomb in the building, crowd panics. Usually found in comedy / cop movies.\n\nNo one in the crowd ever trips or gets stuck.\n\nWhen someone besides the group of Living Prop guys do it, it's a Mass \"Oh, Crap!\". May involve a Redshirt Reporter.\n• Full Metal Panic? Fumoffu: Sousuke finds his bottle of biowarfare agent has been opened, so he puts on an NBC suit and puts the class into Lock Down. Naturally his classmates Freak Out!, and when Sousuke tries to calm them down, he says it's all right for him as he's the only one wearing a Hazmat Suit. Sousuke then takes off his suit in a gesture of solidarity, which is immediately subverted when everyone beats him up for bringing a deadly virus into the classroom in the first place. They then panic again and try to break down the sealed door until Kaname succeeds in Shaming the Mob with a Rousing Speech. Unfortunately, Sousuke stuffs things up again by saying how there's only one antidote.\n• In Breaking Boundaries a Town of Salem fanfic, most people in the town panic over the tiniest things. Only a select few don't join in. Usually caused by Water who is a very anxious character herself.\n• Rosario Vampire: Brightest Darkness Act III: In chapter 41, the entire student body freaks out when they discover that Kuyou has returned.\n• The Naked Gun 2 ½, where Frank Drebin tries to evacuate a crowd in orderly fashion.\n• Batman\n• Batman: The Movie, the movie of the 1960s Batman (1966) TV series. Batman runs with into a restaurant with a Cartoon Bomb and urges everyone to flee for their lives. The crowd promptly panics and escapes (except for two ladies who ignore Batman and keep eating their lunch as if nothing had happened). Some days you just can't get rid of a bomb.\n• Batman (1989). When the Joker's balloons release the Smilex gas, the crowds panic and try to get away.\n• Quantum of Solace when an escaping QUANTUM agent shoots a random girl.\n• D.E.B.S. When Lucy Diamond is spotted at the Endgame celebration, the crowd panics and flees.\n• King Kong (1933). When Kong attacks the native village while searching for Fay Wray, the natives leave in a justifiable hurry.\n• Blazing Saddles. When Mongo first arrives in Rock Ridge, a crowd in the street sees him, panics and runs away.\n• Invoked in Conspiracy Theory Mel Gibson's character is followed into a movie theater by bad guys and shouts that there's a bomb under his seat in order to escape in the resulting panic.\n• When the reporter on the airplane manages to get the fact that terrorists have seized control of the air traffic control systems of the airport in Die Hard 2 on the evening news, everyone in the airport panics. This mainly serves to ensure that the cops can't get through the crowds to attempt to do anything about it.\n• The Day the Earth Stood Still (1951)\n• When Klaatu's spaceship first lands at the park, the crowds of people there run away in terror.\n• Sometime later, a crowd of people (and Army personnel) surround the spaceship. When Gort first appears the crowd panics and take off.\n• The Abyss. When the giant tidal wave threatens the city, the people at the beach flee in terror.\n• Iron Man 2: The result of the attack at the Expo. Rather well done in the regard that the matter of having to evacuate a huge, displaced crowd is followed up on later.\n• Battle of Britain: Berlin, when the lights go out and the air raid sirens start up, announcing that the Royal Air Force has decided to return the favor after the Luftwaffe (accidentally) bombed London. The Berliners understandably freak out and flee in search of shelter.\n• In Artemis Fowl: the Lost Colony, after the first demon appears in the street, it disappears. The crowd \"froze\", but when it disappeared, the crowd \"unfroze violently\".\n• The ending of the Twelfth book of A Series of Unfortunate Events implies this. Almost all the major characters throughout the entire series are trapped in a burning building, and other than the Baudelaires and Count Olaf, whether or not they survive is ultimately left up to the reader.\n• Get Smart. After Maxwell Smart reveals there's a bomb in Harvey, the delegates at a conference flee in panic. The Chief gets on the microphone and delivers a tongue-lashing, telling them to set an example by leaving in a calm, orderly manner. Everyone looks shamefaced...then flees the same way as before.\n• In The Godfather: The Game, whenever you get seen with a gun... or someone starts shooting... or you crash your car into something... or some other stuff, the passersby quickly start running helter-skelter.\n• In the entire Hitman series, the civilian NPCs panic and flee at anything vaguely violent or seeing someone with a gun in a non-military context. They'll also run if they find evidence of your handiwork, i.e. corpses or in some cases bloodstains.\n• The Assassin's Creed series have this, normally when you kill someone in full view of them. Oddly, people will cheer you on when you fight with the guards, but flee in terror when you kill one.\n• [PROTOTYPE] had this, though normally someone won't start panicking until you pick up cars, kill people, or use your offensive powers.\n• The Getaway: People would freak out and run during the first half of the game if you were seen with a gun in public, and just like they would in real life, at least some of them call the cops. Less of an issue in the second half, as you're playing a plainclothes police officer and usually accompanied by some uniformed colleagues.\n• In Thwaite, the villagers inside a house that's threatened by an incoming missile head for another house. Panic ensues in the faster levels where almost every house is threatened one after another.\n• In The Matrix: Path of Neo during the 'Get me an Exit' mission, when the Agents fire at Neo the crowd freaks and some people start running around.\n• In some of the urban areas in Justice League Heroes: The Flash you pass groups of pedestrians fleeing the scene of the battle.\n• Schlock Mercenary has it as part of a plot to blow up a building without any innocent casualties. They stand still on the initial command to evacuate and thus need a little nudge. Schlock: We have confirmed reports of a firefight in the building! Random crowd member: If there's a fire, then where's the smoke?\n• In El Goonish Shive when the Omega Goo attacks a blond girl calls for a crowd panic. Ellen: Dammit, if the goo starts to eat people I hope whoever that was is the first to go...\n• Waterworks: Less of a panic and more of a mass jaw drop , in answer to the protagonist's sudden rage attack.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/CrowdPanic", "media_links": ["/pmwiki/pmwiki.php/Anime/FullMetalPanicFumoffu", "/pmwiki/pmwiki.php/Film/TheNakedGun", "/pmwiki/pmwiki.php/Franchise/Batman", "/pmwiki/pmwiki.php/Film/BatmanTheMovie", "/pmwiki/pmwiki.php/Series/Batman1966", "/pmwiki/pmwiki.php/Film/Batman1989", "/pmwiki/pmwiki.php/Film/QuantumOfSolace", "/pmwiki/pmwiki.php/Film/DEBS", "/pmwiki/pmwiki.php/Film/KingKong1933", "/pmwiki/pmwiki.php/Film/BlazingSaddles", "/pmwiki/pmwiki.php/Film/Dogma", "/pmwiki/pmwiki.php/Film/Damnatus", "/pmwiki/pmwiki.php/Film/ConspiracyTheory", "/pmwiki/pmwiki.php/Film/DieHard2", "/pmwiki/pmwiki.php/Film/TheDayTheEarthStoodStill1951", "/pmwiki/pmwiki.php/Film/TheAbyss", "/pmwiki/pmwiki.php/Film/IronMan2", "/pmwiki/pmwiki.php/Film/BattleOfBritain", "/pmwiki/pmwiki.php/Literature/ArtemisFowl", "/pmwiki/pmwiki.php/Literature/ASeriesOfUnfortunateEvents", "/pmwiki/pmwiki.php/Series/GetSmart", "/pmwiki/pmwiki.php/VideoGame/TheGodfather", "/pmwiki/pmwiki.php/VideoGame/Hitman", "/pmwiki/pmwiki.php/Franchise/AssassinsCreed", "/pmwiki/pmwiki.php/VideoGame/Prototype", "/pmwiki/pmwiki.php/VideoGame/TheGetaway", "/pmwiki/pmwiki.php/VideoGame/Thwaite", "/pmwiki/pmwiki.php/VideoGame/TheMatrixPathOfNeo", "/pmwiki/pmwiki.php/VideoGame/JusticeLeagueHeroesTheFlash", "/pmwiki/pmwiki.php/Webcomic/SchlockMercenary", "/pmwiki/pmwiki.php/Webcomic/ElGoonishShive", "/pmwiki/pmwiki.php/Webcomic/Waterworks"], "non_media_links": ["/pmwiki/pmwiki.php/Main/LivingProp", "/pmwiki/pmwiki.php/Main/MassOhCrap", "/pmwiki/pmwiki.php/Main/RedshirtReporter", "/pmwiki/pmwiki.php/Main/LockDown", "/pmwiki/pmwiki.php/Main/FreakOut", "/pmwiki/pmwiki.php/Main/HazmatSuit", "/pmwiki/pmwiki.php/Main/ShamingTheMob", "/pmwiki/pmwiki.php/Main/RousingSpeech", "/pmwiki/pmwiki.php/Main/ColdEquation", "/pmwiki/pmwiki.php/Main/FanFiction", "/pmwiki/pmwiki.php/FanFic/BreakingBoundaries", "/pmwiki/pmwiki.php/FanFic/RosarioVampireBrightestDarkness", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/CartoonBomb", "/pmwiki/pmwiki.php/Main/RuleOfFunny", "/pmwiki/pmwiki.php/Main/RedAlert", "/pmwiki/pmwiki.php/UsefulNotes/BritsWithBattleships", "/pmwiki/pmwiki.php/Main/CycleOfRevenge", "/pmwiki/pmwiki.php/Main/NiceJobBreakingItHero", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/WhyAmITicking", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/RealityEnsues", "/pmwiki/pmwiki.php/Main/WebComics", "/pmwiki/pmwiki.php/Main/BFG", "/pmwiki/pmwiki.php/Main/DeadpanSnarker", "/pmwiki/pmwiki.php/Main/CrowdPanic", "http://www.egscomics.com/?date=2002-10-12", "http://www.mspfanventures.com/?s=43&p=406"]}