{"title": "Hornet Hole", "content": "The difficulty here can really sting at times.\n\nA level seen in video games that takes place almost exclusively inside a beehive. Due to the nature of this level, it is in the realm almost exclusively of Platform Games. It has sticky honey or beeswax that will get stuck on characters and will often have a mazelike level design. There will be a Queen or King bee that needs to be fought. Of course, this videogame setting isn't limited to bees. Wasps, hornets and other suitably annoying flying, stinging insects can have their homes invaded by intrepid heroes as well. Since this level is full of enemy types that usually can't be defeated by traditional means, it can easily become That One Level.\n\nRelated tropes that can be seen in this type of level are The Swarm, Hive Mind, Synchronized Swarming, Wicked Wasps, Bee Bee Gun and Bee Afraid.\n• Freedom Planet: The temple area in Pangu Lagoon is overrun with wasp/bee-like enemies that have converted the lower levels of the stage into a hive. They spawn endlessly if you fall to those levels.\n• Metroid: Other M: The Biosphere has a single room that is a giant hive of Ki-Hunters, aggressive insectoid enemies driven only more aggressive by a roar heard nearby. You fight a bunch of them and then the King (who just sits in his hive) as a minor boss fight.\n• Little Big Adventure 2 has the island of the Mosquibees which includes a large hive although you spend more time fighting the invading Francos .\n• Obduction has a friendly Hornet Hole hidden away inside a clifftop. The \"bees\" inside are actually intelligent.\n• Pokémon Black and White: The Castelia Gym is, understandably for a Bug gym, themed around a beehive, complete with sticky honey walls to break through and trainers who specialize in using Bug-type Pokémon.\n• Pirates of the Caribbean Online has the Queen's Nest on Isla Perdida.\n• World of Warcraft has the Temple of Ahn'Qiraj, an underground hive for the Old God-worshipping insectoid Qiraji, and Heart of Fear, a palace built out of amber occupied by a related insect race called the mantid.\n• Bugdom has a level and a boss fight that both take place in a beehive. The type of enemies include the flying bees that appeared in the earlier two levels that try to sting you, muscular worker drone bees that fire their stingers at you, and bee larvae with bee heads and stingers sticking out of them; the normal bees and muscular drones die once they lose their stingers. The first level to take place in the beehive also has honey, which if you land in it is a one hit kill as you sink in it and lose a life (unless you have the swim in water-type that would normally kill you cheat on), as for the boss fight you do battle against a queen bee who shoots honey and summons the bee larvae with the heads sticking out.\n• Donkey Kong:\n• Donkey Kong Country 2: Diddy's Kong Quest has Hornet Hole, Rambi Rumble, Parrot-Chute Panic, and a boss level, King Zing Sting, beehive levels inhabited by giant wasps called Zingers.\n• Donkey Kong Country: Tropical Freeze has Beehive Brawl, home to bees as big as Donkey Kong himself.\n• Banjo-Kazooie has this in a very limited fashion in the Click Clock Wood. There are also the highest parts of Cloud Cuckooland's mountain in Banjo-Tooie.\n• Conker's Bad Fur Day has the eponymous character going into a hornet's hangout to rescue a beehive, both at the start of the Windy chapter and much later when it's revisited for its conclusion. Here the bees are pretty OK. Hornets aren't.\n• Super Mario Bros.:\n• Super Mario Galaxy has Honeyhive Galaxy and the Gold Leaf Galaxy, airy woodland areas populated by giant talking bees, and the Honeyclimb Galaxy, made up of enormous walls of honeycomb. Super Mario Galaxy 2 features the more pastoral Honeybloom and Honeyhop galaxies. The bees are friendly, and the sticky honey can be used to scale walls when the Bee powerup is in use.\n• Super Mario Land 2: 6 Golden Coins: Stage 4 of the Tree Zone takes place inside a giant beehive built within an enormous tree, and sees Mario menaced by a variety of giant bees, grubs and skeletal bees.\n• Mario Kart 7: The battle stage Honeybee Hive, which takes place inside a giant hollow beehive and houses a swarm of the bee-like Stingby enemies that will damage any driver they come in contact with.\n• Mario Pinball Land has two beehives on the Grass Table.\n• Sonic Lost World has this in Desert Ruins Zone 2, technically a mach speed-type of level with bee-like robots while speeding through multiple beehives, before coming face-to-face with Zomom.\n• Spelunky: Downplayed in Spelunky HD: sometimes a jungle level will have a beehive area, containing some honey patches that cause items to stick, a number of giant bees , and a queen bee . The queen drops royal jelly when killed, which is the second most potent source of healing in the game.\n• Spyro: Enter the Dragonfly has the Honey Marsh level, which is this crossed with Bubblegloop Swamp. A level of the same name appears in the earlier GBA game Spyro: Season of Ice, but it's a straighter example in that game.\n• Yooka-Laylee plays with this by making the indoor portions of the Hub Level, Hivory Towers, an industrial/corporate building with a honeycomb theme, where everything from doorways to bookshelves are hexagons. It is indeed run by a giant bee — the game's Big Bad — but he's also the only one in the game.\n• Hollow Knight has The Hive in the Kingdom's Edge region.\n• Meteos has Hanihula, an entire planet with this theme. The intelligent bees that live on it are actually friendly and happy, however (its sound effects set even consists of children laughing and people cheering), and developed space travel to find things to pollinate on other planets. Nevertheless, half of the planet's surface is covered in beehives.\n• Dungeon Crawl: The Hive. Hope you like fighting killer bees.\n• Mass Effect 2: The derelict Collector Ship can be considered this due to their general layout and hive-like design, including millions of victims in pods upon the walls.\n• Might and Magic VIII has the Wasp Nest in the Alvar region, which is the nest of the Alvarian giant wasps. The main special thing is that it is set up so that to navigate inside the nest requires Jump magic (your ordinary jumps are not high enough), though fortunately it has several entrances, allowing parties with Fly magic/special abilities (which only works outdoors) to reach most parts of it by taking detours on the outside.\n• Thunderscape: Entomorph: Plague of the Darkfall has a hive of giant bee/wasp-like creatures called Panorpids as one of its dungeons.\n• Terraria has beehives that generate in the underground jungle. They're small, but breaking the hive blocks spawns bees that attack you, and killing the larva found inside summons the giant queen bee boss.\n• The Nui-Rama hive in the Mata Nui Online Game.\n• The obscure game Zapper has one called Crazy Apiary. It also doubled as an Unexpected Shmup Level.\n• In the Discworld, the gnome pest controller Wee Mad Arthur likes to go on what, for somebody his size, are big game hunts. He describes his strategy for dealing with wasps: which is to fight his way into the hive, killing wasps in hand-to-sting combat, and planting substantially large bombs (heavily modified fireworks), set the fuses, then to fight his way out again before they explode. He says it isn't sporting to do anything other than bring them down on the wing, and brandishes a tailor-made very small crossbow to prove the point.\n• Dungeons & Dragons: In adventure \"WG7 Castle Greyhawk\", in the level \"Queen of the Honeybee Hive\", the PCs must fight a group of opponents with bee-themed names.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/HornetHole", "media_links": ["/pmwiki/pmwiki.php/VideoGame/DonkeyKongCountry2DiddysKongQuest", "/pmwiki/pmwiki.php/VideoGame/FreedomPlanet", "/pmwiki/pmwiki.php/VideoGame/MetroidOtherM", "/pmwiki/pmwiki.php/VideoGame/LittleBigAdventure", "/pmwiki/pmwiki.php/VideoGame/Obduction", "/pmwiki/pmwiki.php/VideoGame/PokemonBlackAndWhite", "/pmwiki/pmwiki.php/VideoGame/BioShock1", "/pmwiki/pmwiki.php/VideoGame/Turok", "/pmwiki/pmwiki.php/VideoGame/Frogger", "/pmwiki/pmwiki.php/VideoGame/PiratesOfTheCaribbeanOnline", "/pmwiki/pmwiki.php/VideoGame/WorldOfWarcraft", "/pmwiki/pmwiki.php/VideoGame/Bugdom", "/pmwiki/pmwiki.php/Franchise/DonkeyKong", "/pmwiki/pmwiki.php/VideoGame/DonkeyKongCountry2DiddysKongQuest", "/pmwiki/pmwiki.php/VideoGame/DonkeyKongCountryTropicalFreeze", "/pmwiki/pmwiki.php/VideoGame/BanjoKazooie", "/pmwiki/pmwiki.php/VideoGame/BanjoTooie", "/pmwiki/pmwiki.php/VideoGame/ConkersBadFurDay", "/pmwiki/pmwiki.php/Franchise/SuperMarioBros", "/pmwiki/pmwiki.php/VideoGame/SuperMarioGalaxy", "/pmwiki/pmwiki.php/VideoGame/SuperMarioGalaxy2", "/pmwiki/pmwiki.php/VideoGame/SuperMarioLand2SixGoldenCoins", "/pmwiki/pmwiki.php/VideoGame/MarioKart7", "/pmwiki/pmwiki.php/VideoGame/MarioPinballLand", "/pmwiki/pmwiki.php/VideoGame/SonicLostWorld", "/pmwiki/pmwiki.php/VideoGame/Spelunky", "/pmwiki/pmwiki.php/VideoGame/SpyroEnterTheDragonfly", "/pmwiki/pmwiki.php/VideoGame/SpyroSeasonOfIce", "/pmwiki/pmwiki.php/VideoGame/YookaLaylee", "/pmwiki/pmwiki.php/VideoGame/HollowKnight", "/pmwiki/pmwiki.php/VideoGame/Meteos", "/pmwiki/pmwiki.php/VideoGame/Nethack", "/pmwiki/pmwiki.php/VideoGame/DungeonCrawl", "/pmwiki/pmwiki.php/VideoGame/MassEffect2", "/pmwiki/pmwiki.php/VideoGame/MightAndMagic", "/pmwiki/pmwiki.php/Franchise/Thunderscape", "/pmwiki/pmwiki.php/VideoGame/Terraria", "/pmwiki/pmwiki.php/VideoGame/BIONICLE", "/pmwiki/pmwiki.php/VideoGame/Zapper", "/pmwiki/pmwiki.php/Literature/Discworld", "/pmwiki/pmwiki.php/TabletopGame/DungeonsAndDragons"], "non_media_links": ["/pmwiki/pmwiki.php/Main/Pun", "/pmwiki/pmwiki.php/Main/PlatformGame", "/pmwiki/pmwiki.php/Main/TheMaze", "/pmwiki/pmwiki.php/Main/AnimalGenderBender", "/pmwiki/pmwiki.php/Main/ThatOneLevel", "/pmwiki/pmwiki.php/Main/TheSwarm", "/pmwiki/pmwiki.php/Main/HiveMind", "/pmwiki/pmwiki.php/Main/SynchronizedSwarming", "/pmwiki/pmwiki.php/Main/WickedWasps", "/pmwiki/pmwiki.php/Main/BeeBeeGun", "/pmwiki/pmwiki.php/Main/BeeAfraid", "/pmwiki/pmwiki.php/Main/JungleJapes", "/pmwiki/pmwiki.php/Main/BigCreepyCrawlies", "/pmwiki/pmwiki.php/Main/TropeNamer", "/pmwiki/pmwiki.php/Main/BookEnds", "/pmwiki/pmwiki.php/Main/NightOfTheLivingMooks", "/pmwiki/pmwiki.php/Main/DownplayedTrope", "/pmwiki/pmwiki.php/Main/VideoGameRemake", "http://spelunky.wikia.com/wiki/Killer_Bee", "http://spelunky.wikia.com/wiki/Queen_Bee", "/pmwiki/pmwiki.php/Main/BubblegloopSwamp", "/pmwiki/pmwiki.php/Main/HubLevel", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/ExactlyWhatItSaysOnTheTin", "/pmwiki/pmwiki.php/Main/BeeAfraid", "/pmwiki/pmwiki.php/Main/MamaBear", "/pmwiki/pmwiki.php/Main/BigCreepyCrawlies", "/pmwiki/pmwiki.php/Main/UnexpectedShmupLevel"]}