{"title": "I Approved This Message", "content": "In the United States, a portion of the Bipartisan Campaign Reform Act, otherwise known as the McCain-Feingold Act, requires that a political candidate for a federal office - or the group that produced it - give \"a statement by the candidate that identifies the candidate and states that the candidate has approved the communication.\" This means an ad has to say something like, \"I'm Cole Rupt, and I approved this message.\" This only applies to candidates for Congress and the presidency.note Or, theoretically, candidates for Vice President. But in practice, VP candidates simply act as Number Two to the presidential candidates, and never run their own separate campaigns. Thus it'll always be the presidential candidate who \"approves this message,\" even if their running mate is providing the sound bites for the ad. It does not apply to candidates for state or local office, or to anything other than politicians.\n\nThe provision was added so that political candidates would be less likely to fund attack ads or ads with questionable claims. However, that doesn't stop outside parties like interest groups from running their own ads: the NRA or AARP could run an ad that says \"Cole Rupt is a brain-eating alien,\" but it would obviously not have opposing candidate Bea Ribe's \"approval.\" These must be followed by a statement along the lines of \"Paid for by the Republicratic National Committee\", or \"The S.P.E.B.S.Q.S.A.note Society for the Preservation and Encouragement of Barber Shop Quartet Singing in America, Inc. has paid for this message and is responsible for its content\".\n\nHowever, a number of ads for things other than politicians are parodying this requirement, and including it on them even though it is not applicable to anything else. So some ad will say \"TropeCo's tropes are tropier. We're TropeCo, and we approved this ad.\" Oh yeah, right, an ad by some company might not be approved by them.\n\nNaturally, you most likely will see these types of ads around election season, when the campaign commercials on everyone's mind, and people are most likely to get the reference.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/IApprovedThisMessage", "media_links": ["/pmwiki/pmwiki.php/Creator/DonaldTrump", "/pmwiki/pmwiki.php/Franchise/SpiderMan", "/pmwiki/pmwiki.php/ComicBook/BlackestNight", "/pmwiki/pmwiki.php/Creator/GeoffJohns", "/pmwiki/pmwiki.php/ComicBook/TheAvengers", "/pmwiki/pmwiki.php/Film/Machete", "/pmwiki/pmwiki.php/Series/SaturdayNightLive", "/pmwiki/pmwiki.php/Creator/FOX", "/pmwiki/pmwiki.php/Series/TheXFactor", "/pmwiki/pmwiki.php/Series/HowIMetYourMother", "/pmwiki/pmwiki.php/Series/TheWestWing", "/pmwiki/pmwiki.php/Literature/Goosebumps", "/pmwiki/pmwiki.php/VideoGame/WorldOfWarcraft", "/pmwiki/pmwiki.php/Creator/ChuckNorris", "/pmwiki/pmwiki.php/VideoGame/WeHappyRestaurant", "/pmwiki/pmwiki.php/Website/YouTube", "/pmwiki/pmwiki.php/WesternAnimation/RobotChicken", "/pmwiki/pmwiki.php/WesternAnimation/TransformersAnimated"], "non_media_links": ["/pmwiki/pmwiki.php/Main/StevenUlyssesPerhero", "/pmwiki/pmwiki.php/Main/NumberTwo", "/pmwiki/pmwiki.php/Main/FunWithAcronyms", "/pmwiki/pmwiki.php/UsefulNotes/BillClinton", "/pmwiki/pmwiki.php/UsefulNotes/BarackObama", "/pmwiki/pmwiki.php/Main/AttackOfThePoliticalAd", "/pmwiki/pmwiki.php/UsefulNotes/HillaryClinton", "/pmwiki/pmwiki.php/UsefulNotes/HillaryRodhamClinton", "/pmwiki/pmwiki.php/UsefulNotes/BarackObama", "/pmwiki/pmwiki.php/SelfDemonstrating/Deadpool", "/pmwiki/pmwiki.php/Wrestling/WWE", "/pmwiki/pmwiki.php/Wrestling/JimFullington", "/pmwiki/pmwiki.php/Wrestling/ChrisBenoit", "/pmwiki/pmwiki.php/Wrestling/Kane", "/pmwiki/pmwiki.php/Wrestling/Umaga", "https://www.youtube.com/watch?v=57oUeO_OJMg", "http://sendables.jibjab.com/originals/good_to_be_in_dc", "https://www.youtube.com/watch?v=eq0tk0vB7CE", "/pmwiki/pmwiki.php/Wiki/TVTropes"]}