{"title": "You Know What to Do", "content": "A Stock Phrase, generally delivered by a superior or employer to their subordinates, implying they engage in some piece of procedure or protocol that they are familiar with. Expect it to be immediately followed by a Smash Cut to the characters engaging in the implied act. Can be used dramatically or comically, but either way the point of the phrase is either a simple ploy to keep the audience from knowing what the characters are up to, or just to avoid the redundancy of having a character describe an act, only to immediately show it being carried out.\n\nIf you think about it, this is really a very odd phrase to use in a regular professional capacity, as that kind of vagary can easily lead to misunderstandings and somewhat belies the usefulness of giving orders in the first place. But it can be justified when the order is given over an insecure channel, like a public telephone, to avoid incrimination. Often the \"you know what to do\" involves killing somebody. May be an attempt to maintain Plausible Deniability. May involve nonverbal communication like handing someone a gun. May be subverted, if the recipient decides to turn the tables and do something unexpected, or just misunderstands and takes the phrase in a different way than intended. Still, despite its particular age, this trope is more often played straight than lampshaded.\n• In Dragon Bones, Oreg to Ward. Subverted in that he's Ward's slave, not his boss. Played straight in that it involves killing. Killing Oreg, that is.\n• Beantown Tony Lupino: If you don't hear from me, you know what to do.\n• California Frontier (1938) Mal Halstead: And in case you should happen to find any Mexicans camping out on the place, you know what to do. \n\nBuck Pearson: Why, no. Just exactly what do I do? \n\nMal Halstead: Throw 'em off! They don't belong there. And if they holler, gun 'em off! This land is for Americans.\n• Cats & Dogs Mr. Tinkles: If they ever show their faces again, you know what to do. \n\nCalico: Yes. Tell them to wash with a loofah sponge. Kidding! Hello? Joke!\n• Hot Shots! Part Deux Topper Harley: You're the only one that knows how to get to the copter pad. If I'm not there in 15 minutes, you know what to do. \n\nColonel Walters: Yeah, we get the hell out of here! \n\nTopper Harley: No! Wait another 15 minutes!\n• Revenge of the Ninja Braden: Keep an eye on the girl and don't let her out of the house. If she gives you any trouble you know what to do.\n• Toy Story Woody: Sergeant, establish a recon post downstairs. Code Red. You know what to do.\n• War and Peace (1956) Dolokhov: [re: French prisoners] Take them away! You know what to do with them!\n• In Hot Fuzz, after Chief Inspector Butterman is finally convinced that the scene of an \"accident\" might be a murder, he rattles off orders to each of the police officers on the scene, finishing with this phrase to the two main characters. Cut to them standing around, holding down the crime scene.\n• Subverted in Reign of Fire: Quinn: Anything happens, you know what to do. Creedy: Errr... no, I have no idea.\n• Rico's sargeant in the film version of Starship Troopers utters this but the movie makes it pretty clear what that means.\n• The Witch says this to Maugrim in The Lion, the Witch, and the Wardrobe as she sends him to hunt down the Pevensies.\n• Kyle XY episode \"The List Is Life\" Emily Hollander: You know what to do. \n\nJessi XX: Mingle and blend in.\n• Variations of this were used all the time on The West Wing. The implication is that the characters were all so smart and good at their jobs and in tune with each other that they could leave some things unsaid. Unfortunately, the audience sometimes ended up confused.\n• Example: Charlie (black) goes out with Zoey (white, and the President's daughter). Bartlett tells him: \"You go out with Zoey, you're gonna get your picture taken. And you'll get letters. You know what to do with them?\" Charlie just nods. The standard listen-to-your-heart Aesop would be \"throw them in the trash\", and many viewers might assume that's what is meant. But in the West Wing, of course, the real answer is \"Hand them in to the Secret Service for exhaustive forensic analysis!\"\n• Angel. Used for a Bait-and-Switch in \"Double or Nothing\". Angel is playing an Absurdly High-Stakes Game that if he loses will cost him his soul (which will turn him evil). He hands Cordy a wooden stake and says she knows what to do if that happens, implying a Staking the Loved One scene. When Angel does lose the game, Cordy instead rams the stake through the Big Bad's palm, holding him in place so Angel can lop off his head.\n• Red vs. Blue, Sarge gives a Rousing Speech in Revelation (Season 8), ending with Sarge: You do, what you gotta do Private Grif. Grif: (groans) I'll go get my car keys.\n• Family Guy Lois Griffin: Peter, give Chris a spanking. \n\nPeter Griffin: Okay. Chris, I'm watching the game. You know what to do. \n\n[Chris begins spanking himself]\n• Futurama: In \"A Fishful of Dollars\", Mom uses a security video to instruct her sons on how to bankrupt the newly-rich Fry. Mom: You know what needs to be done. Mom: GET HIS PIN NUMBER, YOU IDIOTS!\n• In Donkey Kong Country, King K. Rool sends Klump and Krusha find out what's causing a banging noise that's keeping all of Kongo-Bongo Island awake (it's Eddie the Mean Old Yeti, by the way). While communicating with them, K. Rool notices the Crystal Coconut flying around. K. Rool: It's heading for the Barrel Factory! You know what to do! Klump: Yes, sir! Put a stop to the banging, sir! K. Rool: I'll take care of the yeti, you get me that coconut! Now!\n• In the intro to Brain Dead 13, this one is spoken by Dr. Nero Neurosis to Fritz when describing his plan to kill Lance after fixing his computer.\n• During a Salmon Run shift in Splatoon 2, this is how Mysterious Employer Mr. Grizz instructs your crew to deal with a Cohock Charge. Considering that he gives you a cannon specifically for this event, it's not hard to figure out what he wants you to do.\n• Zero Wing You know what you doing.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/YouKnowWhatToDo", "media_links": ["/pmwiki/pmwiki.php/VideoGame/Splatoon2", "/pmwiki/pmwiki.php/Literature/DragonBones", "/pmwiki/pmwiki.php/Film/CatsAndDogs", "/pmwiki/pmwiki.php/Film/HotShotsPartDeux", "/pmwiki/pmwiki.php/WesternAnimation/ToyStory", "/pmwiki/pmwiki.php/Film/WarAndPeace", "/pmwiki/pmwiki.php/Film/HotFuzz", "/pmwiki/pmwiki.php/Film/ReignOfFire", "/pmwiki/pmwiki.php/Film/StarshipTroopers", "/pmwiki/pmwiki.php/Literature/TheLionTheWitchAndTheWardrobe", "/pmwiki/pmwiki.php/Series/KyleXY", "/pmwiki/pmwiki.php/Series/TheWestWing", "/pmwiki/pmwiki.php/Series/Angel", "/pmwiki/pmwiki.php/WesternAnimation/FamilyGuy", "/pmwiki/pmwiki.php/WesternAnimation/Futurama", "/pmwiki/pmwiki.php/WesternAnimation/DonkeyKongCountry", "/pmwiki/pmwiki.php/VideoGame/BrainDead13", "/pmwiki/pmwiki.php/VideoGame/KingdomHeartsII", "/pmwiki/pmwiki.php/VideoGame/Splatoon2", "/pmwiki/pmwiki.php/VideoGame/ZeroWing"], "non_media_links": ["/pmwiki/pmwiki.php/Main/StockPhrase", "/pmwiki/pmwiki.php/Main/SmashCut", "/pmwiki/pmwiki.php/Main/FridgeLogic", "/pmwiki/pmwiki.php/Main/JustifiedTrope", "/pmwiki/pmwiki.php/Main/DeadlyEuphemism", "/pmwiki/pmwiki.php/Main/PlausibleDeniability", "/pmwiki/pmwiki.php/Main/UnspokenPlanGuarantee", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/MercyKill", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/BaitAndSwitch", "/pmwiki/pmwiki.php/Main/AbsurdlyHighStakesGame", "/pmwiki/pmwiki.php/Main/StakingTheLovedOne", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/WebOriginal", "/pmwiki/pmwiki.php/Machinima/RedVsBlue", "/pmwiki/pmwiki.php/Main/RousingSpeech", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/CorruptCorporateExecutive", "/pmwiki/pmwiki.php/Main/HairTriggerTemper", "/pmwiki/pmwiki.php/Main/SurroundedByIdiots", "/pmwiki/pmwiki.php/Main/MacGuffin", "/pmwiki/pmwiki.php/Main/ItMakesSenseInContext", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/YouHaveOutlivedYourUsefulness", "/pmwiki/pmwiki.php/Main/MysteriousEmployer", "/pmwiki/pmwiki.php/Main/BFG", "/pmwiki/pmwiki.php/Main/ThereIsNoKillLikeOverkill", "/pmwiki/pmwiki.php/Main/TranslationTrainWreck"]}