{"title": "Success Symbiosis", "content": "Two characters are each doing their thing, whether that's saving the world or just trying not to get fired. For some reason, it turns out that neither can succeed if the other fails. However, the dramatic element is that they can't just cooperate and get both tasks done. It has to be done discreetly, so one or both has to help the other secretly in order to achieve their own goal.\n• In at least some versions of the story, Superman uses Lois Lane to scout out the baddies and types her papers as Clark Kent in order to keep it that way.\n• In Batman: The Dark Knight Returns, once Batman had retired, so did the Joker. And once he comes out of retirement, The Joker follows suit.\n• The Joker's line (\"You complete me\") in The Dark Knight could be seen as this trope.\n• In Batman Begins, WayneCo R&D Director Fox provides much of Batman's gear, so Bruce Wayne has to keep him employed over the objections of the board.\n• Sue-Ellen from Don't Tell Mom the Babysitter's Dead gets a job in the fashion industry by lying about her age and keeps it because a mostly overlooked employee from another department is doing all the hard stuff for her.\n• In the Discworld's Ankh-Morpork, Commander Vimes pursues the law without favor, annoys the rich and power, upsets the finely-balanced alliances of the city's politics and generally makes a nuisance of himself to Lord Vetinari by thumping through his court like a bull in a china shop. This is exactly why Vetinari likes having him around.\n• Author Len Deighton's No Name Given spy once remarks to someone that he's well known to be a loose cannon who the boss can barely keep under control. He mentions that this is his boss's protection, and the government's protection, as they can disown him if needed. Everyone's happy with this, he gets to do what he has to to get the job done and they can pretend to be Shocked, Shocked!, if he gets in trouble.\n• In Buffy the Vampire Slayer Season 5, this ends up being the case between Buffy and the Watcher's Council. Buffy points out that she needs them to identify Glory but they need her or they're just a bunch of old guys in tweed waiting for her (well, actually, they're waiting for Faith) to die because without a Slayer they have no purpose. So the Council hires back Giles (and after his prompting, gives him all the pay he would have gotten since he got fired to that moment) and in return they tell her who Glory is (a hellgod).\n• In Hogan's Heroes, the heroes frequently have to protect Klink, Schultz, or both from the Gestapo or SS; if Klink and Schultz were replaced by more competent guards, it'd mean the end of operations.\n• On The Office (US), almost everyone else is this for Michael Scott.\n• On the FX show Terriers, Hank, an ex-cop and low-level P.I., Frames the Guilty Party in a murder and then tips off his ex-partner Gustafson (who's still a cop and was investigating the crime) about new evidence so he can arrest (and convict) the killer. Gustafson gets great notices for solving the murder, only for something else to unexpectedly go wrong, putting him, Hank, and the whole case in jeopardy. Not wanting to get himself involved, Gustafson tells Hank he has twenty four hours to fix it. If Hank can't, not only would he be investigated for (and charged with) planting evidence, he'll ruin his friend's career too, for being linked to a frame-up.\n• Shiki Misaki from The World Ends with You is this to her best friend Eri, helping to make the materials for her friend's fashion hobby and generally being a supportive, admiring friend.\n• In Inspector Gadget, either M.A.D. or Gadget himself would capture or sideline Penny and Brain, who had to help Gadget despite their predicament or escape to save him.\n• One documentary claimed that, during the Revolutionary War, George Washington had a trusted slave and several officers with him that he was willing to defy Congress to keep around.\n• According to Balance Between Good and Evil, good needs evil in order to be \"good\" and vice versa.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/SuccessSymbiosis", "media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/Franchise/Superman", "https://tvtropes.org/pmwiki/pmwiki.php/Film/TheDarkKnight", "https://tvtropes.org/pmwiki/pmwiki.php/Film/BatmanBegins", "https://tvtropes.org/pmwiki/pmwiki.php/Franchise/Batman", "https://tvtropes.org/pmwiki/pmwiki.php/Film/DontTellMomTheBabysittersDead", "https://tvtropes.org/pmwiki/pmwiki.php/Literature/Discworld", "https://tvtropes.org/pmwiki/pmwiki.php/Creator/LenDeighton", "https://tvtropes.org/pmwiki/pmwiki.php/Film/Casablanca", "https://tvtropes.org/pmwiki/pmwiki.php/Series/BuffyTheVampireSlayer", "https://tvtropes.org/pmwiki/pmwiki.php/Series/HogansHeroes", "https://tvtropes.org/pmwiki/pmwiki.php/Series/TheOfficeUS", "https://tvtropes.org/pmwiki/pmwiki.php/Series/Terriers", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/TheWorldEndsWithYou", "https://tvtropes.org/pmwiki/pmwiki.php/WesternAnimation/InspectorGadget"], "non_media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/Main/BeleagueredAssistant", "https://tvtropes.org/pmwiki/pmwiki.php/Main/ComicBooks", "https://tvtropes.org/pmwiki/pmwiki.php/Comicbook/BatmanTheDarkKnightReturns", "https://tvtropes.org/pmwiki/pmwiki.php/Main/Film", "https://tvtropes.org/pmwiki/pmwiki.php/Main/Literature", "https://tvtropes.org/pmwiki/pmwiki.php/Main/NoNameGiven", "https://tvtropes.org/pmwiki/pmwiki.php/Main/LiveActionTV", "https://tvtropes.org/pmwiki/pmwiki.php/Main/FramingTheGuiltyParty", "https://tvtropes.org/pmwiki/pmwiki.php/Main/RaceAgainstTheClock", "https://tvtropes.org/pmwiki/pmwiki.php/Main/VideoGames", "https://tvtropes.org/pmwiki/pmwiki.php/Main/WesternAnimation", "https://tvtropes.org/pmwiki/pmwiki.php/Main/RealLife", "https://tvtropes.org/pmwiki/pmwiki.php/UsefulNotes/ConspiracyTheories", "https://tvtropes.org/pmwiki/pmwiki.php/Main/Tropes", "https://tvtropes.org/pmwiki/pmwiki.php/Main/BalanceBetweenGoodAndEvil"]}