{"title": "Self Promotion Disguised As News", "content": "When a TV news show runs a feature on a TV program that shows on the same channel, it is usually to promote said program.\n\nSome of these are more subtle than others. Common variations are;\n• \"Tropey the Wonder Dog is breaking all ratings records!\"\n• \"The little-known true story behind critical darling Tropey the Wonder Dog!\"\n• \"Awww lookit da widdle doggies they're training to appear in Tropey the Wonder Dog!\"\n• \"The season premiere of Tropey the Wonder Dog is airing on the new channel we're launching tonight!\"\n\nSee also Advertising Disguised as News, when a blatant advertisement for an outside product/service is presented as editorial content on a TV program/etc.\n• The entire BBC News coverage of the new series of Doctor Who can be described in this category. (In fact, hardly a day goes by when the BBC 6 O'clock News doesn't have at least one item which turns out to be an extended trailer for an upcoming documentary.)\n• Occasionally slightly more justified when they're lead-ins to investigative journalism shows like Panorama. Then it tends to be more in the category of \"genuine news story followed by in-depth investigative program on the same subject\".\n• On many CBS affiliates, episodes of CSI were followed by the local news, which includes a feature piece on real-world people who practice the featured sexual fetish of the week. They've presumably stopped now, if only because CSI grew out of that phase.\n• CBS affiliates also love to air news stories about Survivor. Bonus points because, many times, the actual events happened months ago.\n• The Talk is pretty much a Big Brother aftershow the day after eliminations.\n• Similarly, NBC's Today loves to do cross-promotion of other shows. Or, on Earth Day, NBC Universal's efforts to Go Green\u0099.\n• Ditto for Good Morning America on ABC, which has shilled countless productions from Disney (ABC's parent company) and its other subsidiaries. Perhaps most notable of these is the Frozen sing-along in the wake of that film's massive Sleeper Hit popularity in early 2014.\n• During the buildup to the premieres of The Tonight Show with Conan O'Brien and The Jay Leno Show the two hosts toured every NBC affiliate from Aberdeen to Yakima so NBC could kiss up to every local anchor they could find and promote the shows in interviews that made Byron Allen look like Edward R. Murrow. If they couldn't get the host to the site...they flew the anchors to an O&O station so they could still do the kiss-up interview.\n• Fox News loves to do this with Fox Network shows, especially 24, one time even giving a plot summary of the show as a question in a Republican debate.\n• If American Idol had a contestant from the vicinity of the local Fox affiliate, they would cover them in detail. For that matter, some affiliates aired fluff pieces about Idol regardless of whether or not there are any local contestants.\n• One good example has come out of this; in the wake of the success of America's Most Wanted, some Fox affiliates have done their own, localized versions of the concept during newscasts, where lower-profile criminals not of national interest get highlighted to either turn themselves in, or encourage members of the public call in tips to catch them. One such version, KCPQ's Washington's Most Wanted, still airs to this day as a standalone program, even with the cancellation of the original series.\n• Similarly, if an Extreme Makeover: Home Edition house was being built, you could expect no less than 10 minutes per newscast of live cut-ins of the building site from the local ABC affiliate.\n• ABC affiliates do this with Dancing with the Stars.\n• All of Australia's commercial stations do this way too often. It gets especially annoying when they report the winner of Australian Idol, as if anyone who cared hadn't watched the show.\n• The ABC did this promoting their documentary The Howard Years during the 7 o'clock news.\n• In a September 2011 episode of Media Watch, host Jonathan Holmes satirised and mocked this trope to hell and back when discussing how an ABC radio channel had devolved into doing it.\n• While holding its contest to determine the new opening theme of Hockey Night in Canada, CBC promoted the contest and the competing composers with coverage on its news site.\n• Local news programs airing after Sunday or Monday night (American) football sometimes make the football game the top story. This, when the time schedule of football games all but guarantee that anyone who watches the news on that channel knows how the game ended.\n• In a variant of this, in the days before other football scores were reported continuously in the crawl during live games, networks showing a Sunday afternoon football game would tease the viewers to tune in at halftime to see the scores and highlights of other games. After the obligatory commercial break, the halftime show would begin by giving the score and highlights—of the game the viewers had just been watching.\n• Variant: For some time between 2005 and 2007, the then-CEO of NBC, Bob Wright, used Newsweek and Channel 3 News as excuses to promote his highly-dubious charity Autism Speaks. He was eventually found out and was fired in February 2007, but promotion of the organization on Channel 3 News has been noted as late as October 2008.\n• Geraldo Rivera has built his entire career on this.\n• Back during the Tech Boom, ABC News actually interviewed a sock puppet (a literal one, that is, though it was a Sockpuppet as well...) to push the parent company's investment in Pets.com. It didn't work out.\n• Studio Aperto, the news show of the Italian, Berlusconi-owned channel Italia 1, is practically MADE of this. A typical show is composed of 10% genuine news and 90% tabloid stories about people or TV programs closely related to Mediaset (the parent company). It's no wonder that they broadcast it in a timeslot (6 PM) filled with entertainment programs, as people view it hardly as a news show.\n• It should be noted, however, that nearly every Italian news show (at least those in the dinner timeslot) include a \"sneak preview\" of the following program, often treated in the same way as a normal coverage.\n• A CTV station once aired a \"Consumer Alert\" story that was essentially a Product-Promotion Parade for The Source, an electronics store chain (and originally the Canadian franchises of RadioShack) also owned by the network's parent company Bell.\n• Similarly, another CTV show featured a \"review\" for a mobile Wi-Fi hotspot device which made sure to specifically emphasize that it gives you internet access on the Bell LTE network, and nothing else apparently.\n• CTV's entertainment show eTalk did a special episode devoted to the Toronto premiere of the stage musical adaptation of Meat Loaf's iconic album Bat Out of Hell. What it failed to mention was that Bell Media has a stake in the production.\n• Now Bell's channels have been doing a series of extended commercials under the title \"Tech Untangled\" — which masquerade as an interstitial discussing a new form of technology before eventually revealing that this would not be possible without the power of Bell's wireless network.\n• Common practice of Globo Corporation, the most powerful television network of Brazil. It causes an interesting cycle, which causes people to get interested in the subject in such a way that even other networks and media outlets have to cover it if they want to get viewers.\n• The most frequent use of this practice is to promote telenovelas; is it set in a different country? Expect to see stories about said country. Has a main character succumb to an uncommon disease as a Ratings Stunt? Expect to see stories about what it is and how you can treat it. They even all but give out life stories for new \"celebrities\" who appear in commercials from their sponsors.\n• A common feature in magazines, where the ad is generally followed by a tear-off subscription card. Although this trope is justified in that a single copy of a magazine would be read by many people.\n• A news radio station in Regina considers someone winning $25,000 in a contest on a sister station to be a news headline. It's big, but still...\n• Ant 1, a Greek TV channel, aired a few ads like this (but better) to promote the new internet channel Netwix (ran by said TV channel).\n• Now that Yahoo! has \"Yahoo! Original\" shows, it includes a plot synopsis for its shows and a link to that show in a way indistinguishable from actual news stories.\n• Tribune does this a lot on local newscasts of their owned channels for shows airing on WGN America.\n• Averted by the E.W. Scripps Company-owned ABC station KGTV in San Diego after it was acquired by them, which has to disclaim in health-related reports on its newscasts that it is not affiliated with the local Scripps Health system. The system was named for and formed through the philanthropic efforts of Ellen Browning Scripps, the sister of the media company's namesake.\n• The Murdoch papers in the UK, epecially the Sun, are known for running news stories that can be summed up as \"This is what you're missing if you don't watch Sky\" (The Times tends to be subtler about it.) Private Eye has a regular column recording these under the title \"I Sky\". During the period when Richard Desmond owned Channel Five, the Star and Express would do the same thing.\n• This was already been parodied as far back as 1991, when one of the between-story squibs in Temps was a Sun article on \"20 Things You Never Knew About Paranorms\", and no. 19 was that there was a documentary about them on Sky One that night.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/SelfPromotionDisguisedAsNews", "media_links": ["/pmwiki/pmwiki.php/Literature/AmericaTheBook", "/pmwiki/pmwiki.php/Creator/TheBBC", "/pmwiki/pmwiki.php/Series/DoctorWho", "/pmwiki/pmwiki.php/Series/Panorama", "/pmwiki/pmwiki.php/Creator/CBS", "/pmwiki/pmwiki.php/Series/CSI", "/pmwiki/pmwiki.php/Series/Survivor", "/pmwiki/pmwiki.php/Series/BigBrother", "/pmwiki/pmwiki.php/Creator/NBC", "/pmwiki/pmwiki.php/Series/Today", "/pmwiki/pmwiki.php/Disney/Frozen", "/pmwiki/pmwiki.php/Series/TheTonightShow", "/pmwiki/pmwiki.php/Creator/ConanOBrien", "/pmwiki/pmwiki.php/Creator/JayLeno", "/pmwiki/pmwiki.php/Creator/Fox", "/pmwiki/pmwiki.php/Series/TwentyFour", "/pmwiki/pmwiki.php/Series/AmericanIdol", "/pmwiki/pmwiki.php/Series/AmericasMostWanted", "/pmwiki/pmwiki.php/Series/ExtremeMakeoverHomeEdition", "/pmwiki/pmwiki.php/Creator/ABC", "/pmwiki/pmwiki.php/Series/DancingWithTheStars", "/pmwiki/pmwiki.php/Creator/TheABC", "/pmwiki/pmwiki.php/Series/MediaWatch", "/pmwiki/pmwiki.php/Series/HockeyNightInCanada", "/pmwiki/pmwiki.php/Creator/CTV", "/pmwiki/pmwiki.php/Music/BatOutOfHell", "/pmwiki/pmwiki.php/Creator/Sky", "/pmwiki/pmwiki.php/Creator/ChannelFive", "/pmwiki/pmwiki.php/Literature/Temps"], "non_media_links": ["/pmwiki/pmwiki.php/Main/TropeyTheWonderDog", "/pmwiki/pmwiki.php/Main/YetAnotherBabyPanda", "/pmwiki/pmwiki.php/Main/AdvertisingDisguisedAsNews", "/pmwiki/pmwiki.php/Main/GreenAesop", "/pmwiki/pmwiki.php/Main/SleeperHit", "/pmwiki/pmwiki.php/Main/ByronAllen", "/pmwiki/pmwiki.php/Main/DeadpanSnarker", "/pmwiki/pmwiki.php/SugarWiki/FunnyMoments", "/pmwiki/pmwiki.php/Main/Irony", "/pmwiki/pmwiki.php/Main/Sockpuppet", "/pmwiki/pmwiki.php/Main/ProductPromotionParade", "/pmwiki/pmwiki.php/Main/RatingsStunt", "/pmwiki/pmwiki.php/Main/Ant1", "https://www.youtube.com/watch?v=KweehZCZvBo", "/pmwiki/pmwiki.php/Main/NamesTheSame", "/pmwiki/pmwiki.php/Magazine/PrivateEye"]}