{"title": "Rewritten Pop Version", "content": "When a song, usually from a musical, has a popular version with rewritten lyrics, because the original lyrics were too character-specific or just not commercial enough. This is likely to turn it into a love song if it wasn't originally.\n\nThis phenomenon is related to the Award-Bait Song. See also Forgotten Theme Tune Lyrics, Theme Tune Extended.\n\nFor the inversion, see Repurposed Pop Song.\n• \"Can You Feel The Love Tonight\", \"Circle of Life\" and \"I Just Can't Wait to be King\" all have very different lyrics in The Lion King than the versions sung by Elton John at the end of the film's soundtrack album.\n• \"I Will Always Return\" is about homecoming and family in Spirit: Stallion of the Cimarron. The pop version is a paint-by-numbers love song.\n• Another Disney example is \"Reflection\" from Mulan, the pop version of which was performed by Christina Aguilera.\n• Also from Mulan is the less commonly heard \"True To Your Heart.\" The version that plays over the credits is an exhortation to live honestly and stand by what you believe in. The one in the music video (and on the soundtrack album) says that if you're true to your heart, it will tell you to date the singer.\n• The sequel Mulan II got hit with this too, with \"Like Other Girls\" being changed in the Atomic Kitten cover to reflect their modern desires for freedom (no cameras, no platform shoes, etc.) instead of Chinese princesses escaping the culture standards for women of the time period (get rid of the fan, no escorts, etc.).\n• Transformers: The Movie used a hair-metal version of the show's theme tune, with its full lyrics during the credits.\n• The cafeteria song from My Little Pony: Equestria Girls has a pop version with a live-action music video . Daniel Ingram says he had no involvement in this production.\n• Two of the cut songs from Aladdin, \"Proud of Your Boy\" and \"Call Me a Princess\", were given this treatment, by Clay Aiken and Kerry Butler respectively.\n• Demi Lovato's version of \"Let It Go\" from Frozen changes the latter two lines of the second verse, completely reworks and shortens the bridge, and retains the same chorus lyrics throughout the song.\n• The title song from Help! I'm a Fish was covered bubblegum dance pop style by Creamy of \"I Do, I Do, I Do\" fame, as well as by The Little Trees, and in Dutch by K3.\n• The Special Edition soundtrack to The Little Mermaid includes pop covers of \"Part of Your World\" by Jessica Simpson, \"Under the Sea\" by Raven-Symoné, \"Poor Unfortunate Souls\" by The Jonas Brothers, and \"Kiss the Girl\" by Ashley Tisdale, although only \"Poor Unfortunate Souls\" has its lyrics altered.\n• Moana's soundtrack album, has a pop version of \"You're Welcome\" performed by Jordan Fisher and composer Lin-Manuel Miranda.\n• There's also Alessia Cara's cover of \"How Far I'll Go\", which was released by Disney via Apple Music before the movie version as a preview of the soundtrack.\n• Anastasia's \"Journey to The Past\" was heavily rearranged and given a few new lyrics for its end credits cover by Aaliyah. \"Once upon a December\" also has a pop cover during the credits, by Deana Carter.\n• \"In This Place \" by Julia Michaels, one of the end credits songs from Ralph Breaks the Internet, was given different lyrics than those of the original song, \"A Place Called Slaughter Race \", which has Lyrical Dissonance as it was sung from the perspective of a Tomboy Princess with a desire to live in a violent, chaotic world.\n• The intro song \"Couldn't Be Better\" from Uglydolls has a pop cover exclusive to the movie's soundtrack. It keeps a fair amount of the lyrics of the original, and is also sung by Kelly Clarkson, Moxy's voice actress in the movie, meaning she technically gets two versions of the song to sing.\n• An American Tail is well-known for the pop version of one of the songs from the film, \"Somewhere Out There\", which was preformed by Linda Ronstadt and James Ingram, that played during the credits of the film. It became so popular that it would later break free of its' origins and become one of the 80's defining songs.\n• \"The Bad In Every Man\" from Manhattan Melodrama was rewritten at MGM's request as \"Blue Moon\" (actually the fourth lyric written for the tune), which went on to become a massive hit.\n• Rodgers and Hart did this earlier, if less drastically, with \"Isn't It Romantic?\" and \"Lover\" from Love Me Tonight. In the movie, the former song is worked into an elaborate montage, and the latter includes a Hurricane of Puns about horseback riding.\n• \"Have Yourself a Merry Little Christmas\" has slightly more downbeat lyrics in Meet Me in St. Louis than in the popular version, which changes the lines \"Through the years we all will be together if the Lord allows / Until then we'll have to muddle through somehow\" to \"...if the fates allow / Hang a shining star upon the highest bough.\" However, the lyrics were changed even before filming, because Judy Garland flatly refused to sing such depressing lyrics to little Margaret O'Brien (Tootie). The original featured lines such as \"Have yourself a merry little Christmas / It may be your last\". If you've ever wondered about the Lyrical Dissonance of the song, now you know.\n• Giorgio Moroder's reworking of Metropolis uses a soundtrack written by him; the official soundtrack, however, is changed significantly from the originals. Compare \"Here's My Heart\" by Pat Benatar with the reworked version for radio .\n• Also compare \"Machines,\" an already poppy song of The '80s, with the version from the soundtrack .\n• Sammy Davis Jr.'s \"The Candyman\", originally from Willy Wonka & the Chocolate Factory, changes one line: \"Willy Wonka makes\" becomes \"The Candyman makes\".\n• Those who are used to hearing The Seekers' cheery \"Georgy Girl\" on oldies radio may be shocked by the version used in the original film, where the lyrics are much darker and more cynical, and reference the title character's specific situation (\"Though he's not a dream come true, at least he's a millionaire ...\").\n• In the published version of \"Aren't You Kinda Glad We Did?\" from The Shocking Miss Pilgrim, Ira Gershwin rewrote the last lines of the verse to specify that the experience the unchaperoned lovers shared was \"just one kiss,\" in the hope that the only mildly suggestive song wouldn't be banned from airwaves. It was banned anyway.\n• The Pussycat Dolls have a Translated Cover Version of \"Jai Ho\" from Slumdog Millionaire.\n• Beauty and the Beast (2017), like the 1991 animated film, has a duet arrangement of the title song, this time sung by Ariana Grande and John Legend. The new songs \"How Does a Moment Last Forever\" and \"Evermore\" received covers by Céline Dion and Josh Groban, respectively.\n• The pop version of \"When I Look In Your Eyes\" from Doctor Dolittle replaces the line \"Isn't it a pity you're a seal?\" with \"How I love the world your eyes reveal.\"\n• In The Breakfast Club, the theme song \"Don't You (Forget About Me)\" has two versions: a demo sung by Keith Forsey played at the start of the film and the one by Simple Minds that plays at the end of the movie.\n• Inverted with \"Back Where We Belong\" from Roundhouse. The song is Benny Hester's (the show's music director and an early Christian Rock musician) song \"Restless Nights\" with entirely different lyrics.\n• The popular version of \"Anything Goes\" is a love song; as Cole Porter originally wrote it for the Broadway show Anything Goes, it was a straight List Song.\n• As Pete Stuyvesant's Villain Love Song in Knickerbocker Holiday, \"September Song\" included the line \"And I have lost one tooth and I walk a little lame\". The popular version has instead \"When the autumn weather turns the leaves to flame\".\n• Stephen Sondheim partially rewrote the lyrics of \"Putting It Together\" from Sunday in the Park with George for Barbra Streisand's The Broadway Album. \"Girl\" was substituted for \"George,\" and several lines were changed in less trivial ways.\n• \"Fugue For Tinhorns\" from Guys and Dolls, with its lyrics rewritten to be a more generic round, was issued under the title \"Three-Cornered Tune.\" However, the original \"Fugue For Tinhorns\" still got several pop covers. There was also a solo version of \"Sue Me,\" whose verse has completely different music and lyrics (\"So you're all the time right and I'm all the time wrong\") than the show version (\"You promise me this, you promise me that\").\n• Older Than Radio: \"Silvered is the raven hair\" from Gilbert and Sullivan's Patience was made into the Victorian parlour song \"In the twilight of our love,\" with new lyrics by Hugh Conway to Arthur Sullivan's melody.\n• In the separately published version of \"Out Of My Dreams,\" the lyrics to the bridge are different from those used in Oklahoma!. (The refrain is identical to what Laurey sings in the show.)\n• The antiwar play Johnny Johnson by Paul Green, with songs composed by Kurt Weill, ended with \"Johnny's Song,\" the philosophical ballad of a Wide-Eyed Idealist turned Knight In Sour Armor struggling to survive in a bellicose world. Chappell, who published the songs from the show, had popular songwriter Edward Heyman write entirely new lyrics to \"Johnny's Song,\" and published it as a torch song titled \"To Love You And To Lose You.\" Paul Green was not pleased.\n• Early in its development/workshopping, the title song from The Phantom of the Opera was released as a single (complete with video) with dramatically different lyrics from those in the final theatrical production. If you compare them, both sets of lyrics are totally innocuous, just different. The Phantom's singer on the single, Steve Harvey, was in the running for the role, but in the end Andrew Lloyd Webber and company decided his rock-trained voice wasn't quite what they needed for the final show.\n• \"Tessie\" from 1902's The Silver Slipper was played on a whim at the 1903 World Series, and became known as a good luck song. In 2004, Dropkick Murphys rereleased it with lyrics explicitly about the Red Sox.\n• Kerry Ellis recorded a rock version of \"Defying Gravity\" from Wicked, which was reworked to remove the references to Oz. Produced by Brian May of Queen.\n• Idina Menzel also did a solo pop version , which removes Glinda's lines from the \"Unlimited\" section and covers it by looping in lines from \"The Wizard And I\"; this is the version found in the published vocal selections.\n• \"No One Mourns The Wicked,\" as published in the vocal selections, includes a short vocal bridge that replaces Glinda's spoken lines and the flashback to Elphaba's birth from the show version.\n• 13 has single versions of the opening theme and \"A Little More Homework\".\n• The Cirque du Soleil concert tour Delirium was based around rewritten and/or rearranged pop versions of songs from most of the shows from Saltimbanco through Varekai.\n• In Amaluna, all of the show songs are in \"Cirquish\" as usual, but on the soundtrack album, many of the songs have been rewritten in English (\"Elma Om Mi Lize\", \"Ena Fee Alyne\", and \"O Ma Ley\" remain Cirquish). Similarly, Quidam's soundtrack includes English versions of \"Let Me Fall\" and others.\n• \"Follow Me\" from Camelot has an alternate lyric having no lines in common with the show lyric except the title and \"We shall fly.\" This was the version sung by Frank Sinatra.\n• \"The Party's Over\" from Bells Are Ringing has a separately issued version with a few different lines in the refrain (reputedly changed at Judy Holliday's insistence), as well an entirely different verse that makes no reference to Melisande Scott but does Call-Back to the song \"It's A Perfect Relationship.\"\n• \"Rhythm of Life\" from Sweet Charity has one that's popular with choruses.\n• \"On the Street Where You Live\" from My Fair Lady was published with a slightly altered version of the rather generic original verse, which was cut from the show in favor of a much more character-specific recitative.\n• A variation: The Peter Allen Jukebox Musical The Boy from Oz turns \"Arthur's Theme (Best That You Can Do)\" into a falling-in-love duet between Allen and Liza Minnelli, \"Best That You Can Do\", by dropping the second verse (which is specifically about Arthur) and slightly tweaking the lyrics of the first. Never mind that the original song was released in 1981 and the scene in the musical is set in the mid-1960s; the connection between the love interest and the song — Minnelli was the female lead in Arthur — must be exploited!\n• The first verse of the pop version of \"Only You\" from Starlight Express directly contradicts the characterisation of the character who sings that part in the show. \"Look at me a woman calm and in control, no silly girl whose head's always turning\" is the direct opposite of Pearl, who is a \"silly girl whose head's always turning.\" It makes for a lovely song, though.\n• Barbra Streisand's rendition of \"Where Am I Going?\" from Sweet Charity changed the line \"Run to the Bronx, or Washington Square\" to \"Run where it's foul, run where it's fair.\"\n• The soundtrack version of \"(I've Got To) Find a Way\" from the My Little Pony: Friendship Is Magic episode \"Magical Mystery Cure\" includes a second verse that didn't make it into the show, along with changing the last refrain from \"Oh, why\" to \"I'll try\".\n• The theme of The Raccoons, \"Run with Us\", was initially sung by Steve Lunt, then re-recorded by Lisa Lougheed, who also voiced Lisa Raccoon and produced several other songs for the show. Her version was featured on her Evergreen Nights album along with the other songs sung or co-produced by her.\n• The theme for Phineas and Ferb was slowed down slightly, had its ska trumpets swapped for pop punk guitars and bass and its final lines and all dialogue chopped off before adding new more lyrics, a bridge and a chorus as \"Today's Gonna Be A Great Day\".\n• VeggieTales had an album of popular Christian artists covering their songs called \"Veggie Rocks\".\n• For \"Veggies In Space: The Fennel Frontier\", they had Jamie Grace perform a pop version of \"Enough to Share\" , a major song in that episode, for the end credits.\n• \"I'd Like to Teach the World to Sing\", a Coca Cola commercial jingle that proved to be so popular that extended versions of the commercial were made by popular demand, and the song was reworked into a single with the soft drink references re-written. In a way, this is almost a double subversion; not only is the commercial more remembered than the single, omitting the parts about \"buying the world a Coke\" made the tune less commercial. Well, less of a commercial, anyway.\n• Several songs from Team StarKid productions were reworked for Darren Criss' live music performances. Compare the theatrical, Potter-ised version of \"Stutter\" to the live performance version .\n• \"Ombra mai fu\" from George Frederic Handel's opera XERXES is a love-song to a tree. (It makes sense in context.) Most published versions make it either a love song (\"Slumber, Fair Maid\") or a religious song (\"Love Ye the Lord\").\n• Frank Zappa: The Black Page is featured twice on Zappa in New York in different versions, with the second version specifically described and announced as the New Age version.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/RewrittenPopVersion", "media_links": ["/pmwiki/pmwiki.php/Disney/TheLionKing", "/pmwiki/pmwiki.php/WesternAnimation/SpiritStallionOfTheCimarron", "/pmwiki/pmwiki.php/Disney/Mulan", "/pmwiki/pmwiki.php/Music/ChristinaAguilera", "/pmwiki/pmwiki.php/Disney/MulanII", "/pmwiki/pmwiki.php/Music/AtomicKitten", "/pmwiki/pmwiki.php/WesternAnimation/TransformersTheMovie", "/pmwiki/pmwiki.php/WesternAnimation/MyLittlePonyEquestriaGirls", "/pmwiki/pmwiki.php/Disney/Aladdin", "/pmwiki/pmwiki.php/Music/DemiLovato", "/pmwiki/pmwiki.php/Disney/Frozen", "/pmwiki/pmwiki.php/WesternAnimation/HelpImAFish", "/pmwiki/pmwiki.php/VideoGame/DanceDanceRevolution", "/pmwiki/pmwiki.php/Disney/TheLittleMermaid", "/pmwiki/pmwiki.php/Creator/JessicaSimpson", "/pmwiki/pmwiki.php/Creator/RavenSymone", "/pmwiki/pmwiki.php/Music/TheJonasBrothers", "/pmwiki/pmwiki.php/Creator/AshleyTisdale", "/pmwiki/pmwiki.php/Disney/Moana", "/pmwiki/pmwiki.php/Music/JordanFisher", "/pmwiki/pmwiki.php/Creator/LinManuelMiranda", "/pmwiki/pmwiki.php/WesternAnimation/Anastasia", "/pmwiki/pmwiki.php/Music/Aaliyah", "/pmwiki/pmwiki.php/Music/DeanaCarter", "/pmwiki/pmwiki.php/Music/JuliaMichaels", "/pmwiki/pmwiki.php/Disney/RalphBreaksTheInternet", "/pmwiki/pmwiki.php/WesternAnimation/Uglydolls", "/pmwiki/pmwiki.php/Music/KellyClarkson", "/pmwiki/pmwiki.php/WesternAnimation/AnAmericanTail", "/pmwiki/pmwiki.php/Film/ManhattanMelodrama", "/pmwiki/pmwiki.php/Creator/MGM", "/pmwiki/pmwiki.php/Film/LoveMeTonight", "/pmwiki/pmwiki.php/Film/MeetMeInStLouis", "/pmwiki/pmwiki.php/Creator/JudyGarland", "/pmwiki/pmwiki.php/Music/GiorgioMoroder", "/pmwiki/pmwiki.php/Film/Metropolis", "/pmwiki/pmwiki.php/Music/PatBenatar", "/pmwiki/pmwiki.php/Creator/SammyDavisJr", "/pmwiki/pmwiki.php/Film/WillyWonkaAndTheChocolateFactory", "/pmwiki/pmwiki.php/Music/PussycatDolls", "/pmwiki/pmwiki.php/Film/SlumdogMillionaire", "/pmwiki/pmwiki.php/Film/BeautyAndTheBeast2017", "/pmwiki/pmwiki.php/Music/ArianaGrande", "/pmwiki/pmwiki.php/Music/JohnLegend", "/pmwiki/pmwiki.php/Music/CelineDion", "/pmwiki/pmwiki.php/Music/JoshGroban", "/pmwiki/pmwiki.php/Film/DoctorDolittle", "/pmwiki/pmwiki.php/Film/TheBreakfastClub", "/pmwiki/pmwiki.php/Music/SimpleMinds", "/pmwiki/pmwiki.php/Series/Roundhouse", "/pmwiki/pmwiki.php/Music/ColePorter", "/pmwiki/pmwiki.php/Theatre/AnythingGoes", "/pmwiki/pmwiki.php/Theatre/KnickerbockerHoliday", "/pmwiki/pmwiki.php/Music/StephenSondheim", "/pmwiki/pmwiki.php/Theatre/SundayInTheParkWithGeorge", "/pmwiki/pmwiki.php/Music/BarbraStreisand", "/pmwiki/pmwiki.php/Theatre/GuysAndDolls", "/pmwiki/pmwiki.php/Creator/GilbertAndSullivan", "/pmwiki/pmwiki.php/Theatre/Patience", "/pmwiki/pmwiki.php/Theatre/Oklahoma", "/pmwiki/pmwiki.php/Theatre/ThePhantomOfTheOpera", "/pmwiki/pmwiki.php/Creator/AndrewLloydWebber", "/pmwiki/pmwiki.php/Theatre/TheSilverSlipper", "/pmwiki/pmwiki.php/Music/DropkickMurphys", "/pmwiki/pmwiki.php/Theatre/Wicked", "/pmwiki/pmwiki.php/Music/Queen", "/pmwiki/pmwiki.php/Music/Mika", "/pmwiki/pmwiki.php/Theatre/Thirteen", "/pmwiki/pmwiki.php/Creator/CirqueDuSoleil", "/pmwiki/pmwiki.php/Theatre/Delirium", "/pmwiki/pmwiki.php/Theatre/Saltimbanco", "/pmwiki/pmwiki.php/Theatre/Varekai", "/pmwiki/pmwiki.php/Theatre/Amaluna", "/pmwiki/pmwiki.php/Theatre/Quidam", "/pmwiki/pmwiki.php/Theatre/Camelot", "/pmwiki/pmwiki.php/Music/FrankSinatra", "/pmwiki/pmwiki.php/Theatre/BellsAreRinging", "/pmwiki/pmwiki.php/Creator/JudyHolliday", "/pmwiki/pmwiki.php/Theatre/SweetCharity", "/pmwiki/pmwiki.php/Theatre/MyFairLady", "/pmwiki/pmwiki.php/Film/Arthur", "/pmwiki/pmwiki.php/Theatre/StarlightExpress", "/pmwiki/pmwiki.php/Music/BarbraStreisand", "/pmwiki/pmwiki.php/Theatre/SweetCharity", "/pmwiki/pmwiki.php/WesternAnimation/MyLittlePonyFriendshipIsMagic", "/pmwiki/pmwiki.php/WesternAnimation/TheRaccoons", "/pmwiki/pmwiki.php/WesternAnimation/PhineasAndFerb", "/pmwiki/pmwiki.php/WesternAnimation/VeggieTales", "/pmwiki/pmwiki.php/Creator/TeamStarKid", "/pmwiki/pmwiki.php/Creator/DarrenCriss", "/pmwiki/pmwiki.php/Music/GeorgeFredericHandel", "/pmwiki/pmwiki.php/Music/FrankZappa", "/pmwiki/pmwiki.php/Music/ZappaInNewYork"], "non_media_links": ["/pmwiki/pmwiki.php/Main/SillyLoveSongs", "/pmwiki/pmwiki.php/Main/AwardBaitSong", "/pmwiki/pmwiki.php/Main/ForgottenThemeTuneLyrics", "/pmwiki/pmwiki.php/Main/ThemeTuneExtended", "/pmwiki/pmwiki.php/Main/RepurposedPopSong", "/pmwiki/pmwiki.php/Main/ThemeTuneExtended", "https://www.youtube.com/watch?v=kwygf4JwVXc", "/pmwiki/pmwiki.php/Main/CutSong", "https://www.youtube.com/watch?v=kHue-HaXXzg", "/pmwiki/pmwiki.php/Main/TranslatedCoverVersion", "/pmwiki/pmwiki.php/Main/SpecialEdition", "https://www.youtube.com/watch?v=qI3E11_Im7k", "https://www.youtube.com/watch?v=ZNra8eK0K6k", "https://www.youtube.com/watch?v=JtRa-0hBdbQ", "https://www.youtube.com/watch?v=gqUj4rRiWjQ", "https://www.youtube.com/watch?v=oyUBdLm3s9U", "https://www.youtube.com/watch?v=y4eW30D1p58", "https://www.youtube.com/watch?v=ajmbnfBC7SU", "https://www.youtube.com/watch?v=dCp29sp0XGc", "/pmwiki/pmwiki.php/Main/LyricalDissonance", "/pmwiki/pmwiki.php/Main/TomboyPrincess", "/pmwiki/pmwiki.php/Main/BreakawayPopHit", "/pmwiki/pmwiki.php/Main/HurricaneOfPuns", "/pmwiki/pmwiki.php/Main/LyricalDissonance", "https://www.youtube.com/watch?v=iwsN4CWA7As", "https://www.youtube.com/watch?v=fnL75jrSU9k", "https://www.youtube.com/watch?v=mkdwUgd6iMA", "/pmwiki/pmwiki.php/Main/TheEighties", "https://www.youtube.com/watch?v=JiZGti2eykk", "/pmwiki/pmwiki.php/Main/TranslatedCoverVersion", "/pmwiki/pmwiki.php/Main/MovieBonusSong", "/pmwiki/pmwiki.php/Main/ChristianRock", "/pmwiki/pmwiki.php/Main/ListSong", "/pmwiki/pmwiki.php/Main/VillainLoveSong", "/pmwiki/pmwiki.php/Main/EvilCripple", "/pmwiki/pmwiki.php/Main/OlderThanRadio", "/pmwiki/pmwiki.php/Main/WideEyedIdealist", "/pmwiki/pmwiki.php/Main/KnightInSourArmor", "/pmwiki/pmwiki.php/UsefulNotes/MajorLeagueBaseball", "https://www.youtube.com/watch?v=4P-cMh4QjYA", "https://www.youtube.com/watch?v=-LG5i4K5mzU", "/pmwiki/pmwiki.php/Main/TheSomethingSong", "/pmwiki/pmwiki.php/Main/SingingSimlish", "/pmwiki/pmwiki.php/Main/CallBack", "/pmwiki/pmwiki.php/Main/JukeboxMusical", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Recap/MyLittlePonyFriendshipIsMagicS3E13MagicalMysteryCure", "/pmwiki/pmwiki.php/Main/SecondVerseCurse", "https://youtube.com/watch?v=Mtr2z6j8UG8", "/pmwiki/pmwiki.php/Main/Jingle", "https://www.youtube.com/watch?v=f16urHxNpGs&feature=player_profilepage#t=307s", "https://www.youtube.com/watch?v=UnpJFXYt9fo", "/pmwiki/pmwiki.php/Main/ItMakesSenseInContext"]}