{"title": "Lead Bassist", "content": "The Ace of Spades doesn't need to play lead guitar to be awesome.\n\nSo Nobody Loves the Bassist, eh? Think again. That dude in the spotlight, the one everyone's cheering for, the famous face everybody remembers ... is it me, or is that axe he/she's wielding suspiciously oversized? VINDICATION! The Lead Bassist takes up an instrument that screams \"anonymous role-player,\" and somehow rides it to fame. For one reason or another, he's better-known than the band's lead guitarist, or even the lead singer.\n\nBut what could cause such a perversion of the natural order? There are four fundamental factors that can give birth to a Lead Bassist:\n\nType A: The Virtuoso. This bassist is so famously skilled and so near the top of the field as to overshadow the band's other musicians—who may be excellent in their own right, but not necessarily at the pinnacle.\n\nType B: The Singer. This musician is mainly famous for being a lead vocalist, or part of a Vocal Tag Team. The fact that he plays a bass is secondary, and may even go unnoticed by casual fans.\n\nType C: The Face of the Band. This bass player is well known for non-musical reasons, such as:\n• Being a founder or guiding creative spirit of the band.\n• Engaging in notorious behavior, such as drunken misadventures or a newsworthy love life.\n• Having a successful career in acting or another field outside of music.\n• Having a successful career when leaving the band.\n• Dying tragically ... or at least memorably.\n\nType D: The Genre Lead. Rather than rock or popular music, this bassist plays jazz, funk, African folk music, etc., genres in which the bass cuts a larger figure—sometimes even a central one.\n\nBassists may qualify under more than one of these tropes: Paul McCartney, for example, manages to flawlessly embody Types A, B, and C.\n\nThis is not a list of \"Good Bassists\" or \"Bassists I Like.\" This page is for bass players who, for one reason or another, garner a distinctly larger share of public notice than more traditional band \"frontmen\" such as the singer or lead guitarist. If the bassist is the least-known member of the band, he doesn't belong here, however well-regarded he is (future musicologists will dub this the \"Entwistle-J.P. Jones barrier\").\n\nContrast Nobody Loves the Bassist. Sister Trope of Lead Drummer. Does not refer to a bassist made out of lead.\n• Before switching primarily to the guitar, Abbath Doom Occulta was the bassist/singer/frontman for Immortal.\n• Martin Eric Ain was a co-Face of the Band and spokesman during his tenure with Celtic Frost.\n• Juan Alderete de la Peña of Vato Negro is the lead instrumentalist for his band's unique style of bass-driven noise rock, and has a sizable internet following because of his online effects-pedal reviews.\n• Emma Anzai of Sick Puppies is just as well known as lead singer/guitarist Shim Moore. Due to their nature as a 3 piece band, Anzai's bass has a lot of room to shine,and each album sees her stepping up to the mic more and more often from simple backing vocals, to vocal tag team and outright taking the lead here and there. She's also considered very attractive.\n• Cliff Burton (Type A), late bassist of Metallica for their first 3 albums before his death in a freak bus crash in 1986. Also a Type C, being a primary songwriter for the band, as well as being famous for the freak accident that killed him.\n• Tom Araya is lead vocalist and frontman of Slayer.\n• During her stint with Kittie, Talena Atfield was the band's undisputed Ms. Fanservice.\n• Not only is Walter Becker a famously virtuosic bass player, but after the first few albums, he and Donald Fagen pretty much were Steely Dan. Co-face and co-songwriter of the band with Fagen.\n• Jean Baudin of Nuclear Rabbit: Types A (rocks an 11-string bass!), C (he's the founder/leader), and D (the music's built around his eccentric technique).\n• Sean Beasley of Dying Fetus constitutes half of a Vocal Tag Team with John Gallagher.\n• Jason Netherton is now the frontman for Misery Index and was once the frontman of Dying Fetus.\n• Brett Beavers was the bassist and bandleader for Martina McBride and Lee Ann Womack, and has since become a songwriter and producer.\n• Adam Biggs of Rivers of Nihil: Type A (he's got a huge amount of technical ability, though the years have made him less hell-bent on showcasing it at every opportunity), B (he serves as the second vocalist, contrasting Jake Dieffenbach's mid-ranged bellow with higher rasps and the occasional guttural lows), C (he writes the vast majority of the lyrics and shares primary songwriting duties with Brody Uttley), and D (his basslines factor heavily into their established style and seldom do exactly what the guitar does, often playing lead lines or creating a melodic backdrop instead of necessarily playing rhythm all the time).\n• Jack Blades has been the co-lead singer for both Night Ranger and the supergroup Damn Yankees.\n• Andreas Blomqvist of Seventh Wonder is his band's big name, famous both as a founder and for his fret-tapping speed runs.\n• Derek Boyer of Suffocation is notorious for his bizarro antics, both onstage and off, while his enormous bass sound, distinctive tone, and considerable technical prowess factor heavily into Suffocation's current sound and live reputation.\n• Ron Broder is the bassist and lead singer of Coroner.\n• Brian Bromberg: Behold an example of his work . All those \"guitar\" tracks are actually bass lines (with the strings tuned up high). He's released several \"bass-only\" albums. Don't love the bassist? Too-bad—he's all you've got!\n• Jack Bruce was the bassist and primary singer of Cream, and had a low key but well-regarded solo career.\n• Michael \"Fat Mike\" Burkett is the singer and bandleader of NOFX.\n• John Cale (Velvet Underground, solo), Types B and C, through his songwriting, production, and multi-instrumental skills.\n• Ken Casey of the Dropkick Murphys is the co-lead singer, songwriter, and sole remaining founding member.\n• Erlend Caspersen (Blood Red Throne, Spawn of Possession, Deeds of Flesh, etc.): Type A, also a Type C due to his highly influential status among metal bassists.\n• Peter Cetera was the co-lead vocalist of Chicago, and enjoyed a successful solo career afterwards.\n• Al Cisneros (Sleep, Shrinebuilder): Type B, C and D. With Sleep, Cisneros was such a key figures in the evolution of Doom Metal that he can be partly credited with the importance of the bass in the genre.\n• Stanley Clarke (Return to Forever, The Seatbelts) is a genuine jazz celebrity, as well as a bandleader in his own right.\n• Primus's Les Claypool is the epitome of Lead Bassist: A) He's one of the greatest bass players of all time, B) He's Primus's lead singer, C) He's face of the band, and D) Primus's sound is centered around his bass playing, which means he hits all four criteria.\n• Bootsy Collins (George Clinton) is one of funk's most recognizable faces and sounds, and even sang occasionally (with Bootsy's Rubber Band).\n• Max Collins is the singer and frontman of Eve 6.\n• John Crawford was the primary songwriter for Berlin.\n• John Cooper is known as the vocalist of Skillet.\n• John Cowan was the lead vocalist of the bluegrass band New Grass Revival.\n• Kim Deal was the face of The Pixies alongside Black Francis, sang the occasional lead, and was the lead singer and bandleader of The Breeders.\n• Russell DeCarle is the lead singer of Country Music band Prairie Oyster.\n• Joey DeMaio of Manowar is the band's main songwriter, and famous for his piccolo bass and solos.\n• Jay DeMarcus of Rascal Flatts is somewhat well-known outside the band for several Record Producer and co-writer credits.\n• Carlos Dengler, formerly of Interpol, was as recognized in the band as the lead singer.\n• James Dewar sang for both the Robin Trower Band and Stone the Crows.\n• Steve DiGiorgio (Death, Autopsy, Control Denied, Dark Haul, Faust, Testament, Vintersorg, Iced Earth, Sebastian Bach, Charred Walls of the Damned, Obituary, Sadus, Dragonlord, the list could go on): Type A for his technical skills on the fretless bass and a Type C for being in all of those bands and many more (for at least one album).\n• John Doe of the punk band X is the band's founder, bassist, co-songwriter, and the male half of its Vocal Tag Team. He's also had notable TV and movie roles, including a recurring stint on Roswell.\n• Leif Edling of Candlemass is celebrated as the band's main songwriter.\n• Bernard Edwards was a central identifying face of Chic, a defining contributor to the band's signature funk sound, and a well-known songwriter/producer. He was also co-lead vocalist, though this was less well-known to the general public as his lead vocals tended to remain as album tracks.\n• Flea (Michael Balzary) of Red Hot Chili Peppers is considered a leading pioneer of his craft. He's also arguably the most famous member of the band, with his memorable nickname, distinctive appearance and acting roles doing him great service. He's also technically the only continuous member of the band, since vocalist Anthony Kiedis was fired for at least a month during the 80s.\n• Mike Flores of (Origin) usually steals the spotlight because of his fast and highly technical playing—not to mention that he's one of the band's main songwriters, an occasional stand-in vocalist, and has the second-longest uninterrupted tenure after Paul Ryan.\n• Sharin Foo of The Raveonettes is half of a Vocal Tag Team (alongside Sune Rose Wagner).\n• Dave Fridmann of Mercury Rev is a household name in the industry—not only for his band, but as a producer both for them and the Flaming Lips.\n• Teddy Gentry of Alabama. Although the band has only ever released singles with Randy Owen on lead vocals (except \"Mountain Music\", where Gentry and guitarist Jeff Cook each sing one line drummer Mark Herndon never sang, and left the group in the 2000s ), both Gentry and Cook have sung lead on several album cuts. In addition, Gentry wrote hit singles for Shenandoah and George Strait, and has produced for Emerson Drive.\n• The Brazilian bassist/vocalist Humberto Gessinger has become the only steady member of Engenheiros do Hawaii.\n• There's a funny example of this trope also in Brazil: a forró band became viral on YouTube simply because of the narmtastic dance of the bass player Junior Groovador during the recording of the song . While there's another known videos of him throughout the Internet, the rest of the band didn't have the same popularity.\n• Rodrigo González is the co-vocalist of the German punk rock band Die Ärzte.\n• Kim Gordon, Sonic Youth's co-singer and co-Face of the Band.\n• Larry Graham is the inventor of the \"slapping\" technique, which he popularized with both Sly and the Family Stone and Graham Central Station.\n• Keith Grimwood of Trout Fishing In America is a Type B, since he splits lead vocals about 50-50 with guitarist Ezra Idlet and they write most of their songs together.\n• Steve Grisaffe has been the lead singer and bassist of the country band River Road since 1997.\n• Steve Harris of Iron Maiden is a seminal figure among bass players, writes most of the band's songs and is as recognized as Bruce Dickinson. He's also generally considered an incredible player technically speaking, making him both a Type A and C.\n• Johnny Hedlund is the lead singer of Unleashed.\n• Mike Herrera was known as the singer for Mx Px, and later as the frontman of his own band Tumbledown.\n• Marco Hietala was the singer of Nightwish, the singer and bandleader of his old band Tarot, and an extremely influential instrumental stylist for Finnish metal.\n• Morgan from the italian new wave Bluvertigo is both Type A and C, but he's been transitioning to Type B thanks to his appearences on reality TV and talent shows.\n• Peter Hook was the co-founder of Joy Division and New Order, and famous for his distinctively high-pitched, melodic playing.\n• Mark Hoppus of Blink182 shares frontman and singing duties with guitarist Tom Delonge, and is also lead singer of the band +44.\n• Hiroki Ikegawa is Crossfaith's Mr. Fanservice, standing out even from an entire band of pretty-boys. Thanks to his swoonworthy mug and relative proficiency in English, he's become co-Face of the Band (along with singer Kenta Koie) in Western-media appearances.\n• Japan bassist Mick Karn was known for his melodic fretless playing.\n• Ricardo Iorio, bassist and singer of the Argentinian bands V8, Hermética, and Almafuerte, is considered a seminal figure in his country's metal and popular-music scenes ... bordering on national-hero status.\n• James Jamerson (Funk Brothers/Motown Records session musician) is both a famous virtuoso and a purveyor of essentially bass-driven funk genres.\n• Gary Jarman of the Cribs is half of a Vocal Tag Team type with his twin Brother, Ryan.\n• Janice Marie Johnson was both the lead vocalist and lead bassist of A Taste of Honey.\n• Percy Jones (Brand X, Tunnels, various Brian Eno albums): Type A, without a doubt, and on fretless electric bass, to boot.\n• Jesse F. Keeler, of dance-punk duo Death from Above 1979, has dominated and largely defined the band's sound with his uniquely distorted, grinding bass.\n• Mike Kerr of British Hard Rock band Royal Blood is not only the lead singer, but the lone instrumentalist except for the drummer.\n• Steve Kilbey is the lead singer of The Church.\n• Lemmy Kilmister, pictured atop this page, was the long-time singer and bandleader of Motörhead, an iconic elder statesman of old-school heavy metal, and the mayor-for-life of Drinkin' Island.\n• Mark King of Level 42 is a renowned virtuoso, lead singer, and the Face of the Band.\n• Bakithi Kumalo is a lead musician and soloist whose fretless bass generally carries the melody—for an example, check out nearly half the tracks of Paul Simon's Graceland.\n• Greg Lake was the vocalist of King Crimson, Emerson, Lake & Palmer, and (briefly) Asia.\n• Joe Lally of Fugazi often carries the melody in the band's songs, sometimes relegating the guitars to near-rhythm capacity, and has also contributed a couple of lead vocals.\n• At the time, Ronnie Lane was the best-known member of both the Small Faces and the Faces, though Steve Marriott and Rod Stewart would later eclipse him in fame. Lane was also a frequent songwriter for both groups.\n• Dominic \"Forest\" LaPointe (Augury, Beyond Creation, Atheretic, Quo Vadis etc.): Type A. Mastering a left-handed 6-string fretless bass guitar is bound to get quite some attention.\n• Sonny LeMaire, bassist of Exile, sang lead vocals on several occasions after lead vocalist J. P. Pennington quit in 1989, including the singles \"Nobody's Talking\" and \"Yet\". He also recorded with the band Burnin' Daylight in 1997, and has written hit singles for Diamond Rio, Clay Walker, Andy Griggs, Restless Heart, and Sons of the Desert.\n• Geddy Lee, lead vocalist, bassist, and keyboardist of Rush. Canonical combo of A and B.\n• White Wizzard's Jon Leon earns his Type C by being the founder and only permanent member of a Revolving Door Band.\n• Symphony X's Mike Le Pond has more than earned his Type A status with his incredible technical skill and flashy, virtuosic playstyle that nonetheless can take a backseat to playing for the song when need be. His myriad other projects certainly help, and he was also known for being a Cliff Burton-like figure in his early days, where he played in various bar bands; plenty of people who knew him from that time knew him as the incredibly talented bassist playing in perpetual local openers.\n• Phil Lesh of the Grateful Dead was not only the member of the Grateful Dead to put on the most successful solo shows after the Grateful Dead disbanded, but he even took over some leadership responsibilities of the band after Jerry Garcia passed away. Though not a major song writer of the band, he did influence the sound and assist in some of the band's hits in writing. Lesh is also known in many ways as one of the first Bass players to break away from the traditional timekeeping role within the beat of the song being played, further influencing the classic sound of the Grateful Dead.\n• John Lodge of The Moody Blues is part of a Vocal Tag Team (and co-songwriter) with Justin Hayward.\n• Bruce Loose and the late Will Shatter of Flipper were co-vocalists and co-bassists, depending on the song.\n• Garry Lowe is Big Sugar's most ear-catching and eye-catching member: amidst a nattily dressed hard-rock/blues band with country influences stands a shirtless, wild-haired Jamaican churning out funk jams and R&B riffs.\n• Nick Lowe can play several instruments, but has often functioned as the bassist in bands which he has played in or lead — and has sometimes been the facke or joint face of those bands. That puts him in type B, but his skills as a songwriter and producer probably move him more into type C.\n• Marcus Luscombe is the lead singer of Cormorant.\n• During his time with Thin Lizzy, Phil Lynott was the principal songwriter, singer, and Face of the Band.\n• Singer-songwriter Aimee Mann was the bassist, singer, and Face of the Band for Til Tuesday, and still frequently plays the bass in her solo output.\n• Michael Manring's latter-day output consists of solo fretless-bass performances, leading one admirer to quip \"he's not so much a bass player as he is a one-man band who just happens to play bass.\"\n• Ryan Martinie of Mudvayne is the band's musical focus of attention, renowned for his unique, percussive style that owes not a little to flamenco.\n• Terry McBride was the bassist and lead singer of the country band McBride & the Ride in The '90s, and later became noted for his songwriting (including for Brooks & Dunn, who later had him play bass in their road band).\n• Paul McCartney: A, B, and C. Probably the best known bassist of all, helped by turning the violin-looking Hofner bass into an Iconic Item.\n• Tatsu Mikami is a Type C. He even acknowledged it when everyone else in Church of Misery left by saying that the band wasn't going anywhere and that he had already written another entire album and just needed to find a new lineup.\n• Mike Mills sang several R.E.M. songs, and in public often served as co-Face of the Band (with Michael Stipe).\n• Charles Mingus, Jazz double bassist , composer and bandleader. Types A, C, and D\n• Arif Mirabdolbaghi: Types A and C, for writing the band's lyrics until recently.\n• Colin Moulding of XTC was co-singer along with Andy Partridge, as well as co-Face of the Band.\n• Chris Murphy of Sloan is Type B, part of a Vocal Tag Team.\n• Danny Myrick: Type B and C. Myrick fronted the 1990s band Western Flyer. Several years after they broke up, he became a successful songwriter (including \"She's Country\" by Jason Aldean) and producer.\n• Arthur von Nagel was the original vocalist of Cormorant, as well as the lyricist.\n• Johnette Napolitano (of Concrete Blonde): Type B and C - Concrete Blonde is basically Napolitano and whoever she decides to play/record with.\n• Before nearly embodying the Nobody Loves the Bassist trope during his Metallica tenure, the put-upon Jason Newsted was Flotsam & Jetsam's main lyricist and co-Face of the Band. Post-Metallica, he became the vocalist/songwriter of his own self-named group.\n• Tomomi Ogawa was co-vocalist, main lyricist, and well-liked mascot of SCANDAL (not the Patty Smyth band, the Japanese one).\n• Richard Page was the lead singer (and male-model face) of the '80s band Mr. Mister.\n• For better or worse, Nick Oliveri has made his mark in several bands:\n• He's often credited with co-creating \"stoner metal\" as a member of Kyuss.\n• With Queens of the Stone Age, he famously wore out his welcome with epic drug abuse, capped off by spousal abuse.\n• After his QOTSA tenure, Oliveri founded and sang lead for the band Mondo Generator.\n• Benjamin Orr of The Cars was the co-lead singer, and The Face Of The Band along with Ric Ocasek.\n• The virtuosic bass skills of Atheist's Roger Patterson were responsible for a good bit of the band's early buzz). Later, his tragic death contributed to his fame in Technical Death Metal circles.\n• Jaco Pastorius became world-famous for his revolutionary fretless-bass skills as a member of Weather Report and as solo artist. Unfortunately, he became nearly as famous for his sudden alcoholic descent and unfortunate death.\n• Aaron Pauley of Of Mice & Men became a Type B in 2017.\n• Tom Petersson: Type C—he's not more memorable than Rick Nielsen or Bun E. Carlos, but he certainly rings more of a bell than singer Robin Zander.\n• Dickie Peterson was the lead singer for (Blue Cheer, those proto-metal pioneers of the psychedelic era.\n• Doug Phelps of The Kentucky Headhunters became a Type B the hard way. He originally sang backing vocals and played bass, while his brother Ricky Lee Phelps sang lead. Both of them quit after the second album, with a new lead singer and bassist (Mark S. Orr and Anthony Kenney, respectively) on their third album. On the fourth, Doug returned as only lead vocalist, with Kenney continuing to play bass until the late 2000s, at which point Kenney quit and Doug once again became bassist.\n• Genesis P-Orridge of Throbbing Gristle is types B and C.\n• Pretty much the only reason anyone paid attention to the band Dogstar was because Keanu Reeves played bass.\n• Reita of The Gazette is notorious not only for his virtuosic musicianship, but for his look—in the Visual Kei world, apparently, the iconic nose band makes the man.\n• Paulo Ricardo is a noted singer, and the Face of the Band with the Brazilian group RPM.\n• John Rich was originally a Type B in Lonestar, where he traded lead vocals with Richie McDonald. After being fired from the band in 1998 with no official replacement, he became a Type C as one-half of Big & Rich (although he no longer plays bass), along with a large list of songwriting and production credits for other artists.\n• Tyson Ritter of The All-American Rejects is both type B and C, doing acting and modeling outside of the band. While Ritter no longer plays bass guitar live, he still records it in the studio.\n• James Rushnet, type A for his ability to make some catchy riffs on the bass, type B for being the singer, and type D since dance punk is mostly inspired by Post-Punk which is a pretty bassy genre.\n• Troy Sanders is a little bit of Type B, a little bit of Type C.\n• Mark Sandman of Morphine was Types B, C, and D, rolled up into in one doomed Genre-Busting package.\n• Taiji Sawada was famously virtuosic during his stints with X Japan, Loudness, The Killing Red Addiction, and other projects, as well as being one of four faces of the band for X Japan, pioneering Loudness's first foray into Thrash Metal, and for some surprising lyrical depth in solo work. He was equally, and sadly, famous for his substance abuse, recurring mental problems, and suspicious death.\n• Nick Schendzielos of Cephalic Carnage, Job for a Cowboy, and Havok hits all four on the head, being a Type A (renowned for his incredible technical skill and creative playing), Type B (he does secondary vocals in Cephalic Carnage and backing live vocals in Havok), Type C (his face is well-known in the bass world between his YouTube channel and frequent NAMM appearances, plus he's become a secondary Face of the Band for both Job for a Cowboy and Havok due in no small part to his oddball sense of humor and amusing interviews), and Type D (his basslines became a very major and integral part of Job for a Cowboy's sound circa Sun Eater).\n• Marcel \"Schmier\" Schirmer is the vocalist for Destruction.\n• Jacob Schmidt of Defeated Sanity is a firm Type A and Type C, as he shares songwriting duties with Lille Gruber and is renowned for both his astounding technical ability and deep knowledge of theory.\n• Singer Tommy Scott of Space was the group's bassist in its early years, and on its first album.\n• Jason Sellers: Type B and C. Originally a bassist in Ricky Skaggs' road band, he recorded two solo albums in the late 1990s and played bass on both. He is now a prominent backing vocalist and songwriter (most notably, he co-wrote Jason Aldean and Kelly Clarkson's \"Don't You Wanna Stay\"). Sellers is also famous for being the first husband of Lee Ann Womack.\n• Billy Sheehan: Type A (when you can keep up with Steve Vai it's a given!), and the Face of the Band for Mr. Big. With jazz group Niacin, he's arguably a type D as well.\n• Burke Shelly of Budgie, under Type B (the singer), and Type C (he co-wrote the band's songs and has been the only consistent member of the group).\n• Gene Simmons is a huge combination of Types B and C, writing most songs with Paul Stanley (the other Face of the Band), singing at least half the tracks, and being the most recognizable of the band members without makeup (he loves to give interviews, has written several books, and has had his own reality show).\n• Actor Gary Sinise is also a bassist, and founder of the Lt. Dan Band. Once, he got to pluck his bass on CSI: NY, and four-stringers everywhere rejoiced.\n• Nikki Sixx wrote most Mötley Crüe songs with [[Lead Drummer/Tommy Lee]]. His notoriously wild life (including being dead for a few minutes!) was even better known.\n• Zach Smith of Pinback has a very distinct playing style (heavy on chords, tapping, and melody lines on a short-scale bass) and plays Vocal Tag Team alongside guitarist Rob Crow.\n• Steve Soto was the one constant of the Revolving Door Band the Adolescents.\n• Greg Spawton, the co-founder and main songwriter of Big Big Train, willingly assumed this mantle by switching from guitar to bass.\n• Squarepusher: Types A and C—his bass playing is as well-known as his electronic work.\n• Yes's bassist Chris Squire was the prototypical Type A. He's also the primary backing vocalist for the band, technically making him a Type B. Additionally, until his death he was the only founding member consistently in Yes, and is generally the most recognizable member, making him a Type C as well.\n• Jeffrey Steele: He was the lead singer/bassist in the 1990s country band Boy Howdy (type B), and after they broke up, he had a fruitful career as a singer-songwriter and record producer (type C).\n• Peter Steele: Types B and C. Wrote all the songs, was the public face of the band, and a sex symbol to female fans (and some male ones) after his Playgirl magazine shoot.\n• John Taylor: Type C, especially as he's Heterosexual Life-Partners with the only consistent member of the band, Nick Rhodes. Also a mild case of A, since John's unorthodox and genre-defying basslines were uncommon at the time, but widely emulated since then.\n• Kavyen Temperley of Eskimo Joe: Type B and C.\n• Jeroen Paul Thesseling: Type A. Playing with two acclaimed Technical Death Metal (Pestilence and Obscura) bands is bound to get you some respect. Also a Type D of sorts, and he has done flamenco and jazz work and is also somewhat well-known in microtonal music circles. Most people know him for his monster 7-string fretless bass.\n• D.D. Verni is a Type A and Type C, as he's the only founding member remaining other than Bobby, in addition to his basslines playing a very prominent role in the band's sound.\n• Sid Vicious: Type C, with a giant, 72-point \"C\" (and he couldn't even play!)\n• Roger Waters: The lead creative force and co-lead singer of Pink Floyd between Syd Barrett's departure and the band's 1980s resurrection. Even now he has successful solo tours.\n• Mike Watt was Minutemen's main songwriter, played a central musical role in the group's funk/jazz-influenced punk sound, and has enjoyed a Breakup Breakout as replacement bassist for a number of well-known bands, including the reunited Stooges.\n• Norman Watt-Roy from The Blockheads: Type A. Has become Type C since Dury's death with fans chanting \"Norman, Norman, Norman...\" during solos. He is also unquestionably the fan-favorite Blockheads member.\n• Lyn-Z Way is known for her furious basslines and impressive backbends on stage. On the other hand, her marriage to Gerard Way has come to overshadow her musical abilities.\n• Cannibal Corpse's Alex Webster is not only known for his extreme technical proficiency, but he has also become a major, genre-affecting influence on metal bassists.\n• Pete Wentz: When your marriage, indiscreet photos, and Estrogen Brigade are more common knowledge than what you do for a living ... you're a Type C, full stop. (He's also known for being the band's main lyricist.)\n• John Wetton was the lead singer and resident bass virtuoso of late '70s King Crimson, U.K., and Asia.\n• Tina Weymouth of the Talking Heads also sang lead with the Tom Tom Club.\n• Verdine White of Earth, Wind & Fire is in category A, C and D. Not only is he a top-notch funk bassist, he's the only one (with bandleader/founder Maurice White's passing in 2016) to be with the band from Day One. During the Seventies, one of the highlights of the band's concerts was his bass solo where he would be playing suspended in mid-air.\n• The Beach Boys' Brian Wilson is the band's best-known member, renowned for his singing voice, as the genius behind the group's most seminal albums (even though he played less and less bass by that time), and for his later struggles with substance abuse and mental issues.\n• Doug Wimbish of Living Colour. On top of his own solo work, he's also done work for Tackhead, Jungle Funk, The Rolling Stones, and many others.\n• Kip Winger was his band's lead singer and lancer (The Hero, of course, was Winger's hair).\n• Nicky Wire of Manic Street Preachers is a Type C. He has been the most well known member of the band since Edwards disappeared, thanks to being the primary lyric writer and his flamboyant stage presence.\n• Jah Wobble was Type A in Public Image Ltd. and added Type C in his other ventures.\n• Victor Wooten: Type A. Arguably Type D, but that would require his conforming to a genre.\n• Rob Wright is the lead singer of Nomeansno. He's also a founding member, and a virtuoso bassist who gives the band's punk recordings a startlingly progressive undergirding.\n• Doris Yeh: Type C to a T. Also Type B for her role of supporting vocals as well.\n• Da Yoopers have gone through several bassists (Jim Pennell, Joe DeLongchamp, Doc Bradbury, Jim Bellmore, Reggie Lusardi). Each of them has gotten at least one turn on lead vocal. DeLongchamp and guitarist/bassist Bellmore also handled songwriting duties.\n• Miracles of Modern Science's bassist Evan Younger is also the lead singer.\n• Dan Andriano of Alkaline Trio. While singer/guitarist Matt Skiba is more well known (especially now he's in that other band), bassist Dan is co-lead singer and songwriter; a Type B all over.\n• Dallon Weekes is the founder, singer, songwriter, and face of I Don't Know How But They Found Me, although it should be noted that the band only has one other member, drummer Ryan Seaman. Dallon was also the Lead Bassist of his old band, The Brobecks, though he shared singing and writing credits with other members.\n• Pär Sundström of Sabaton is the secondary Face of the Band alongside lead vocalist Joakim Brodén. In addition to co-writing the songs with Joakim and having about as much interview time, Pär has regularly sung backing vocals since the 2012 lineup change (he and Joakim are the only founding members remaining).\n• Mio Akiyama is a type B and (less-than-willing) C.\n• Ditto with Yuu Haruna, who is initially a Type B (being the co-vocalist of his band) but more or less has elements of Type C as well.\n• Cassandra is both the B and C of her band Crucial Taunt, to the point that her manager's plan in the sequel is to distance her from the rest of the band.\n• Guitar Hero: World Tour: Shirley Crowley becomes a Face of the Band example, having a impressive solo career.\n• Murdoc Niccals: Type C—he co-founded the band, and makes most of their headlines in his semi-cartoon universe by virtue of being an Axe-Crazy Psychopathic Manchild.\n• Yamato/Matt Ishida in Digimon Adventure 02 and Digimon Adventure tri. is the bassist and vocalist of his bands. He has several fangirls, notably Jun Motomiya.\n• Charlie Pace (Drive Shaft 4 ever!) is Type C.\n• Scott Pilgrim is not only the hero of his eponymous comic series and movie, he's the sole original member of his band.\n• The 2nd Gym Leader in Pokémon Black 2 and White 2, Roxie is the leader of her band. Both Type B as the band's singer and Type C as a Gym Leader.\n• Naturally, it also carries over to her anime appearance. You know the two other trainers you face in the Virbank Gym in the game? They're her bandmates in the anime.\n• Spinal Tap: On \"Big Bottom,\" David, Nigel, and Derek treat the listener to a triple-bass assault! (Harry Shearer rocks a double-neck.)\n• Adventure Time: Marceline and the Scream Queens reveals Marceline to be a Type B, so much that her bandmates have never been seen on the show.\n• Somewhat subverted for Murderface in Metalocalypse, since the band claims they mix out his parts in post, but during concerts he displays a talent for playing the bass with his penis.\n• In Iron Zion, Jan Doornenbal is Type A (and gets into musical duels with his band members) and B, whenever a song has Dutch or Frisian lyrics (he sings along with his brother) and somewhat Type C, since a double bass is unusual in Heavy Metal, and also having a classical side project with his brother.\n• The nameless singer in Guitar Hero On Tour is a type B.\n• Sgt. Floyd Pepper of the Electric Mayhem in The Muppets is a type C. Although Dr. Teeth leads the band, Floyd is easily the most recognizable member after Animal, overshadowing Dr. Teeth, and the one who talks the most to Kermit. He also often sings lead vocals whenever the band is shown performing.\n• Mae Borowski of Night in the Woods is a type C by virtue of being the Player Character who just happens to play bass; the four friends never perform in public, leaving their actual memorability up in the air. Then again, depending on how well you play during each practice, she potentially demonstrates an amazing talent at improvising songs that she has never performed before.\n• AW Yrjänä of the Finnish band CMX is both type C, being a founding member of the band, and type B, being the singer. He is arguably type A thanks to his lyrical prowess (though the band's lyrics are only in Finnish).\n• Murdoc Niccals of Gorillaz is a Type C for invoking the birth and demise of the band and a Magnificent Bastard In-Universe, as well as having a large fanbase out of universe for both being Creepy Awesome as well as his bass playing in songs like \"Feel Good Inc.\"\n• Andy McCluskey of Orchestral Manoeuvres in the Dark is Type B as the band's frontman.\n• Davide Biale of Davie504 is this to a tee - all of his videos are about him slapping the bass.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/LeadBassist", "media_links": ["/pmwiki/pmwiki.php/Music/Motorhead", "/pmwiki/pmwiki.php/Music/Metallica", "/pmwiki/pmwiki.php/Music/PaulMcCartney", "/pmwiki/pmwiki.php/Music/TheWho", "/pmwiki/pmwiki.php/Music/LedZeppelin", "/pmwiki/pmwiki.php/Film/MontyPythonAndTheHolyGrail", "/pmwiki/pmwiki.php/Music/Immortal", "/pmwiki/pmwiki.php/Music/CelticFrost", "/pmwiki/pmwiki.php/Music/SickPuppies", "/pmwiki/pmwiki.php/Music/Metallica", "/pmwiki/pmwiki.php/Music/Slayer", "/pmwiki/pmwiki.php/Music/SteelyDan", "/pmwiki/pmwiki.php/Music/DyingFetus", "/pmwiki/pmwiki.php/Music/MiseryIndex", "/pmwiki/pmwiki.php/Music/MartinaMcBride", "/pmwiki/pmwiki.php/Music/LeeAnnWomack", "/pmwiki/pmwiki.php/Music/RiversOfNihil", "/pmwiki/pmwiki.php/Music/NightRanger", "/pmwiki/pmwiki.php/Music/SeventhWonder", "/pmwiki/pmwiki.php/Music/Suffocation", "/pmwiki/pmwiki.php/Music/Cream", "/pmwiki/pmwiki.php/Music/JohnCale", "/pmwiki/pmwiki.php/Music/VelvetUnderground", "/pmwiki/pmwiki.php/Music/Devo", "/pmwiki/pmwiki.php/Music/MarkMothersbaugh", "/pmwiki/pmwiki.php/Music/DropkickMurphys", "/pmwiki/pmwiki.php/Music/BloodRedThrone", "/pmwiki/pmwiki.php/Music/SpawnOfPossession", "/pmwiki/pmwiki.php/Music/DeedsOfFlesh", "/pmwiki/pmwiki.php/Music/Chicago", "/pmwiki/pmwiki.php/Music/TheSeatbelts", "/pmwiki/pmwiki.php/Music/Primus", "/pmwiki/pmwiki.php/Music/GeorgeClinton", "/pmwiki/pmwiki.php/Music/Skillet", "/pmwiki/pmwiki.php/Music/ThePixies", "/pmwiki/pmwiki.php/Music/TheBreeders", "/pmwiki/pmwiki.php/Music/Manowar", "/pmwiki/pmwiki.php/Music/RascalFlatts", "/pmwiki/pmwiki.php/Music/Death", "/pmwiki/pmwiki.php/Music/Autopsy", "/pmwiki/pmwiki.php/Music/Testament", "/pmwiki/pmwiki.php/Music/IcedEarth", "/pmwiki/pmwiki.php/Music/Obituary", "/pmwiki/pmwiki.php/Music/X", "/pmwiki/pmwiki.php/Series/Roswell", "/pmwiki/pmwiki.php/Music/Candlemass", "/pmwiki/pmwiki.php/Music/Chic", "/pmwiki/pmwiki.php/Music/RedHotChiliPeppers", "/pmwiki/pmwiki.php/Music/Origin", "/pmwiki/pmwiki.php/Music/TheRaveonettes", "/pmwiki/pmwiki.php/Music/MercuryRev", "/pmwiki/pmwiki.php/Music/FlamingLips", "/pmwiki/pmwiki.php/Music/Alabama", "/pmwiki/pmwiki.php/Music/Shenandoah", "/pmwiki/pmwiki.php/Music/GeorgeStrait", "/pmwiki/pmwiki.php/Website/YouTube", "/pmwiki/pmwiki.php/Music/DieArzte", "/pmwiki/pmwiki.php/Music/SonicYouth", "/pmwiki/pmwiki.php/Music/SlyAndTheFamilyStone", "/pmwiki/pmwiki.php/Music/TroutFishingInAmerica", "/pmwiki/pmwiki.php/Music/IronMaiden", "/pmwiki/pmwiki.php/Music/BruceDickinson", "/pmwiki/pmwiki.php/Music/Unleashed", "/pmwiki/pmwiki.php/Music/MxPx", "/pmwiki/pmwiki.php/Music/Nightwish", "/pmwiki/pmwiki.php/Music/Bluvertigo", "/pmwiki/pmwiki.php/Music/JoyDivision", "/pmwiki/pmwiki.php/Music/NewOrder", "/pmwiki/pmwiki.php/Music/Blink182", "/pmwiki/pmwiki.php/Music/Japan", "/pmwiki/pmwiki.php/Music/RicardoIorio", "/pmwiki/pmwiki.php/Music/BrianEno", "/pmwiki/pmwiki.php/Music/RoyalBlood", "/pmwiki/pmwiki.php/Music/TheChurch", "/pmwiki/pmwiki.php/Music/Motorhead", "/pmwiki/pmwiki.php/Webcomic/Achewood", "/pmwiki/pmwiki.php/Music/PaulSimon", "/pmwiki/pmwiki.php/Music/KingCrimson", "/pmwiki/pmwiki.php/Music/EmersonLakeAndPalmer", "/pmwiki/pmwiki.php/Music/Asia", "/pmwiki/pmwiki.php/Music/RodStewart", "/pmwiki/pmwiki.php/Music/DiamondRio", "/pmwiki/pmwiki.php/Music/ClayWalker", "/pmwiki/pmwiki.php/Music/RestlessHeart", "/pmwiki/pmwiki.php/Music/Rush", "/pmwiki/pmwiki.php/Music/WhiteWizzard", "/pmwiki/pmwiki.php/Music/SymphonyX", "/pmwiki/pmwiki.php/Music/GratefulDead", "/pmwiki/pmwiki.php/Music/TheMoodyBlues", "/pmwiki/pmwiki.php/Music/Flipper", "/pmwiki/pmwiki.php/Music/NickLowe", "/pmwiki/pmwiki.php/Music/Cormorant", "/pmwiki/pmwiki.php/Music/ThinLizzy", "/pmwiki/pmwiki.php/Music/Mudvayne", "/pmwiki/pmwiki.php/Music/BrooksAndDunn", "/pmwiki/pmwiki.php/Music/PaulMcCartney", "/pmwiki/pmwiki.php/Music/REM", "/pmwiki/pmwiki.php/Music/CharlesMingus", "/pmwiki/pmwiki.php/Music/ProtestTheHero", "/pmwiki/pmwiki.php/Music/XTC", "/pmwiki/pmwiki.php/Music/Sloan", "/pmwiki/pmwiki.php/Music/JasonAldean", "/pmwiki/pmwiki.php/Music/Cormorant", "/pmwiki/pmwiki.php/Music/Metallica", "/pmwiki/pmwiki.php/Music/JasonNewsted", "/pmwiki/pmwiki.php/Music/SCANDAL", "/pmwiki/pmwiki.php/Music/Kyuss", "/pmwiki/pmwiki.php/Music/QueensOfTheStoneAge", "/pmwiki/pmwiki.php/Music/TheCars", "/pmwiki/pmwiki.php/Music/Atheist", "/pmwiki/pmwiki.php/Music/WeatherReport", "/pmwiki/pmwiki.php/Music/OfMiceAndMen", "/pmwiki/pmwiki.php/Music/CheapTrick", "/pmwiki/pmwiki.php/Music/BlueCheer", "/pmwiki/pmwiki.php/Music/TheKentuckyHeadhunters", "/pmwiki/pmwiki.php/Music/ThrobbingGristle", "/pmwiki/pmwiki.php/Music/RiseAgainst", "/pmwiki/pmwiki.php/Music/SuziQuatro", "/pmwiki/pmwiki.php/Creator/KeanuReeves", "/pmwiki/pmwiki.php/Music/TheGazette", "/pmwiki/pmwiki.php/Music/Lonestar", "/pmwiki/pmwiki.php/Music/BigAndRich", "/pmwiki/pmwiki.php/Music/TheAllAmericanRejects", "/pmwiki/pmwiki.php/Music/DoesItOffendYouYeah", "/pmwiki/pmwiki.php/Music/Mastodon", "/pmwiki/pmwiki.php/Music/TaijiSawada", "/pmwiki/pmwiki.php/Music/XJapan", "/pmwiki/pmwiki.php/Music/Loudness", "/pmwiki/pmwiki.php/Music/TheKillingRedAddiction", "/pmwiki/pmwiki.php/Music/JobForACowboy", "/pmwiki/pmwiki.php/Music/Havok", "/pmwiki/pmwiki.php/Website/YouTube", "/pmwiki/pmwiki.php/Music/Space", "/pmwiki/pmwiki.php/Music/JasonAldean", "/pmwiki/pmwiki.php/Music/KellyClarkson", "/pmwiki/pmwiki.php/Music/LeeAnnWomack", "/pmwiki/pmwiki.php/Music/SteveVai", "/pmwiki/pmwiki.php/Music/MrBig", "/pmwiki/pmwiki.php/Music/Kiss", "/pmwiki/pmwiki.php/Creator/GarySinise", "/pmwiki/pmwiki.php/Series/CSINY", "/pmwiki/pmwiki.php/Music/MotleyCrue", "/pmwiki/pmwiki.php/Music/Adolescents", "/pmwiki/pmwiki.php/Music/BigBigTrain", "/pmwiki/pmwiki.php/Music/Squarepusher", "/pmwiki/pmwiki.php/Music/Yes", "/pmwiki/pmwiki.php/Music/TypeONegative", "/pmwiki/pmwiki.php/Music/ThePolice", "/pmwiki/pmwiki.php/Music/DuranDuran", "/pmwiki/pmwiki.php/Music/Overkill", "/pmwiki/pmwiki.php/Music/SidVicious", "/pmwiki/pmwiki.php/Music/Rage", "/pmwiki/pmwiki.php/Music/PinkFloyd", "/pmwiki/pmwiki.php/Music/PinkFloyd", "/pmwiki/pmwiki.php/Music/SydBarrett", "/pmwiki/pmwiki.php/Music/Minutemen", "/pmwiki/pmwiki.php/Music/TheStooges", "/pmwiki/pmwiki.php/Music/IanDuryAndTheBlockheads", "/pmwiki/pmwiki.php/Music/MindlessSelfIndulgence", "/pmwiki/pmwiki.php/Music/MyChemicalRomance", "/pmwiki/pmwiki.php/Music/CannibalCorpse", "/pmwiki/pmwiki.php/Music/FallOutBoy", "/pmwiki/pmwiki.php/Music/AshleeSimpson", "/pmwiki/pmwiki.php/Music/KingCrimson", "/pmwiki/pmwiki.php/Music/UK", "/pmwiki/pmwiki.php/Music/Asia", "/pmwiki/pmwiki.php/Music/TalkingHeads", "/pmwiki/pmwiki.php/Music/TomTomClub", "/pmwiki/pmwiki.php/Music/EarthWindAndFire", "/pmwiki/pmwiki.php/Music/TheBeachBoys", "/pmwiki/pmwiki.php/Music/BrianWilson", "/pmwiki/pmwiki.php/Music/LivingColour", "/pmwiki/pmwiki.php/Music/Winger", "/pmwiki/pmwiki.php/Music/PublicImageLtd", "/pmwiki/pmwiki.php/Music/ChthoniC", "/pmwiki/pmwiki.php/Music/DaYoopers", "/pmwiki/pmwiki.php/Music/Jamiroquai", "/pmwiki/pmwiki.php/Music/Blink182", "/pmwiki/pmwiki.php/Music/IDontKnowHowButTheyFoundMe", "/pmwiki/pmwiki.php/Music/TheBrobecks", "/pmwiki/pmwiki.php/Music/Sabaton", "/pmwiki/pmwiki.php/Manga/KOn", "/pmwiki/pmwiki.php/Manga/Fuuka", "/pmwiki/pmwiki.php/Film/WaynesWorld", "/pmwiki/pmwiki.php/VideoGame/GuitarHero", "/pmwiki/pmwiki.php/Music/Gorillaz", "/pmwiki/pmwiki.php/Anime/DigimonAdventure02", "/pmwiki/pmwiki.php/Anime/DigimonAdventureTri", "/pmwiki/pmwiki.php/Series/Lost", "/pmwiki/pmwiki.php/ComicBook/ScottPilgrim", "/pmwiki/pmwiki.php/VideoGame/PokemonBlack2AndWhite2", "/pmwiki/pmwiki.php/Film/ThisIsSpinalTap", "/pmwiki/pmwiki.php/Anime/Interstella5555", "/pmwiki/pmwiki.php/ComicBook/AdventureTimeMarcelineAndTheScreamQueens", "/pmwiki/pmwiki.php/WesternAnimation/AdventureTime", "/pmwiki/pmwiki.php/WesternAnimation/Metalocalypse", "/pmwiki/pmwiki.php/VideoGame/GuitarHero", "/pmwiki/pmwiki.php/Franchise/TheMuppets", "/pmwiki/pmwiki.php/VideoGame/NightInTheWoods", "/pmwiki/pmwiki.php/Music/Gorillaz", "/pmwiki/pmwiki.php/Music/OrchestralManoeuvresInTheDark"], "non_media_links": ["/pmwiki/pmwiki.php/Main/NobodyLovesTheBassist", "/pmwiki/pmwiki.php/Main/EnsembleDarkhorse", "/pmwiki/pmwiki.php/Main/VocalTagTeam", "/pmwiki/pmwiki.php/Main/FaceOfTheBand", "/pmwiki/pmwiki.php/Main/MrFanservice", "/pmwiki/pmwiki.php/Main/MsFanservice", "/pmwiki/pmwiki.php/Main/BreakupBreakout", "/pmwiki/pmwiki.php/Main/DeadArtistsAreBetter", "/pmwiki/pmwiki.php/Main/NobodyLovesTheBassist", "/pmwiki/pmwiki.php/Main/SisterTrope", "/pmwiki/pmwiki.php/Main/LeadDrummer", "/pmwiki/pmwiki.php/Main/FaceOfTheBand", "/pmwiki/pmwiki.php/Main/MsFanservice", "/pmwiki/pmwiki.php/Main/HeterosexualLifePartners", "/pmwiki/pmwiki.php/Main/VocalTagTeam", "/pmwiki/pmwiki.php/Main/VocalTagTeam", "https://www.youtube.com/watch?v=MZg1Hs0YfX8", "/pmwiki/pmwiki.php/Main/NobodyLovesTheBassist", "/pmwiki/pmwiki.php/Main/RecordProducer", "/pmwiki/pmwiki.php/Main/CountryMusic", "/pmwiki/pmwiki.php/Main/RecordProducer", "/pmwiki/pmwiki.php/Main/AttentionDeficitCreatorDisorder", "/pmwiki/pmwiki.php/Main/VocalTagTeam", "/pmwiki/pmwiki.php/Main/VocalTagTeam", "/pmwiki/pmwiki.php/Main/VocalTagTeam", "/pmwiki/pmwiki.php/Main/LeadDrummer", "/pmwiki/pmwiki.php/Main/StepUpToTheMicrophone", "/pmwiki/pmwiki.php/Main/IAmTheBand", "/pmwiki/pmwiki.php/Main/NamedLikeMyName", "/pmwiki/pmwiki.php/Main/VocalTagTeam", "/pmwiki/pmwiki.php/Main/IAmTheBand", "/pmwiki/pmwiki.php/Main/NarmCharm", "https://youtu.be/K5qZkbhoCmQ", "https://youtu.be/f1oEiBZaMk8", "https://youtu.be/-MpkjtyfeD0", "https://youtu.be/qtBpbSiIKSA", "https://youtu.be/B1N-9-pj-r4", "/pmwiki/pmwiki.php/Main/FaceOfTheBand", "/pmwiki/pmwiki.php/Main/VocalTagTeam", "/pmwiki/pmwiki.php/Main/MrFanservice", "/pmwiki/pmwiki.php/Main/FaceOfTheBand", "/pmwiki/pmwiki.php/Main/VocalTagTeam", "/pmwiki/pmwiki.php/Main/HardRock", "/pmwiki/pmwiki.php/Main/FaceOfTheBand", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Main/RevolvingDoorBand", "/pmwiki/pmwiki.php/Main/LePond", "/pmwiki/pmwiki.php/Main/AttentionDeficitCreatorDisorder", "/pmwiki/pmwiki.php/Main/VocalTagTeam", "/pmwiki/pmwiki.php/Main/RecordProducer", "/pmwiki/pmwiki.php/Main/FaceOfTheBand", "/pmwiki/pmwiki.php/Main/FaceOfTheBand", "/pmwiki/pmwiki.php/Main/TheNineties", "/pmwiki/pmwiki.php/Main/IconicItem", "/pmwiki/pmwiki.php/Main/FaceOfTheBand", "http://en.wikipedia.org/wiki/Double_bass", "/pmwiki/pmwiki.php/Main/FaceOfTheBand", "/pmwiki/pmwiki.php/Main/VocalTagTeam", "/pmwiki/pmwiki.php/Main/IAmTheBand", "/pmwiki/pmwiki.php/Main/NobodyLovesTheBassist", "/pmwiki/pmwiki.php/Main/FaceOfTheBand", "/pmwiki/pmwiki.php/Main/TheFaceOfTheBand", "/pmwiki/pmwiki.php/Main/TechnicalDeathMetal", "/pmwiki/pmwiki.php/Main/EnsembleDarkhorse", "/pmwiki/pmwiki.php/Main/VisualKei", "/pmwiki/pmwiki.php/Main/FaceOfTheBand", "/pmwiki/pmwiki.php/Main/VocalTagTeam", "/pmwiki/pmwiki.php/Main/EpicRiff", "/pmwiki/pmwiki.php/Main/PostPunk", "/pmwiki/pmwiki.php/Main/GenreBusting", "/pmwiki/pmwiki.php/Main/ThrashMetal", "/pmwiki/pmwiki.php/Main/FaceOfTheBand", "/pmwiki/pmwiki.php/Main/FaceOfTheBand", "/pmwiki/pmwiki.php/Main/FaceOfTheBand", "/pmwiki/pmwiki.php/Main/LeadDrummer", "/pmwiki/pmwiki.php/Main/VocalTagTeam", "/pmwiki/pmwiki.php/Main/RevolvingDoorBand", "/pmwiki/pmwiki.php/Main/HeterosexualLifePartners", "/pmwiki/pmwiki.php/Main/TechnicalDeathMetal", "/pmwiki/pmwiki.php/Main/DreadfulMusician", "/pmwiki/pmwiki.php/Main/BreakupBreakout", "/pmwiki/pmwiki.php/Main/EstrogenBrigade", "/pmwiki/pmwiki.php/Main/TheLancer", "/pmwiki/pmwiki.php/Main/TheHero", "/pmwiki/pmwiki.php/Main/ManicStreetPreachers", "/pmwiki/pmwiki.php/Main/MsFanservice", "/pmwiki/pmwiki.php/Main/FaceOfTheBand", "/pmwiki/pmwiki.php/Main/LeadBassist", "/pmwiki/pmwiki.php/Main/FaceOfTheBand", "/pmwiki/pmwiki.php/Main/ComedicUnderwearExposure", "/pmwiki/pmwiki.php/Main/FaceOfTheBand", "/pmwiki/pmwiki.php/Main/AxeCrazy", "/pmwiki/pmwiki.php/Main/PsychopathicManchild", "/pmwiki/pmwiki.php/Main/DubNameChange", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Main/MsFanservice", "/pmwiki/pmwiki.php/Main/CanonForeigner", "/pmwiki/pmwiki.php/Main/NobodyLovesTheBassist", "/pmwiki/pmwiki.php/Main/BreakoutCharacter", "/pmwiki/pmwiki.php/Main/PlayerCharacter", "/pmwiki/pmwiki.php/Main/MagnificentBastard", "/pmwiki/pmwiki.php/Main/InUniverse", "/pmwiki/pmwiki.php/Main/CreepyAwesome", "https://www.youtube.com/channel/UCgFvT6pUq9HLOvKBYERzXSQ"]}