{"title": "Dirty Foreigner", "content": "One of the easiest ways to look down upon another person is to make fun of their personal hygiene. This extends sometimes to entire nationalities. Thus, the Dirty Foreigner trope was born.\n\nThis trope is strange in that it, in particular, unlike the Funny Foreigner, is a Discredited Trope at best, possibly verging on a Dead Horse Trope, and is most often used today in subversion, as a quick and easy way to tell that a character has a prejudice against another group, and that character is usually painted in a negative light. The French are a particularly common target for this trope, though it is by no means exclusive to them.\n\nSee also The Pig Pen.\n• Osaka begins wondering along the lines of this trope at one point in Azumanga Daioh. Osaka: In American homes.. (...) You can go inside with your shoes, right? \n\nYukari-sensei: Yes.. \n\nOsaka: Then what if they step on dog poop and go back inside home without noticing? What if the American dad, mom, brothers and sisters step on dog poop and go inside without noticing? In American homes.. (...) You can go inside with your shoes, right?Yes..\n• In Viz, a foaming at the mouth rabid dog enters Britain through the then recently opened Channel Tunnel, followed shortly by its French owner, who explains that the dog isn't rabid but ate some soap having mistaken it for cheese, because we do not have soap in France.\n• A Brighter Dark: Hoshidans tend to have this opinion of anyone who isn't Hoshidan. Nohrians especially, but also non-humans and tribals.\n• In Isaac Asimov's The Caves of Steel protagonist Elijah Baley notes that the Earth rhyme against the foreign \"Spacers\" (people who settled worlds besides Earth) always seems to include \"Dirty Spacers\", and that \"dirty\" seems to be a common insult against those you hate. Ironically, the Spacers consider Earth people as dirty, and are correct, as the Spacers have eliminated most communicable diseases and compared to them, Earth people are bags of disease and a danger to Spacers due to a mostly unused Spacer immune system.\n• In addition, when Elijah Baley visits a Spacer world in the sequel, the bathroom is so clean it gleams (because it is cleaned by robots after every use and uses advanced materials) that he wonders how he will adjust when he has to go back to using communal bathrooms on Earth.\n• Historical downtimers are treated this way in Time Scout.\n• In Tom Sharpe's novels, the mutual respect with which the two kinds of white South Africans look upon each other... both British-descended and Dutch-descended Afrikaaners will use the trope of soap-innocence to describe each other...\n• In Jingo, this is discussed and averted; Colon says that a sign of the good Morporkian way of life is \"washing regular\", and Nobby (who probably doesn't wash regular himself) mentions that he's never seen Mr. Goriff and his family with dirty clothes.\n• Buffy the Vampire Slayer: Anya punishes a philanderer. When his girlfriend wishes he was a frog, Anya makes him French. Now he smells.\n• The very first line in The Drew Carey Show was an Orphaned Punchline about this. Lewis: ...and that's why the French don't wash.\n• This appears in various iterations of Star Trek as a stereotype of Klingons; Starfleet crewmen make racist jokes about Klingon hygiene and body odor in Star Trek VI: The Undiscovered Country and Q makes similar barbs about Worf in The Next Generation, even in Worf's presence (he's a god, what could Worf do to him?).\n• This American Life: in a bit by David Sedaris that takes place while he's living in France, on the French subway he overhears an ugly American Hawaiian-Shirted Tourist and his wife talking loudly about (among other things) how much French people stink. Including Sedaris, who (a) isn't French, he's only living there and (b) just took a bath.\n• \"Tales of the White Street Society\" by Grady Hendrix has the very obviously prejudiced protagonist repeatedly claim this of the Irish.\n• A fantastical, Animal Jingoism variant in BoJack Horseman. Mice have an entire holiday dedicated to demonizing cats, and the song they sing has a line about how cats smell bad.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/DirtyForeigner", "media_links": ["/pmwiki/pmwiki.php/Manga/AzumangaDaioh", "/pmwiki/pmwiki.php/ComicBook/Viz", "/pmwiki/pmwiki.php/Film/Borat", "/pmwiki/pmwiki.php/Creator/IsaacAsimov", "/pmwiki/pmwiki.php/Literature/TheCavesOfSteel", "/pmwiki/pmwiki.php/Literature/TimeScout", "/pmwiki/pmwiki.php/Creator/TomSharpe", "/pmwiki/pmwiki.php/Series/BuffyTheVampireSlayer", "/pmwiki/pmwiki.php/Series/TheDrewCareyShow", "/pmwiki/pmwiki.php/Franchise/StarTrek", "/pmwiki/pmwiki.php/Film/StarTrekVITheUndiscoveredCountry", "/pmwiki/pmwiki.php/Series/StarTrekTheNextGeneration", "/pmwiki/pmwiki.php/Radio/ThisAmericanLife", "/pmwiki/pmwiki.php/WesternAnimation/BoJackHorseman"], "non_media_links": ["/pmwiki/pmwiki.php/Main/FunnyForeigner", "/pmwiki/pmwiki.php/Main/DiscreditedTrope", "/pmwiki/pmwiki.php/Main/DeadHorseTrope", "/pmwiki/pmwiki.php/Main/ThePigPen", "/pmwiki/pmwiki.php/Main/Anime", "/pmwiki/pmwiki.php/Main/Manga", "/pmwiki/pmwiki.php/Main/CloudCuckoolander", "/pmwiki/pmwiki.php/Main/FridgeHorror", "/pmwiki/pmwiki.php/Main/ComicBooks", "/pmwiki/pmwiki.php/Main/FanWorks", "/pmwiki/pmwiki.php/FanFic/ABrighterDark", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Discworld/Jingo", "/pmwiki/pmwiki.php/Main/InsultFriendlyFire", "/pmwiki/pmwiki.php/Main/AsianStoreOwner", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/OrphanedPunchline", "/pmwiki/pmwiki.php/Main/PhysicalGod", "/pmwiki/pmwiki.php/Main/Radio", "/pmwiki/pmwiki.php/Main/BilingualBackfire", "/pmwiki/pmwiki.php/Main/HawaiianShirtedTourist", "/pmwiki/pmwiki.php/Main/WebOriginal", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/AnimalJingoism"]}