{"title": "Puny Parachute", "content": "In Real Life, parachutes are big; rarely less than twelve to fifteen feet across once unfurled. But in animation (and comics especially), parachutes are usually much smaller — a four to six foot diameter for example — yet somehow, they still manage to work just as well (if not better) than their real life counterparts. This also applies to airship envelopes, and for the same reasons.\n\nThis is based on the Rule of Perception, as a realistically proportioned parachute would reduce the user to little more than a dot or a line hanging from it.\n\nA type of Balloonacy, with Parasol Parachute as a distinct subtrope usually Played for Laughs. See also Improvised Parachute, which often fits this trope.\n• In Aladdin, the main character jumps from a building and uses an approximately 2x2 foot scarf to soften his fall. Try that and good luck in not reducing your leg bones to shards.\n• Undercover Brother. When Undercover Brother falls over the edge of the cliff near the end of the movie, he floats to the ground using his bell-bottom pants as a parachute. They are much smaller than a normal parachute.\n• Pee-wee's Big Adventure - when Pee-Wee drives Mickey's Edsel convertible off a cliff, after several seconds of screaming, he raises the top, which balloons out a small amount and floats the two-ton car to a soft landing.\n• The Great Race - Professor Fate has a small pedal-powered airship - but the envelope component looks too small to lift the metal gondola framework, let alone a person - and it carries two people. Still, it looks cool.\n• The Great Dictator. One of the wacky inventions demonstrated by Grand Marshall Herring is a hat parachute. It doesn't work.\n• In the first Skylark Series book by E. E. \u0093Doc\u0094 Smith, the antagonist Marc \"Blackie\" DuQuesne bails out from the titular spacecraft while high in Earth's atmosphere, using a parachute designed for compactness on a world with both considerably lower gravity and higher atmospheric density than Earth . While the landing isn't described, there's no indication of him requiring a lengthy stay in hospital when he reappears in the next book.\n• Kamen Rider Fourze has a specific switch that gives him three of these. Somehow they can help him survive re-entry into the Earth's atmosphere.\n• Almost every dirigible in Girl Genius is ridiculously small for its lifting power.\n• The Legend of Zelda:\n• The Deku Leaf in The Legend of Zelda: The Wind Waker is used to slow falls and ride updrafts; it's only about two or three feet to a side, though it at least relies on magic for its power to stay aloft.\n• The sailcloth used by Link in The Legend of Zelda: Skyward Sword is used for similar purposes and is of similar size.\n• The Paraglider in The Legend of Zelda: Breath of the Wild is at least a bit bigger than the previous two, and unlike them it seems specifically designed for this function. It's nonetheless way too small to realistically serve this function. In what might be a sneaky Lampshade Hanging, a scientist studying the Rito thinks their wings are too small to function, and asks you to provide scientific data by using the paraglider to fly as far as possible — he doesn't outright say it, but since they both have the same problem, it makes sense that it would make a good scientific analogue.\n• The Aladdin example under Film also applies to the SNES platformer, though the player needs to pick up the rug first.\n• World of Warcraft has raggedy, patched parachutes that are about six feet squares but work perfectly until their time runs out or you land. The engineering tinker goblin glider has a pair of wings that unfold from one's cloak that are about the same surface area.\n• The B.A.S.E. Jumper parachute in Team Fortress 2 isn't much bigger than an umbrella. Notably, it can only be used by the two classes who can Rocket Jump.\n• In Balloon Fight, the parachute used by enemies after you pop their balloons is no wider than they are. The parachute can be attacked like any balloon, and destroying it sends the enemy to a watery death.\n• The Herculoids. Whenever Gloop or Gleep turn themselves into an Improvised Parachute, they're significantly smaller than a regular parachute — too small to provide the braking power they do.\n• Any and every Warner Bros. cartoon parachute.\n• Many cartoons show umbrellas being used as parachutes — the real-life consequences are shown on The Venture Bros. when Hank jumps off the roof of the compound with an umbrella (in a Batman Halloween costume), with fatal results.\n• One episode of He-Man and the Masters of the Universe (1983) shows the short-but-massive Ram-Man descending on a parachute only slightly wider than his shoulders.\n• The Perils of Penelope Pitstop. Penelope once used her scarf as a parachute after jumping from a plane.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/PunyParachute", "media_links": ["/pmwiki/pmwiki.php/Disney/Aladdin", "/pmwiki/pmwiki.php/Film/UndercoverBrother", "/pmwiki/pmwiki.php/Film/PeeWeesBigAdventure", "/pmwiki/pmwiki.php/Film/TheGreatRace", "/pmwiki/pmwiki.php/Film/TheGreatDictator", "/pmwiki/pmwiki.php/Literature/SkylarkSeries", "/pmwiki/pmwiki.php/Creator/EEDocSmith", "/pmwiki/pmwiki.php/Series/KamenRiderFourze", "/pmwiki/pmwiki.php/Webcomic/GirlGenius", "/pmwiki/pmwiki.php/Franchise/TheLegendOfZelda", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaTheWindWaker", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaSkywardSword", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaBreathOfTheWild", "/pmwiki/pmwiki.php/VideoGame/AladdinCapcom", "/pmwiki/pmwiki.php/VideoGame/WorldOfWarcraft", "/pmwiki/pmwiki.php/VideoGame/TeamFortress2", "/pmwiki/pmwiki.php/VideoGame/BalloonFight", "/pmwiki/pmwiki.php/WesternAnimation/TheHerculoids", "/pmwiki/pmwiki.php/Creator/WarnerBros", "/pmwiki/pmwiki.php/WesternAnimation/TheVentureBrothers", "/pmwiki/pmwiki.php/WesternAnimation/HeManAndTheMastersOfTheUniverse1983", "/pmwiki/pmwiki.php/WesternAnimation/ThePerilsOfPenelopePitstop"], "non_media_links": ["/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/Main/RuleOfPerception", "/pmwiki/pmwiki.php/Main/Balloonacy", "/pmwiki/pmwiki.php/Main/ParasolParachute", "/pmwiki/pmwiki.php/Main/PlayedForLaughs", "/pmwiki/pmwiki.php/Main/ImprovisedParachute", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/JustifiedTrope", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/RuleOfThree", "/pmwiki/pmwiki.php/Main/Webcomics", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/AWizardDidIt", "/pmwiki/pmwiki.php/Main/LampshadeHanging", "/pmwiki/pmwiki.php/Main/BirdPeople", "/pmwiki/pmwiki.php/Main/AchievementsInIgnorance", "/pmwiki/pmwiki.php/Main/RocketJump", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/ImprovisedParachute"]}