{"title": "Third Is 3D", "content": "For a period in the Eighties, it was not uncommon for the third film in a series to be released in 3D. With the current flood of 3D film releases, this has once again become common practice. It may or may not also be set in a foreign country.\n\nAlso, a common trend in the times of the first Video Game 3D Leaps, was to have two 2D games, and make the third a 3D one, with titles such as:\n• Spy Kids\n• Taken even further with the fourth Spy Kids movie, which was released 4D (scratch and sniff).\n• Grand Theft Auto III, while not the first three dimensional game in the series (as the first two also had a height dimension), was the first to feature three-dimensional camera angles, in contrast to its forerunners' top-down views.\n• The \"Solid\" in the original Metal Gear Solid comes from not just Solid Snake's codename, but also from solid geometry (since it was the first game in the series to be made in 3D), while also being a subtle way of indicating that it was a sequel to the first two Metal Gear games on the MSX2 (the original Metal Gear and Metal Gear 2: Solid Snake). The choice of \"solid\" was also a slight jab at SquareSoft, a company which Konami viewed as a rival, since a \"solid\" is a square with an extra dimension.\n• When Metal Gear Solid 3: Snake Eater was ported to the Nintendo3DS, the title was changed slightly to Metal Gear Solid: Snake Eater 3D.\n• Splinter Cell: Chaos Theory, much like MGS3, was ported to the Nintendo 3DS under the title Splinter Cell 3D.\n• Wolfenstein. First there were the two Apple games, and then id Software bought the rights to the title and released Wolfenstein 3D (even though the Apple games don't really belong to the Wolfenstein series.)\n• The official title of Doom 3 is actually Doom³, the \"cubed\" is interpreted by some as meaning \"3D\". This one is interesting, as it announced a switch from \"fake\" 3D using sprite scaling to \"true\" polygon-based 3D.\n• Sly 3: Honor Among Thieves parodied this by giving the game 3D sections to be used with the glasses included in the case. Effectively making it the game that followed the movie method.\n• Marvel vs. Capcom 3 has 3D visuals. The play mechanics and hit-boxes still remain 2D.\n• Bubsy 3D is actually the fourth game in the series. The lesser-known Bubsy in Fractured Furry Tales was released exclusively for the Atari Jaguar following the first two games on 16-bit consoles.\n• Fallout 1 and 2 were isometric... and you can guess where this is going... Like Duke Nukem, however, there were a few Gaiden Games between 2 and 3.\n• RollerCoaster Tycoon 3 was in full polygonal graphics, unlike the first two games. It even allowed to ride a coaster in first-person view.\n• Dangeresque 3: The Criminal Projective...in 3D!, though that one changed medium from web toon to graphical adventure game.\n• Puzzle Bobble 3 was titled Bust-a-Move 3DX in some countries.\n• If you consider the light-gun game Ghoul Panic as part of the Point Blank series, then it marks the spot where the games switched from 2D to full 3D characters and environments.\n• Micro Machines V3 and Sonic 3D Blast are aversions, as they weren't actually the third game in the series.\n• Played straight with Sonic 3. While it wasn't a 3D game, the title screen actually used pre-rendered 3D as opposed to the pixel art tile screens in the first 2.\n• The third DJ Hero game would have been a Nintendo 3DS spin-off entitled DJ Hero 3D. The game appears to have been cancelled, however. You have Warriors of Rock to blame for it (although Activision has acknowledged that had DJ Hero not existed to begin with, Guitar Hero may still be up and running).\n• The 3DS itself, if you take the DS as the first and DSi as the second (and dismiss the Lite and XL as revisions).\n• Nintendo 64: While not stereoscopic 3D and it did not have 3D in its name, it was Nintendo's third home console and the first to render Polygonal Graphics natively (the Super NES could only do so via the Super FX chip used by certain games).\n• PlayStation 3: Not at first, but eventually gained 3DTV support via a firmware update.\n• Paper Mario might be an example or inversion depending on if you view Super Paper Mario as a spinoff or not.\n• Super Paper Mario might be an inversion, as normal gameplay is in 2-D, and 3-D is instead an optional feature only Mario can use.\n• Alternatively, Paper Mario: Sticker Star for the 3DS is the third game if you consider SPM to be a spinoff considering its change of gameplay.\n• Guilty Gear Xrd, kinda. It uses 3D models to imitate 2D sprites and is the third \"X\" game in the series, though it's technically the fourth fighting game since the original Guilty Gear didn't use an X in the title, and 6th if you count Isuka and Overture (it is the first non-spinoff after Overture, which was explicitly numbered 2, though).\n• Semi-subverted with Rayman, which has a game called Rayman 3D, a 3DS Updated Re-release of Rayman 2, which is arguably the last one you'd expect from that title.\n• Warcraft III was fully-3D, after the first two and their expansions were isometric.\n• The first two Age of Empires games were barely isometric, while the third blew away its competition in the 3D graphics part.\n• Command & Conquer, the third games in both the Tiberium series and the Red Alert series used a 3D engine. There's also a more meta example involving Generals, the first fully-3D RTS in the series which started a third continuity to Command & Conquer. Also, if you consider Dune 2000 as a separate game instead of a remake of Dune II (which was technically the first game, being entirely unrelated to the other Dune game from 1992), then Emperor: Battle for Dune counts as well.\n• The third Gabriel Knight game, Blood of the Sacred, Blood of the Damned, was in 3D. In hindsight its creators call jumping on the 3D bandwagon a wrong decision. Same as Full Motion Video for the second game.\n• A third Jazz Jackrabbit game was planned to be a 3D platformer, but was cancelled.\n• The third RoboCop Licensed Game for Atari ST, Amiga and DOS was in 3D, though it was simply titled RoboCop 3, and Ocean also made 2D games with the same title for other systems.\n• Data East's Side Pocket series became a \"3D Polygonal Billiard Game\" for its third and last installment.\n• After using sprite graphics for the first two Corpse Party titles, the third game in the series, Corpse Party: Blood Drive, switched to the Unity Engine to render the previous games' environments in 3D.\n• The first two Trine games used polygonal graphics for its backgrounds and characters, but gameplay was strictly on a two-dimensional plane. Trine 3: The Artifacts of Power brought the game into full 3D.\n• Excitebike 64 is the third game in the Excite series and the first with full 3D graphics and gameplay (the second game was a Japan-only Mission-Pack Sequel of the first).\n• Sniper Elite III: The series was in 3D from the start, but the third game can be played in stereoscopic 3D if you have the right sort of TV.\n• In terms of mainline Shin Megami Tensei games, Shin Megami Tensei and Shin Megami Tensei II were in 2D, while Shin Megami Tensei III: Nocturne was in 3D, including during all battles, the latter quality not seen again in the mainline series before or since.\n• The 2D RPG Chrono Trigger was followed by the visual novel Radical Dreamers, which was in turn followed by Chrono Cross, which used 3D models for its characters. The backgrounds were still 2D though.\n• Averted by Space Harrier 3D, which is actually the second game in the series, being followed by, strangely enough, Space Harrier II.\n• The third album of Psychostick is named Space Vampires VS Zombie Dinosaurs in 3D.\n• Parodied by Psych, which titled its third Yin/Yang episode \"Yang 3 in 2D\".\n• \"Weird Al\" Yankovic subverts this, as it's his second album that's titled In 3-D.\n• The third track on Tito Puente's Dance Mania Vol 1 is called \"3-D Mambo\".\n• The third installment of the VH1 miniseries I Love the '80s is in 3D. It uses a a process called ChromaDepth that appears in 3D when using a special pair of ChromaDepth glasses, but the process allows the show to be viewable in normal 2D (unlike the anaglyphic 3D process). These glasses for the show were available free at Best Buy stores across the United States.\n• Universal Studios' Terminator 2 3-D: Battle Across Time, if you count it as the third installment of the franchise.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/ThirdIs3D", "media_links": ["/pmwiki/pmwiki.php/Film/FridayThe13thPartIII", "/pmwiki/pmwiki.php/Film/Amityville3D", "/pmwiki/pmwiki.php/Film/Jaws3D", "/pmwiki/pmwiki.php/Film/FridayThe13thPartIII", "/pmwiki/pmwiki.php/WesternAnimation/IceAge3DawnOfTheDinosaurs", "/pmwiki/pmwiki.php/Series/Jackass", "/pmwiki/pmwiki.php/Film/MenInBlack3", "/pmwiki/pmwiki.php/Film/Piranha3D", "/pmwiki/pmwiki.php/Film/TheRing", "/pmwiki/pmwiki.php/Film/SpyKids", "/pmwiki/pmwiki.php/Film/StepUp", "/pmwiki/pmwiki.php/Film/TransformersDarkOfTheMoon", "/pmwiki/pmwiki.php/Film/AVeryHaroldAndKumar3DChristmas", "/pmwiki/pmwiki.php/Film/Zombi3D", "/pmwiki/pmwiki.php/WesternAnimation/Madagascar3EuropesMostWanted", "/pmwiki/pmwiki.php/Film/Krrish", "/pmwiki/pmwiki.php/Film/IronMan3", "/pmwiki/pmwiki.php/VideoGame/DukeNukem3D", "/pmwiki/pmwiki.php/VideoGame/EarthwormJim", "/pmwiki/pmwiki.php/VideoGame/GrandTheftAutoIII", "/pmwiki/pmwiki.php/VideoGame/MetalGearSolid", "/pmwiki/pmwiki.php/VideoGame/MetalGear", "/pmwiki/pmwiki.php/VideoGame/MetalGear", "/pmwiki/pmwiki.php/VideoGame/MetalGear2SolidSnake", "/pmwiki/pmwiki.php/Creator/SquareSoft", "/pmwiki/pmwiki.php/Creator/Konami", "/pmwiki/pmwiki.php/VideoGame/MetalGearSolid3SnakeEater", "/pmwiki/pmwiki.php/VideoGame/PrinceOfPersia3D", "/pmwiki/pmwiki.php/VideoGame/SplinterCell", "/pmwiki/pmwiki.php/VideoGame/Wolfenstein3D", "/pmwiki/pmwiki.php/VideoGame/Wolfenstein3D", "/pmwiki/pmwiki.php/VideoGame/Doom", "/pmwiki/pmwiki.php/VideoGame/Sly3HonorAmongThieves", "/pmwiki/pmwiki.php/VideoGame/MarvelVsCapcom3", "/pmwiki/pmwiki.php/VideoGame/SimonTheSorcerer", "/pmwiki/pmwiki.php/VideoGame/Bubsy", "/pmwiki/pmwiki.php/VideoGame/Fallout1", "/pmwiki/pmwiki.php/VideoGame/Fallout2", "/pmwiki/pmwiki.php/VideoGame/DukeNukem", "/pmwiki/pmwiki.php/VideoGame/Fallout3", "/pmwiki/pmwiki.php/VideoGame/RollerCoasterTycoon", "/pmwiki/pmwiki.php/VideoGame/StrongBadsCoolGameForAttractivePeople", "/pmwiki/pmwiki.php/VideoGame/BubbleBobble", "/pmwiki/pmwiki.php/VideoGame/GhoulPanic", "/pmwiki/pmwiki.php/VideoGame/PointBlank", "/pmwiki/pmwiki.php/VideoGame/MicroMachines", "/pmwiki/pmwiki.php/VideoGame/Sonic3DBlast", "/pmwiki/pmwiki.php/VideoGame/Sonic3AndKnuckles", "/pmwiki/pmwiki.php/VideoGame/DJHero", "/pmwiki/pmwiki.php/VideoGame/GuitarHero", "/pmwiki/pmwiki.php/VideoGame/PaperMario", "/pmwiki/pmwiki.php/VideoGame/SuperPaperMario", "/pmwiki/pmwiki.php/VideoGame/PaperMarioStickerStar", "/pmwiki/pmwiki.php/VideoGame/GuiltyGear", "/pmwiki/pmwiki.php/VideoGame/Rayman", "/pmwiki/pmwiki.php/VideoGame/Rayman2", "/pmwiki/pmwiki.php/VideoGame/Warcraft", "/pmwiki/pmwiki.php/VideoGame/AgeOfEmpires", "/pmwiki/pmwiki.php/VideoGame/CommandAndConquer", "/pmwiki/pmwiki.php/VideoGame/CommandAndConquer3TiberiumWars", "/pmwiki/pmwiki.php/VideoGame/CommandAndConquerRedAlert3", "/pmwiki/pmwiki.php/VideoGame/CommandAndConquerGenerals", "/pmwiki/pmwiki.php/VideoGame/DuneII", "/pmwiki/pmwiki.php/VideoGame/Dune1992", "/pmwiki/pmwiki.php/VideoGame/EmperorBattleForDune", "/pmwiki/pmwiki.php/VideoGame/GabrielKnight", "/pmwiki/pmwiki.php/VideoGame/JazzJackrabbit", "/pmwiki/pmwiki.php/Franchise/RoboCop", "/pmwiki/pmwiki.php/Creator/DataEast", "/pmwiki/pmwiki.php/VideoGame/CorpseParty", "/pmwiki/pmwiki.php/VideoGame/Trine", "/pmwiki/pmwiki.php/VideoGame/Trine", "/pmwiki/pmwiki.php/VideoGame/Excite", "/pmwiki/pmwiki.php/VideoGame/SniperEliteIII", "/pmwiki/pmwiki.php/Franchise/ShinMegamiTensei", "/pmwiki/pmwiki.php/VideoGame/ShinMegamiTenseiI", "/pmwiki/pmwiki.php/VideoGame/ShinMegamiTenseiII", "/pmwiki/pmwiki.php/VideoGame/ShinMegamiTenseiIIINocturne", "/pmwiki/pmwiki.php/VideoGame/ChronoTrigger", "/pmwiki/pmwiki.php/VisualNovel/RadicalDreamers", "/pmwiki/pmwiki.php/VideoGame/ChronoCross", "/pmwiki/pmwiki.php/VideoGame/SpaceHarrier", "/pmwiki/pmwiki.php/Series/Psych", "/pmwiki/pmwiki.php/Music/WeirdAlYankovic", "/pmwiki/pmwiki.php/Music/TitoPuente", "/pmwiki/pmwiki.php/Music/DanceManiaVol1", "/pmwiki/pmwiki.php/Ride/UniversalStudios", "/pmwiki/pmwiki.php/Ride/Terminator23DBattleAcrossTime", "/pmwiki/pmwiki.php/Franchise/TheTerminator"], "non_media_links": ["/pmwiki/pmwiki.php/UsefulNotes/ThreeDMovie", "/pmwiki/pmwiki.php/Main/SequelGoesForeign", "/pmwiki/pmwiki.php/Main/VideoGame3DLeap", "/pmwiki/pmwiki.php/Main/UltraSuperDeathGorefestChainsawer3000", "/pmwiki/pmwiki.php/Main/NumberedSequels", "/pmwiki/pmwiki.php/Main/OddlyNamedSequel2ElectricBoogaloo", "/pmwiki/pmwiki.php/Main/SuperTitle64Advance", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/UsefulNotes/MSX", "/pmwiki/pmwiki.php/UsefulNotes/Nintendo3DS", "/pmwiki/pmwiki.php/Main/TwoAndAHalfD", "/pmwiki/pmwiki.php/UsefulNotes/PolygonalGraphics", "http://www.mobygames.com/game-group/catacomb-series", "/pmwiki/pmwiki.php/Main/TwoAndAHalfD", "/pmwiki/pmwiki.php/UsefulNotes/AtariJaguar", "/pmwiki/pmwiki.php/Main/GaidenGame", "/pmwiki/pmwiki.php/WebAnimation/HomestarRunner", "/pmwiki/pmwiki.php/UsefulNotes/Nintendo3DS", "/pmwiki/pmwiki.php/Main/FranchiseKiller", "/pmwiki/pmwiki.php/UsefulNotes/PolygonalGraphics", "/pmwiki/pmwiki.php/UsefulNotes/SuperNES", "/pmwiki/pmwiki.php/UsefulNotes/PlayStation3", "/pmwiki/pmwiki.php/Main/UpdatedRerelease", "/pmwiki/pmwiki.php/Main/FullMotionVideo", "/pmwiki/pmwiki.php/Main/LicensedGame", "/pmwiki/pmwiki.php/Main/MissionPackSequel", "/pmwiki/pmwiki.php/Main/SpritePolygonMix", "/pmwiki/pmwiki.php/Main/NinjaPirateZombieRobot", "/pmwiki/pmwiki.php/Main/TheEighties"]}