{"title": "The Stakeout", "content": "\"It's like basketball: you can run zone defense or man-to-man. Man-to-man is risky; follow someone too long and they're going to get suspicious. Zone is usually the way to go. Stay put and let targets come to you. Less obvious, easier on the feet... and you can catch up on your celebrity gossip.\"\n\nA character, group of characters or organization wants to solve a mystery or put a controversy to rest, and they decide the only way to solve it is to pack up and set up camp at a location where they believe something of interest will occur, such as their opponent's headquarters, in hope of finding some critical clue. Often they will go to rather extreme lengths to find just one critical clue. Almost invariably, there's a risk that someone will find out about the operation and blow the observers' cover, and all their efforts will be ruined... or worse.\n\nUsually, it's The Hero's True Companions who are doing this, but occasionally a villain will use a stakeout, often to find a weakness in their intended victim's security, or reveal their Secret Identity. And it almost certainly happens in Real Life, though probably not as often as in fiction.\n\nGenerally, to be a stakeout, the following conditions must be met:\n• The characters are watching one or more locations.\n• The characters involved in the operation must hide the fact that they are doing it from someone (or something) else.\n• The purpose of a stakeout is to gather intelligence. If the purpose is to surprise someone, that's an ambush. If the purpose is to trick someone into revealing something he wouldn't have otherwise, it's a sting. Of course, there's no reason a stakeout can't become a starting point for a sting or ambush operation.\n\nSupertrope of Spies in a Van. Often leads to Rear Window Investigation, We Wait.\n\nStakeouts are a fairly universal trope. Common in Detective Drama , they are also found in many other genres including adventure comedy , and even fantasy . TV shows almost always include this trope during an episode that parodies a cop or detective show. Since it can be a case of Truth in Television , it's an appropriate plot point for shows that are on the realistic end of the Sliding Scale of Realistic Versus Fantastic — but it's also a strategy that might believably still work even in Cloudcuckooland . It's simply applying the idea of being in the right place at the right time in a systematic way. Any character with the patience and self control, and sometimes the stealth and courage, has at least a small chance of being able to pull off a stakeout caper successfully.\n\nIt's also easily Played for Drama or Played for Laughs. Usually the question of importance to the plot is not the morality of subjecting someone to such scrutiny, but whether the team will be able to get anything useful before they're stopped by the opposing side, the press, the neighbors, or their own superiors. At any moment, they might find or miss something important or their cover might be blown. The characters' lives, careers, and reputations, or the lives of innocents, might be on the line if they're caught or the stakeout proves useless. Having a group of characters stuck in one spot maintaining The Masquerade that nothing unusual is going on is a great opportunity for dialog, character introduction, or character development. It's also a great opportunity for a moment of subtle humor to relieve the tension.\n\nThis trope provides plenty of opportunities for the writers to prolong the drama with dramatic or humorous sidestories. Amung the more commonly seen:\n• If the stakeout lasts for more than a couple days, the group will often add more personnel or equipment as time goes by. If a well-funded agency, that will often include wiretaps, hidden cameras, telescopes, laser-triggered alarms, etc., all to watch their \"opponent\".\n• They start snacking, and run out of food, so one character is sent to get more. The others complain about the food.\n• They get into a debate over something. It's at that moment one of them notices that for once something is happening and tells the others to be quiet.\n• They temporarily end up spying on someone involved in something titillating but either completely unrelated or only peripherally related to the overall mission. If The Hero is spying on a particularly sympathetic relatively innocent person or Anti-Villain, it's likely they'll end up working together later, or else their \"victim\" will turn out to be a Not-So-Harmless Villain.\n• The group decides that just watching isn't enough, resulting in a Rear Window Investigation.\n• Another common result is for one or more of the heroes to be discovered and captured by the villains they are spying on, precipitating the crisis that was delayed during the stakeout.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/TheStakeout", "media_links": ["/pmwiki/pmwiki.php/Series/BurnNotice", "/pmwiki/pmwiki.php/Anime/FullMetalPanicFumoffu", "/pmwiki/pmwiki.php/Manga/DekaWanko", "/pmwiki/pmwiki.php/Film/TheWreckingCrew", "/pmwiki/pmwiki.php/Film/Sneakers", "/pmwiki/pmwiki.php/Film/Stakeout", "/pmwiki/pmwiki.php/Film/ThatDarnCat", "/pmwiki/pmwiki.php/Creator/TomClancy", "/pmwiki/pmwiki.php/Film/ClearAndPresentDanger", "/pmwiki/pmwiki.php/Theatre/Oscar", "/pmwiki/pmwiki.php/Film/AttackOfTheKillerTomatoes", "/pmwiki/pmwiki.php/Film/ToLiveAndDieInLA", "/pmwiki/pmwiki.php/Creator/FrankHerbert", "/pmwiki/pmwiki.php/Literature/TheDresdenFiles", "/pmwiki/pmwiki.php/Literature/Edgedancer", "/pmwiki/pmwiki.php/Literature/TheStormlightArchive", "/pmwiki/pmwiki.php/Series/BurnNotice", "/pmwiki/pmwiki.php/Series/TheWire", "/pmwiki/pmwiki.php/Series/PushingDaisies", "/pmwiki/pmwiki.php/Series/NCIS", "/pmwiki/pmwiki.php/Film/Stakeout", "/pmwiki/pmwiki.php/Series/TheRockfordFiles", "/pmwiki/pmwiki.php/Series/YoungBlades", "/pmwiki/pmwiki.php/Franchise/Dragnet", "/pmwiki/pmwiki.php/Series/TheXFiles", "/pmwiki/pmwiki.php/Series/Monk", "/pmwiki/pmwiki.php/Series/Seinfeld", "/pmwiki/pmwiki.php/Series/TheProfessionals", "/pmwiki/pmwiki.php/VideoGame/MySims", "/pmwiki/pmwiki.php/VideoGame/Persona4", "/pmwiki/pmwiki.php/VideoGame/TeamFortress2", "/pmwiki/pmwiki.php/WesternAnimation/JusticeLeagueUnlimited", "/pmwiki/pmwiki.php/Franchise/WonderWoman", "/pmwiki/pmwiki.php/Franchise/Batman", "/pmwiki/pmwiki.php/WesternAnimation/Recess", "/pmwiki/pmwiki.php/WesternAnimation/SonicBoom"], "non_media_links": ["/pmwiki/pmwiki.php/Main/TheHero", "/pmwiki/pmwiki.php/Main/TrueCompanions", "/pmwiki/pmwiki.php/Main/Villain", "/pmwiki/pmwiki.php/Main/SecretIdentity", "/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/Main/SpiesInAVan", "/pmwiki/pmwiki.php/Main/RearWindowInvestigation", "/pmwiki/pmwiki.php/Main/WeWait", "/pmwiki/pmwiki.php/Main/DetectiveDrama", "/pmwiki/pmwiki.php/Main/Adventure", "/pmwiki/pmwiki.php/Main/Comedy", "/pmwiki/pmwiki.php/Main/Fantasy", "/pmwiki/pmwiki.php/Main/TruthInTelevision", "/pmwiki/pmwiki.php/Main/SlidingScaleOfRealisticVersusFantastic", "/pmwiki/pmwiki.php/Main/Cloudcuckooland", "/pmwiki/pmwiki.php/Main/PlayedForDrama", "/pmwiki/pmwiki.php/Main/PlayedForLaughs", "/pmwiki/pmwiki.php/Main/TheMasquerade", "/pmwiki/pmwiki.php/Main/DistractedByTheSexy", "/pmwiki/pmwiki.php/Main/Fanservice", "/pmwiki/pmwiki.php/Main/RedHerring", "/pmwiki/pmwiki.php/Main/TheHero", "/pmwiki/pmwiki.php/Main/AntiVillain", "/pmwiki/pmwiki.php/Main/NotSoHarmlessVillain", "/pmwiki/pmwiki.php/Main/RearWindowInvestigation", "/pmwiki/pmwiki.php/Fanfic/OriginStory", "/pmwiki/pmwiki.php/Main/ExactlyWhatItSaysOnTheTin", "/pmwiki/pmwiki.php/Main/NiceJobBreakingItHero", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/BananaInTheTailpipe", "/pmwiki/pmwiki.php/Main/FlockOfWolves", "/pmwiki/pmwiki.php/Main/FriendOnTheForce", "/pmwiki/pmwiki.php/Main/BigEater", "/pmwiki/pmwiki.php/Main/DonutMessWithACop", "/pmwiki/pmwiki.php/Main/MeetCute", "https://en.wikipedia.org/wiki/No_Activity", "/pmwiki/pmwiki.php/Pinball/JudgeDredd", "/pmwiki/pmwiki.php/Podcast/MysteryShow", "/pmwiki/pmwiki.php/Roleplay/GlobalGuardiansPBEMUniverse", "https://www.youtube.com/watch?v=8w6khbl-uXw"]}