{"title": "Cool of Rule", "content": "Something cool is even more cool if it is accomplished within an understood set of rules.\n\nThe \"understood set of rules\" is usually the rules of reality, but it can just as easily be some set of rules established within the work in question. Less props for explaining the rules after the fact.\n\nThis rule is not a contradiction of, but is in tension with, Artistic License. But if you use the Cool Of Rule to make something so cool that the audience willing suspends their disbelief, congratulations! You're an example of the Cool Of Rule.\n\nSee also: Suspension of Disbelief, Magic A Is Magic A, Chekhov's Boomerang. Compare Rule of Cool, MST3K Mantra, Reality Is Unrealistic, Puzzle Thriller. Contrast Hand Wave, Plot Hole.\n• In The Sixth Sense Dr. Malcolm Crowe follows all the rules , while still (theoretically) leaving the viewer with the impression that he is a living human .\n• Sherlock Holmes stories, and mysteries in general, often make heavy use of this rule. When they don't they frequently aren't considered as good.\n• In Dead Beat, one of the reasons is so awesome is because it doesn't technically break the Laws of Magic that forbid necromancy, as those laws apply only to humans.\n• Death Note is basically built around this rule, as much of the entertainment derives from Light and L's clever use of the rules of logic and (in Light's case) the rules of the Death Note.\n• Baby Steps: Unlike some other sports manga, not only is tennis portrayed as realistically as possible, but also how the body develops and transforms over the course of training.\n• The ending of Fullmetal Alchemist is great because in Edward's transmutation to bring his brother's body back from the gate, he follows equivalent exchange: the door that's been present in every gate scene since the beginning of the series, for his brother's body.\n• This happens a lot in the writings of Brandon Sanderson due to his logical and complex magic systems.\n• Any win in a work that either involves tabletop, card, or board games, like Yu-Gi-Oh!, or is a tabletop, board, or card game, like Magic: The Gathering.\n• The original Naruto carefully built a world where a few core mechanics could explain nearly every character's powers, with many fights resolved with creativity and logic instead of brute force. The less-popular Naruto Shippuden played much looser with the rules of its universe, almost to the point of becoming a Dragon Ball Z-style anime where fights were won by stacking vague power-ups and genetic advantages on top of each other. A notable exception is the Pein arc, which was well-received by fans and spent a lot of time exploring the mechanics of Pein's abilities.\n• Dungeon Keeper Ami, most of the fun is seeing Keeper Mercury (Sailor Mercury who accidentally bonded with a Dungeon Heart pull crazy shenanigans through clever use of Sufficiently Analyzed Magic. The rest of the fun is seeing stupidly overpowered Sailor Mercury pull crazy gambits to defeat even crazier odds, and seeing how Gossip Evolution turns her into an In-Universe Memetic Molester who is a grandmaster of the art of the Gambit Roulette when she is closer to a Xanatos Speed Chess grandmaster, always finding some Indy Ploy when her gambits don't work as intended.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/CoolOfRule", "media_links": ["/pmwiki/pmwiki.php/Film/TheSixthSense", "/pmwiki/pmwiki.php/Creator/BruceWillis", "/pmwiki/pmwiki.php/Franchise/SherlockHolmes", "/pmwiki/pmwiki.php/Literature/DeadBeat", "/pmwiki/pmwiki.php/Manga/DeathNote", "/pmwiki/pmwiki.php/Manga/BabySteps", "/pmwiki/pmwiki.php/Manga/FullmetalAlchemist", "/pmwiki/pmwiki.php/Creator/BrandonSanderson", "/pmwiki/pmwiki.php/Anime/YuGiOh", "/pmwiki/pmwiki.php/TabletopGame/MagicTheGathering", "/pmwiki/pmwiki.php/Manga/Naruto", "/pmwiki/pmwiki.php/Anime/NarutoShippuden", "/pmwiki/pmwiki.php/Anime/DragonBallZ", "/pmwiki/pmwiki.php/Anime/SailorMoon", "/pmwiki/pmwiki.php/VideoGame/DungeonKeeper"], "non_media_links": ["/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/Main/MagicAIsMagicA", "/pmwiki/pmwiki.php/Main/SharpshooterFallacy", "/pmwiki/pmwiki.php/Main/ArtisticLicense", "/pmwiki/pmwiki.php/Main/LifeImitatesArt", "/pmwiki/pmwiki.php/Main/SuspensionOfDisbelief", "/pmwiki/pmwiki.php/Main/MagicAIsMagicA", "/pmwiki/pmwiki.php/Main/ChekhovsBoomerang", "/pmwiki/pmwiki.php/Main/RuleOfCool", "/pmwiki/pmwiki.php/Main/MST3KMantra", "/pmwiki/pmwiki.php/Main/RealityIsUnrealistic", "/pmwiki/pmwiki.php/Main/PuzzleThriller", "/pmwiki/pmwiki.php/Main/HandWave", "/pmwiki/pmwiki.php/Main/PlotHole", "/pmwiki/pmwiki.php/Main/TabletopGame", "/pmwiki/pmwiki.php/Fanfic/DungeonKeeperAmi", "/pmwiki/pmwiki.php/Main/EvilOverlord", "/pmwiki/pmwiki.php/Main/ChronicHeroSyndrome", "/pmwiki/pmwiki.php/Main/SufficientlyAnalyzedMagic", "/pmwiki/pmwiki.php/Main/NormalFishInATinyPond", "/pmwiki/pmwiki.php/Main/GossipEvolution", "/pmwiki/pmwiki.php/Main/InUniverse", "/pmwiki/pmwiki.php/Main/MemeticMolester", "/pmwiki/pmwiki.php/Main/GambitRoulette", "/pmwiki/pmwiki.php/Main/XanatosSpeedChess", "/pmwiki/pmwiki.php/Main/IndyPloy"]}