{"title": "Post-End Game Content", "content": "A feature created to improve the replayability of some games. Some games are designed so you can reach 100% Completion in one go, but some others don't make everything the game has to offer available until you've beaten the game (that is, seen the credits) at least once. This is very common in Role-Playing Games and games with levels, but it can appear in every genre.\n\nThe exact things you can unlock vary from game to game. Common unlockables include a Secret Character, higher difficulty levels, a new costume, the True Final Boss, and many more. Sometimes the game makes the content unlockable by doing a rewind to the last Save Point before fighting the Final Boss, but it's quite more common that the unlockables appear only in New Game+, which is Post-End Game Content in its own right too.\n\nA subtrope of Unlockable Content and supertrope to New Game+, Endgame+, and Playable Epilogue. It will frequently overlap with the other subtropes, Double Unlock being the most frustrating and most common one. Necessary for 100% Completion. Compare with Downloadable Content. Compare also with Extended Gameplay.\n\nAs this concerns content that takes place after the \"proper\" ending of the game, expect some spoilers.\n• After beating Journey and obtaining the White Robe, many players play through again searching for (and guiding Red Cloaks to) areas that have come to be known by the community as \"Glitchlands\", areas in various levels where it is possible to slip through the game world's boundaries and wander in a glitchy outside-the-world area full of new sights, sounds, and even NPCs not encountered in regular gameplay.\n• To unlock the hidden Boss Rush level of Ace Combat Zero: The Belkan War, you have to complete the game thrice.\n• In Assassin's Creed III, after completing the game and watching the credits, a cutscene and two epilogue missions are unlocked, followed by someone hacking the Animus and opening up the ability to unlock cheat codes and find a bonus Abstergo video .\n• In Batman: Arkham City:\n• The ability to use alternate Batsuit skins for freeroam is unlocked after beating the story once (although it is also possible if one inputs a cheat code at the main menu screen before beating the game).\n• The final chapter of Catwoman's storyline is only available after the ending cutscene and credits. When that mission is finished, the player can switch between her and Batman at any time, as well as finish another Catwoman-only mission where she can retrieve the rest of her diamonds.\n• The in-game enemy chatter and menu description changes to reflect the fact that you've beaten the game.\n• After defeating the final boss of Breath of Fire IV, a new shop is opened by two characters from the third game, selling various powerful items.\n• Some achievements in Brütal Legend are only obtainable after beating the main campaign.\n• Castlevania series:\n• The Duplicator item and several cheats for a new save become available in Castlevania: Symphony of the Night if you have a Clear or Replay save. If you get a high enough percentage you can unlock the option to play as Richter and Maria.\n• The Sisters and Richter modes unlock in Castlevania: Portrait of Ruin depending on the ending you get. If you kill 1,000 Old Axe Armors, you can also play as one .\n• Aria and Dawn of Sorrow unlock Boss Rush mode, as well as Julius mode (which, in Dawn of Sorrow, becomes how the game continues after the Dark Lord ending ).\n• Castlevania: Order of Ecclesia unlocks New Game+, Hard Mode, , Boss Rush, and Sound Mode. If you beat the game at Level 1 Hard Mode, you'll unlock level 255 mode.\n• Chantelise: The Event Viewer is unlocked by beating the game, and the Survival Dungeon is unlocked in saves made after the epilogue cutscene.\n• Chrono Trigger has New Game+, where you can find many more endings that you couldn't access before unless you did a lot of level grinding. The DS version exclusive Dimensional Vortex, however, only unlocks in New Game+.\n• Copy Kitty: Beating either Boki or Savant's Normal campaigns unlock their respective Hard Modes. What makes this an example and not just a new difficulty setting is that the story continues on from Normal, featuring remixed levels with new enemies, unique weapons, upgraded bosses with new attack patterns and powers, and an exclusive True Final Boss for each character. Beating all four campaigns unlocks The Lost Levels, stages from earlier versions that were kept throughout the game's 7-year development. There's also several in-game cheats and Joke Character modes that are unlocked during and after the game's completion. And as with the rest of the unique weapons and enemies, these are added to the potential random environments in Endless Mode.\n• In the Devil May Cry series, Dante Must Die and the upper difficulties. They later unlock the Super Costumes (not that you need them anymore).\n• The Disgaea series. Many Bonus Bosses and Dungeons only become available after killing the final boss, as well as some Secret Characters. Some of the remakes feature gaiden storylines that are only unlocked after completing the game, as well. These post-game stages regularly have enemies with levels far beyond what the final boss has.\n• Inward Chaos and Secret Characters Gabranth and Shantotto in Dissidia Final Fantasy.\n• More costumes, Confessions of the Creator, and more Secret Characters in Duodecim.\n• It's been suggested (not inaccurately) that Dragon Quest IX has more post-game content than game content.\n• Endless Mode in Duel Savior Destiny doesn't unlock until you've beaten the final route. For every level you clear, you get points to spend. With these points, you can unlock more characters to use and the ability to bring in allies. You can't buy certain stuff until you've progressed to a certain point, though, and certain levels have special bonus content.\n• The SNES port of Faceball 2000: after beating the main campaign mode, Cyberzone, you're given a code that unlocks a second, full-length campaign, Cyberscape, which contains all the levels from the original Game Boy version of Faceball 2000 just released a year earlier and plays differently from Cyberzone.\n• Fallout 2 offers you legitimate cheats that increase all your skills to 300 and give free experience. One is a book given by a priest in New Reno; the other is a download in Vault City's computer. Both are avaiable after you beat the main quest.\n• Grand Theft Auto: San Andreas, like the others in the series, allow the player to continue to explore the Wide Open Sandbox after the main mission ends. Aside from accessing rewards available with 100% completion, news broadcasts can be heard on the radio referencing the events surrounding the game's conclusion, and even delivers a Brick Joke related to the fate of one of the Weazel News broadcasters.\n• In Grand Theft Auto V:\n• After completing the main campaign, the surviving characters will receive certain text messages and phone calls based on the chosen ending.\n• There are many missions that do not need to be finished before the main campaign ends, rendering any left-overs as falling under this trope (although some may not be available anymore if certain characters do not survive).\n• If Trevor survived the main campaign, a bonus mission, \"Mrs. Phillips\", will unlock after beating the main campaign.\n• 100% completion rewards the player with another post-game bonus mission, \"The Last One\" that triggers randomly at some point (one may need to wander around San Andreas for days in game time before it does).\n• The Harvest Moon and Rune Factory series have special crops you can only purchase once you have reached the end credits. Both game franchises allow you to continue playing, even though the main plot has finished.\n• As part of its Endgame+, I Miss the Sunrise gives you access to Splice i and three new bounty hunts.\n• In the Jak and Daxter series:\n• Jak II: Renegade offers more mini missions for you to complete, and you also can unlock cheats and Hero Mode with the Precursor Orbs.\n• Jak 3: Wastelander unlocks more or less the same as 2, but it let's you choose what you want to buy instead of requiring to reach a specific amount of orbs.\n• The Mega Man Battle Network series all have a fairly extensive post-game. It basically exists to allow the fairly complex combat system to be fully utilized, as the main game can be completed without too much effort, but the post-game requires you to really understand what you are doing.\n• Metal Gear series:\n• In the re-released versions of Metal Gear and Metal Gear 2: Solid Snake, you can get the bandana for infinite ammo only after beating the game.\n• In Metal Gear Solid, depending on which of the Multiple Endings you get, you win either the Stealth camoflauge or the infinite ammo bandanna. Beat the game twice on the same save and Snake will wear a tux and the Ninja will look like Spider-Man.\n• Metal Gear Solid 2 awards cool sunglasses to whoever beats the game twice on the same save. There are also various post-game rewards that you can take into a New Game+ by collecting dog tags.\n• Metal Gear Solid 3 awards The Patriot and a Tuxedo to whoever can beat the game, and depending on your choices in a certain end game cutscene, you can get Ocelot's Revolver. You also carry over all your special camos from beating the Cobras with stamina kills.\n• Metal Gear Solid 4 basically has all of the above. Tuxedo? Check. Bandanna? Check. Stealth camo? Check. Special guns? Check. New special guns? Check. Of course, you have to either buy them or do some seriously Nintendo Hard tasks to win it all. You also carry over all of your boss-specific weapons, including the Rail Gun which destroys vehicles, and you carry over all your old guns, ammo and silencer stats.\n• However, you only get said items after meeting up with Otacon and the Metal Gear Mk II, forcing you to play the first few maps without them.\n• In Metal Gear Solid V: Ground Zeroes, unlockable weapons will spawn at your location upon replaying each mission, as well as unlocking Hard Mode.\n• After the Final Boss is defeated in Ni no Kuni Wrath of the White Witch, the player is allowed to return to a point in time just before the fight, but with new side quests unlocked at Swift Solutions, a new string of Bonus Bosses available to fight, and the ability to claim some rare and powerful familiars from Umbopa.\n• The \"All Runes Game\" and the Challenge Mode of Order of Twilight, which are unlocked after completing the main game once.\n• The Pokémon series:\n• The first generation unlocked the Cerulean Cave, home to the most powerful Pokémon, Mewtwo.\n• The second generation unlocked the Kanto region, with the gym leaders of the first generation ready to fight you again. Many people, however, consider this to be part of the game, and not an unlockable. Mt. Silver, on the other hand, only unlocks when you beat the 8 old gym leaders and lets you fight the True Final Boss, the protagonist of the first generation . Crystal's postgame, along with the above, unlocked move tutors at the Game Corners for Ice Beam, Thunderbolt, and Flamethrower.\n• The third generation unlocks the roaming Pokémon Latios or Latias. Ruby & Sapphire unlock Rayquaza and the Battle Tower, Emerald unlocks the Pokémon Frontier, 2 extra zones for the Safari Zone that allowed players to catch some Johto Pokémon, the ability to catch Groudon and Kyogre, and a fight with Ruby and Sapphire's champion Steven Stone in the deepest part of Meteor Falls .\n• FireRed & LeafGreen's postgame, unlocking with unlocking Mewtwo, unlocked the 4th-7th islands of the Sevii Islands.\n• The fourth generation unlocks the upper right part of the map, with the Fight, Survival, and Resort Areas, but to unlock the latter two, you need to have seen every Pokémon in the Regional Pokédex (which can be a pain in the ass and a Guide Dang It! to boot). Turnback Cave also appeared when you unlocked the previous areas. Pokémon swarms started to appear every day too.\n• HeartGold and SoulSilver's postgame is the same as the originals, with every Gym Leader giving out a TM this time, and of course, access to an expanded Mt. Silver , and after THAT, the ability to get a Kanto and Hoenn starter, fighting either Groudon (SoulSilver) or Kyogre (HeartGold), the chance to catch National Dex mons in either the Bug-Catching Contest or playing a remixed Route 101 or Route 201 in certain areas, the GS Sounds Key Item (plays 8-bit music for most areas and fights in the game, in the style of the original Gold and Silver), and of course, the Battle Frontier.\n• The fifth generation went one step further than any other, as beating the game lets you fight the Champion of the League , something never done before. Other important fights with Bonus Bosses are unlocked too, as well as new areas (the right part of the map) where old generation Pokemon appear. The option to connect with the fourth generation becomes available too. Kyurem, the 3rd member of the Tao Trio, can be fought.\n• The sequels unlock the true Pokémon World Tournament (allowing the player to challenge every Gym Leader and Champion in the series up to Gen V), make several Legendary Pokémon available for capture, including older ones such as Latios and Latias, and open up more parts of Unova to explore (most of which consist of early-game towns from Black and White). A new Battle Facility is also unlocked along with Black City and White Forest, Black Tower and White Treehollow. These facilities actually let you gain experience and the boss of the end is Benga, the grandson of the BW champion , who gives a gift shiny Gible (Black 2) or Dratini (White 2) after beating him. Also, seeing every Pokémon in this game allows you to go to the Nature Preserve, which has some Pokémon to catch... and a shiny Haxorus, too. Yes, TWO free shinies per game if you put in enough work .\n• The sixth generation gears the post-end game content towards Tournament Play, with the Friend Safari (where Pokémon with two out of six perfect stats and better abilities can be caught) being unlocked, along with the Battle Maison awarding new prizes essential to stat breeding. Mewtwo also makes a comeback, holding its Mega Stone. For the first time ever, a postgame story is available to you as soon as you step into Lumiose City, and stars Looker from the 4th gen games and a new character who is homeless and has a pet Espurr to keep her company .\n• The third-generation sixth generation remakes unlock the Delta Episode, a short episode that involves a meteor threatening to hit Hoenn and the ability to fight & catch Deoxys. The Delta Episode also includes a nod to the original Ruby & Sapphire, implying it to be an Alternate Universe of Omega Ruby and Alpha Sapphire. After beating that, the Battle Resort is unlocked with its own Daycare, move tutors, and Battle Maison. A final Wally fight is available after beating a Battle Chatelaine in any Super battle format with a team that can surprise even competitive players.\n• The seventh generation unlocks the ability to capture all four of the Legendary temple guardians, as well as hunt and capture the escaped Ultra Beasts. Once all the UB are dealt with, it unlocks Necrozma to be encountered. In addition to this, beating the game unlocks the Battle Tree, a suped up version of the Battle Maison that is being run by champions from the first generation games, Red and Blue. Also, by beating the initial 20 rounds of the Battle Tree, the super versions of the challenges are unlocked, which allow you to encounter special trainers such as island captains and rivals or champions from other generations. They can even be scouted if you beat them and be chosen to partner up with you in multi-battles. Also, talking to Gladion in the Aether Foundation will give you a Type: Null of your own. Defeat the Elite Four again, and you can face 10 different trainers that you met along your journey (well, save for Ryuki ), because you are the first Champion in Alola's history and you are defending your Champion title .\n• Pokémon Ultra Sun and Ultra Moon unlock the ability to get 2 new Ultra Beasts introduced in these games (yes, introduced in the middle of the 7th Generation), Blacephalon in Ultra Sun and Stakataka in Ultra Moon . Also, a postgame story is unlocked where you face Team Rainbow Rocket, consisting of evil team leaders from past games, with a legendary Pokémon in their party ! The Battle Tree, the 2nd half of Poni Island and the carries over from Sun and Moon.\n• The Mystery Dungeon series are far from over when you end the game. You'll gain access to many new areas and a second storyline. You'll also be able to fight the boss Legendary Pokémon from the first part.\n• The Professor Layton series offers you the Sound Mode, images, the cinematics, and descriptions of every character... that is, if you obtained enough picarats from solving puzzles.\n• The Silent Hill series:\n• Silent Hill: If you beat the game once, you'll access the chainsaw. Do it twice with a good and bad ending and you get access to a Katana.\n• Silent Hill 3: Beating the game gives you access to the HEZZAH BEAM!\n• Silent Hill: Origins: Doing certain things in game will get you post-game rewards that include a plasma rifle, some Game-Breaker gauntlets, and some sweet threads.\n• The bonus worlds in the Something Series. Something even advises you to complete the game before taking on the bonus world when you press the Switch Palace in World 4.\n• Star Ocean: Till the End of Time: Completing the main quest will unlock the Maze of Tribulations, the Urssa Cave Temple, and allows you to take on the rest of Sphere 211 (which covers the remaining 111 floors). Each dungeon comes complete with their own bonus boss battles. However, Lenneth and Freya cameo as the game's two optional bosses, and have attacks so devastating, they can annihilate even fully leveled parties in record time.\n• Super Mario Bros.:\n• Beating Super Mario Bros.: The Lost Levels without using warp zones unlocks World 9. Beating the game eight times unlocks Worlds A-D.\n• Beating the final boss in Super Mario Galaxy unlocks new Prankster Comet missions where Mario must collect 100 purple coins in each major level. Collecting 120 stars and beating the final boss again unlocks a New Game+ where you play as Luigi instead of Mario. Repeating this whole process with Luigi unlocks the Grand Finale Galaxy, a leisurely level where Mario and Luigi can chat with several NPCs and receive a postcard for their hard work.\n• Completing Super Mario Galaxy 2 with 120 stars unlocks the green star challenge, an additional 120 stars. These range from pathetically easy, to Rage Quit inducing difficulty depending on their location and means required to snag 'em. If you can get 240 stars (a feat in itself) and deposit 9,999 starbits in the toad bank, you'll unlock the Harder Than Hard Grand Master Galaxy. This level comes with its own comet coin which must be collected along with the course's star. Then you get to take on \"The Perfect Run\". Good luck with that.\n• Beating Super Mario 3D World unlocks a number of secret worlds, the first of which also contains Rosalina, as well as the Luigi Bros. minigame (though it can be unlocked at the start with New Super Luigi U save data).\n• Beating Super Mario Odyssey unlocks a version of the Mushroom Kingdom based on Super Mario 64, hundreds of new missions which include boss rematches, a chance to unlock two bonus levels by getting more Moons, and if requirements are met, a tougher Final Boss. After a February 2018 content update, \"Luigi's Balloon World\" \u0097 a Mini-Game hosted by Luigi where players have to find a balloon that another player had hidden within the kingdom \u0097 will also become available. Balloon World comes in two game modes: \"Find It\", which is the actual balloon-searching, and \"Hide It\", where you set up your own balloon for other players to find.\n• Tales Series\n• Tales of Vesperia unlocks the Bonus Dungeon Labyrinth of Memories and a 200-Man-Melee battle in the colisseum.\n• Tales of Xillia unlocks the Bonus Dungeon Magna Zero, a dungeon that contains the Bonus Boss The Golden Knight and allows the Fell Arms to unlock their true potential.\n• Tales of Xillia 2 unlocks a new Elite Rank in the battle arena; new items to be forged as Custom Orders, including the option to unseal the Sealed Weapons; an extra dungeon with the Illusory Darkness, which takes the Affinity system into play and contains a battle against Cless and Stahn from Phantasia and Destiny, respectively. Finally, the player also unlocks two new sidequests that involve Mint and Rutee, from the same games, who join Cless and Stahn in the battle arena, once they are defeated in the Illusory Darkness.\n• Tons and tons of characters in the Tekken series, as well as Tekken Bowl, Force, and Ball in 3.\n• In an early example, ToeJam & Earl ends when the titular characters assemble their ship and head for home. But after the credits roll, you can wander around the aliens' home planet, talking to residents who welcome you back home. At the end of the road, your home awaits, and in one-player mode, the other playable character. Only then do you get the final \"The End.\"\n• Valkyria Chronicles 4: After completing the game you get a variety of content, including more and harder skirmishes, new characters, characters back from the dead, and the \"True Ending.\"\n• The World Ends with You has a \"Chapter Select\" feature (including a bonus chapter, \"Another Day\"), optional sidequests for every chapter, Ultimate difficulty, and most of the strongest pins, equipment and key items.\n• In Plants vs. Zombies Pinball, beating Dr. Zomboss resets the game status, but all the zombies become slightly harder to kill.\n• Williams Electronics' Safe Cracker pinball rewards players who beat the game with a (physical) \"Magic Token\". Players can use the token to play \"Assault On the Vault\", where they have 90 seconds and four balls to hit as many drop targets and ramp shots as possible.\n• The Elder Scrolls III: Morrowind: The Morag Tong has a series of quests which are only available if you are the Grandmaster of the faction and have completed the main quest. Namely, they are a series of high-level assassinations where the targets are primarily characters whose death prior to beating the game would have made it unwinnable by the standard means (similarly, there is a Mages' Guild quest to kill all the councilors of House Telvanni). Many other quests also become significantly easier once you've completed the main quest, particularly those which involve increasing the disposition of a NPC because you can use your status as Nerevarine to butter them up, even if you have a low Speechcraft skill.\n• Might and Magic X gives you access to the joke Limbo Dungeon (it is a science-fiction-y dungeon version of the developer's office, and you get an achievement called \"Beyond the Scenes\" for beating it) after you beat the game. There is also a a relic (the game's version of artefacts. Worn/used ones level up as you get XP) you can only get after beating the game, though that's the result of it being the reward for a collection sidequest where one of the things you need to collect is in the final dungeon, and you can't leave said dungeon until you beat the game.\n• Haunting Ground: Beating the game at least once (that is, getting one of the two good endings) unlocks the ability to change costumes at any point in the game, a couple of extra scenes that make late-game events make more sense, the ability to leave the castle early (yielding a new ending where Fiona avoids ever meeting Riccardo or Lorenzo) and, most significant of all, an optional Hard Mode.\n• In the 'Final Mix' and 'II.5' versions of Kingdom Hearts II, you must beat the Final Boss once and then save on that file in order to make No. 1 of the Mushroom XIII appear, unlock the Data Rematches against the five Organization-XIII bosses fought in The World That Never Was, and unlock the fight against the Lingering Will.\n• In Splatoon, beating the game's story mode unlocks the ability to view the credits at any time, as well as changing most of the dialog in the final level to reflect that the boss has escaped confinement and kidnapped Cap'n Cuttlefish again. Clearing the game also unlocks the ability to use the Splatoon amiibo to replay 15 certain levels and all the boss levels with new abilities. The Inkling Boy amiibo replaces the Hero Shot with the Hero Roller, the Inkling Girl amiibo uses the Hero Charger instead, and the Inkling Squid amiibo has you turn into a kraken instead of a squid (except for four levels, which instead impose a limit on your ink). Completing the challenges earns you money, costume pieces, minigames, and the ability to use the Hero weapons outside of Story Mode.\n• In Xenoblade Chronicles X, completing the final chapter rewards you with blueprints for the level 60 Skell Superweapons, allows you to craft the level 60 Skells and some unique armor, unlocks several missions, including the Support Missions to grind affinity, money and Miranium, or Battle Points, and adds five Superbosses to the world.\n• Xenoblade Chronicles 2 allows you to fight several high level enemies (most of which are Level 100+ in a game where the maximum level is 99) after beating the final boss, as well as unlocking a Challenge Colosseum where players can complete special challenges with unique objectives for better loot than is normally available. You can also unlock a new blade and complete their exclusive quest.\n• Etrian Odyssey, already a Nintendo Hard series right out of the starting gate of any given game, features a bonus sixth stratum (or maze, in Etrian Odyssey IV) with some of the hardest Random Encounters in the game and one final Bonus Boss that often requires a level-capped and fully-optimized party following strategies down to the letter just for a chance at victory.\n• Rabi-Ribi nominally ends after Chapter 5, but then there are three more chapters to go, which introduce new dungeons and three particularly difficult and long bosses. And then there's Post-Post-End-Game Content in the form of the \"Is The Order A DLC?\" expansion, which can be purchased but not accessed until Chapter 8 is completed.\n• Blast Corps: After the credits roll, one last main level appears in which a large city needs to be leveled to clear the path for a space shuttle's emergency landing. Then a bonus level on the moon is unlocked. After clearing that, you're encouraged to unlock all the bonus levels and collect all the gold medals. Doing this unlocks four more bonus levels around the solar system, and getting gold medals on those unlocks time trials for the main levels, allowing a third medal to be collected in each. Finally, getting gold on all the time trials reveals platinum medal targets for every bonus level and time trial.\n• Completing one of the Yakuza games unlocks Premium Adventure mode, which lets you go wherever you want (including fast travelling to any of the different locations at will if there's more than one,) giving the player a chance to finish up any unfinished substories, partake in one of the many minigames, unlock more completion points and do whatever else they want. Certain games also allow you to change the time of day at certain areas of the map, as well as access alternate costumes.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/PostEndGameContent", "media_links": ["/pmwiki/pmwiki.php/VideoGame/Journey", "/pmwiki/pmwiki.php/VideoGame/AceCombatZeroTheBelkanWar", "/pmwiki/pmwiki.php/VideoGame/AssassinsCreedIII", "/pmwiki/pmwiki.php/VideoGame/BatmanArkhamCity", "/pmwiki/pmwiki.php/VideoGame/BreathOfFireIV", "/pmwiki/pmwiki.php/VideoGame/BreathOfFireIII", "/pmwiki/pmwiki.php/VideoGame/BrutalLegend", "/pmwiki/pmwiki.php/Franchise/Castlevania", "/pmwiki/pmwiki.php/VideoGame/CastlevaniaSymphonyOfTheNight", "/pmwiki/pmwiki.php/VideoGame/CastlevaniaPortraitOfRuin", "/pmwiki/pmwiki.php/VideoGame/CastlevaniaChroniclesOfSorrow", "/pmwiki/pmwiki.php/VideoGame/CastlevaniaOrderOfEcclesia", "/pmwiki/pmwiki.php/VideoGame/Chantelise", "/pmwiki/pmwiki.php/VideoGame/ChronoTrigger", "/pmwiki/pmwiki.php/VideoGame/CopyKitty", "/pmwiki/pmwiki.php/VideoGame/DevilMayCry", "/pmwiki/pmwiki.php/Franchise/Disgaea", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyXII", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyXI", "/pmwiki/pmwiki.php/VideoGame/DissidiaFinalFantasy", "/pmwiki/pmwiki.php/VideoGame/DragonQuestIX", "/pmwiki/pmwiki.php/VideoGame/DuelSaviorDestiny", "/pmwiki/pmwiki.php/VideoGame/Fallout2", "/pmwiki/pmwiki.php/VideoGame/GrandTheftAutoSanAndreas", "/pmwiki/pmwiki.php/VideoGame/GrandTheftAutoV", "/pmwiki/pmwiki.php/VideoGame/HarvestMoon", "/pmwiki/pmwiki.php/VideoGame/RuneFactory", "/pmwiki/pmwiki.php/VideoGame/JakAndDaxter", "/pmwiki/pmwiki.php/VideoGame/JakIIRenegade", "/pmwiki/pmwiki.php/VideoGame/Jak3Wastelander", "/pmwiki/pmwiki.php/VideoGame/MegamanBattleNetwork", "/pmwiki/pmwiki.php/VideoGame/MetalGear", "/pmwiki/pmwiki.php/VideoGame/MetalGear1", "/pmwiki/pmwiki.php/VideoGame/MetalGear2SolidSnake", "/pmwiki/pmwiki.php/VideoGame/MetalGearSolid", "/pmwiki/pmwiki.php/Film/JamesBond", "/pmwiki/pmwiki.php/Franchise/SpiderMan", "/pmwiki/pmwiki.php/VideoGame/MetalGearSolid2", "/pmwiki/pmwiki.php/VideoGame/MetalGearSolid3", "/pmwiki/pmwiki.php/VideoGame/MetalGearSolid4", "/pmwiki/pmwiki.php/VideoGame/MetalGearSolidVGroundZeroes", "/pmwiki/pmwiki.php/VideoGame/OrderOfTwilight", "/pmwiki/pmwiki.php/Franchise/Pokemon", "/pmwiki/pmwiki.php/VideoGame/PokemonRedAndBlue", "/pmwiki/pmwiki.php/VideoGame/PokemonGoldAndSilver", "/pmwiki/pmwiki.php/VideoGame/PokemonRubyAndSapphire", "/pmwiki/pmwiki.php/VideoGame/PokemonDiamondAndPearl", "/pmwiki/pmwiki.php/VideoGame/PokemonRubyAndSapphire", "/pmwiki/pmwiki.php/VideoGame/PokemonDiamondAndPearl", "/pmwiki/pmwiki.php/VideoGame/PokemonBlackAndWhite", "/pmwiki/pmwiki.php/VideoGame/PokemonBlack2AndWhite2", "/pmwiki/pmwiki.php/VideoGame/PokemonXAndY", "/pmwiki/pmwiki.php/VideoGame/PokemonRubyAndSapphire", "/pmwiki/pmwiki.php/VideoGame/PokemonSunAndMoon", "/pmwiki/pmwiki.php/VideoGame/PokemonUltraSunAndUltraMoon", "/pmwiki/pmwiki.php/VideoGame/PokemonMysteryDungeon", "/pmwiki/pmwiki.php/VideoGame/ProfessorLayton", "/pmwiki/pmwiki.php/Franchise/SilentHill", "/pmwiki/pmwiki.php/VideoGame/SilentHill1", "/pmwiki/pmwiki.php/VideoGame/SilentHill3", "/pmwiki/pmwiki.php/VideoGame/SilentHillOrigins", "/pmwiki/pmwiki.php/VideoGame/Something", "/pmwiki/pmwiki.php/VideoGame/StarOceanTillTheEndOfTime", "/pmwiki/pmwiki.php/VideoGame/ValkyrieProfile", "/pmwiki/pmwiki.php/Franchise/SuperMarioBros", "/pmwiki/pmwiki.php/VideoGame/SuperMarioBrosTheLostLevels", "/pmwiki/pmwiki.php/VideoGame/SuperMarioGalaxy", "/pmwiki/pmwiki.php/VideoGame/SuperMarioGalaxy2", "/pmwiki/pmwiki.php/VideoGame/SuperMario3DWorld", "/pmwiki/pmwiki.php/VideoGame/MarioBros", "/pmwiki/pmwiki.php/VideoGame/NewSuperLuigiU", "/pmwiki/pmwiki.php/VideoGame/SuperMarioOdyssey", "/pmwiki/pmwiki.php/VideoGame/SuperMario64", "/pmwiki/pmwiki.php/VideoGame/TalesSeries", "/pmwiki/pmwiki.php/VideoGame/TalesOfVesperia", "/pmwiki/pmwiki.php/VideoGame/TalesOfXillia", "/pmwiki/pmwiki.php/VideoGame/TalesOfXillia2", "/pmwiki/pmwiki.php/VideoGame/Tekken", "/pmwiki/pmwiki.php/VideoGame/ToejamAndEarl", "/pmwiki/pmwiki.php/VideoGame/ValkyriaChronicles4", "/pmwiki/pmwiki.php/VideoGame/TheWorldEndsWithYou", "/pmwiki/pmwiki.php/VideoGame/PlantsVsZombiesPinball", "/pmwiki/pmwiki.php/Creator/WilliamsElectronics", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsIIIMorrowind", "/pmwiki/pmwiki.php/VideoGame/MightAndMagic", "/pmwiki/pmwiki.php/VideoGame/HauntingGround", "/pmwiki/pmwiki.php/VideoGame/KingdomHeartsII", "/pmwiki/pmwiki.php/VideoGame/Splatoon", "/pmwiki/pmwiki.php/Toys/Amiibo", "/pmwiki/pmwiki.php/VideoGame/XenobladeChroniclesX", "/pmwiki/pmwiki.php/VideoGame/XenobladeChronicles2", "/pmwiki/pmwiki.php/VideoGame/EtrianOdyssey", "/pmwiki/pmwiki.php/VideoGame/RabiRibi", "/pmwiki/pmwiki.php/VideoGame/BlastCorps", "/pmwiki/pmwiki.php/VideoGame/Yakuza"], "non_media_links": ["/pmwiki/pmwiki.php/Main/HundredPercentCompletion", "/pmwiki/pmwiki.php/Main/RolePlayingGames", "/pmwiki/pmwiki.php/Main/SecretCharacter", "/pmwiki/pmwiki.php/Main/HarderThanHard", "/pmwiki/pmwiki.php/Main/AndYourRewardIsClothes", "/pmwiki/pmwiki.php/Main/TrueFinalBoss", "/pmwiki/pmwiki.php/Main/EndgamePlus", "/pmwiki/pmwiki.php/Main/SavePoint", "/pmwiki/pmwiki.php/Main/FinalBoss", "/pmwiki/pmwiki.php/Main/NewGamePlus", "/pmwiki/pmwiki.php/Main/PostEndGameContent", "/pmwiki/pmwiki.php/Main/UnlockableContent", "/pmwiki/pmwiki.php/Main/NewGamePlus", "/pmwiki/pmwiki.php/Main/EndgamePlus", "/pmwiki/pmwiki.php/Main/PlayableEpilogue", "/pmwiki/pmwiki.php/Main/DoubleUnlock", "/pmwiki/pmwiki.php/Main/HundredPercentCompletion", "/pmwiki/pmwiki.php/Main/DownloadableContent", "/pmwiki/pmwiki.php/Main/ExtendedGameplay", "/pmwiki/pmwiki.php/Main/BossRush", "/pmwiki/pmwiki.php/Main/GameBreaker", "/pmwiki/pmwiki.php/Main/SecretCharacter", "/pmwiki/pmwiki.php/Main/AnotherSideAnotherStory", "/pmwiki/pmwiki.php/Main/SecretCharacter", "/pmwiki/pmwiki.php/Main/MultipleEndings", "/pmwiki/pmwiki.php/Main/GuideDangIt", "/pmwiki/pmwiki.php/Main/AnotherSideAnotherStory", "/pmwiki/pmwiki.php/Main/NewGamePlus", "/pmwiki/pmwiki.php/Main/SecretCharacter", "/pmwiki/pmwiki.php/Main/HarderThanHard", "/pmwiki/pmwiki.php/Main/BraggingRightsReward", "/pmwiki/pmwiki.php/Main/NewGamePlus", "/pmwiki/pmwiki.php/Main/MultipleEndings", "/pmwiki/pmwiki.php/Main/LevelGrind", "/pmwiki/pmwiki.php/Main/UpdatedRerelease", "/pmwiki/pmwiki.php/Main/NewGamePlus", "/pmwiki/pmwiki.php/Main/TrueFinalBoss", "/pmwiki/pmwiki.php/Main/ShoutOut", "/pmwiki/pmwiki.php/Main/JokeCharacter", "/pmwiki/pmwiki.php/Main/HarderThanHard", "/pmwiki/pmwiki.php/Main/AndYourRewardIsClothes", "/pmwiki/pmwiki.php/Main/BraggingRightsReward", "/pmwiki/pmwiki.php/Main/BonusBoss", "/pmwiki/pmwiki.php/Main/BonusDungeon", "/pmwiki/pmwiki.php/Main/SecretCharacter", "/pmwiki/pmwiki.php/Main/VideoGameRemake", "/pmwiki/pmwiki.php/Main/GaidenGame", "/pmwiki/pmwiki.php/Main/AnotherSideAnotherStory", "/pmwiki/pmwiki.php/Main/BrutalBonusLevel", "/pmwiki/pmwiki.php/Main/AnotherSideAnotherStory", "/pmwiki/pmwiki.php/Main/BrutalBonusLevel", "/pmwiki/pmwiki.php/Main/SecretCharacter", "/pmwiki/pmwiki.php/Main/AnotherSideAnotherStory", "/pmwiki/pmwiki.php/Main/SecretCharacter", "/pmwiki/pmwiki.php/Main/EmbeddedPrecursor", "/pmwiki/pmwiki.php/Main/UnexpectedGameplayChange", "/pmwiki/pmwiki.php/Main/WideOpenSandbox", "/pmwiki/pmwiki.php/Main/BrickJoke", "/pmwiki/pmwiki.php/Main/EndgamePlus", "/pmwiki/pmwiki.php/Videogame/IMissTheSunrise", "/pmwiki/pmwiki.php/Main/BonusDungeon", "/pmwiki/pmwiki.php/Main/BonusBoss", "/pmwiki/pmwiki.php/Main/MultipleEndings", "/pmwiki/pmwiki.php/Main/NewGamePlus", "/pmwiki/pmwiki.php/Main/InfinityMinusOneSword", "/pmwiki/pmwiki.php/Main/NewGamePlus", "/pmwiki/pmwiki.php/Main/NintendoHard", "/pmwiki/pmwiki.php/Main/InfinityMinusOneSword", "/pmwiki/pmwiki.php/Main/NewGamePlus", "/pmwiki/pmwiki.php/Main/RobotBuddy", "/pmwiki/pmwiki.php/Main/FinalBoss", "/pmwiki/pmwiki.php/Videogame/NiNoKuni", "/pmwiki/pmwiki.php/Main/BonusBoss", "/pmwiki/pmwiki.php/Main/TrueFinalBoss", "/pmwiki/pmwiki.php/Main/GuideDangIt", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Main/BonusBoss", "/pmwiki/pmwiki.php/Main/TournamentPlay", "/pmwiki/pmwiki.php/Main/EldritchAbomination", "/pmwiki/pmwiki.php/Main/GiantSpaceFleaFromNowhere", "/pmwiki/pmwiki.php/Main/GameBreaker", "/pmwiki/pmwiki.php/Main/AndYourRewardIsClothes", "/pmwiki/pmwiki.php/Main/SNKBoss", "/pmwiki/pmwiki.php/Main/CurbstompBattle", "/pmwiki/pmwiki.php/Main/NewGamePlus", "/pmwiki/pmwiki.php/Main/RageQuit", "/pmwiki/pmwiki.php/Main/HarderThanHard", "/pmwiki/pmwiki.php/Main/ThatOneLevel", "/pmwiki/pmwiki.php/Main/SecretCharacter", "/pmwiki/pmwiki.php/Main/OldSaveBonus", "/pmwiki/pmwiki.php/Main/FinalBoss", "/pmwiki/pmwiki.php/Main/MiniGame", "/pmwiki/pmwiki.php/Main/BonusDungeon", "/pmwiki/pmwiki.php/Main/BonusDungeon", "/pmwiki/pmwiki.php/Main/BonusBoss", "/pmwiki/pmwiki.php/Main/InfinityPlusOneSword", "/pmwiki/pmwiki.php/Main/InfinityPlusOneSword", "/pmwiki/pmwiki.php/Main/RelationshipValues", "/pmwiki/pmwiki.php/Main/AnotherSideAnotherStory", "/pmwiki/pmwiki.php/Main/HarderThanHard", "/pmwiki/pmwiki.php/Main/InfinityPlusOneSword", "/pmwiki/pmwiki.php/Main/AndYourRewardIsClothes", "/pmwiki/pmwiki.php/Pinball/SafeCracker", "/pmwiki/pmwiki.php/Main/MurderInc", "/pmwiki/pmwiki.php/Main/PointOfNoReturn", "/pmwiki/pmwiki.php/Main/FinalBoss", "/pmwiki/pmwiki.php/Main/TheVeryDefinitelyFinalDungeon", "/pmwiki/pmwiki.php/Main/BonusBoss", "/pmwiki/pmwiki.php/Main/AndYourRewardIsClothes", "/pmwiki/pmwiki.php/Main/InfinityPlusOneSword", "/pmwiki/pmwiki.php/Main/BonusBoss", "/pmwiki/pmwiki.php/Main/NintendoHard", "/pmwiki/pmwiki.php/Main/BrutalBonusLevel", "/pmwiki/pmwiki.php/Main/RandomEncounters", "/pmwiki/pmwiki.php/Main/BonusBoss", "/pmwiki/pmwiki.php/Main/MarathonLevel"]}