{"title": "Inescapable Ambush", "content": "A specific type of enemy encounter common in a variety of video game genres. When the player enters a specific area, some type of barrier is closed around the player character (even one as simple as a door that mysteriously shuts and locks itself), and they cannot leave these narrow confines until all the available enemies are defeated.\n\nThis is commonly used as a way to set up a Boss Battle (though not all Boss Battles are Inescapable Ambushes).\n\nIn some games, if your characters gain enough experience in a certain trait, such as awareness or agility, they may be able to detect potential ambushes and/or evade them entirely.\n\nA huge cause of Useless Useful Stealth. Longer or more plot-involved examples may extend into an Involuntary Group Split. Sub-Trope of Kill Enemies to Open.\n• In The Legend of Zelda series, these often take the form of a dungeon room that seals itself when Link enters, and unseals when all the enemies are gone. Though in many of the earlier games, it was possible to remain in the doorway of the ambush room and check out the situation, allowing you a quick retreat if necessary.\n• The Legend of Zelda: Twilight Princess:\n• The portal locations are a side effect of Link being ambushed by shadow beasts, who show up in a group and erect a force barrier similar to a boxing ring around themselves. When Link defeats them, the portal becomes available.\n• At several points in Hyrule Castle, Link gets sealed inside magic barrier rings and attacked by enemies (that for some reason can walk straight through them).\n• Here's the hammer brothers pulling one of these in Distorted Travesty 3. This game, and the series in general, are fond of this trope.\n• In all the Pokémon RPGs, when the main character enters the Elite Four's rooms, s/he cannot go outside until s/he defeats or is defeated by the Elite Four and the Champion. Done most cleverly in the Gen IV games (D/P/Pl), where a platform takes you from each trainer to the next, and returns to its original position after you step off.\n• In Trials of Mana, there are certain rooms in dungeons that will trap the player until all of the enemies are defeated. Of course, every single boss battle is like this as well.\n• Fable had the nasty habit of erecting forcefields around the room you are in whenever you fight certain monsters or during ambushes.\n• Soul Reaver 2 had similar forcefields generated by certain types of time demons when you faced them. You didn't have to kill all the monsters, just the one casting the barrier.\n• Devil May Cry has barriers that flare into life when you walk into certain rooms, whereupon the enemies usually arrive via Cutscene. Interestingly, if you get too close to a barrier, it briefly forms into a hand and takes a swipe at you.\n• In the Kingdom Hearts games, not only do these lock Sora in, but they often lock Goofy and Donald Duck out, forcing you to battle one-on-one with the boss.\n• In a humorous aversion of Gameplay and Story Segregation, Goofy slams right into one of the invisible walls, and Donald is knocked out of the area by the boss, leaving Sora to fight him alone.\n• This is averted by several boss encounters in the first game. In Neverland, you can leave the fight against Captain Hook via the Captain's Quarters, and in the second fight against Oogie Boogie you can leave via a cave in the side of the wall.\n• Some boss fights in 358/2 Days avert this trope by creating no barriers after you enter the area where the boss resides. This is oftentimes more annoying than if the game had prevented you from exiting, as it is painfully easy to accidentally exit and when you re-enter, the boss is at full HP again.\n• And that's just regular gameplay. Mission Mode, which is meant for up to four players but can be played solo, has \"gathering gates\" meant to move all players to another area at once and have a wider area of effect than regular exits to accommodate everyone. They activate instantly if you're playing Mission Mode solo, leading to an Unstable Equilibrium where you restart the boss fight without the spells and items you used last time.\n• God of War essentially swiped the barriers from Devil May Cry; the only difference is that the barriers in this game turn into a fate's head instead of a hand.\n• Granblue Fantasy: The \"Do or Die\" scenarios in Arcarum \u0096 A set of enemies may suddenly pop up from an unvisited node, and the only way to progress further is to defeat them (preventing the player from clicking other nodes). If you lose, they will still remain in that node, waiting to be defeated.\n• Castlevania\n• Nearly every single room in Castlevania: Lament of Innocence acts this way the first time you visit it.\n• And on \"Crazy\" difficulty this happens every time you enter a room.\n• The other 3D Castlevania, Castlevania: Curse of Darkness, tones this down considerably. There's actually a separate theme for the inescapable ambushes: \"Followers of Darkness - The First\".\n• Of course, the Metroid series, which erected grey barriers in front of the doors during any major boss battle.\n• An interesting variation happens early in Super Metroid where one obtains the bomb ability. In this case, the door locks after obtaining it, contrary to all other such rooms. This has provided a way for tool-assisted speedrunners to skip the fight, though just barely.\n• Super Metroid has an interesting variation, in that the door to Tourian only opens when you defeat the main bosses. One wonders why they would set up the door to their main computer system only when those charged with defending it are dead: the exact opposite would be more secure.\n• The Metroid Prime Trilogy takes it even further by often locking the room when you first encounter a new type of Elite Mook, for which you usually don't yet have the powerups that would make the fight a cakewalk.\n• Exception: Chrono Cross, where every battle could be escaped, including the final boss. While you won't gain any real advantages (most will just draw you back in, and none of them are skippable), it is useful to be able to infinitely reset your elements and try again.\n• Near the end of the first level in the first mission of Medal of Honor: Allied Assault, the ambush in question loops endlessly until you accomplish your given objectives. You could waste your ammo on German soldiers, hide near the locked exit door, etc. until you pick up that machinegun and shoot!\n• At the end of the second mission, after blowing your cover, you have to push your way through several respawning ambushes.\n• Sonic Rush has several of these in three of its zones.\n• Ōkami conjures up a barrier decorated with kanji around every battle. In all but a few of these fights, you can run from battle by breaking through the barrier in a certain spot.\n• Justified in Phantasy Star Online, which explains that this is a security feature that locks the doors when wild creatures are nearby.\n• Although generally it left the doors already opened unlocked allowing you to escape, some cases however did lock you in a room leaving you only with the ability to warp out to heal and then come back full equipped (not true boss fights).\n• Happens in Half-Life 2, Episode 2, during the \"White Forest Inn Siege\". While the player and sidekick are driving down a seemingly deserted street, force-fields activate at either end of the road and Combine soldiers pour out of the woodwork. The player is forced to retreat into a hotel in which, for some reason, all the exits are locked except for those inside the force-fields.\n• The Elder Scrolls IV: Oblivion includes several ambushes with inexplicably locking doors. Two optional side quests end in rooms (for example, a farmhouse and a family tomb) where the door suddenly locks behind you, with no suggestion of minions waiting outside to trap you. This is actually inconsistent with most of the gameplay, because as fantastic as Oblivion may be, the storylines usually adhere to common sense. In one example this is justified: the Big Bad of that particular sidequest is one of the two that ambushes you, and he carries the key you need to get out. The implication is (naturally) that he closed and locked you in with himself and his ally after they entered behind you (granted, they entered almost instantaneously, but...).\n• The Elder Scrolls V: Skyrim: The only way to avoid Karliah's ambush at Snow Veil Sanctum is to simply refuse to go through the door, leave the sanctum and do other quests. But this leaves the Thieves Guild questline frozen at that point. You can at this point potentially have the ability to turn yourself invisible and intangible and to invoke Bullet Time which normally slows down arrows to a crawl but Karliah will hit you if you move through that doorway.\n• All boss fights in Drakengard take this form due to Gameplay and Story Segregation: one would think being on a dragon would let one just fly away if they wanted to. Also happens and played straight when in the Forest, as the Fog of War tends to obscure enemy positions until it is too late.\n• Averted in City of Heroes, where you can easily outrun your would-be ambushers. Of course, this can lead to high-level ambush groups wandering around a low-level zone, with predictable results.\n• Some high-level players do this on purpose, for laughs.\n• Also played straight with ambushes that know exactly where you are. Even if you're stealthed. Even if you're a Stalker and the enemies who ambush can't normally see you.\n• Multiple Kirby adventure games have these. There is a common ambush song across the series (sometimes remixed).\n• Prince of Persia: Warrior Within has a annoying version. There are rooms that can only be escaped with the prince's Le Parkour skills, which can't be used with your sword drawn. The Prince will not sheath his sword until all the enemies are defeated, even if the enemies are below you and you can simply jump over them a few times.\n• No More Heroes does this during most boss fights, and in some Mook Fights as well. The most annoying one being during the 1st-ranked Assassin fight, where the border is a glowing serpent-like dragon , that shrinks the arena during the fight twice. As your opponent is a martial-arts master with a lot of very fast dash moves , this makes the fight a frustrating experience to say the least.\n• Final Fantasy X 's Mimics shut off your Escape and Flee commands if you steal from them while they're in chest form (thereby exposing their true forms).\n• Which is why you always Mug chests. Although in most areas with Mimics, there are no real chests in battle.\n• At one point in Chrono Trigger, you can talk to some random mook that tells you to be quiet without looking at you because... he's planning to ambush a group of adventurers and doesn't want to be overheard.\n• Welcome to Wario World! There's an enemy in this game that only shows up on your first playthrough. There's an inescapable barrier around him for a small part of the level, and Wario will only be able to continue when he's smashed his puny crystal in.\n• Super Smash Bros.: Both the Adventure Mode in Melee and the Subspace Emissary in Brawl often have these. Neither game bothers with barriers (after all, that wouldn't work with the \"getting knocked out of bounds'' element) but simply won't allow you to move any further in the level until all enemies are defeated.\n• In one episode of Buffy the Vampire Slayer, Buffy ends up in an inescapable ambush when someone from the Initiative sets her up.\n• That happened several times in season 4, including the Haunted House that sealed everyone inside and the ghosts who sealed Buffy and Riley inside a dorm room so they would keep having sex . Also the characters who had their hearts cut out were technically in an inescapable ambush; but they didn't escape.\n• Happens a lot in the Resident Evil series. Usually hand waved as some sort of security mechanism to keep in whatever viral beastie you are fighting. Sometimes it is triggered when you grab a key item. About half the time it's played entirely straight (the door opens when the enemies die), sometimes there's a variation (the door opens when you've done enough damage to the unkillable enemy), and sometimes it's subverted (you can—and have to—escape; you just have to survive long enough to do so).\n• Dead Space does this repeatedly. The computer warns you that infected entities are in your sector, all doors lock and you have to kill all the baddies to get them to unlock again. The justification is that the computer is futilely trying to stop the spreading of the infection, but you gotta wonder if a computer that traps everyone involved in an accident right where it happened, when \"the accident\" means \"horrible possession by Face Full of Alien Wing-Wong\", didn't turn a moderately serious infection into a shipwide disaster all by itself.\n• They have a few of these on one specific planet in Ratchet & Clank: Going Commando. Notably, one of them only triggers if you open the health box.\n• This pretty much defines the enemy battles in Vivisector Beast Within; not only are you forced to trip an Inescapable Ambush each time you activate a checkpoint, during the first half of the game, but said checkpoint is usually situated in another cage that springs up, usually much smaller so you're literally a sitting duck for the enemies you're supposed to clear out to be released.\n• A side quest in Fallout: New Vegas has the Courier exploring a Vault that had a \"sacrificial chamber.\" Upon activating it, numerous robots literally come out of the walls and seal the chamber until they're all defeated.\n• Once you gain infamy with either of the major factions, they will summon hit squads as scripted encounters at various locations. Once you enter their spawning area, either by normal or fast travel, they will always find you, even if you have a Stealth Boy on.\n• At the end of Dead Money, if you try to take the shortcut when sneaking out of the casino's vault, Elijah will detect you without fail and reactivate the force fields, forcing you to fight him and the sentry guns.\n• Lonesome Road does it a number of times as well, with Tunnelers and Deathclaws.\n• The Metal Gear series have these where a group of enemy soldiers corner you and you cannot escape, thus you're forced to fight them due to the plot.\n• In Vampire: The Masquerade \u0096 Bloodlines you are trapped at the top of a ski lift and must hide from a savage werewolf until the timer runs out or you kill it.\n• There's also an optional mission where you are trapped in a cemetery fighting an endless stream of zombies until the timer runs out.\n• Deus Ex's Alex Jacobson will not give you the key to until you have killed , if you have not done so already. It's a tough fight if you don't . However, the Mooks in the building can be avoided, the is an instant win, and sequence breaking minded players can use the old \"enemies have master keys\" trick to avoid needing to kill her entirely.\n• Certain quests in Dungeons & Dragons Online: Eberron Unlimited have rooms with portcullises that slam down when a player enters and don't open until the monsters (or players) inside are slain or a timer runs out. These are particularly annoying to anyone outside the room when this occurs.\n• In the Left 4 Dead series, the standard Hold the Line type finale works a bit like this- your rescuer will often say over the radio that they're X minutes away, but the vehicle won't actually arrive until you've killed all the necessary enemies (a wave of common infected, followed by a Tank, then more commons, then a second Tank. Then a ***load more commons and multiple Tanks, but at this point you need to stop killing and run like hell)\n• Occurs frequently in the Descent games, where doors lock or walls appear upon entering a room or taking a key, and Mook Makers or monster closets activate.\n• Also happens with many bosses in the Silent Hill series. The most memorable example comes from the second game - the first battle with Pyramid Head begins when the door suddenly closes behind James in the preceding cutscene, leaving him stuck in a narrow hallway with the executioner. Obviously, he immediately tries to open it and run to the hills, but to no avail.\n• Knights Of The Chalice is very fond of this trope, you can barely enter a room without the door slamming shut and spawning a bunch of monsters right on top of you, and if you try to hug the walls or head for a corner the game will teleport you right into the middle of the room so you're always surrounded no matter what.\n• In some of the Ys games, you are locked into boss battles. Which means that if you're underleveled, you can kiss your ass goodbye. Hope you saved beforehand. (Alternatively, learn to fight the boss without taking a hit. This is usually possible, unless you're too low a level to damage it.)\n• Dragon Buster did this with every single room.\n• The Darkness and The Darkness II do this sometimes. It helps that your enemies use locked doors and LOTS of lightbulbs to trap Jackie, thus turning a Physical God into an underprepared hitman. Sadly, the cops Didn't Think This Through because they end up getting slaughtered over trivial mistakes (Eddie Shrote forgot where he put his flashbangs, the cops who use a giant stadium lighter forgot to put bulletproof glass over the lightbulbs). As for the Brotherhood, they're smarter but insane, so they make their fair share of mistakes after Jackie gets captured in the ambush.\n• Used all the time in Dragon Age: Origins map random encounters, but a special mention must go to the ambush by Zevran, which ends in a chance to recruit him to your party .\n• Henry Hatsworth in the Puzzling Adventure uses these viciously, with nearly every level having one or two of these. The game usually uses these to introduce new types of enemies, or to just make the stages that much harder.\n• In Kid Icarus: Uprising, every now and then Pit will get locked in a room and will be required to take on an onslaught of enemies in before progressing any further.\n• Resident Evil: Operation Raccoon City does this several times however other times it also complete averts this expecting the player to run away too. Leading to the occasional confusing moment when you rush to the objective marker and are informed you have to clear the room to proceed.\n• One room in Resident Evil 4 contains a treasure chest; as you approach, a cage drops around you, surrounded by Zealots, then a Garrador jumps in. You can either take down the Garrador and Zealots from in here, or if you have enough firepower, you can Shoot Out the Lock and fight them outside. In a later room, taking the King's Grail seals the exit and deploys two waves of Animated Armors against you. At the end of Chapter 4-1, activating the elevator power closes the door to the room, attempting to re-open it summons Verdugo. After scoring a few hits on him, it re-opens. Then you can either wait it out for 4 minutes, or kill Verdugo and summon the elevator sooner.\n• It's not a bad idea to save often in the Mega Man Battle Network series, lest you accidentally stumble across an inescapable boss rematch (They're invisible Pre Existing Encounters) while you're not prepared for it.\n• This is exemplified in the fourth game of the series, where if you manage to win said rematch, you'll unleash the ridiculously strong Omega version of the boss upon that part of the net as an inescapable random encounter. It's possible to eventually have every single area on the net occupied by one of them, which makes getting around interesting to say in the least.\n• Bayonetta has this in spades. Almost every fight in the game is inescapable due to a magical barrier. When you are done with a battle, Bayonetta destroys the magical barrier... by blowing a kiss at it. In the sequel, there are barriers she breaks by shooting a heart-shaped bullet pattern into.\n• PAYDAY The Heist has a random chance of the crew being ambushed by the local gang in the Panic Room level. Instead of making the deal inside the apartment, the gang may appear in the alley instead and will quickly pull their guns on you in a pincer attack.\n• In The Adventures Of Lolo III, Level 13's boss battle plays like this. It's the Eggerland King, and at first it looks like a normal boss battle...until you realize that he won't die no matter how many times you hit him. Thus, your character is forced to die, leaving the other one outside of the castle. This then takes you to the Underworld Level 14, where the remaining character must trudge through four levels to rescue the character lost in Level 13.\n• In the Total Recall Licensed Game for the Nintendo Entertainment System, you could be pulled into alleys and forced to fight midgets in purple suits.\n• Done all the time in Luigi's Mansion and Luigi's Mansion: Dark Moon, with areas that immediately have ghosts show up, then lock Luigi in until all of them are caught. Or in the case of latter, it's not a door being blocked, but a magical gate popping out the floor and barricading anything from an opening to a set of stairs until all nearby ghosts are caught. In the latter, this is also marked by the lights immediately going off whenever an ambush occurs.\n• Act II of The Witcher ends in an ambush that, if you've solved the mystery correctly, you should see coming a mile away. Since by this point in the game you'd be familiar enough with the area to retreat, the Big Bad conjures a Ring of Fire to keep you hemmed in, then summons his sidekick. Of course this didn't prevent him from escaping...\n• Largely averted in Mirror's Edge - you're able to simply run past every single police ambush, bar cutscenes and a single scripted fight, if you're skilled enough.\n• In Faria, some tower rooms have doors that slam shut until all the enemies are defeated.\n• Happens constantly in Implosion, where each new area you enter is sealed by doors or laser fences. The in-game explanation is that during the early parts of the invasion of Earth by the XADA, security barriers were set up to let humans pass through, but lock down if any aliens approached. Your WarMech has no human body inside, so the barriers won't open until all the XADA attackers locked in with you are dead.\n• In Eagle Island, some rooms will have all exits locked upon entering them, at which point the player has to kill all the enemies inside to be allowed to leave.\n• Hollow Knight loves to pull this on the player. One of the worst is in the top floor of the East City of Tears, where you are locked into fighting at least three waves of the tough Husk Sentries including the Winged, Lance, and Heavy types.\n• The Binding of Isaac: Every encounter uses Kill Enemies to Open, but most doors can be opened with a bomb. Some rooms can only be escaped using a teleportation item.\n• Mob Trap and Boss Trap rooms, which contain some chests or rarely an item, but force you to fight waves of enemies or Degraded Bosses respectively.\n• Any of the Deadly Sins, which appear in side rooms that are unmarked on the minimap until explored. Unlike Mob and Boss Traps, these aren't optional once entered and often have far worse loot.\n• In effect, every room in the Brutal Bonus Level is one of these, since they're immune to bombing.\n• Paper Mario:\n• There is one room in Koopa Bros. fortress, where upon entering, the entrance corridors will rise above the floor, out of Mario's reach. Only by defeating all the enemies in the room will the corridors drop back to their original positions.\n• In Toad Town Tunnels, the room containing the pipe to Boo's Mansion will lock Mario in until he defeats all the enemies that are there.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/InescapableAmbush", "media_links": ["/pmwiki/pmwiki.php/VideoGame/FinalFantasyV", "/pmwiki/pmwiki.php/Film/MadMaxBeyondThunderdome", "/pmwiki/pmwiki.php/Franchise/TheLegendOfZelda", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaTwilightPrincess", "/pmwiki/pmwiki.php/VideoGame/DistortedTravesty", "/pmwiki/pmwiki.php/Franchise/Pokemon", "/pmwiki/pmwiki.php/VideoGame/TrialsOfMana", "/pmwiki/pmwiki.php/VideoGame/Fable", "/pmwiki/pmwiki.php/VideoGame/LegacyOfKain", "/pmwiki/pmwiki.php/VideoGame/DevilMayCry", "/pmwiki/pmwiki.php/Franchise/KingdomHearts", "/pmwiki/pmwiki.php/VideoGame/GodOfWarI", "/pmwiki/pmwiki.php/VideoGame/DevilMayCry", "/pmwiki/pmwiki.php/VideoGame/GranblueFantasy", "/pmwiki/pmwiki.php/Franchise/Castlevania", "/pmwiki/pmwiki.php/VideoGame/CastlevaniaLamentOfInnocence", "/pmwiki/pmwiki.php/VideoGame/CastlevaniaCurseOfDarkness", "/pmwiki/pmwiki.php/Franchise/Metroid", "/pmwiki/pmwiki.php/VideoGame/SuperMetroid", "/pmwiki/pmwiki.php/VideoGame/MetroidPrimeTrilogy", "/pmwiki/pmwiki.php/VideoGame/ChronoCross", "/pmwiki/pmwiki.php/VideoGame/MedalOfHonor", "/pmwiki/pmwiki.php/VideoGame/SonicRushSeries", "/pmwiki/pmwiki.php/VideoGame/Okami", "/pmwiki/pmwiki.php/VideoGame/PhantasyStarOnline", "/pmwiki/pmwiki.php/VideoGame/HalfLife2", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsIVOblivion", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsVSkyrim", "/pmwiki/pmwiki.php/VideoGame/Drakengard", "/pmwiki/pmwiki.php/VideoGame/CityOfHeroes", "/pmwiki/pmwiki.php/VideoGame/Kirby", "/pmwiki/pmwiki.php/VideoGame/PrinceOfPersiaWarriorWithin", "/pmwiki/pmwiki.php/VideoGame/NoMoreHeroes", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyX", "/pmwiki/pmwiki.php/VideoGame/ChronoTrigger", "/pmwiki/pmwiki.php/VideoGame/WarioWorld", "/pmwiki/pmwiki.php/VideoGame/SuperSmashBros", "/pmwiki/pmwiki.php/Series/BuffyTheVampireSlayer", "/pmwiki/pmwiki.php/Franchise/ResidentEvil", "/pmwiki/pmwiki.php/Franchise/DeadSpace", "/pmwiki/pmwiki.php/VideoGame/RatchetAndClankGoingCommando", "/pmwiki/pmwiki.php/VideoGame/VivisectorBeastWithin", "/pmwiki/pmwiki.php/VideoGame/FalloutNewVegas", "/pmwiki/pmwiki.php/VideoGame/MetalGear", "/pmwiki/pmwiki.php/VideoGame/VampireTheMasqueradeBloodlines", "/pmwiki/pmwiki.php/VideoGame/DeusEx", "/pmwiki/pmwiki.php/VideoGame/DungeonsAndDragonsOnline", "/pmwiki/pmwiki.php/VideoGame/Left4Dead", "/pmwiki/pmwiki.php/VideoGame/Descent", "/pmwiki/pmwiki.php/Franchise/SilentHill", "/pmwiki/pmwiki.php/VideoGame/SilentHill2", "/pmwiki/pmwiki.php/VideoGame/KnightsOfTheChalice", "/pmwiki/pmwiki.php/VideoGame/Ys", "/pmwiki/pmwiki.php/VideoGame/DragonBuster", "/pmwiki/pmwiki.php/VideoGame/TheDarkness", "/pmwiki/pmwiki.php/VideoGame/TheDarknessII", "/pmwiki/pmwiki.php/VideoGame/DragonAgeOrigins", "/pmwiki/pmwiki.php/VideoGame/HenryHatsworthInThePuzzlingAdventure", "/pmwiki/pmwiki.php/VideoGame/KidIcarusUprising", "/pmwiki/pmwiki.php/VideoGame/ResidentEvil4", "/pmwiki/pmwiki.php/VideoGame/MegaManBattleNetwork", "/pmwiki/pmwiki.php/VideoGame/Bayonetta", "/pmwiki/pmwiki.php/VideoGame/PAYDAYTheHeist", "/pmwiki/pmwiki.php/VideoGame/AdventuresOfLolo", "/pmwiki/pmwiki.php/Film/TotalRecall1990", "/pmwiki/pmwiki.php/VideoGame/LuigisMansion", "/pmwiki/pmwiki.php/VideoGame/LuigisMansionDarkMoon", "/pmwiki/pmwiki.php/VideoGame/TheWitcher", "/pmwiki/pmwiki.php/VideoGame/MirrorsEdge", "/pmwiki/pmwiki.php/VideoGame/Faria", "/pmwiki/pmwiki.php/VideoGame/NinjaGaiden", "/pmwiki/pmwiki.php/VideoGame/Implosion", "/pmwiki/pmwiki.php/VideoGame/EagleIsland", "/pmwiki/pmwiki.php/VideoGame/HollowKnight", "/pmwiki/pmwiki.php/VideoGame/TheBindingOfIsaac", "/pmwiki/pmwiki.php/VideoGame/PaperMario64"], "non_media_links": ["/pmwiki/pmwiki.php/Main/GhostButler", "/pmwiki/pmwiki.php/Main/BossBattle", "/pmwiki/pmwiki.php/Main/UselessUsefulStealth", "/pmwiki/pmwiki.php/Main/InvoluntaryGroupSplit", "/pmwiki/pmwiki.php/Main/SubTrope", "/pmwiki/pmwiki.php/Main/KillEnemiesToOpen", "/pmwiki/pmwiki.php/Main/WarpWhistle", "/pmwiki/pmwiki.php/Main/TheVeryDefinitelyFinalDungeon", "https://youtu.be/mAvdJnekJpg?t=18s", "/pmwiki/pmwiki.php/Main/Cutscene", "/pmwiki/pmwiki.php/Main/DonaldDuck", "/pmwiki/pmwiki.php/Main/DuelBoss", "/pmwiki/pmwiki.php/Main/GameplayAndStorySegregation", "/pmwiki/pmwiki.php/Main/PunchedAcrossTheRoom", "/pmwiki/pmwiki.php/Main/UnstableEquilibrium", "/pmwiki/pmwiki.php/Main/SequenceBreaking", "http://tasvideos.org/1073M.html", "/pmwiki/pmwiki.php/Main/EliteMook", "/pmwiki/pmwiki.php/Main/YouWillNotEvadeMe", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/BulletTime", "/pmwiki/pmwiki.php/Main/GameplayAndStorySegregation", "/pmwiki/pmwiki.php/Main/FogOfWar", "/pmwiki/pmwiki.php/Main/TheComputerIsACheatingBastard", "/pmwiki/pmwiki.php/Main/LeParkour", "/pmwiki/pmwiki.php/Main/ChestMonster", "/pmwiki/pmwiki.php/Main/LampshadeHanging", "/pmwiki/pmwiki.php/Main/TeleportingKeycardSquad", "/pmwiki/pmwiki.php/Main/FaceFullOfAlienWingWong", "/pmwiki/pmwiki.php/Main/InescapableAmbush", "/pmwiki/pmwiki.php/Main/PlayerCharacter", "/pmwiki/pmwiki.php/Main/TheAllSeeingAI", "/pmwiki/pmwiki.php/Main/SentryGun", "/pmwiki/pmwiki.php/Main/DemonicSpiders", "/pmwiki/pmwiki.php/Main/AxCrazy", "/pmwiki/pmwiki.php/Main/WhyAmITicking", "/pmwiki/pmwiki.php/Main/Mooks", "/pmwiki/pmwiki.php/Main/HoldTheLine", "/pmwiki/pmwiki.php/Main/TeleportingKeycardSquad", "/pmwiki/pmwiki.php/Main/MookMaker", "/pmwiki/pmwiki.php/Main/MonsterCloset", "/pmwiki/pmwiki.php/Main/Unwinnable", "/pmwiki/pmwiki.php/Main/WeaksauceWeakness", "/pmwiki/pmwiki.php/Main/PhysicalGod", "/pmwiki/pmwiki.php/Main/DidntThinkThisThrough", "/pmwiki/pmwiki.php/Main/NoKillLikeOverkill", "/pmwiki/pmwiki.php/Videogame/ResidentEvilOperationRaccoonCity", "/pmwiki/pmwiki.php/Main/ShootOutTheLock", "/pmwiki/pmwiki.php/Main/AnimatedArmor", "/pmwiki/pmwiki.php/Main/PreExistingEncounters", "/pmwiki/pmwiki.php/Main/MundaneMadeAwesome", "/pmwiki/pmwiki.php/Main/LicensedGame", "/pmwiki/pmwiki.php/UsefulNotes/NintendoEntertainmentSystem", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/RingOfFire", "/pmwiki/pmwiki.php/Main/TheDragon", "/pmwiki/pmwiki.php/Main/GetBackHereBoss", "/pmwiki/pmwiki.php/Main/GhostButler", "/pmwiki/pmwiki.php/Main/AirborneMook", "/pmwiki/pmwiki.php/Main/DemonicSpiders", "/pmwiki/pmwiki.php/Main/GiantMook", "/pmwiki/pmwiki.php/Main/KillEnemiesToOpen", "/pmwiki/pmwiki.php/Main/DegradedBoss", "/pmwiki/pmwiki.php/Main/MiniBoss", "/pmwiki/pmwiki.php/Main/BrutalBonusLevel"]}