{"title": "Perpetually Static", "content": "MMORPGs are usually based on the concept of a perpetual world. You make your character and enter a large world filled with cities, people (both other players and Non Player Characters), and all sorts of intrigue. You can fight monsters, undertake tasks given by NPCs, and participate in many events.\n\nHowever, if any real control were given to the players, they would ruin the concept faster than a heckler at a play. As such, many rules end up being put in place to prevent that from happening. Also, due to the fact that there is very rarely any single overarching character trait (outside of being a \"hero\" or \"adventurer\" or what have you), the developers have to write all plots with that in mind. This leads to a perpetually static world. Rules for the world are as follows:\n• Every NPC that has a permanent role and a part in the plot is immune to death or otherwise being unable to return to said role.\n• Every organization with a public face that exists when you start the game will continue to exist no matter what. Kingdoms never fall and companies never go out of business.\n• Every major boss will respawn and continue to exist long after you've killed him, turned in the corresponding quest, and got rewarded for saving the world from imminent destruction at his hands. This, of course, means said boss will not remember you killed him even if you equip a piece of gear that you looted from his cooling corpse.\n• There will never be any sort of large geological change. Will that Floating Continent with the horde of baddies fall after you defeat the dark lord? Nope. Will the underground ruins sealing off the evil god crumble after you defeat it (or probably just seal it off some more)? Nope.\n• On a similar note, any faction's general outward attitudes will never change during the plot. If they're at war with another faction, they will always be at war with that faction.\n• Similar to the above is that the whole world is at a stalemate. Will the orcs that have a hideout within less than a mile of the kingdom ever make an attempt to invade? Not in any way where they could possibly succeed or be completely driven out.\n• As a corollary to all of the above, any major changes that do occur are basically a whole retcon to the game done by the developers. For example, if they decide that a kingdom was destroyed, then everything in the game will be changed to reflect that it happened in the past.\n• You, the player, are the least interesting character in the story by far. If you have any lines, they are prompt choices scripted in a But Thou Must! style and are usually extremely generic. The other characters do all the talking for you. As such, it's actually fairly rare to have scenes interacting with a single person for very long.\n• Related to the above, you also play the smallest role in the story. You are little more than a glorified delivery service and bodyguard, fighting all the big bad guys and just being a mute witness to the scripted plot's main character NPC's.\n• However, practically every quest they hand you will do its level best to convince you that the fate of the world rests in your hands. If enemies are ready to blow up the castle, rest assured the guards will turn to you, the innocent bystander, with \"you have to go stop them or all is lost!\" coupled with some lame excuse why they can't do it themselves. Though, of course, Take Your Time, and try to ignore how this same quest gets offered to every other player who passes this way, and the castle never does get blown up, and....\n• The longer a story is, the fewer options you truly get to influence it. The only possibility of Multiple Endings come from tiny, self-contained quests (and these will rarely have any impact on the rest of the game world).\n• No matter how many people you bring along (or, indeed, there are in the entire world), the story treats it as though the world's events are being influenced solely by your (non)action.\n• Time is meaningless outside cutscenes. You could finish a cutscene where you have to chase somebody, go do something else for two years, and come back to the next cutscene, where you corner them with the events of the previous cutscene still only a few minutes ago.\n• The most unique, irreplaceable and valuable Mac Guffins and even Cosmic Keystones that the hero is tasked with recovering will be a dime a dozen, and the player will at times be able to possess multiple copies at the same time!\n\nExceptions to these rules are rare and usually gimmicky. See also An Adventurer Is You, Heroic Mime, and Status Quo Is God. Results in Orcus on His Throne for the Big Bad of any MMORPG. This could be considered an Acceptable Break from Reality, given that it's pretty much necessary for the genre. For non-MMORPG examples, compare Medieval Stasis and Modern Stasis.\n• Final Fantasy XI takes this to its logical extreme. While the Conquest system means that imbalance in the nationalities of Player Characters fighting in some regions can lead to those regions changing hands, and there have been attempts to add more spontaneity through Besieged and Campaign, all are still zero sum games in that no permanent changes happen regardless of their outcomes.\n• Story Rule 2 is taken to extremes in Treasures of Aht Urghan. It may be annoying that if an NPC there is at least somewhat competent, you'll be treated like a slab of muscle with the IQ of a turnip... but it's even more annoying when your character's actions actually reflect this. Obviously the author had never heard of the saying, \"fool me once, shame on you; fool me twice, shame on me.\"\n• An interesting consequence occurs from Story Rule 5 due to the extremely plot-heavy nature of FFXI: All events over the course of the game (with the exception of the Crystal War, experienced only through time travel) are effectively contemporary to each other, with linearity only occurring along the course of specific sets of quests or missions. Short-term changes are allowed for the sake of plot development, with a return to a reasonable facsimilie of the status quo by the end. This can sometimes cause oddities not just for the player but for important NPCs, such as Minister Ajido-Marujido representing Windurst in national diplomacy while under investigation for treason—or possibly even while being incarcerated for it .\n• A later expansion seems to chafe against this, however. The expansion's story revolves around colonization, and as each new region is added with updates, players have to participate in the construction of the zone by running packages of supplies on foot to the encampments in return for currency and experience points. Once enough supplies have been received, the camp is built and teleporters set up. On a smaller level, players must frequently remove trees and rocks that Mother Nature builds to defend her pristine land, or wait for paths in a forest to open because they change with the time of day.\n• Final Fantasy XIV has some interesting takes on the world and story rules while also playing some of them straight:\n• While most NPCs will stay where they are forever, certain characters related to quests will vanish from the world if the plot calls for it. Beastmen tribes will always appear to antagonize NPCs and/or the player no matter how many times you beat them in the main story or related quests. Certain cities and areas do actually change over time as you progress in certain quests and in the main story, but other players will not see the changes until they do the required quests. When the game bombed at 1.0, the developers decided to trash the entire world and remade it for the reboot in 2.0, changing a lot of areas as a result.\n• In regards to the player, it's a mixed bag. The main story treats every accomplishment done by the player as a solo feat, even though a lot of trials require players to form a party in order to tackle the challenges in the story. The strange part about this is when you talk to an NPC in the overworld to start the trial, they'll always tell you to bring along a few more adventurers to make things easier. When the battle is won, everyone assumes you did everything yourself. Likewise, cut scenes will only show the player character along with the relevant NPCs, but very specific content (like the Binding Coil of Bahamut) will show other players in your party.\n• While you can choose how to respond to certain NPCs, the only thing that changes is how they respond to you before going back to their script since all quests and the main story are set in stone and cannot be altered. In some cases, it becomes a But Thou Must! moment where responding negatively stops the story/quest from advancing until you give a positive response instead.\n• This gets handwaved at the end of Patch 2.55 when you are framed for murdering the Sultana. Any time you go back to Ul'Dah (which most players at the time likely did, since there were a few months between 2.55 and Heavensward), the guards either don't believe you're guilty, or are afraid to take you on alone, giving you plenty of time to escape while they \"send for reinforcements\" that never arrive.\n• Runs heavily into Gameplay and Story segregation as the story of Heavensward progresses. Plot-wise, you win the Dragonsong War, somewhat shrink the gap between nobles and commoners in Ishgard, and the like, but most dragons in the Churning Mists are still out to get you, and leves and some random NPC non-conversation text is still clearly set during the war. Job quests don't fare any better.\n• World Rule 3 (infinitely-respawning bosses) is in full force, but with an actual explanation — primals are, essentially, tulpas summoned by the beast tribes, and as long as they still have a reason to want their primals back, they'll finagle a way to resummon them. Even the Hard Mode Filler versions are explained, as primals are summoned with prayer and crystals, and of course the beast tribes will gather more crystals and pray harder after you beat their god once already.\n• City of Heroes attempted to subvert this in places, but failed. They tried to lampshade why the Task Forces were repeatable with a vague \"but that doesn't mean they won't try it again\" type of sentence. It doesn't quite explain why if they're trying the same thing over again, you still have to play along as if you haven't foiled them before. Some mission sets tried to progress the general story, but failed due to conflicts with either the game world or with other missions. One example is the Crey corporation, where you eventually exposed all their conspiracies and arrested the owner. That didn't stop the operatives from swarming the streets or the fact that Manticore still acts like the Countess is a highly respected business owner when you started his task force . One Task Force even had you rescuing an NPC that you could still find standing around in the world. It also tried to progress the game world itself over time, but this had mixed results as well. One very clunky change was the 5th Column takeover by the Council, which itself had been criticized as a No Swastikas retcon. One can read about it here . More effectively subverted in an update which makes the world change client-side to reflect the things the player character has done. For example, if the player shut down a certain enemy group in one particular area, he/she would not encounter the enemies associated with that group there, however another player would, unless he/she had taken them out as well. The world also changed client-side when your character joined a team, based upon what the team leader had done.\n• World of Warcraft has advanced somewhat over the years from its origins, which played this trope completely straight.\n• Static examples:\n• The Horde and Alliance will always be at war or on the verge thereof, no matter what other conflicts arise and no matter how idiotic its leaders have to remain to enforce this.\n• Unless completely removed (or phased; see below for more on this), all major encounters, bosses, and dungeon enemies will respawn a certain time after being defeated, no matter how many times you've killed them before. You can still go and kill Onxyia in her lair, despite her being canonically dead in the main storyline and an undead version of her being an encounter in Blackwing Descent. Similarly, Ragnaros is still fightable in Molten Core, despite having been canonically summoned and defeated there, summoned and defeated yet again in Mount Hyjal, and being the end boss of the Firelands raid.\n• As if to rub it in, quests exist that can be repeated daily for progressive rewards, even if these focus on killing the exact same NPC you defeated the day before. There are multiple lampshadings of this, however, including the \"Glop, Son of Glop\" quest in Deepholm which functions on the conceit that the badguy you're killing today is the absolutely identical son of the previous one, ad infinitum; and a quest giver in Tol Barad Peninsula who remarks on how uncanny it is that he receives a new set of orders every day at exactly 3 AM (which is when daily quests reset).\n• Aversions or attempted aversions:\n• Holiday events come and go periodically, with their associated NPCs and buildings spawning for the duration, then disappearing once it's over.\n• Various one-time events have heralded the introduction of new content, particularly before each expansion, and also with some content patches like the War Effort pre-Ahn-Qiraj, the Scourge Invasion pre-Naxxramas (with an upgraded version pre-Wrath of the Lich King), the building of the Argent Tournament, and the retaking of the Isle of Quel'Danas. In many cases this results in permanently missable special rewards. In a counter-aversion, some of the NPCs related to these events are still around to accept any left-over tokens or quest turn-ins, even though the events are long gone, never to return.\n• Burning Crusade introduced world PvP objectives, where players could fight over zone-specific control points and earn their side a temporary buff. This fell out of popularity and was revisited in Wrath of the Lich King and Cataclysm in the form of entire zones dedicated to PvP, with battles fought every two hours for control of the zone and its associated quests/dungeons.\n• Wrath of the Lich King introduced a technique called \"phasing\" to the main quest lines, which allows zone features and NPCs to appear differently for players after they've passed certain quest milestones. One major use of this is in the Death Knight starting zone, which changes dramatically as you complete quests. For you, that is. That village you attacked may look conquered and on fire to you, but to a Death Knight who has yet to complete the attack quest, it's still full of Scarlet Crusade.\n• With the Cataclysm expansion, the Eastern Kingdoms and Kalimdor have been completely redone thanks to Deathwing's emergence and subsequent rampage. Of course, this leaves the world in a Perpetually Static state of having just suffered this wave of destruction. Parodied by the repair crew trying to move a fallen statue outside Stormwind City, who cannot agree on how to move the statue, and the foreman tells you they'll probably be there \"for a long, long time.\"\n• Cataclysm, however, vastly expands the phasing system. Players will start seeing the world change around them as a result of their actions by level 15 or so now, although the same caveat — other players see the zone as a result of their actions or lack thereof, not yours — still applies.\n• Several outdated quests have been removed from the game. Examples include the quests after the Angrathar the Wrathgate quest, which lead up to the Battle for the Undercity (which involve meeting with Thrall, who has since left the Horde to help the Earthen Ring in Cataclysm). The quests to save Princess Moira Bronzebeard from Thaurissan are no longer in the game, as she is now part of the Concil of Three Hammers, but still appears in the boss encounter with Thaurissan unless the players have done the quest to save her already, in which case a Dark Iron Priestess replaces her.\n• Thrall has members of the Kor'kron elite guard replace the abominations that used to guard the Undercity after the horrific consequences of Varimathras and Putress' betrayal at the Wrathgate to make sure nothing like that happens again, and because most of the abominations were killed when the Horde retook the city. The guards, referencing the events, express contempt and distrust for undead players and give words of caution to non-undead players when spoken to. They, however, are present for players who have not completed the Wrathgate quest chain yet, and if spoken to before then, say that they are here to guard the city because most of the troops are in Northrend.\n• As of patch 5.4, Siege of Orgrimmar, Garrosh's Kor'kron forces have most of the city on lockdown as they prepare for the siege in question. The troll sector of the city, in particular, is completely shut down, and several citizens or groups of people, such as Gamon and the Warlocks under the city, are being held at gun- or axe-point to quell dissidents. Meanwhile, a massive rebel army, led by Baine and Vol'jin, gathers in Razor Hill. However, this is mostly flavor. Questing and the overall functionality of the city itself remains undisturbed, no matter how many times people clear the titular raid.\n• In Ultima Online, there was an invasion of towns by the Orcs that players actually had to fight. On some Shards (servers), people actually failed to kill \"enough\" Orcs, and certain towns were taken over permanently.\n• Likewise, there was an event which involved fighting to save a small woodland town from invasion. Some shards just didn't try hard enough, and the town was partially corrupted into a giant swamp full of mutated creatures; it has only just been reverted, several years later.\n• Ultima Online also accidentally violated the first law, with the eponymous Lord British getting killed of by a simple fireball spell during an event. In fact, they did code Lord British to be unkillable — a server crash reset the 'Unkillable Flag' and the staff didn't notice until Richard Garriot's character was dying in front of a crowd of several hundred.\n• In EVE Online, how static a region is varies directly with its security level. The highest-security systems are almost completely in the hands of NPCs, and no player-controlled building is allowed, while no-security \"zero-zero\" sections are all-players, no-rules. The publishers of the game have decided to leave this be, as the player base seems capable of providing for itself, and the economy is now almost completely anarcho-capitalist. It helps immensely that this particular gameworld is space, as the almost complete emptiness lends itself well to player control.\n• The Incursion update brought with it the titular 'Incursion' system, which undermines somewhat the above sliding scale of staticness. While player-control rules remain the same, the incursions, wherein local sovereignty is subverted by pirate-faction interests, can strike in absolutely any security zone, screwing up reward rates, PC ship stats, and instance types while ambushes will occur around major points in the affected system. This situation will persist (and get gradually worse) until such time as players band together to kick the pirates out again.\n• Wormhole space is particularly dynamic, as even the entry and exit points will change over time, the amount of time depending on the amount of use they see.\n• Subverted in Achaea (and other Iron Realms games). The world is run entirely by the players; they rule the cities, control every major organisation and create the vast majority of the content, from clothing to pets. The only reason the status quo stays that way is that the powerful players at the top want it to - and every now and then it shifts dramatically, with everything up to player-guided wars. (However, NPCs are more or less static, respawning shortly after they're killed, and the safer newbie-lands of Lodi and Minia are completely static with no player control at all.)\n• Although this mainly applies to MMORPG Anarchy Online, there are few elements in the game worlds plot that move forward. For example in one patch the city of borealis was occupied by omni-tech affiliated unicorn guards, which made travelling through there deadly for clan. After few player organised major clan attacks the Unicorns retreated at a later patch. Also some other areas control has changed hands in permanent basis.\n• While Gaia Online features a dynamic plotline, and the world has changed a lot over time, the world of zOMG tends perpetually static. This is lampshaded early on with repeatable quests, where your character complains that no matter how many enemies he/she kills, no progress is ever made. Even after you defeat , and the NPCs resolve to find out more about this new G'hi energy that creates the Animated, everything is exactly the same as before. Most NPCs in Barton are still wondering if the Zurg or Vampires are behind everything and Blaze is still standing around the ruins wondering where her dad is. If you return to the Shallow Sea, you can rescue Marshall again, and he'll act like it's the first time you've met him. You can also travel all the way back to the Underwater Base, and stop the Big Bad's plan again. In the most extreme example, you encounter an NPC at the Old Aqueduct who is later revealed to be a villain. After you defeat the Big Bad, you can return to the Aqueduct, and the NPC is still standing there like nothing is wrong, pretending he doesn't know you. (It helps that the text implies that your character doesn't recognize that are the same person. But your character does know that many of the Labtechs that showed up in the Barton area were actually , but no one bats an eye.)\n• Asheron's Call illustrated why this is almost necessary for MMORPGs. For the main plot event of one month, characters were left with one crystal keeping Big Bad in check. Great rewards were given to those who destroyed the crystal and set him free. However, players were also empowered to fight each other and defend the crystal. In most servers a half-hearted defense was mounted and the crystal was quickly destroyed, but in one, they were able to mount a round-the-clock vigilant defense. Unfortunately the developers had expected the crystal to be destroyed for plot purposes, and thus were forced to intervene to keep all of the servers on the same page. Never let the players have control of the plot.\n• Star Wars: The Old Republic manages to avert most of the story rules - your character is actually rather important to each storyline, and is considered a canon character to the galaxy, though in more general terms (for example, the Jedi Knight is the \"Hero of Tython\" and not whatever name you gave them). However, this actually causes more problems than it solves, as time quite obviously passes within the storyline but is never reflected within the game world. Someone on Act 3 may have a certain event going that is two years after the game story starts, while someone in Act 1 or the Prologue is just getting started. The worlds are vastly different between the two, but the game world itself remains exactly the same.\n• This trope can also become jarring to anyone who has started the Knights of the Fallen Empire content, which DOES shake up galactic politics quite a bit, yet you can still return to your factions fleet exactly as it was, and all Non Player Characters from the original content are still going about their business as they were before the expansion happened.\n• Perfect World Online has a rather more malleable world than most, with player guilds being able to take and lose territories if they are strong enough. However, there isn't much of an overarching plot for this chaos to mess up.\n• Guild Wars easily averts this by meshing its MMORPG with a single-player RPG's plot structure and geography, just with a lot more sidequests and side areas and other players to team up with (the plot pretends you have the same team the whole game). The only real side effect is that with the exception of the Searing (which transforms the tutorial areas into the start of the main game), you can freely move backward in time by just visiting an earlier area—everything will be as if all plot points since then never happened (including Face Heel Turners chatting amicably rather than stabbing you) and there will often be no logical way you could've gotten back there, storywise (since a large part of the plot was getting OUT of Ascalon, how did I just get back from that desert island into a fort in the middle of it?).\n• Its sequel will have a persistent world, but will try to avert it via the dynamic event system: The players actions during these events will change the area for everyone and lead to different new events depending if the players managed to succeed in the previous events or failed it. Of course, after a while the quest chain will reset, so those players who don't want to break the Willing Suspension of Disbelief that their actions matter had better move to the next area quickly.\n• This is played straight in Ragnarok Online, at least until the Satan Morocc patch, which turns the desert town of Morocc into some sort of portal for evil things to come out of. Sort of. The city's still accessible though.\n• Puzzle Pirates averts this to some degree, because pretty much everything that happens in the game (I.E. any sort of plot) is a result of large organizations of players creating these events. It is players who own entire islands and players who set up shops and drive the economy, so when two factions are fighting, it is because the players leading those factions declared war on one another, not because any arbitrary plot-writer decided it should be that way. Wars between factions are therefore temporary and may be settled with the exchange of land or other assets, and the most major event in the game is a blockade, where one faction attempts to permanently take territory from another faction during a massive free-for-all naval combat in which a thousand players may sometimes participate. Therefore, history writes itself based on the decisions of the most powerful players in the game.\n• Averted by Urban Dead where the city is constantly changing due to the actions of the players.\n• Fought furiously by Nexus War, the Fan Sequel to Urban Dead. The game usually managed to avoid this due to its status as an open beta - there was usually a good explanation for anything the PCs could do, and the regular infusion of new stuff shook up the gamemap on a continual basis. All of that came to a halt when the developer was contractually forced into stopping the updates. Rather than submit to this trope, he took the game Off the Rails for a epic finale. Eventually fans brought the game back as Nexus Clash, which once again has active plot development.\n• Averted even more in Shintolin, where every building, weapon, and slice of huckleberry pie is player-created, mighty empires rise and fall, the Glyph of Marquai was carved into a forest, and so on.\n• Averted by a one time glitch in Planetside that allowed one team's main base to be captured, effectively eliminating the faction from the server (as romanticized here ).\n• The Lord of the Rings Online started as fully embracing this trope, as the main storyline is tied to the story of the Fellowship. Each Region is locked in time, so it's always September 3018 in the Shire, December 3018 in Rivendell, February 3019 in Lothlórien etc. As a result, many characters can appear in different locations simultaneously - because they are also in different time periods, sometimes down to a specific date assigned to the room they're in. Any missions taking place on landscape as opposed to dungeons were actually set in instanced spaces designed to look like open world, with the world itself unchanged by your actions. The part of the story you're supposed to affect lived to the trope as well: characters who died or permanently moved away were simply hidden behind suddenly impassible doors, locations you supposedly cleared of enemies were still crawling with mooks and Big Bads of group instances could be defeated repeatedly even despite sometimes surviving and opposing you in encounters later down the storyline as well. Lately, however, the designers have been experimenting with Phasing to a great effect: characters in open world can now appear and disappear by moving along the landscape with you or even be Killed Off for Real and the world itself can be affected by your actions, so the village being burned or overrun by brigands can be freed and rebuild after you save it - while other people walking around see different things depending on their own progress. This feature, however, is only implemented in some regions of Enedwaith, Dunland and Isengard, while the rest of the world still employs static rules. While developers have expressed their desire to eventually bring the rest of the world to date, it's admittedly not of the top priority.\n• Averted in Dungeons & Dragons Online, where the starting area changes in appearance on a player-by-player basis once you've completed its main quest line.\n• Final Fantasy XIV plays every single story rule straight. The random events that pop up outside of cities have a quick blurb on what danger has arisen and what could happen if nobody stops it. You can ignore the events all you want or fail the events and nothing changes. However, the story itself makes the player character one of the chosen many that were blessed by the mother crystal, Hydalen, with the power of the Echo which makes them immune from being brainwashed by the Primals.\n• The game breaks world rule 4 after it had gotten a major overhaul for patch 2.0; many of the locations have been heavily altered due to the calamity and in later patches, many dungeons have gotten a hard mode version that you can explore and it shows how much of the dungeon has changed.\n• Aversions to several rules show up more and more as the patch cycles go on. Characters related to storylines will move around after that patch's storylines end and have thoughts to share that will change when the next patch comes out and their story continues, and sometimes this bleeds over into others. The best example is probably the fallout from the finale of the 2.0 storyline, where every NPC you've met will have some form of comment about what events had played out.\n• Aion falls hard into this one, so much so that you wonder why they bothered to set it up that way. The overarching story is that the world of Atreia has been shattered into two halves by the Balaur, resulting in two factions constantly at war, the Elyos and the Asmodians, and both are at war with the Balaur, who only exist in the center of the shattered world. However, the breaking of the world means that the lifeblood of all three races, Aether, is disappearing, and the game goes so far as to state that the constant warfare is accelerating the loss of Aether, with cataclysmic consequences if the Aether gets too low. What effect does this have on gameplay? None at all (except for the PvPvE).\n• Runescape had this thing going on for years and is still present with the same in-game year (169) being for eternity and majority of NPC folk treat you as the hero. However, about in 2005, permanent character changes were made. For an example, completing a quest may result many NPC s die permanently and there are even a few which are skill-related. Some of the updates (like revenants) were also written into in-game timeline. Also, the player character would also gain some personality which varies per quest or task.\n• In order to prevent them from leaving the League of Legends, none of the champions will ever complete their personal reasons for being there. No-one will join who knows Trundle's cure, Ammumu's history, or the location of Nami's Moonstone. No matter how many games they dominate, neither Jax, Fiora or Wukong will be able to prove they're number one. No matter how many times Graves, Kha'zix or Warwick kill Twisted Fate, Rengar or Soraka, they will just respawn and the hunt will be on again.\n• However, in the lore at least they're averting this by having the story finally marching on in ways that rivals meet, fight, and terms change, starting with a massive Wham Episode where Miss Fortune appears to kill Gangplank, leading him to return Darker and Edgier with a new model. Other things, such as Graves and Twisted Fate burying the hatchet and returning to being friends have happened. However, save situations where the characters need redesigns or relaunches, none of these advancements in their personal stories affect the game outside of a few new lines of interaction dialogue.\n• Played with in Kingdom of Loathing, where the word is static because, well, you keep getting reincarnated back to before it was changed. However, the gameworld itself has undergone radical changes - a rash of bugmeat caused the Penguin Mafia to move into the Kingdom, a comet hit Hagnk's Storage and caused a bit of a rush for its valuable material, a campaign went into action to restore the Knott Yeti population, and so forth. These are called \"world events\" and tend to leave the Kingdom changed in at least one significant way.\n• Large-scale and long-running \"official\" roleplaying campaigns like D&D's former \"Living Greyhawk\" are prone to this for much the same reasons as MMORPGs. In particular, because any given official scenario (of which only so many can be plausibly created, printed, and distributed in a given timespan) is usually meant to be played through multiple times by different, potentially constantly shifting and changing player groups up to all over the world in whatever order turns out to be convenient on a case-by-case basis, consequences of any given single current group's actions by and large can't officially carry over from one game to the next except for carefully pre-scripted benefits and drawbacks in the form of physical handouts the players can take with them and that may or may not prove useful in future events.\n• Averted starting with season 4 of Pathfinder Society, where online reports of players' success (or failure) in certain scenarios were used to determine a major NPC's fate.\n• This is parodied during the \"Years of Yarncraft\" storyline from Sluggy Freelance, most notably in these two strips. Torg: \"It felt like I was accomplishing something, stopping Luther. But I wasn't! He's still in the game drowning puppies. And if I'm not supposed to care about the quests, if I don't have any real impact on this world, what am I playing the dumb game for?\"", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/PerpetuallyStatic", "media_links": ["/pmwiki/pmwiki.php/Literature/NineteenEightyFour", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyXI", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyXIV", "/pmwiki/pmwiki.php/VideoGame/CityOfHeroes", "/pmwiki/pmwiki.php/VideoGame/WorldOfWarcraft", "/pmwiki/pmwiki.php/VideoGame/UltimaOnline", "/pmwiki/pmwiki.php/VideoGame/UltimaOnline", "/pmwiki/pmwiki.php/VideoGame/EVEOnline", "/pmwiki/pmwiki.php/VideoGame/Achaea", "/pmwiki/pmwiki.php/VideoGame/AnarchyOnline", "/pmwiki/pmwiki.php/VideoGame/AsheronsCall", "/pmwiki/pmwiki.php/VideoGame/PerfectWorld", "/pmwiki/pmwiki.php/VideoGame/GuildWars", "/pmwiki/pmwiki.php/VideoGame/RagnarokOnline", "/pmwiki/pmwiki.php/VideoGame/PuzzlePirates", "/pmwiki/pmwiki.php/VideoGame/UrbanDead", "/pmwiki/pmwiki.php/VideoGame/NexusWar", "/pmwiki/pmwiki.php/VideoGame/NexusClash", "/pmwiki/pmwiki.php/VideoGame/Shintolin", "/pmwiki/pmwiki.php/VideoGame/Planetside", "/pmwiki/pmwiki.php/VideoGame/TheLordOfTheRingsOnline", "/pmwiki/pmwiki.php/VideoGame/DungeonsAndDragonsOnline", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyXIV", "/pmwiki/pmwiki.php/VideoGame/Aion", "/pmwiki/pmwiki.php/VideoGame/Runescape", "/pmwiki/pmwiki.php/VideoGame/LeagueOfLegends", "/pmwiki/pmwiki.php/VideoGame/KingdomOfLoathing", "/pmwiki/pmwiki.php/TabletopGame/DungeonsAndDragons", "/pmwiki/pmwiki.php/TabletopGame/Pathfinder", "/pmwiki/pmwiki.php/Webcomic/SluggyFreelance"], "non_media_links": ["/pmwiki/pmwiki.php/Main/MMORPG", "/pmwiki/pmwiki.php/Main/NonPlayerCharacter", "/pmwiki/pmwiki.php/Main/NPC", "/pmwiki/pmwiki.php/Main/BossBattle", "/pmwiki/pmwiki.php/Main/FloatingContinent", "/pmwiki/pmwiki.php/Main/NoOntologicalInertia", "/pmwiki/pmwiki.php/Main/SealedEvilInACan", "/pmwiki/pmwiki.php/Main/LoadBearingBoss", "/pmwiki/pmwiki.php/Main/EnforcedColdWar", "/pmwiki/pmwiki.php/Main/Retcon", "/pmwiki/pmwiki.php/Main/ThisLoserIsYou", "/pmwiki/pmwiki.php/Main/HeroicMime", "/pmwiki/pmwiki.php/Main/ButThouMust", "/pmwiki/pmwiki.php/Main/WelcomeToCorneria", "/pmwiki/pmwiki.php/Main/FetchQuest", "/pmwiki/pmwiki.php/Main/Railroading", "/pmwiki/pmwiki.php/Main/ItsUpToYou", "/pmwiki/pmwiki.php/Main/TakeYourTime", "/pmwiki/pmwiki.php/Main/MultipleEndings", "/pmwiki/pmwiki.php/Main/TakeYourTime", "/pmwiki/pmwiki.php/Main/MacGuffin", "/pmwiki/pmwiki.php/Main/CosmicKeystone", "/pmwiki/pmwiki.php/Main/EnoughToGoAround", "/pmwiki/pmwiki.php/Main/OddlyCommonRarity", "/pmwiki/pmwiki.php/Main/AnAdventurerIsYou", "/pmwiki/pmwiki.php/Main/HeroicMime", "/pmwiki/pmwiki.php/Main/StatusQuoIsGod", "/pmwiki/pmwiki.php/Main/OrcusOnHisThrone", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/AcceptableBreakFromReality", "/pmwiki/pmwiki.php/Main/MedievalStasis", "/pmwiki/pmwiki.php/Main/ModernStasis", "/pmwiki/pmwiki.php/Main/MMORPG", "/pmwiki/pmwiki.php/Main/PlayerCharacter", "/pmwiki/pmwiki.php/Main/IdiotBall", "/pmwiki/pmwiki.php/Main/GaiasVengeance", "/pmwiki/pmwiki.php/Main/ButThouMust", "/pmwiki/pmwiki.php/Main/Tulpa", "/pmwiki/pmwiki.php/Main/HardModeFiller", "/pmwiki/pmwiki.php/Main/GodsNeedPrayerBadly", "/pmwiki/pmwiki.php/Main/GreenRocks", "/pmwiki/pmwiki.php/Main/Lampshade", "/pmwiki/pmwiki.php/Main/NoSwastikas", "/pmwiki/pmwiki.php/Main/Retcon", "http://cityofheroes.wikia.com/wiki/5th_Column_Controversy", "/pmwiki/pmwiki.php/Main/ConflictBall", "/pmwiki/pmwiki.php/Main/PermanentlyMissableContent", "/pmwiki/pmwiki.php/Main/WhamEpisode", "/pmwiki/pmwiki.php/Main/LordBritishPostulate", "/pmwiki/pmwiki.php/WebSite/GaiaOnline", "/pmwiki/pmwiki.php/Main/TheForce", "/pmwiki/pmwiki.php/Main/TheVeryDefinitelyFinalDungeon", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/OffTheRails", "/pmwiki/pmwiki.php/Videogame/StarWarsTheOldRepublic", "/pmwiki/pmwiki.php/Main/NiceJobBreakingItHero", "/pmwiki/pmwiki.php/Main/NonPlayerCharacter", "/pmwiki/pmwiki.php/Main/FaceHeelTurn", "/pmwiki/pmwiki.php/Main/HereWeGoAgain", "/pmwiki/pmwiki.php/Main/WillingSuspensionOfDisbelief", "/pmwiki/pmwiki.php/Main/FanSequel", "/pmwiki/pmwiki.php/Main/OffTheRails", "/pmwiki/pmwiki.php/Main/GrandFinale", "http://www.rockpapershotgun.com/2008/09/05/planetside-the-1/", "/pmwiki/pmwiki.php/Main/KilledOffForReal", "/pmwiki/pmwiki.php/Main/EvilGod", "/pmwiki/pmwiki.php/Main/WhamEpisode", "/pmwiki/pmwiki.php/Main/WhamEpisode", "/pmwiki/pmwiki.php/Main/DarkerAndEdgier", "/pmwiki/pmwiki.php/Main/GameplayAndStorySegregation", "/pmwiki/pmwiki.php/Main/TabletopGames", "/pmwiki/pmwiki.php/Main/WebComics", "http://www.sluggy.com/daily.php?date=080820", "http://www.sluggy.com/daily.php?date=080821"]}