{"title": "One Last Fling", "content": "Like a bachelor party for fictional, not-yet-dating couples. The narrative often drives the Star-Crossed Lovers into a relationship or fling juuuuuust before they finally hook up for good. Perhaps so they can sow wild oats or learn important lessons about their partner, or on the opposite end of the scale, who to trust with an unattended drinks. Sometimes these last minute hookups are used to get the other party to realize the error of their delays. Often, this is the very first relationship in a long time for the flinging party, since they've been so entrapped by the ongoing will-they-or-won't-they nonsense.\n• Cheers: In episode \"One for the Book\", a seminary student named Kevin, who is one day away from a life of chastity and a vow of silence as a monk, comes into the bar to experience a night of drinking and fun before going away to the monastery forever. He calls it \"a first and last fling\". After he gets some alcohol in him Kevin starts thinking about losing his virginity as well but both Diane and Carla reject him.\n• Friends: Ross and Rachel have multiple last flings, they try and fail to have a 'bonus' night when Chandler and Monica get engaged, they succeed later on and conceive their daughter Emma, and they have one in the final episode as a way to 'say goodbye'. Well, Rachel thought it was one last fling - Ross thought they were getting back together.\n• This kind of fruitless love is in the air in the second-last Harry Potter book, just in time for most of the relationships to be dashed and properly reordered in time for the finale.\n• Jacob and Bella in Twilight, just in time for Bella to decide that she really needs to be with Edward.\n• This is pretty much the relationship between Alanna and Liam in the last Song of the Lioness book, since Alanna has decided to travel after breaking up with Prince Jonathan and she meets him on the road. They eventually realize that their goals are too different and split up amicably. Liam soon dies defending the palace at Jonathan's coronation , and Alanna ends up with longtime friend George Cooper in the end.\n• In the gay-themed, furry Slice of Life comic, Circles, Paulie explains about his past in issue #5, Paulie said that one last fling couldn't hurt and had sex with Keith. However, this became the biggest mistake of his life as this caused him to contract HIV from Keith.\n• This is what happens in between Ryo Sasaki and in Crescendo. Subverted in that, since she's one of the love interests, she can be convinced otherwise.\n• Also takes place in True Love Junai Monogatari, if the Player Character manages to bed in . Again, Misako can get upgraded into the love interest if you play your cards right.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/OneLastFling", "media_links": ["/pmwiki/pmwiki.php/Series/Cheers", "/pmwiki/pmwiki.php/Series/Friends", "/pmwiki/pmwiki.php/Literature/HarryPotterandTheHalfBloodPrince", "/pmwiki/pmwiki.php/Literature/HarryPotterAndTheDeathlyHallows", "/pmwiki/pmwiki.php/Literature/Twilight", "/pmwiki/pmwiki.php/Literature/SongOfTheLioness", "/pmwiki/pmwiki.php/ComicBook/Circles", "/pmwiki/pmwiki.php/VisualNovel/CrescendoEienDatoOmotteItaAnoKoro", "/pmwiki/pmwiki.php/VisualNovel/TrueLoveJunaiMonogatari"], "non_media_links": ["/pmwiki/pmwiki.php/Main/StarCrossedLovers", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Recap/CheersS1E11", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/Comics", "/pmwiki/pmwiki.php/Main/SliceOfLife", "/pmwiki/pmwiki.php/Main/SchoolNurse", "/pmwiki/pmwiki.php/Main/PlayerCharacter"]}