{"title": "The Item Number", "content": "A Bollywood song designed for only one thing: Fanservice. The song in question traditionally had an Item Girl do a dance for either the hero or the villain, but usually did not involve them beyond ogling the girl in question. Also, the song may or may not have anything to do with the plot. A variation on this would be the heroine to do the Item Number, depending on a few factors: She is either a skilled dancer, a new actress in her first movie, the studio could not afford the Item Girl they wanted, or the movie's promotion was centered around the song in question.\n\nCinema of the Arab world does much the same thing, but usually with a belly dance.\n• Aishwarya Rai in Kajra Re in Bunty aur Babli, alongside her future father-in-law Amitabh Bachchan and her future husband Abhishek Bachchan.\n• Malaika Arora (on top of a moving train!) in Chaiyya Chaiyya, in 1998's Dil Se...\n• Deliberately invoked (among with a lampshading of its fanservice nature) in Om Shanti Om, when Shah Rukh Khan's character believes the film he is working in is too dull and claims that such an scene must be added to reflect the mindset of his absurdly crippled character. Cue Item Number with him as the main Item, alternately shirtless or in dripping clothing.\n• \"Munni Badnam Hui Darling Tere Liye\" from Dabangg (2010) This one lampshades itself. (And, in a way, kind of deconstructs itself, too.)\n• \"Nimbooda Nimbooda\" in Hum Dil De Chuke Sanam featuring Aishwarya Rai. It's a song about lemons, though to be fair, the lemons are being used as a metaphor for the challenges that make life and relationships interesting.\n• The controversial (because of its title) song \"Choli Ke Peeche Kya Hai\" in Khalnayak. The title translates as \"What's behind the blouse?\"...although the answer is far less perverted than one would expect.\n• The opening song to that movie qualifies, too.\n• \"Chane Ke Khet Mein\" in Anjaam. If you were to just look at the lyrics, it's a song about a rape, but it's being presented as a positive experience, something to sing a happy song about...at a wedding! (It could be read as being about a \"rape fantasy\" scenario or simply consensual rough sex, but still...)\n• \"Mera Piya Ghar Aaya\" from Yaraana. (The above mentioned \"Munni Badnam\" number pays homage to the dance number aspect in Dabanng)\n• Lajja featured two item numbers. The first one is \"Aa Hi Jaiye\" with Urmila Matondkar. The second one is \"Badi Mushkil\" with Madhuri Dixit.\n• Frerquently parodied in Western works. Goodness Gracious Me puts a British-Asian slant on the Item Number, in an affectionate way. And the character of painfully shy, selectively mute around women Raj Koothrapali has been allowed several Item Numbers (featuring the female members of the cast) in The Big Bang Theory.\n• During the pitching tryout finals of Million Dollar Arm, a Disney movie filmed in India and the United States, which tells the story of J.B. Bernstein scouting the Indian countryside for prospective pitching talent. At the finals in Mumbai, some young Indian ladies can be seen dancing about in the background as the hopeful pitchers audition for the right to become the first baseball pitchers from India to make it in the United States.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/TheItemNumber", "media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/Creator/ShahRukhKhan", "https://tvtropes.org/pmwiki/pmwiki.php/Creator/AishwaryaRai", "https://tvtropes.org/pmwiki/pmwiki.php/Creator/AmitabhBachchan", "https://tvtropes.org/pmwiki/pmwiki.php/Creator/ShahRukhKhan", "https://tvtropes.org/pmwiki/pmwiki.php/Creator/AishwaryaRai", "https://tvtropes.org/pmwiki/pmwiki.php/Creator/MadhuriDixit", "https://tvtropes.org/pmwiki/pmwiki.php/Series/GoodnessGraciousMe", "https://tvtropes.org/pmwiki/pmwiki.php/Series/TheBigBangTheory", "https://tvtropes.org/pmwiki/pmwiki.php/Film/MillionDollarArm"], "non_media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/UsefulNotes/Bollywood", "https://tvtropes.org/pmwiki/pmwiki.php/Main/MsFanservice", "https://tvtropes.org/pmwiki/pmwiki.php/UsefulNotes/Bollywood", "https://tvtropes.org/pmwiki/pmwiki.php/Main/Fanservice", "https://tvtropes.org/pmwiki/pmwiki.php/Main/MsFanservice", "https://tvtropes.org/pmwiki/pmwiki.php/Main/BigLippedAlligatorMoment", "https://tvtropes.org/pmwiki/pmwiki.php/Main/BellyDancer", "https://tvtropes.org/pmwiki/pmwiki.php/Bollywood/BuntyAurBabli", "https://tvtropes.org/pmwiki/pmwiki.php/Bollywood/DilSe", "https://tvtropes.org/pmwiki/pmwiki.php/Bollywood/OmShantiOm", "https://tvtropes.org/pmwiki/pmwiki.php/Main/ShirtlessScene", "https://tvtropes.org/pmwiki/pmwiki.php/Main/WetSariScene", "https://www.youtube.com/watch?v=YpnohT_a-2I", "https://tvtropes.org/pmwiki/pmwiki.php/Main/Dabangg", "https://tvtropes.org/pmwiki/pmwiki.php/Bollywood/HumDilDeChukeSanam", "https://tvtropes.org/pmwiki/pmwiki.php/Bollywood/Devdas", "https://tvtropes.org/pmwiki/pmwiki.php/Bollywood/Khalnayak", "https://tvtropes.org/pmwiki/pmwiki.php/Main/SubvertedTrope", "https://tvtropes.org/pmwiki/pmwiki.php/Main/Tarkieb", "https://tvtropes.org/pmwiki/pmwiki.php/Main/LyricalDissonance", "https://tvtropes.org/pmwiki/pmwiki.php/Main/Anjaam", "https://tvtropes.org/pmwiki/pmwiki.php/Main/Yaraana", "https://tvtropes.org/pmwiki/pmwiki.php/Main/Dabanng", "https://tvtropes.org/pmwiki/pmwiki.php/Bollywood/Lajja"]}