{"title": "Enemy-Detecting Radar", "content": "A few real life combat vehicles have radar support (and all seafaring vessels are required to have at least one) that can help the pilot navigate the battlefield and avoid enemies, so it's no surprise that this is often part of video games that feature such systems. Sometimes it's justified as your character's equipment, or psychic, abilities or Handwaved as A Wizard Did It; other times it's just there with no explanation except to make the player's life easier. It may also partially model non-visual cues that humans tend to get like positional sound location (an aspect of the cocktail party effect ) which are difficult to implement in video game sound systems which often lack the ability to create true positional sound. Alternately, the \"radar\" is used to detect hidden items instead.\n\nIn some games, you will encounter enemies who can interfere with your radar in some way or other. Some jam the radar, filling the screen with static, others just don't show up at all or only show up randomly for a split second. This is usually justified with stealth technology and almost never affects visual detection or lock-ons.\n\nIn cases where both enemy and friendly units will be shown, they will be color-coded for the player's convenience.\n\nA common variation is for the radar to only display enemy units that are attacking. It's also often tied to Fog of War, showing only enemies that you actually see normally.\n\nIt may be part of a Level-Map Display.\n• The main character of Bully has one for absolutely no reason at all.\n• Ecco the Dolphin has the real-life-inspired animal version. Using his echolocation tells you where enemies are.\n• The Compass in The Legend of Zelda only pointed out the location of the boss and item boxes (starting from The Legend of Zelda: Link's Awakening); it wasn't until the 3-D titles that it also showed the direction you were facing.\n• Metroid:\n• All three Metroid Prime Trilogy games have this as a function of Samus' suit; in prior Metroid titles, the overworld map screen (if there even was one) just showed whether Samus had already been in a room and if it had an item hidden in it.\n• In Metroid: Samus Returns, the Metroid counter from the original Metroid II: Return of Samus gets a slight upgrade; it now blinks whenever a Metroid is close. The closer the Metroid, the darker the color of the icon and the more quickly it blinks. The Metroid amiibo takes this further by marking the nearest Metroid on your map screen.\n• Project Eden has a radar that beeps when enemies are near, which can get a little annoying when there is a nearby enemy you can't reach.\n• Since Spider-Man has a Spider-Sense that alerts him to danger, games featuring him have it as part of the gameplay.\n• The minimap in Syndicate showed the position of people, and distinguished between civilians, police, enemy agents and targets.\n• This is often known as an IFF (Identify Friend/Foe) system. They exist in Real Life, but those can only tell you if a signal is coming from a known friendly or not. It can't distinguish between enemies, civilians, or allies whose codes haven't been registered as such.\n• The scanner in Defender, which is also used in Chopper Command and Star Wars: The Empire Strikes Back (Atari 2600).\n• Cosmic Avenger has one appearing on the top of the screen, which can detect where UFOs will appear from.\n• The 7th Saga gives you a crystal ball that allows you to detect enemies, among other things. This functionality seems present mostly for the game to taunt you, as it's nearly impossible to avoid running into them.\n• The Dark Cloud games feature a \"Magic Crystal\" on each dungeon floor which will reveal the locations of any remaining enemies and treasure chests.\n• Dawn of Mana has one that's even Color-Coded for Your Convenience: blue enemies drop items, red ones are just there for you to kill and abuse the Ragdoll Physics with their bodies, and yellow indicates the direction in which you need to go.\n• Final Fantasy XII uses a similar system to Final Fantasy XI. A mini-map is shown at all times in the corner of the screen. Green dots were NPCs, blue dots were either your allies or a neutral character in the battlefield, red dots were foes, and huge red dots were bosses.\n• The Monster Hunter series had the Paintball item, which allowed a hunter to see where his/her mark is located on the onscreen map.\n• A function of the mini-map in Odin Sphere is to show enemy locations and even any projectiles they may be firing.\n• Parasite Eve 2 has a radar system that shows how close enemies are to you, but only if you have the GPS item equipped or are wearing armor that has a GPS built in.\n• Persona 3 has a radar screen that shows enemies, treasures, and general geography while exploring Tartarus. In one section, the enemies tend to blend into the dark background and the radar becomes that much more useful.\n• Pokémon:\n• Pokémon has one of these for items, creatively called the \"Item Finder.\" Over time it's evolved from a somewhat unhelpful noise maker if you were within 50 yards of something, to a \"DowsingMCHN\" that points out the EXACT location of a hidden item. It wasn't until Fire Red and Leaf Green that players got access to the \"Vs. Seeker,\" which could detect trainers. That is, those who wanted to battle or have a rematch and were onscreen.\n• The Pokeradar in Gen IV points you to hidden Pokemon via shaking grass. Trouble was it lasted a few steps and then needed 50 steps to recharge.\n• The Star Ocean games have a radar when battling the enemy to show the relative positions of your team and the enemy's.\n• Valkyria Chronicles: The overworld map shows the position of all allies and visible enemies.\n• Valkyrie Profile 2 Silmeria has a radar when battling the enemy to show the relative positions of your team and the enemy's, as well as each enemy's range of attack when zoomed in. The field map also shows the location of enemies, and changes their color depending on whether they're active (red), defeated (grey), or frozen in place by Alicia's photons (purple).\n• The radar in the 1980 coin-op arcade classic BattleZone (with wire-frame monochrome graphics.) May make this Older Than They Think.\n• Vehicles and the spacesuit in both Battle Zone 1998 and its sequel have a circular radar display, which shows the terrain in 3-dimensional wireframe, with friendly and enemy contacts displayed on top of the wireframe terrain. Different vehicles have different radar ranges, radar pulse rates, and inherent stealth abilities, the latter of which can be augmented by the RED Field generator or the Scion's Jammer building, which completely hides a vehicle from radar.\n• The Call of Duty series plays with this. In just about every game, there's a map in the top left corner of the screen which shows your squadmates as green chevrons and red dots representing enemy fire - in both World War II and Modern settings. This map could be disabled or enhanced in many ways:\n• Calling a UAV or Recon Plane (depending on the setting) will periodically give you all enemy positions every few seconds. Oddly enough, even if said enemies are inside concrete bunkers with no windows. Modern Warfare 3 includes an \"Advanced UAV\" that updates more often, while the Black Ops games include, respectively, an SR-71 Blackbird, an \"Orbital VSAT\", and a \"High Altitude Telemetry Reconnaissance\" vehicle that show the positions of enemies in real-time (marking them as red chevrons) and, except for the H.A.T.R., can't be shot down like the standard UAV.\n• Using tools/perks like UAV Jammer, Camouflage, Cold Blooded, Ghost, Assassin, Off the Grid, Low Profile or even simply shooting the UAV down will hide you from this sort of detection.\n• As well, these maps can be defeated by using suppressed weapons - firing one wouldn't have you show up on enemy radar.\n• In Modern Warfare 2, a Counter-UAV will completely disable enemy radar - it replaces the map, friendly positions, and enemy positions with static.\n• The Scrambler perk also makes enemy radar more static-filled the closer to enemy personnel you get. Unfortunately, this can also act as an early-warning system to said enemies.\n• Modern Warfare 2 and 3 also have heartbeat sensors available for certain weapons - and these can, for some reason, distinguish between friendly and enemy heartbeats. However, these can also be defeated by the 'Ninja' perk, which makes you invisible to such sensors.\n• Finally, all enemy electronics can be disabled by using an EMP, which makes the only method of detection the Mark One Eyeball. Oddly enough, this only affects the enemy team - not yours. This is, however, averted in Hardcore mode where an EMP will disable all electronics.\n• Catacomb Abyss and its sequels have you collect crystals throughout the game; each crystal allows you to see one specific type of enemy on your crystal ball (like a radar, it shows enemies at some distance all around you, though it isn't an automap)\n• Command & Conquer: Renegade had a radar that shown the position of enemies, and was jammed by enemy communications centers. In multiplayer mode, it only showed allies (in the default settings, anyway).\n• Counter-Strike has one of these.\n• The top-down automaps in Doom and Doom II allow you to see enemies (and other objects) with the proper cheat codes on.\n• Strife, another Doom-engine game, adds this function as an item as well. Unfortunately you have to use it on a level filled out by an automap powerup, and only a few levels in Strife have map pickups.\n• In Far Cry the player character finds a set of binoculars near the beginning of the game which allows him to isolate the tracking beacons of targetted enemies, putting them on the radar. So, once the enemies have been spotted once, they show up on the radar. This returns in Far Cry 3, Blood Dragon and 4 by way of marking enemies through your camera or cyber-eye depending on the game.\n• The video game adaptation of GoldenEye has one, explained as the function of one of Bond's gadgets. Spiritual Successor series Perfect Dark also has one.\n• Oddly enough you had to unlock a cheat code to turn the radar off. The most common reason for bothering unlocking this cheat was when you had a friend who was so good at the game in multiplayer you had to do something to make things harder for them to hunt everyone down.\n• In Guns of Icarus, this feature is absolutely vital for tracking the position of enemies, since your vision will be obscured by clouds and weather conditions, and you'll be attacked from all sides—enemies will retreat out of your vision range and circle around to the other side of your ship—so if you don't watch the radar, expect to die.\n• Halo puts one on the player's HUD in both single-player and multiplayer modes. The one in Halo 4 can even indicate vehicle type (e.g. if an enemy is driving a Wraith, they'll appear in the shape of a Wraith on your motion tracker). That said, the tracker can be foiled by either crouch-walking or just moving really slowly.\n• MAG has different uniforms for different factions, but allied players always show up as blue on the minimap and enemy players show up as red. This has led to expressions like \"hey blue dot, heal me\" and \"fighting some red dot when...\"\n• The Alien one was dutifully cloned by Marathon's motion tracker, and has since followed Bungie through the Halo series as well. In Marathon humans and defense drones appear as green squares, aliens as red triangles, and hostile players during net play as yellow squares.\n• We have recently sensors that can detect someone's heartbeat and therefore determine how many people are in a vehicle, room, etc. Assuming that your enemies have different heartbeats than humans, this technology probably will be used in the sensors of the future.\n• The HUD minimap in Nitemare 3D has an optional overlay that shows enemies in red.\n• No One Lives Forever nicely made a gameplay element out of it: your radar doesn't show nearby enemies... unless you shoot them with a \"tracking dart\" (which takes some skill), after which they appear as red dots on it.\n• In PlanetSide 2, your map will report the position of enemies firing non-silenced weapons. Spotting an enemy tags them on radar, allowing all your allies to see real-time aim and position tracking on their map for a few seconds. Devices like Scout Radar on vehicles, and the infiltrator's Motion Spotter and Recon Darts allow you to expand radar capability.\n• The Heartbeat Sensor in the Rainbow Six series functions like this.\n• Red Faction: Guerilla has an in-built radar that shows enemy vehicles. You can purchase an upgrade later on that allows you to see the location of enemy soldiers, too.\n• Sensory Overload has the hidden Radar Display Chip, along with the Proximity Detector which beeps when enemies are nearby, and the Trap Detector which shows trap triggers on the radar. One of the McNinja enemies has an Invisibility Cloak that also prevents radar detection.\n• Stalker's HUD is partly related to the lead character's PDA, which includes a map that marks the locations of other PDA-users and identifies whether they are friendly, hostile, or dead. However, enemies can \"cloak\" themselves, only appearing on the map when you can see them.\n• Time Shift: Your radar can detect enemies (Red), allies (Green) and usable vehicles (Yellow). It also helpfully tells you if they are above, below or on the same level as you.\n• No More Heroes requires you to earn the \"Memory of White\", a minimap with the enemies in purple and the treasures in yellow, by collecting Lovikov balls. Desperate Struggle averts the Bag of Spilling by letting Travis keep it.\n• All of the Warriors series (Dynasty Warriors, Samurai Warriors, Warriors Orochi, the Gundam spinoff) has an overworld map that colors allied units blue, enemies red, and other factions yellow.\n• Final Fantasy XI possesses two radar systems. The first can be used by all the classes in the game and is part of the normal HUD, but actual targets you can attack will only show up if you have the Beastmaster, Ninja, Thief, Ranger, Summoner, or Blue Mage jobs either as your main or subjob. Beastmasters and Rangers(and anyone who subs them) can use Wide Scan, which essentially uses the map of the area as a radar for NPCs and monsters. You can even select one to \"track\", which allows you to hunt it down by pointing towards it on the normal radar.\n• Kingdom of Loathing has a radar function in the Meteoid subgame. It doesn't begin detecting enemies until it's been upgraded, though.\n• Downplayed in PlanetSide 2. Enemies do show up on the minimap, but not magically - another player has to see them and \"spot\" them. Being spotted lasts a few seconds; an attentive spot can ruin an ambush or win a rematch. The infiltrator, with its unique ability to cloak, is the only class that can shed being spotted at will. Infiltrators, however, also carry motion detectors that play this trope straight for a limited time. They in turn can be countered by standing still, equipping the Sensor Shield implant, or shooting/EM Ping the deployed motion detector.\n• The Divine Herald from Nexus Clash can detect when there are demons in the area. Unlike some examples of this trope, the Herald can only find out how many demons are nearby this way and not quite exactly where they are, and it may take a few pings of the radar to triangulate the location of their target.\n• The Hunter class in World of Warcraft has a feature that allows you to see all of one type of mob within the range of your minimap.\n• This was previously limited to only tracking one type of thing at a time, which was fairly useless if the Hunter was also a miner and didn't want to miss out on collecting shiny rocks. Currently, the number of things that can be simultaneously tracked is limited only by the player's ability to sort through all of the dots.\n• Paladins can track undead, warlocks can track demons, and druids in cat form can track humanoids.\n• And herbalists can track plants, and miners can track rocks....\n• Many Real-Time Strategy games have a mini-map that shows enemy buildings and troops once the Fog of War has been lifted.\n• Total Annihilation even made a distinction between \"radar\" and \"visual range\". Radar buildings and units have a large radius and will show incoming enemy units as dots on the minimap, but don't uncover Fog of War.\n• StarCraft II has the Terran sensor tower, which shows enemies beyond visual range as a red exclamation mark symbol. In a twist, it also tells opponents where your tower's detection radius is.\n• Jim Raynor has one built into his armor.\n• In the side-scrolling Real-Time Strategy Armor Alley, your radar displays everything on the length of the battlefield...unless your Hero Unit strays near an enemy signal-jamming van, which will cause the radar display to flicker blank.\n• In Company of Heroes, the British can use such a special ability, when choosing the Royal Commandos Commander Tree (the Brits actually invented Radar in real WW2). You'll receive 3 Radar positions, which you can place randomly on the quadrangular map. This forms a triange between the three stations (see Bermuda Triangle), a Fog of War - free zone, where you can spot any enemy movments. This method can only supervise up to 50% of the map though (a triangle may fit twice into a quadrangle - Duh!), so you better concentrate all your scouts on the other halve...\n• Dune II had the Outpost building, which gave you a radar screen that tracked your enemies (including Sand Worms).\n• In the original Command & Conquer games, you didn't have a minimap unless you built a Radar Dome, which would then show off the entire map (though areas covered by the shroud would appear as black space). Additionally, the later games added ways of detecting stealth units (typically, light vehicles might have sensors which would revealed their location, meaning that players would be well advised to keep a few stealth detecting units around to avoid being ambushed).\n• Though there were a few missions in the series that gave you the minimap even without a Communications Center (though those missions usually were the ones before you could build a Comm. Center, or those with no base at all).\n• Command & Conquer: Generals: The USA can use a satellite scan (and have radar access) right off the bat as long as they have Command Centers, an ability that can eventually be researched by the GLA for their Radar Vans. The Chinese don't get it, instead having to rely on the detection capabilities of their troop crawlers.\n• The Ace Combat series has a radar system that varies a little between games. In some games, the color of a target indicates either its point value (Ace Combat 04: Shattered Skies) or whether it's critical to the mission (Ace Combat Zero: The Belkan War), in others it indicates its current health (Ace Combat 5: The Unsung War). Stealth planes generally fade in and out, making it difficult to keep track of them, and aircraft equipped with ECM systems would block portions of the radar or display false targets when close by.\n• Escape Velocity has a radar screen. Buying an IFF Decoder will give it colors: non-hostile ships are blue, enemy ships are red, disabled ships are gray, launched fighters and mission escorts are green.\n• In the MechWarrior series, radar is a staple of practically every game and is extremely useful in tracking enemies and their damage. 2 and 3 offered the 'satellite uplink' mode, which was more like a bird's eye view of the field. Each game has had some kind of mission restriction or equipment to enhance or mess with the radar, including lots of false-positive decoy pods, electronic jammers, and range enhancing probes.\n• The Naval Ops series uses this trope quite heavily since trying to spot enemy ships visually is a bit of a pain. Upgrading your ship increases the radar range. Sonar is required to spot submarines. You have a minimap radar in one corner of the screen and a close-range radar as part of your HUD. Stealth enemies may not show up on the minimap, but they'll appear on the HUD.\n• The X-Universe series has a Gravidar device fitted onto every ship and spacesuit, which can detect anything (bar Space Mines) within its detection radius, which can be expanded with the Duplex or Triplex scanner. Gravidar is shared between ships and satellites, allowing a satellite to be used as a Target Spotter for a missile frigate.\n• The Gravidar returns in X Rebirth's 2.0 update with some nifty new features - capital ships and stations are now rendered as 3d objects on the gravidar display, and the highway system is likewise shown on the gravidar. Entering a highway will switch the gravidar to a sector-wide highway map, or a tunnel map showing nearby ships in the highway.\n• X-Wing and its sequels (TIE Fighter, X Wing Vs TIE Fighter, and X-Wing Alliance) all featured sensor displays showing any ships nearby using color-coded dots: red for Imperial, green for Rebel, and blue for neutral (or unaligned). Later games added additional colors to represent pirates or otherwise distinguish between multiple unaligned factions.\n• A staple of Metal Gear games;\n• Metal Gear 2: Solid Snake was the first to use a radar, allowing the player to see enemies on the surrounding screens. It showed both the guards positions and their vision cones to indicate when you could be seen.\n• Metal Gear Solid and Metal Gear Solid 2: Sons of Liberty both used Soliton radar, which had been invented by Mei Ling. Apparently \"It employs the KdV equation to detect the electromagnetic waves resulting from biological reactions.\" It could detect when people yawned, when they closed their eyes, which way they were looking, and how far they could see. Triggering an alarm would result in the radar being jammed, as would using chaff grenades, and the radar wouldn't work in enclosed spaces.\n• As a prequel, Metal Gear Solid 3: Snake Eater didn't feature the radar, as it was set before it was invented (and many argued that the radar made the stealth too easy). There were a number of more primitive alternatives that could be found through the game, all of which needed battery power. The Motion Sensor would only show moving guards and animals, so a stationary guard wouldn't be shown. The Sonar would indicate everything, but had to be manually triggered and the 'ping' could alert guards. The AP sensor would vibrate when guards were near.\n• Metal Gear Solid: Portable Ops had a Surround Indicator that would mark the direction and proximity of guards according to how much noise they made, as well as how noisy the player was.\n• Metal Gear Solid: Peace Walker did not feature one traditionally, being set just 10 years after Snake Eater. However, you can acquire specs to build your own battery-powered Soliton Radar, continuity be damned, which functions identically to its appearance in previous games. Unfortunately, the battery consumption means that it's all but Awesome, but Impractical until the very last upgrade, whereupon it stops consuming battery.\n• Metal Gear Solid 4: Guns of the Patriots used a similar Threat Ring, this time surrounding the player in 3D when they crouched rather than in a radar screen. The Solid Eye also gives a radar when worn that worked similarly, which showed the position of the player and nearby characters, as well as a second circle around the player that expands or shrinks to indicate how large of a presence they're making themselves through sound and the like - running full-tilt would nearly fill the radar screen, while laying down and blending in with OctoCamo would make the circle only just barely larger than the one indicating their position. The camo index (indicating how effective your camouflage is against your current background) was also worked into the Solid Eye's radar, and would turn blue or red if you're currently harder or easier to notice amidst things like gunfire and mortar shells exploding nearby.\n• The Alien vs. Predator motion detector is of course from the original Alien movie, and as a result is in absolutely every game based on the franchise, too.\n• And, unlike many such systems, the readout only shows movement in an arc in front of you. That means you don't see what's behind you, you don't see enemies who are standing still, and anything moving will set it off including elevators and loading hooks swaying in the wind.\n• The Alien: Isolation radar (pictured) can detect any moving thing in front of you, be it human, droid, or alien. It also has lights to tell you if something is to your side or behind you, but not how far away it is. However, it cannot tell you if it's on the same level as you, and the beeping might alert other things to your presence.\n• Enemy Zero. Picture this: you're on a spaceship out in the middle of nowhere, and a bunch of nasty aliens have come aboard and murdered everyone save you and a few others. Problem is, the aliens are completely invisible, and you get to roam the corridors of the ship, completely unable to see them. Your only way of knowing they're around is a sonar-ish device that starts pulsing louder and faster depending on how close the aliens are, all of which is absolutely nerve-wracking. The slightest peep will have you spooked, to say nothing when the aliens can be heard growling close by. Bring My Brown Pants, please.\n• Fatal Frame has two: the Camera Obscura's filament, and the main character's heartbeat. The filament glows when a ghost is nearby, and glows brighter if you're facing the ghost and/or getting closer to it. The character's heartbeat also speeds up the closer a ghost is. This is quite handy, because it is a common situation that ghost can be near you and you can't see it, either because it's in a wall or it's invisible at the time.\n• The NES game Jaws includes a radar (unlockable with some seashells) to detect the proximity of the shark.\n• The \"Jaws: The Ride\" minigame in Universal Studios Theme Park Adventure has this as a mechanic to tell you where he is in relation to the Orca. Even in \"Hard\" mode he gives you enough time to grab a barrel and head towards that section of the boat.\n• The radio in Silent Hill serves as an audio version, emitting ominous-sounding static whenever a monster is lurking nearby, but all it ends up doing is provide Paranoia Fuel since it doesn't tell you how far away said monster is or how many there are. The Variable Mix ambient music/noise also behaves similarly, which may be why they got rid of the radio altogether in the fourth game (except for the one in your room so you can check if it's haunted .\n• Freddy Fazbear's Pizzeria Simulator, unlike the other games in the franchise, only had motion sensors instead of cameras serving as this to monitor the killer animatronics, presumably because you're just starting out with your pizzeria and can't afford the cameras. Really, though, it's to hide that the 'pizzeria' is a Closed Circle trap for said killer animatronics so they can be destroyed once and for all in the Twist Ending\n• Armored Core has this in almost every game, often color coded, but in a bit of a different way; The colors of enemies on radar change depending on their vertical alignment with you (blue for higher, yellow for lower). Starting with Armored Core 4, this system is abolished in favor of a 3D radar, but target enemies show up in red while everything else is white.\n• Noteworthy in that the radar actually has a scan interval between updates. Equipping a rapid-scan radar makes it a lot easier to perform a High-Speed Missile Dodge, since you can trace the missile trajectories even when they circle behind you, but very often there's a tradeoff between fast scan times and longer radar ranges.\n• The 3D Grand Theft Auto games has a minimap (sometimes called a radar) in-game. At times, it will show a mission objective or a moving enemy.\n• The Freelance Astronauts made fun of this in their Let's Play of ''Grand Theft Auto: Vice City, coming to the conclusion that most missions involve \"Killing the pink dot on the radar.\"\n• You don't have this in radar form, but the map of the area you get in every mission in the Hitman games is insanely accurate, even displaying which way doors open, where the fusebox is, and tracking the movement of every person on the premises, Agent 47 included.\n• On the higher difficulty levels, details are removed. On the hardest level, only 47 himself is shown on the map, making the \"look through keyhole\" action quite handy.\n• Mafia despite being set in the 1930s before World War II and the invention of Radar had one for detecting vehicles in the top left of the screen that showed civilian cars as white, Police as blue and enemies as red blips.\n• The video game adaptation of Rogue Trooper shows enemies on a radar at the bottom-left, available as long he is wearing Helm. It doesn't stop enemies from ambushing Rogue when he fires upon the hologram of the traitor general.\n• A staple of the \"All Range Mode\" in Star Fox.\n• Warframe has this by default for your frames, though it is rather short-range. Ivara's passive grants her increased range by default, and of course there are mods, both for your Frame and Companion / Sentinel that increase its range.\n• Long-range scanners in the Star Trek Text Game, possibly the Ur-Example from 1971.\n• X-COM\n• The classic MicroProse series uses two types:\n• On the geoscape, bases need radar arrays (or sonar in the case of Terror From the Deep) to locate UFOs. These come in three sizes with increasing range, and the most advanced type will give detailed information on alien craft and their missions.\n• On the battlescape, troopers can carry a Motion Scanner (Particle Disturbance Sensor in Terror From the Deep) that will detect units that have moved since the player's last turn, even through walls. However, it doesn't differentiate between friend or foe, has a VERY basic display (for instance, a large contact can be either a large unit or a small unit moving quickly), and is rather short range.\n• The Firaxis reboot has three:\n• The stand-ins for the old base radar arrays are satellites that can be deployed over the Council countries. They detect UFOs flying over the covered countries, guarantee funding from said countries and are critical to controlling nation-wide panic in three ways: 1) launching a satellite immediately reduces the panic level by two points out of five, 2) at the end of each month they have a chance to reduce panic by one point, and the chance increases the higher the panic level is, and 3) they preclude the Sadistic Choice that is the \"Alien Abductions\" mission, where you can only help one country out of three. The flipside to these advantages are that satellites take 20 full days to build until very late in the game after you research Advanced Construction in the Foundry, you can spend double the money to halve the time to 10 days , require Satellite Uplink or Nexus installations to manage the feeds, and if you ignore a UFO for whatever reason, they can be shot down by a following contact (and instantly raise the country's panic to the breaking point).\n• The Battle Scanner is a round camera-like device that can be thrown like a grenade, and reveals a section of the Fog of War without alarming the enemies it sees; it also blows the cover on invisible , disguised or concealed Spectres and the Chosen Assassin in XCOM 2 s War of the Chosen Expansion Pack enemies within its area of effect but does not affect the invisibility or concealment of the soldier that deploys it. In XCOM: Enemy Unknown it's normally a Sniper-exclusive Lieutenant skill any soldier can get it at any rank with the ability-shuffling \"Training Roulette\" Second Wave option introduced in Enemy Within and has two \"charges\" per mission, while in XCOM 2 it's a regular item with only one \"charge\" developed after performing an autopsy on an ADVENT Trooper.\n• In XCOM 2, Specialists at Sergeant rank or above have access to Scanning Protocol, a skill where they use their GREMLIN to increase their sight radius and reveal disguised or concealed enemy units. It only lasts one turn, though.\n• In both continuities, the Hyperwave Relay is a base structure that complements the radar surveillance with info on the UFO's mission and the species on board.\n• Dragon Age: Origins has a Survival skill, and as you gain levels in it, more detail about enemies and higher level enemies will show up. The sequel had all enemies visible on the minimap, but only after you encounter them.\n• Available in The Elder Scrolls III: Morrowind and The Elder Scrolls IV: Oblivion although both required a spell to have the monsters show up. Also available were magic detection (which showed magical items) and key detection (presumably the result of a mage losing his tower key once too often).\n• The Elder Scrolls V: Skyrim has two spells, Detect Living and Detect Dead, which do what they sound like, letting you determine where people are located. The latter is a must-have for draugr ruins to spot where those sneaky undead might be hiding. There's also a Dragon Shout called Aura Whisper that detects everything that can move, living or undead, and has a very wide range and fast cooldown. Once you've got Aura Whisper, you will never fall into an ambush again.\n• The PIPBoy has a motion tracker option in Fallout & Fallout 2, which will display all living entities on the minimap scanner when it's switched on.\n• In Fallout 3, enemies are shown on your compass as red ticks, with the range governed by your Perception stat.\n• Fallout: New Vegas's Lonesome Road DLC has areas where the high radiation levels interfere with your motion tracker.\n• Mass Effect features both Enemy Detecting Radar and Radar-Jamming Enemies, specifically geth. But the geth radar-jamming is more of a nuisance than anything else: its range is short enough that they only jam you when they're about to attack (meaning they can't really ambush an attentive player), and their flashlight heads are kind of a giveaway as to their location, even in thick fog.\n• Might and Magic 6 introduced the \"new and improved\" automap, which, when combined with the first Air magic spell \"Wizard Eye\", functioned as an Life Detecting Radar - Green is Neutral, Red is Hostile, Blue is Loose Item, and Yellow is Lootable Body.\n• Strictly speaking Blue is 'Point of Interest'. Most of the time that either means a chest or a loose item. Sometimes it is a map-object you can interact with (a fountain that regenerates health, a floor that moves, etc).\n• Neverwinter Nights 2 has the Track ability, which pinpoints enemies on the minimap at a distance dependent on your Survival skill. You can toggle it on at the cost of movement speed, or you can take the Improved Tracking feat (free to rangers), which changes it to always-on and allows you to move at full speed.\n• Available in TerraTech as actual radar blocks which can be fitted onto the player's tech. A radar allows enemies to show up on the minimap as red targeting reticules.\n• One of the most famous occurrences of this is the motion tracker from Aliens, used by the Colonial Marines both to look for survivors of Hadley's Hope and hunt for the titular Xenomorphs. However, it doesn't discriminate between friend and foe, as shown when the very first thing detected was some hamsters in their habitat; Newt is nearly shot when her appearance on the tracker prompts the Marines to prep their weapons.\n• Utterly averted in The Giant Behemoth, because (for some reason) the Paleosaurus is invisible to radar.\n• Code Red: the Rubicon Conspiracy has a tracking device which initially is being used to track the remaining survivor, but then inexplicably also tracks both types of aliens.\n• Harry Potter has both the Marauder's Map (a real-time map of people and where they are on school grounds) and the Sneakoscope. Though the Sneakoscope only indicates if someone nearby is untrustworthy, whether it's due to a little prank they're playing or something much more serious, with no distinction between the two.\n• Krokodil Teares. Smug Californian Op Bronson Manolo's mobile command centre has a readout showing him exactly how many living people there are in the town of Dead Rat with enemies in red and friendlies in blue.\n• In the Star Wolf series by David Gerrold, due to the distances involved in a space battle no-one ever sees their opponent. In fact the first novel originally ends with the main character discovering that the enemy spacecraft they've been chasing the entire novel is just a sensor glitch (Gerrold later expanded the novel and had this just be an enemy ploy).\n• \"Locate the Joker\" in Stern Pinball's Batman shows Batman using a hand-held sensor to track the Joker as he runs around.\n• As mentioned above, this is Truth in Television: There is also a widely-used military system called a Radar Warning Receiver, which (in many, but not all cases) identifies the type of radar emissions (i.e. SPY-1, \"High Lark\", Agave) and can determine the likely threat of them. A general hint — a repeating tone indicates that an enemy radar emitter has locked on to you and may be getting ready to fire.\n• Want a real life Motion tracker? The closest you'll get in the civilian market is the T-Cube sensor. 500 metre maximum range, with an SOS function, encryption and real time motion detection, the only catch is that you can only see friendlies on your screen. And that it's $500 for two. Take a look.\n• Aircraft have something referred to as \"IFF\", the Identification Friend-or-Foe system. By transmitting certain signals, aircraft can be identified as \"friendly\", \"hostile\", \"civilian/neutral\" or \"unknown\". This is a way that pilots can quickly identify which aircraft belong to their allies to avoid blowing them out of the sky.\n• In most if not all Dungeons & Dragons game mechanics (and probably a lot of Tabletop RPGs in general) there are spells to detect the presence, location, and relative strength of a variety of creatures, usually in the form of Detect [Alignment], for creatures matching a particular type of alignment, and Detect Magic, for magical creatures and items.\n• Warhammer 40K has the auspex, a handheld or helmet-mounted scanner that can usually detect enemies. Unfortunately (in addition to all the problems with Imperial tech, against the tyranids it sometimes fails due to being calibrated for one species or the other and not hybrids, and sometimes because the 'nids know to stay just out of auspex range when building up their forces for a Zerg Rush.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/EnemyDetectingRadar", "media_links": ["/pmwiki/pmwiki.php/VideoGame/AlienIsolation", "/pmwiki/pmwiki.php/VideoGame/MetalGearSolid", "/pmwiki/pmwiki.php/VideoGame/Bully", "/pmwiki/pmwiki.php/VideoGame/EccoTheDolphin", "/pmwiki/pmwiki.php/Franchise/TheLegendOfZelda", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaLinksAwakening", "/pmwiki/pmwiki.php/Franchise/Metroid", "/pmwiki/pmwiki.php/VideoGame/MetroidPrimeTrilogy", "/pmwiki/pmwiki.php/VideoGame/MetroidSamusReturns", "/pmwiki/pmwiki.php/VideoGame/MetroidIIReturnOfSamus", "/pmwiki/pmwiki.php/VideoGame/ProjectEden", "/pmwiki/pmwiki.php/Franchise/SpiderMan", "/pmwiki/pmwiki.php/VideoGame/Syndicate", "/pmwiki/pmwiki.php/VideoGame/Defender", "/pmwiki/pmwiki.php/VideoGame/ChopperCommand", "/pmwiki/pmwiki.php/VideoGame/StarWarsTheEmpireStrikesBackAtari2600", "/pmwiki/pmwiki.php/VideoGame/CosmicAvenger", "/pmwiki/pmwiki.php/VideoGame/The7thSaga", "/pmwiki/pmwiki.php/VideoGame/DarkCloud", "/pmwiki/pmwiki.php/VideoGame/DawnOfMana", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyXII", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyXI", "/pmwiki/pmwiki.php/VideoGame/MonsterHunter", "/pmwiki/pmwiki.php/VideoGame/OdinSphere", "/pmwiki/pmwiki.php/VideoGame/ParasiteEve2", "/pmwiki/pmwiki.php/VideoGame/Persona3", "/pmwiki/pmwiki.php/Franchise/Pokemon", "/pmwiki/pmwiki.php/VideoGame/StarOcean", "/pmwiki/pmwiki.php/VideoGame/ValkyriaChronicles", "/pmwiki/pmwiki.php/VideoGame/ValkyrieProfile2Silmeria", "/pmwiki/pmwiki.php/VideoGame/WildArms2", "/pmwiki/pmwiki.php/VideoGame/BattleZone1980", "/pmwiki/pmwiki.php/VideoGame/CallOfDuty", "/pmwiki/pmwiki.php/VideoGame/CallOfDutyBlackOps", "/pmwiki/pmwiki.php/VideoGame/CallOfDutyBlackOpsII", "/pmwiki/pmwiki.php/VideoGame/CallOfDutyBlackOpsIII", "/pmwiki/pmwiki.php/VideoGame/CallOfDutyBlackOps", "/pmwiki/pmwiki.php/VideoGame/CallOfDutyBlackOpsII", "/pmwiki/pmwiki.php/VideoGame/CallOfDutyBlackOpsIII", "/pmwiki/pmwiki.php/VideoGame/CallOfDutyInfiniteWarfare", "/pmwiki/pmwiki.php/VideoGame/CallOfDutyGhosts", "/pmwiki/pmwiki.php/VideoGame/CallOfDutyAdvancedWarfare", "/pmwiki/pmwiki.php/VideoGame/ModernWarfare", "/pmwiki/pmwiki.php/VideoGame/CatacombFantasyTrilogy", "/pmwiki/pmwiki.php/VideoGame/CommandAndConquerRenegade", "/pmwiki/pmwiki.php/VideoGame/CounterStrike", "/pmwiki/pmwiki.php/VideoGame/Doom", "/pmwiki/pmwiki.php/VideoGame/Doom", "/pmwiki/pmwiki.php/VideoGame/Strife", "/pmwiki/pmwiki.php/VideoGame/FarCry", "/pmwiki/pmwiki.php/VideoGame/FarCry3", "/pmwiki/pmwiki.php/VideoGame/FarCry3BloodDragon", "/pmwiki/pmwiki.php/VideoGame/FarCry4", "/pmwiki/pmwiki.php/VideoGame/GoldenEye1997", "/pmwiki/pmwiki.php/VideoGame/PerfectDark", "/pmwiki/pmwiki.php/VideoGame/GunsOfIcarus", "/pmwiki/pmwiki.php/Franchise/Halo", "/pmwiki/pmwiki.php/VideoGame/Halo4", "/pmwiki/pmwiki.php/VideoGame/MAG", "/pmwiki/pmwiki.php/VideoGame/Marathon", "/pmwiki/pmwiki.php/Franchise/Halo", "/pmwiki/pmwiki.php/VideoGame/Nitemare3D", "/pmwiki/pmwiki.php/VideoGame/NoOneLivesForever", "/pmwiki/pmwiki.php/VideoGame/RainbowSix", "/pmwiki/pmwiki.php/VideoGame/RedFaction", "/pmwiki/pmwiki.php/VideoGame/SensoryOverload", "/pmwiki/pmwiki.php/VideoGame/Stalker", "/pmwiki/pmwiki.php/VideoGame/TimeShift", "/pmwiki/pmwiki.php/VideoGame/NoMoreHeroes", "/pmwiki/pmwiki.php/VideoGame/DynastyWarriors", "/pmwiki/pmwiki.php/VideoGame/SamuraiWarriors", "/pmwiki/pmwiki.php/VideoGame/WarriorsOrochi", "/pmwiki/pmwiki.php/Franchise/Gundam", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyXI", "/pmwiki/pmwiki.php/VideoGame/KingdomOfLoathing", "/pmwiki/pmwiki.php/Franchise/Metroid", "/pmwiki/pmwiki.php/VideoGame/PlanetSide", "/pmwiki/pmwiki.php/VideoGame/NexusClash", "/pmwiki/pmwiki.php/VideoGame/WorldOfWarcraft", "/pmwiki/pmwiki.php/VideoGame/TotalAnnihilation", "/pmwiki/pmwiki.php/VideoGame/StarCraftII", "/pmwiki/pmwiki.php/VideoGame/ArmorAlley", "/pmwiki/pmwiki.php/VideoGame/CompanyOfHeroes", "/pmwiki/pmwiki.php/VideoGame/DuneII", "/pmwiki/pmwiki.php/VideoGame/CommandAndConquer", "/pmwiki/pmwiki.php/VideoGame/CommandAndConquerGenerals", "/pmwiki/pmwiki.php/VideoGame/AceCombat", "/pmwiki/pmwiki.php/VideoGame/AceCombat04ShatteredSkies", "/pmwiki/pmwiki.php/VideoGame/AceCombatZeroTheBelkanWar", "/pmwiki/pmwiki.php/VideoGame/AceCombat5TheUnsungWar", "/pmwiki/pmwiki.php/VideoGame/EscapeVelocity", "/pmwiki/pmwiki.php/VideoGame/MechWarrior", "/pmwiki/pmwiki.php/VideoGame/NavalOps", "/pmwiki/pmwiki.php/VideoGame/XWing", "/pmwiki/pmwiki.php/VideoGame/TIEFighter", "/pmwiki/pmwiki.php/VideoGame/XWingVsTIEFighter", "/pmwiki/pmwiki.php/VideoGame/XWingAlliance", "/pmwiki/pmwiki.php/VideoGame/MetalGear", "/pmwiki/pmwiki.php/VideoGame/MetalGear2SolidSnake", "/pmwiki/pmwiki.php/VideoGame/MetalGearSolid", "/pmwiki/pmwiki.php/VideoGame/MetalGearSolid2SonsOfLiberty", "/pmwiki/pmwiki.php/VideoGame/MetalGearSolid3SnakeEater", "/pmwiki/pmwiki.php/VideoGame/MetalGearSolidPortableOps", "/pmwiki/pmwiki.php/VideoGame/MetalGearSolidPeaceWalker", "/pmwiki/pmwiki.php/VideoGame/MetalGearSolid4GunsOfThePatriots", "/pmwiki/pmwiki.php/VideoGame/AlienVsPredator", "/pmwiki/pmwiki.php/Film/Alien", "/pmwiki/pmwiki.php/VideoGame/AlienIsolation", "/pmwiki/pmwiki.php/VideoGame/EnemyZero", "/pmwiki/pmwiki.php/VideoGame/FatalFrame", "/pmwiki/pmwiki.php/VideoGame/Jaws", "/pmwiki/pmwiki.php/Franchise/SilentHill", "/pmwiki/pmwiki.php/VideoGame/FreddyFazbearsPizzeriaSimulator", "/pmwiki/pmwiki.php/VideoGame/ArmoredCore", "/pmwiki/pmwiki.php/VideoGame/GrandTheftAuto", "/pmwiki/pmwiki.php/VideoGame/GrandTheftAutoViceCity", "/pmwiki/pmwiki.php/VideoGame/Hitman", "/pmwiki/pmwiki.php/VideoGame/Mafia", "/pmwiki/pmwiki.php/VideoGame/RogueTrooper", "/pmwiki/pmwiki.php/VideoGame/StarFox", "/pmwiki/pmwiki.php/VideoGame/Warframe", "/pmwiki/pmwiki.php/VideoGame/StarTrekTextGame", "/pmwiki/pmwiki.php/VideoGame/XCom", "/pmwiki/pmwiki.php/Creator/MicroProse", "/pmwiki/pmwiki.php/VideoGame/XCOMTerrorFromTheDeep", "/pmwiki/pmwiki.php/Creator/Firaxis", "/pmwiki/pmwiki.php/VideoGame/XCOMEnemyUnknown", "/pmwiki/pmwiki.php/VideoGame/XCOM2", "/pmwiki/pmwiki.php/VideoGame/XCOM2", "/pmwiki/pmwiki.php/VideoGame/XCOMEnemyUnknown", "/pmwiki/pmwiki.php/VideoGame/XCOM2", "/pmwiki/pmwiki.php/VideoGame/XCOM2", "/pmwiki/pmwiki.php/VideoGame/DragonAgeOrigins", "/pmwiki/pmwiki.php/VideoGame/DragonAgeII", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsIIIMorrowind", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsIVOblivion", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsVSkyrim", "/pmwiki/pmwiki.php/VideoGame/Fallout1", "/pmwiki/pmwiki.php/VideoGame/Fallout2", "/pmwiki/pmwiki.php/VideoGame/Fallout3", "/pmwiki/pmwiki.php/VideoGame/FalloutNewVegas", "/pmwiki/pmwiki.php/Franchise/MassEffect", "/pmwiki/pmwiki.php/VideoGame/MightAndMagic", "/pmwiki/pmwiki.php/VideoGame/NeverwinterNights2", "/pmwiki/pmwiki.php/VideoGame/TerraTech", "/pmwiki/pmwiki.php/Film/Aliens", "/pmwiki/pmwiki.php/Film/TheGiantBehemoth", "/pmwiki/pmwiki.php/Film/CodeRedTheRubiconConspiracy", "/pmwiki/pmwiki.php/Literature/HarryPotter", "/pmwiki/pmwiki.php/Literature/DarkFuture", "/pmwiki/pmwiki.php/Creator/SternPinball", "/pmwiki/pmwiki.php/TabletopGame/DungeonsAndDragons", "/pmwiki/pmwiki.php/TabletopGame/Warhammer40K"], "non_media_links": ["/pmwiki/pmwiki.php/Main/OhCrap", "/pmwiki/pmwiki.php/Main/ThisIsGoingToSuck", "/pmwiki/pmwiki.php/Main/Handwave", "/pmwiki/pmwiki.php/Main/AWizardDidIt", "/pmwiki/pmwiki.php/Main/GameplayAndStorySegregation", "/pmwiki/pmwiki.php/Main/AcceptableBreaksFromReality", "http://en.wikipedia.org/wiki/Cocktail_party_effect", "/pmwiki/pmwiki.php/Main/ColorCodedArmies", "/pmwiki/pmwiki.php/Main/ColourCodedForYourConvenience", "/pmwiki/pmwiki.php/Main/FogOfWar", "/pmwiki/pmwiki.php/Main/LevelMapDisplay", "/pmwiki/pmwiki.php/Main/DetectEvil", "/pmwiki/pmwiki.php/Main/AuraVision", "/pmwiki/pmwiki.php/Main/EnemyScan", "/pmwiki/pmwiki.php/Main/ActionAdventure", "/pmwiki/pmwiki.php/Main/SpiderSense", "/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/UsefulNotes/ArcadeGame", "/pmwiki/pmwiki.php/Main/EasternRPG", "/pmwiki/pmwiki.php/Main/ColorCodedForYourConvenience", "/pmwiki/pmwiki.php/Main/RagdollPhysics", "/pmwiki/pmwiki.php/Main/ScrappyLevel", "/pmwiki/pmwiki.php/Main/FirstPersonShooter", "/pmwiki/pmwiki.php/Main/OlderThanTheyThink", "/pmwiki/pmwiki.php/Videogame/BattleZone1998", "/pmwiki/pmwiki.php/UsefulNotes/WorldWarII", "/pmwiki/pmwiki.php/Main/SpiritualSuccessor", "/pmwiki/pmwiki.php/Main/HUD", "/pmwiki/pmwiki.php/Videogame/PlanetSide", "/pmwiki/pmwiki.php/Main/McNinja", "/pmwiki/pmwiki.php/Main/InvisibilityCloak", "/pmwiki/pmwiki.php/Main/HackAndSlash", "/pmwiki/pmwiki.php/Main/BagOfSpilling", "/pmwiki/pmwiki.php/Main/ColorCodedForYourConvenience", "/pmwiki/pmwiki.php/Main/MassivelyMultiplayerOnlineRolePlayingGame", "/pmwiki/pmwiki.php/Main/EMPing", "/pmwiki/pmwiki.php/Main/OurAngelsAreDifferent", "/pmwiki/pmwiki.php/Main/RealTimeStrategy", "/pmwiki/pmwiki.php/Main/RealTimeStrategy", "/pmwiki/pmwiki.php/Main/FogOfWar", "/pmwiki/pmwiki.php/Main/FogOfWar", "/pmwiki/pmwiki.php/Main/SideView", "/pmwiki/pmwiki.php/Main/RealTimeStrategy", "/pmwiki/pmwiki.php/Main/HeroUnit", "/pmwiki/pmwiki.php/UsefulNotes/WW2", "/pmwiki/pmwiki.php/Main/BermudaTriangle", "/pmwiki/pmwiki.php/Main/FogOfWar", "/pmwiki/pmwiki.php/Main/SandWorms", "/pmwiki/pmwiki.php/Main/SimulationGame", "/pmwiki/pmwiki.php/Videogame/X", "/pmwiki/pmwiki.php/Main/SpaceMines", "/pmwiki/pmwiki.php/Main/TargetSpotter", "/pmwiki/pmwiki.php/Main/MacrossMissileMassacre", "/pmwiki/pmwiki.php/Videogame/XRebirth", "/pmwiki/pmwiki.php/Main/PortalNetwork", "/pmwiki/pmwiki.php/Main/StealthBasedGame", "/pmwiki/pmwiki.php/Main/TechnoBabble", "/pmwiki/pmwiki.php/Main/AnachronismStew", "/pmwiki/pmwiki.php/Main/AwesomeButImpractical", "/pmwiki/pmwiki.php/Main/SurvivalHorror", "/pmwiki/pmwiki.php/Main/BringMyBrownPants", "/pmwiki/pmwiki.php/Main/UniversalStudiosThemeParkAdventure", "/pmwiki/pmwiki.php/Main/ParanoiaFuel", "/pmwiki/pmwiki.php/Main/VariableMix", "/pmwiki/pmwiki.php/Main/ClosedCircle", "/pmwiki/pmwiki.php/Main/TwistEnding", "/pmwiki/pmwiki.php/Main/ThirdPersonShooter", "/pmwiki/pmwiki.php/Main/ColorCodedForYourConvenience", "/pmwiki/pmwiki.php/Main/HighSpeedMissileDodge", "/pmwiki/pmwiki.php/LetsPlay/FreelanceAstronauts", "/pmwiki/pmwiki.php/Main/LetsPlay", "/pmwiki/pmwiki.php/UsefulNotes/WorldWarII", "/pmwiki/pmwiki.php/Main/TurnBasedStrategy", "/pmwiki/pmwiki.php/Main/UrExample", "/pmwiki/pmwiki.php/Main/SadisticChoice", "/pmwiki/pmwiki.php/Main/FogOfWar", "/pmwiki/pmwiki.php/Main/ExpansionPack", "/pmwiki/pmwiki.php/Main/ExpansionPack", "/pmwiki/pmwiki.php/Main/WesternRPG", "/pmwiki/pmwiki.php/Main/MundaneUtility", "/pmwiki/pmwiki.php/Main/MakeMeWannaShout", "/pmwiki/pmwiki.php/Main/InterfaceScrew", "/pmwiki/pmwiki.php/Main/WideOpenSandbox", "/pmwiki/pmwiki.php/Main/ColorCodedForYourConvenience", "/pmwiki/pmwiki.php/Main/Pinball", "/pmwiki/pmwiki.php/Pinball/BatmanStern", "/pmwiki/pmwiki.php/Main/TruthInTelevision", "/pmwiki/pmwiki.php/Main/SensorSuspense", "http://www.redwolfairsoft.com/redwolf/airsoft/Combat_Gear_Electronic_Positioning_Devices_T_Cube_Motion_Tracker_Unit_Dual_Pack.htm", "/pmwiki/pmwiki.php/Main/TabletopGames", "/pmwiki/pmwiki.php/Main/PercussiveMaintenance", "/pmwiki/pmwiki.php/Main/ZergRush"]}