{"title": "Post-Injury Desk Job", "content": "After a Career-Ending Injury (in the line of duty or otherwise), someone is reassigned to an administrative position. If the injury is serious and permanent, the reassignment can be permanent as well; otherwise, the reassignment will last as long as it takes for the injury to heal. Usually, the injury has to be fairly serious, with a lengthy recovery time, in order to justify such a reassignment. In terms of severity it typically takes at least a broken bone to cause this reassignment. Anything less severe or with a shorter recovery time would probably result in the individual being placed on convalescent leave for the duration of their illness or injury. On the other hand, a more severe injury, or one that causes brain damage, may result in them being permanently discharged.\n\nUsually, this trope applies to those in the military, police, or firefighters; however, this could apply to other physically demanding or dangerous occupations, such as construction, logging or mining, or athletes.\n\nIt's worth noting that many of the tropes related to Desk Jockey and Soldiers at the Rear do not apply here; frontline soldiers often treat those who got a desk job as a result of an injury with a great deal of respect, as their wounds prove that they have served at the front themselves, and also serve as a sobering reminder of what can happen to them.\n• In My Hero Academia, Ragdoll goes from an active hero to someone who supports her team with desk work after she loses her Quirk to All for One.\n• In Judge Dredd, judges injured in the line of duty who cannot recover sufficiently to meet the requirements of continuing as a street judge are often reassigned to administrative roles elsewhere in the Justice Department or become instructors at the Academy of Law. In the story arc \"The Day the Law Died\" Dredd recruits several of them to aid in his rebellion against the insane Judge Cal as they have not been affected by the brainwashing the street judges were subjected to via subliminal messages in their daily briefing tapes.\n• Bend It Like Beckham has the sports-related version of this; Joe can no longer play soccer due to a knee injury, but now works as a coach.\n• The Blue Max provides the page quote; Kettering is the squadron adjutant, and throughout the film he walks with a pronounced limp. Stachel is sent to Berlin while recovering from being shot down, although his time in Berlin is more of a publicity tour.\n• Starship Troopers has a soldier missing both legs and with a prosthetic arm processing the recruits' enlistment papers.\n• Crops up fairly frequently in Tom Clancy's works.\n• At the beginning of Red Storm Rising, USMC Colonel Chuck Lowe has a desk job in intelligence after he broke his leg while skiing.\n• In Patriot Games, this is how Jack Ryan met his Black Best Friend Robbie Jackson; Jackson, a naval aviator, broke his leg when his airplane's ejector seat spontaneously activated due to a faulty circuit, and was given a job teaching at the Annapolis Naval Academy (where Ryan worked) while the injuries healed. Ryan was himself a former Marine officer, but his injuries from a helicopter crash were so severe that he was invalided out of the service entirely.\n• The Hunt for Red October has Commander Quentin, a former destroyer officer, manning a sonar listening post while he's recovering from chemotherapy, and \"Skip\" Tyler, a former submarine officer who is now teaching at Annapolis and doing consulting work after losing half a leg to a drunk driver. At one point, Tyler is offered the chance to go back to sea, but he turns it down so he can spend more time with his family.\n• Starship Troopers has a heavily-wounded recruiting officer actively trying to dissuade Rico and Carmen from joining, or at least making them think really long and hard about doing so. The Book also has several heavily-wounded veteran instructors, including a \"dirty fighting\" instructor who's wheelchair-bound and wears a neckbrace...and is apparently still able to take just about anybody on in a fight and win.\n• Shows up a couple of times in The Century Trilogy:\n• In book 1, Fitz is reassigned to an intelligence office in London after being heavily wounded at The Somme, and also has a coal miner being given a job loading and unloading minecarts from an elevator after losing a hand.\n• Book 2 has Colonel Beck, a Wehrmacht officer who is reassigned to staff headquarters in Berlin after losing a lung on the Eastern Front.\n• One of the characters in Isaac Asimov's C-Chute complains he used to be a master pilot, but after he lost his hands, the artiplasm prosthetics made him useless for anything but a desk job and, sometimes, a lecture.\n• Discussed in Up Front, a collection of Bill Mauldin's Willie And Joe comics; at times, frontline soldiers would disparage rear-echelon troops while not realizing that many of those soldiers were assigned rear-echelon duties because they'd been injured on the front lines.\n• Legion: After his encounter with David leaves him terribly burned and scarred, Clark is assigned a desk job by Division 3 as soon as he returns to the office. He then promptly refuses to take the job, claiming that he'll hunt and capture the man who almost killed him.\n• On Chicago P.D. Sergeant Platt was shot in the line of duty and the injury permanently restricted her mobility, making her ineligible for street duties. She instead took the position of desk sergeant in the 21st District.\n• On Space: Above and Beyond Colonel McQueen was an Ace Pilot till a head injury left him without a working inner ear. An implant allows him to live normally but exposure to high g-forces disables it, causing crippling nausea. McQueen, no longer able to fly space fighters himself, becomes the commanding officer of the 58th squadron and is restricted to desk duties on the SCVN Saratoga.\n• Rescue Me had a firefighter whose injuries left him in a wheelchair reassigned to an administrative job at FDNY headquarters.\n• Defied by Jackie from Roseanne when she was a cop. After she injured herself arresting a perp, she was going to be offered a desk job. Instead of taking it she instead quit since she didn't want that.\n• Phil Cerreta was Put on a Bus this way in the original Law & Order.\n• Parodied in Family Guy with the episode Blue Harvest, a Parody Episode of A New Hope. Joe (as Biggs) is shown at the Yavin IV base making sandwiches after an accident left him in a wheelchair.\n• Colonel Claus von Stauffenberg was reassigned to a staff position after losing an eye, a hand, and two of the fingers on his remaining hand. He later led and carried out an assassination attempt against Adolf Hitler.\n• Wehrmacht officer Siegfried Knappe's memoir Soldat mentions that one section of the staff headquarters he served with during the Battle of Berlin was manned entirely by amputees.\n• Averted with pilots Douglas Bader and Hans-Ulrich Rudel, both of whom continued to fly after losing their legs (both in the case of Bader, one in the case of Rudel).", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/PostInjuryDeskJob", "media_links": ["/pmwiki/pmwiki.php/Film/TheBlueMax", "/pmwiki/pmwiki.php/Manga/MyHeroAcademia", "/pmwiki/pmwiki.php/ComicBook/JudgeDredd", "/pmwiki/pmwiki.php/Film/BendItLikeBeckham", "/pmwiki/pmwiki.php/Film/TheBlueMax", "/pmwiki/pmwiki.php/Film/StarshipTroopers", "/pmwiki/pmwiki.php/Creator/TomClancy", "/pmwiki/pmwiki.php/Literature/RedStormRising", "/pmwiki/pmwiki.php/Literature/PatriotGames", "/pmwiki/pmwiki.php/Literature/TheHuntForRedOctober", "/pmwiki/pmwiki.php/Literature/StarshipTroopers", "/pmwiki/pmwiki.php/Literature/TheCenturyTrilogy", "/pmwiki/pmwiki.php/Creator/IsaacAsimov", "/pmwiki/pmwiki.php/Series/Legion", "/pmwiki/pmwiki.php/Series/ChicagoPD", "/pmwiki/pmwiki.php/Series/SpaceAboveAndBeyond", "/pmwiki/pmwiki.php/Series/RescueMe", "/pmwiki/pmwiki.php/Series/Roseanne", "/pmwiki/pmwiki.php/Series/LawAndOrder", "/pmwiki/pmwiki.php/WesternAnimation/FamilyGuy"], "non_media_links": ["/pmwiki/pmwiki.php/Main/CareerEndingInjury", "/pmwiki/pmwiki.php/Main/DeskJockey", "/pmwiki/pmwiki.php/Main/SoldiersAtTheRear", "/pmwiki/pmwiki.php/Main/BlackBestFriend", "/pmwiki/pmwiki.php/Main/VeteranInstructor", "/pmwiki/pmwiki.php/ComicStrip/WillieAndJoe", "/pmwiki/pmwiki.php/Main/DefiedTrope", "/pmwiki/pmwiki.php/Main/ItsPersonal", "/pmwiki/pmwiki.php/Main/AcePilot", "/pmwiki/pmwiki.php/Main/PutOnABus", "/pmwiki/pmwiki.php/Main/ParodyEpisode", "https://en.wikipedia.org/wiki/Claus_von_Stauffenberg", "/pmwiki/pmwiki.php/UsefulNotes/AdolfHitler"]}