{"title": "Action Bar", "content": "A UI element consisting of a box or strip of icons (or menu items) corresponding to actions which can be performed.\n\nGames on personal computers, designed to be used with a one or two-button mouse, use these to allow the player to select which action he wants to perform. Console games generally assign different controller buttons to these functions, but, particularly when the buttons are assignable, may keep an Action Bar on screen as a visual reference as to which options are currently equipped. The Action Bar can also represent the player's inventory of usable items.\n\nA variation seen in later games was to replace the Action Bar with a pop-up display of actions which appear radially around the character sprite. Such a usage is commonly called a \"Ring Menu\".\n• One of the three main styles of interface for adventure games, particularly early Sierra and LucasArts games.\n• The Legend of Zelda games, from their earliest incarnation, kept an action bar on-screen to show which items Link has equipped.\n• The Metroid Prime Trilogy have visual indicators at the bottom of the screen to show which weapon and display Samus has armed.\n• The Ring Menu-style Action Bar was common in late Lucas Arts adventure games, and is currently best known from its use in The Sims.\n• Natural Selection, a multiplayer mod for Half-Life, ups the ante with a full-featured Action Menu that can be quickly called and navigated with a middle click.\n• Ratchet & Clank uses a Ring Menu as a weapon select.\n• Saints Row and its sequel do this as well.\n• Due to their huge assortment of building tools, most building simulation games such as the SimCity series have an Action Bar somewhere in the screen.\n• The Ring Menu makes an appearance in Second Life\n• Common in many MMOs such as World of Warcraft and City of Heroes. It's not uncommon for higher-level characters to have many action bars, with those who have maxed-out their capabilities viewing the game through a kind of narrow window in between their action buttons.\n• Everybody Edits has a bar at the bottom of the screen that allows the player to leave the level, give woots, type in the password to the level, a minimap, and more.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/ActionBar", "media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/Creator/Sierra", "https://tvtropes.org/pmwiki/pmwiki.php/Creator/LucasArts", "https://tvtropes.org/pmwiki/pmwiki.php/Franchise/TheLegendOfZelda", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/MetroidPrimeTrilogy", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/TheSims", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/HalfLife", "https://tvtropes.org/pmwiki/pmwiki.php/Franchise/RatchetAndClank", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/SaintsRow1", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/SimCity", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/SecondLife", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/WorldOfWarcraft", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/CityOfHeroes", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/EverybodyEdits"], "non_media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/Main/ActionBar", "https://tvtropes.org/pmwiki/pmwiki.php/Main/ActionBar", "https://tvtropes.org/pmwiki/pmwiki.php/Main/RingMenu", "https://tvtropes.org/pmwiki/pmwiki.php/Main/AdventureGame", "https://tvtropes.org/pmwiki/pmwiki.php/Main/RingMenu", "https://tvtropes.org/pmwiki/pmwiki.php/Main/ActionBar", "https://tvtropes.org/pmwiki/pmwiki.php/Main/RingMenu", "https://tvtropes.org/pmwiki/pmwiki.php/Main/RingMenu", "https://tvtropes.org/pmwiki/pmwiki.php/Main/LevelMapDisplay"]}