{"title": "I Knew There Was Something About You", "content": "This is a Stock Phrase said by a character upon discovering an important new piece of information about another. There may have been an actual buildup of the first character's suspicions, or it may be a case of hindsight being 20/20.\n\nCommon variants are \"I knew there was something fishy/odd about you\" or \"I knew there was something about you that I liked/didn't like\".\n\nWhen the fandom says this about a character, it's I Knew It!.\n• Empath: The Luckiest Smurf: Polaris Psyche was the only one of his kind to find out that Empath was a Smurf... as if the blue skin and bald head didn't clue him in.\n• The phrase \"I knew there was something wrong with you\" is spoken to Mulan by the Emperor's advisor Chi-Fu, when he reveals her identity as a woman in front of her platoon.\n• In Disney's The Little Mermaid II: Return to the Sea, Ariel's daughter tells her new fish friends that she's really a human. One of them responds with: \"I knew there was something un-fishy about you!\"\n• In Toy Story 2, the toys are trying to find out who took Woody when Buzz recognizes the thief as Al of Al's Toy Barn, who appears in his commericals as \"The Chicken Man\", which the other toys dislike. Hamm says \"I knew there was something I didn't like about that chicken.\"\n• In Reservoir Dogs, during the final standoff, Joe tells everyone that was the one guy that he wasn't 100% on.\n• Used as a Tear Jerker in TRON. Ram suspects early on that there was something unusual about Flynn and even remarks on that fact to Tron. Later, when Ram , he flat-out asks Flynn \"Are you a User?\". When Flynn confirms it, Ram , happy to not only be right in his suspicions, but knowing that the Users exist and one is there to help.\n• In Avengers: Endgame, after seeing , Thor delivers an ecstatic \"I knew it!\", having clearly suspected since Avengers: Age of Ultron that Cap was indeed worthy to wield the hammer.\n• Bones: Zach was a brilliant but vulnerable genius, who . Cam: I knew the day I met that boy that he would cause me pain.\n• Dexter: Sergeant James Doakes: [about Dexter using drugs] I knew there was something wrong with you. The secrets, the sneaking around... Now it all makes sense. A lot of cops have been where you are. The booze, the drugs... makes the job go down easier. Stay clean and stay out of my way, we won't have a problem.\n• Later subverted when Doakes discovers the real reason that Dexter acts weird.\n• Also, when Lila discovers that Dexter is the Bay Harbor Butcher and Dexter asks her if she is now afraid of him, she tells him that she was always afraid of him because she could tell how consumed he was by the darkness inside him. And later in season five, one of Dexter's soon-to-be victims says that \"from the moment I met you I knew you were f**ked up\".\n• Mighty Morphin' Power Rangers: This is Aisha's reaction when Adam's date turns out to be Scorpina. Aisha: I knew there was something I didn't like about you! I mean, besides your hair and your clothes.\n• In the Poirot adaptation of Curtain, when Hercule Poirot narrows down as the mastermind behind the murders , who cannot even be lawfully tried or convicted: Poirot: Your proximity to these three murders was too much of a coincidence, and I smelt, as you say, the rat! That is why I came to Styles, to observe you function, and you have not disappointed, . No, you are a who is very clever, but not clever enough for Hercule Poirot.\n• Wizards of Waverly Place: Alex Russo: I knew there was something I liked about you, but this... this is genius. You are my new role model. \n\nStevie: Please, Alex. I'm sure this is something you would have eventually come up with yourself. \n\nAlex Russo: Yeah, now that's true. I take it back; I'm my own role model again.\n• BIONICLE: Vezon: Who are you, and why are you here? \n\nMazeka: I'm here to kill you! \n\nVezon: Oh. I knew there was something about you that I liked!\n• Soon after the end of Act III in Diablo III, several of your followers (as well as player characters) express that they always knew something was wrong about but had allowed themselves to be taken in.\n• When Max Payne busts down the door to face Vinnie Gognitti, Gognitti tells him \"I knew from day one there was something screwy about you!\"\n• Pops up in a couple of the Pokémon main series games, usually with a gym leader or one of the final bosses saying it to the player character.\n• Star Wars Legends: In Knights of the Old Republic, Carth is very openly stating he smells a rat in the whole setup with your Player Character. And just as he's getting over his trust issues, in comes The Reveal. His alternate lines almost quote the trope title.\n• In Tales of Symphonia, Raine says this after .\n• Played for laughs in The Adventures of Dr. McNinja. Person 1: I knew he was a ghost wizard. \n\nPerson 2: \n\nPerson 1: I knew he was an evil agent of Dracula. \n\nPerson 3: ... \n\nPerson 1: I knew \n\nPerson 4: He is so good to all of us. Stop it. I knew he was a ghost wizard. What no you didn't.I knew he was an evil agent of Dracula.I knew I didn't like him He is so good to all of us. Stop it.\n• Star Wars: The Clone Wars: In \"Crisis on Naboo\", Cad Bane says this when he finds out that Rako Hardeen was actually an undercover Obi-Wan Kenobi.\n• Steven Universe: In \"Made of Honour\", is upset but feels vindicated after Steven fills her in on , as it explains a lot about her suspicions concerning Rose's passive and merciful yet surprisingly successful battle strategy during the Crystal Gems' rebellion .", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/IKnewThereWasSomethingAboutYou", "media_links": ["/pmwiki/pmwiki.php/Disney/Mulan", "/pmwiki/pmwiki.php/Disney/TheLittleMermaidIIReturnToTheSea", "/pmwiki/pmwiki.php/WesternAnimation/ToyStory2", "/pmwiki/pmwiki.php/Film/ReservoirDogs", "/pmwiki/pmwiki.php/Film/Tron", "/pmwiki/pmwiki.php/Film/AvengersEndgame", "/pmwiki/pmwiki.php/Film/AvengersAgeOfUltron", "/pmwiki/pmwiki.php/Series/Bones", "/pmwiki/pmwiki.php/Series/Dexter", "/pmwiki/pmwiki.php/Series/MightyMorphinPowerRangers", "/pmwiki/pmwiki.php/Series/Poirot", "/pmwiki/pmwiki.php/Literature/Curtain", "/pmwiki/pmwiki.php/Literature/HerculePoirot", "/pmwiki/pmwiki.php/Series/WizardsOfWaverlyPlace", "/pmwiki/pmwiki.php/Toys/Bionicle", "/pmwiki/pmwiki.php/VideoGame/DiabloIII", "/pmwiki/pmwiki.php/VideoGame/MaxPayne", "/pmwiki/pmwiki.php/Franchise/Pokemon", "/pmwiki/pmwiki.php/Franchise/StarWarsLegends", "/pmwiki/pmwiki.php/VideoGame/KnightsOfTheOldRepublic", "/pmwiki/pmwiki.php/VideoGame/TalesOfSymphonia", "/pmwiki/pmwiki.php/Webcomic/TheAdventuresOfDrMcNinja", "/pmwiki/pmwiki.php/WesternAnimation/StarWarsTheCloneWars", "/pmwiki/pmwiki.php/WesternAnimation/StevenUniverse"], "non_media_links": ["/pmwiki/pmwiki.php/Main/StockPhrase", "/pmwiki/pmwiki.php/Main/TheReveal", "/pmwiki/pmwiki.php/Main/IKnewIt", "/pmwiki/pmwiki.php/Main/FanFic", "/pmwiki/pmwiki.php/Fanfic/EmpathTheLuckiestSmurf", "/pmwiki/pmwiki.php/Main/TearJerker", "/pmwiki/pmwiki.php/Main/GoOutWithASmile", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/SubvertedTrope", "/pmwiki/pmwiki.php/Main/TheReveal", "/pmwiki/pmwiki.php/Main/SerialKillerKiller", "/pmwiki/pmwiki.php/Main/Toys", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/PlayerCharacter", "/pmwiki/pmwiki.php/Main/TheReveal", "/pmwiki/pmwiki.php/Main/Webcomics", "http://drmcninja.com/archives/comic/33p08/", "/pmwiki/pmwiki.php/Main/VisibleSilence", "/pmwiki/pmwiki.php/Main/FlatWhat", "/pmwiki/pmwiki.php/Main/ArsonMurderAndJaywalking", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Recap/StarWarsTheCloneWarsS4E18CrisisOnNaboo", "/pmwiki/pmwiki.php/Recap/StevenUniverseS5E22MadeOfHonor", "/pmwiki/pmwiki.php/Main/TwoAliasesOneCharacter"]}