{"title": "Jobber Entrance", "content": "Imagining watching your favorite Professional Wrestling show and your favorite was already in the ring just as the show came back from commercial. It's the jobber entrance, where Jobbers normally get that treatment. However, it became more common place as explained below:\n\nThis was commonplace during the Rock & Wrestling Era, when the line between jobbers and Superstars was more defined; most of the time, jobbers didn't have any entrance music at all, and most fans didn't know them from each other (except for certain infamous ones, like Brooklyn Brawler , Lanny Poffo and Barry Horowitz ), and many of them were small-time local wrestlers hired specifically to put over touring talent. It was also a bit more common in the early to mid Nineties, when RAW was only an hour long.\n\nEver since RAW went to a three-hour format beginning with the 1000th episode on July 23, 2012, it became very common for more wrestlers to get their entrances cut out to make room for more commercials, social media, recaps, and backstage segments. Jobber entrances have also been very common on Smackdown and to a lesser extent, WWE Main Event. It's not as common during WWE Superstars, Saturday Morning Slam, and the PPVs, however most of the participants of the Andre the Giant battle royal at WrestleMania XXX got jobber entrances (thanks to the Rock. Or more like, everyone got it for the Rock).\n\nThe wrestlers that are prone to jobber entrances are the lower card and midcard guys, Divas, and local independent talent they bring in for Squash Matches, although occasionally most of the main eventers (e.g. everyone except John Cena and CM Punk) had their entrances cut out as well.\n• Jobber Entrances have become so common in the rated PG era that Smackdown started to subvert the trope. 1/31/2014 saw Kofi Kingston and Cody Rhodes have jobber entrances but win their matches after looking like they were going to lose like they usually do.\n\nWCW was actually more known for their jobbers and jobber entrances than the WWF was. Not only did they have many more jobbers (they had a roster upwards of 200, without a brand split gimmick), but not even Ric Flair was above the jobber entrance, which is probably why Goldberg got so over when he was given a jobber entrance and actually did not job.\n• Jeff Jarrett was given jobber entrances as punishment after Hulk Hogan and Eric Bischoff took over.\n• On the 7/24/2014 edition of Impact, the Bromans got two jobber entrances, against Low Ki and The Great Muta, which caused Robbie E to complain about it.\n\nJobber entrances aren't nearly as common in TNA/Impact Wrestling.\n\nSame goes for Ring of Honor.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/JobberEntrance", "media_links": [], "non_media_links": ["/pmwiki/pmwiki.php/Wrestling/ChristinaVonEerie", "/pmwiki/pmwiki.php/Main/ProfessionalWrestling", "/pmwiki/pmwiki.php/Main/Jobber", "/pmwiki/pmwiki.php/Wrestling/WWE", "/pmwiki/pmwiki.php/Wrestling/SteveLombardi", "/pmwiki/pmwiki.php/Wrestling/BarryHorowitz", "/pmwiki/pmwiki.php/Wrestling/WWEMainEvent", "/pmwiki/pmwiki.php/Wrestling/WWESuperstars", "/pmwiki/pmwiki.php/Wrestling/WrestleMania", "/pmwiki/pmwiki.php/Main/SquashMatch", "/pmwiki/pmwiki.php/Wrestling/JohnCena", "/pmwiki/pmwiki.php/Wrestling/CMPunk", "/pmwiki/pmwiki.php/Wrestling/KofiKingston", "/pmwiki/pmwiki.php/Wrestling/CodyRhodes", "/pmwiki/pmwiki.php/Wrestling/WCW", "/pmwiki/pmwiki.php/Wrestling/RicFlair", "/pmwiki/pmwiki.php/Wrestling/Goldberg", "/pmwiki/pmwiki.php/Wrestling/TNA", "/pmwiki/pmwiki.php/Wrestling/JeffJarrett", "/pmwiki/pmwiki.php/Wrestling/HulkHogan", "/pmwiki/pmwiki.php/Wrestling/EricBischoff", "/pmwiki/pmwiki.php/Wrestling/LowKi", "/pmwiki/pmwiki.php/Wrestling/TheGreatMuta", "/pmwiki/pmwiki.php/Wrestling/RingOfHonor"]}