{"title": "Final Season Casting", "content": "Being involved with a show for years, while rewarding, can be tiresome for actors. They might want to move on to different things, the reduced budget isn't enough to pay their salary, they signed up to something else before the show was unexpectedly Un-Cancelled or something else happens in their life that forces them to leave. Long story short, at some point they opt out before the show ends and their characters are written off. And more often than not, the show's ratings take a toll, as a part of its fanbase loses interest.\n\nNow imagine what happens to the ratings if the actor in question was the main character. Or if more than one actor quit at the same time. Or both. You're stuck with a show that no longer has a protagonist and/or half of its cast and is steadily losing its viewership. Either you try to bring new characters to fill the void, rewriting the scripts accordingly, or you can try to function with what you have left. Either way, even if you do it right, the show just won't be the same now and the chances to be renewed for another season after this are slim to none.\n\nIn a nutshell, Final Season Casting is a rather common phenomenon when a show experiences unusual and significant cast changes for its final season. Expect core members of the show's central Five-Man Band or even the protagonist to leave. Sometimes Suspiciously Similar Substitutes or new characters without much back story take over, sometimes the show continues with a reduced cast. The dynamic between the cast is very likely to change and if the show hasn't jumped the shark yet, it most probably will.\n\nThis trope makes no distinction between the seasons that weren't supposed to conclude the show, but turned out to be the final seasons because of low ratings partially caused by the Cast Turnover, and the ones that were supposed to conclude the show, and the Final Season Casting was either willingly invoked or was a mere coincidence.\n\nOften the result of a Long-Runner Cast Turnover, though this could also technically contribute to a Second Season Downfall. A very common effect of this trope is They Changed It, Now It Sucks! and a common attribute of a Post-Script Season. See also Jumped the Shark, Replacement Scrappy, Later Installment Weirdness. Also compare After Show, which changes the name of the show along with the cast.\n• In the chaotic and controversial last season of the TV version of Our Miss Brooks, Executive Meddling saw Miss Brooks take a new job as a teacher at a private elementary school in California (versus the Everytown, America setting of Madison). The last season initially sees the departure of everybody but Miss Brooks and Mr. Conklin. Mrs. Davis was briefly replaced by her sister Angela, before returning to the picture a couple of episodes later. Mrs. Nestor is introduced as Miss Brooks' new boss, only to be replaced by her sister, also named Mrs. Nestor. Mr. Boynton is replaced as Miss Brooks' love interest by two gym teachers in quick succession until finally returning at the end of the series. Harriet Conklin and Walter Denton disappear entirely from Miss Brooks' life, although Mrs. Conklin again made a few appearances toward the end. The cinematic series finale ignored all these changes and followed the radio continuity, which had continued in Madison as usual.\n• Vaughn and Weiss were absent for most of season 5 of Alias. Two rather generic characters, Rachel Gibson and Thomas Grace, were introduced instead. The producers were actually hoping for a spinoff with Rachel and Thomas, plus another new recurring character Renee Reienne, but when the network didn't oblige them, Thomas and Renee were both rather suddenly killed off, with very little effort to provide resolution to their own story arcs.\n• In Ally McBeal season 5, a horrible culling of many original cast members and replacement with far less interesting characters occurred. The final scene of the final episode still featured all the old cast and none of the new, making it rather contrived.\n• Angel:\n• As James Marsters said about his involvement with Buffy the Vampire Slayer: \"Spike was supposed to be the new Cordelia\". In the final season of Angel, he replaces her for the second time, even taking her place in the opening credits.\n• Lilah, a prominent recurring character since season 1, is replaced by Eve.\n• In what could be seen more as cases of The Bus Came Back, Harmony and Lindsey returned to play prominent roles, with the former even receiving a Promotion to Opening Titles in the last few episodes.\n• In an unusual move, one main character is permanently killed off a few episodes before the series finale. However, due to the way that the plot progresses, her actress ends up playing the replacement character.\n• Claudia Christian, who played Susan Ivanova, left Babylon 5 before the fifth (and final) season, necessitating the arrival of her Suspiciously Similar Substitute, Elizabeth Lochley. Ivanova returns for the series finale while Lochley is completely absent from the episode because the series finale was filmed as the finale for season 4 before Claudia Christian (Ivanova) left, Tracy Scoggins (Lochley) was hired, and when it was believed that season would be the last. When the show was picked up for a fifth season, a new season 4 finale was filmed, which features neither Ivanova nor Lochley.\n• Ivanova and Marcus both left at the same time (although Marcus was killed off before the writer realised the show was being renewed for another season - and he later said that had he known that Claudia Christian would be leaving, he would have killed her instead of Marcus). The loss of these two characters at once adversely affected the cast dynamic.\n• The fifth season also saw several recurring characters get brought forward into the limelight, with the original cast of characters moving on to other things by the end of the series. By the penultimate episode of the series, most of the leadership roles on the station were filled by new people (although some of these changes happened in the previous season, like Zack Allen taking over for Garibaldi as Chief of Security.)\n• When Charmed got Un-Cancelled for an eighth season, the network apparently mandated several new characters, including final Love Interests for the two single leads, as well as Billie, a college-aged protege for the Charmed Ones who wound up becoming The Scrappy. Billie's Long Lost Sibling Christy later came in as the season's Big Bad. Meanwhile, Daryll and his family were Put on a Bus, and halfway through the season Leo, the most important character after the sisters, joined them until the finale.\n• Coupling had this going with one of the guys (Jeff) being replaced, with the new guy being (poorly) photoshopped into the cast photo on the cover of the series DVD collection.\n• Family Matters also did this, but there was also a Channel Hop that further complicated matters.\n• Scrubs had this happen in the final season. JD, Elliot, Carla, and the Janitor were all written off.\n• Partially subverted in that the previous season was the final one for the main show, as far as Bill Lawrence was concerned. When it came time to proceed, he lobbied to refer to the new season as part of a spin-off show. ABC denied him the right to do this outright, so it's treated as Season 9, though it was at least given the unofficial title of Scrubs: Med School.\n• In the final season of Sliders, the main character Quinn was replaced by an alternate universe version who looked nothing like him, but was apparently melded with his personality, and Colin was lost forever, and replaced by someone else from the same universe as the second Quinn. Thus the show lost both the protagonist and half of the cast for its final season. Also, only one member of the original cast went all the way until Season 5.\n• In the final season of Home Improvement, Randy was written out of the show by having him spend a year in Latin America. He wasn't replaced with anyone, but other characters were given increased roles and/or new dynamics to fill the absence.\n• Partial example in Spin City. When Michael J. Fox could no longer do the show, he was replaced by Charlie Sheen. The characters of Nikki, Janelle, James, and Stacy also disappeared. The show managed to last for two more seasons with this cast rather than the usual one.\n• Heather Locklear, who had come on board a season before, shared top billing with Sheen. The remaining cast members all got their own title cards.\n• In Star Trek: Deep Space Nine, Jadzia Dax was replaced by Ezri Dax for the final season when Terry Farrell left for Becker. It was a particularly curious case as her departure was a real surprise to everyone involved, as Farrell admitted to loving the show and the character but was just interested in expanding her career. She later regretted the decision because while she enjoyed her new character, Dax was a \"super hero.\" To the writing's credit, Ezri managed to fit into the series well and wasn't just Jadzia with a new face (although that would be justified)\n• That '70s Show's final season:\n• Eric and Kelso were no longer in the cast, replaced by Randy, a character who shared some of their traits. In fact, Randy was originally going to be Eric, just recast with Josh Meyers! His experiences in Africa would have left him \"a changed man\"... Both returned for the Series Finale. (Another new character, Samantha, was even less popular.)\n• Tommy Chong's character, Leo, was bumped up to main cast. This was more welcome than the newcomers, but since he had been strictly a gag character before, there was a bit of a Klinger effect.\n• In the final season of NewsRadio, Bill was replaced by Max after Phil Hartman's death. Catherine left in season 4 as well and wasn't replaced. Late additions Walt and Andrea had disappeared and left respectively as well.\n• The X-Files in its last two seasons. The eighth season had Mulder missing for over half its run, and partnered Scully with the new character of John Doggett; the ninth season didn't feature Mulder at all until the two-part Grand Finale, significantly reduced Scully's screen time and made Doggett and Monica Reyes the two agents attached to the X-files. The plan had been for Doggett and Reyes to take over officially as the new main characters, but the show got cancelled first.\n• Inverted with Law & Order: Criminal Intent. The 10th (and final) season brought the return of Vincent D'Onofrio to the role of Bobby Goren, and Kathryn Erbe (Alex Eames) back as well.\n• Welcome Back, Kotter had a big problem with this during its last season. Both the nominal star (Mr. Kotter) and the most popular character (Barbarino) all but quit the show. Mrs. Kotter, of all people, took up the slack for Mr. Kotter, and the show brought in a replacement for Barbarino named Beau. Many viewers found Beau to be a pale imitation of Barbarino, and were not impressed with the \"twist\" of Beau being a Southerner.\n• Laverne & Shirley is an infamous example. Shirley left and the show continued without her, strangely keeping the title intact. The show compensated by bringing on weekly guest stars to assist Laverne in her schemes.\n• Robin Hood deliberately killed off for cheap shock value in the final episode of series two, and the actors playing Will and Djaq left as well. Furthermore, Keith Allen could only sign on for half of series three, leading to the absence of Vasey for several episodes. To compensate for this loss of the original cast, the show introduced the characters of Isabella, Kate, Tuck and Prince John — Prince John being the only one who went down at all well with fans. Later on, Robin and Guy's long-lost half-brother Archer appeared and was equally unpopular. The show ended with the deaths of , with Sam Troughton (Much) also quitting. A planned fourth series was thankfully not commissioned, but it would have left Little John as the only remaining original cast member.\n• The Practice replaced half its cast in the final season. The cast shake-up was mainly a way to shoehorn in a Poorly Disguised Pilot for Boston Legal.\n• Stargate SG-1 retired Jack O'Neill and replaced him with Cameron Mitchell for the final two seasons. Vala Mal Doran was also added to the cast, although no one else left.\n• Season 9's beginning looked to be this, though, with the arrival of newcomers Mitchell and General Landry, and Mitchell's attempt to 'get the band back together' resulting in an SG-1 consisting of him, Daniel, Vala, and Teal'c. Those familiar with SG-1 looking at the largely new cast with a \"who the hell are these guys?\" reaction was a Running Gag. The full return of Carter (who had been written out of the first several episodes due to Amanda Tapping's real-life pregnancy) and an increase in O'Neill guest spots would come later.\n• In the fifth and final season of Stargate Atlantis Sam Carter was replaced by Richard Woolsey. None of the replacements were well received.\n• Ivan Dixon left the cast of Hogan's Heroes when his contract expired, leading to Newkirk taking over some of Kinch's duties and Kenneth Washington playing the new communications officer, Sgt. Baker.\n• Saved by the Bell presents a curious case. The intended final episodes were filmed with the entire regular cast, including a Grand Finale where the teens graduated. Problem is, afterwards, more episodes were ordered, but no one was under contract. Most returned, but Tiffani Thiessen and Elizabeth Berkley chose not to. Leanna Creel was hired to play new character Tori and her tenure was interspersed with the previously produced episodes.\n• Subverted - twice - in Blake's 7. Gareth Thomas who played Blake left at the end of the second season, not the last, and wasn't replaced. Despite there being no change in title, there was no Blake for the next two seasons until the very last episode when he made a tragic return. This caused much ridicule among critics and some fans at the time, but can be justified in that although Blake was gone, the rest of the Liberator's crew were still products of his rebellion and, in a sense, still his creations, carrying on his fight.\n• Main character Joel never quite disappeared from Northern Exposure, but in the last season his role was drastically reduced and the town got a different doctor.\n• Prior to the filming of season 4 of Hannah Montana, Mitchel Musso (who played Oliver Oken) left the series to star in Pair of Kings and work on his music. He and his character appeared only in a few episodes as a guest, including the series finale. He was replaced by Australian actress Tammin Sursok, who played Jackson's bikini model girlfriend, Sienna.\n• Multiple replacements in the final season of the original Hawaii Five-O: Danno (James MacArthur) and Chin Ho (Kam Fong) were replaced by Kimo (William Smith), Lori (Sharon Farrell) and Truck (Moe Keale)... and Lori didn't stick around for the duration. Although the series had run its course over 12 seasons, the massive recasting probably put the final nail in its coffin. In the case of Chin Ho, by the actor's request, the character didn't just disappear but his murder was made integral to the episode's plot. (Danno, on the other hand, didn't get much of a sendoff.)\n• Earth: Final Conflict was doing this LONG before its final season. The show's producers were infamous for immediately firing any actor who asked for a raise. Only one character (a villain who largely functioned as The Dragon for the current Big Bad) was a regular in all five seasons.\n• House. Lisa Edelstein left after season 7, so Cuddy was written out and Foreman (Omar Epps) became the dean of medicine at Princeton-Plainsboro. Also, the characters of Dr. Chi Park (Charlyne Yi) and Dr. Jessica Adams (Odette Annable) were added to House's team. Thirteen (Olivia Wilde) was written out a few episodes in, although she came Back for the Finale.\n• The sixth and final season of 3rd Rock from the Sun saw Tommy (Joseph Gordon-Levitt) with severely reduced screen time, notably appearing in only half the episodes of the series.\n• In Dynasty, Linda Evans left the show leaving her character Krystle brain-death in a coma, she did appear in the reunion.\n• The last season of 24 ditched almost all the new characters introduced in the previous season along with any regulars who had been on the show before only carrying over two of season 7's new characters alongside mainstays Jack and Chloe and throwing in a supporting cast that consists mostly of replacement scrappies, unmemorable newbies and a pretty horrid Creator's Pet with the only new character that was remotely interesting biting the dust halfway through the season. To show how much of a case this was, Season 8 is the only one in the original series' run not to feature recurring character Aaron Pierce, which left Jack Bauer as the only character to have a presence in every season. It was also only one of two not to feature Tony Almeida, though this was somewhat justified by .\n• JAG: Rear Admiral A.J. Chegwidden (John M. Jackson) retired at the end of season 9 and was replaced in the final 10th season by Major General Gordon Cresswell (David Andrews). Lieutenants Gregory Vukovic (Chris Beteem) and Catherine Graves (Jordana Spiro) were also last season additions. The plan was to do like Law & Order, introducing new core characters as the old ones left; Vukovic reminded one a great deal of Harm in the early seasons. They could have squeezed out a couple of more seasons with him and Graves substituting for Harm and Rab in the core cast. It wouldn't have been as good, though.\n• Subverted by Criminal Minds. Edward Allen Bernero called Jason Gideon the show's central character and openly worried that Mandy Patinkin's departure would ruin the cast dynamic and perhaps produce this trope. Arguably, Joe Mantegna's arrival improved the cast dynamic and helped keep it on the air for six more seasons (and counting).\n• The Wire does this without combining it with Post-Script Season. The final season writes out quite a few characters but for the most part, their stories were wrapped up and they all return for cameos that provide a nice codas to their stories. The show is also justified in playing the trope straight in that that some time has passed between seasons, and it is a grounded crime drama mostly centered in the drugs war in low-income Baltimore: many of the characters who formed the backbone of the narrative in earlier seasons are dead or incarcerated with regard to the criminals, or have moved on in the careers with regard to police, local administrators, and so forth.\n• In the third series of Princess Returning Pearl, the cast changed dramatically, and three of the four main roles were recast, including a majority of supporting roles as well. The fans did not like it, to say the least.\n• How I Met Your Mother:\n• The series added Cristin Milioti to the main cast for its 9th and final season\n• Jason Segel appears a bit less in the final season, with Marshall being Out of Focus by being forced to take a road trip to Fairhampton (where everyone is gathering at for wedding) after missing the last plane. He still appears in every episode, but his interactions with the rest of the cast (mainly conversing with them with a phone and appearing in flashbacks) have him be more limited than normal.\n• Community would be on the cusp of the trope, having written out the characters of Pierce and Troy, while introducing a new replacement for Pierce in the \"old guy\" slot, for the fifth season. Troy lampshades it with a reference to Zach Braff leaving before the final season of Scrubs. The show managed to get a sixth season, in which Shirley is also missing except for the first and last episode. True to form, it's all Lampshaded in the series finale. Abed: I don't know how likely season seven is. I mean, what show ever peaks after season six?\n• Carmen from The George Lopez Show left the cast at the final season since the actor for her wanted to start college. So Carmen managed to get admitted to college at the beginning of the final season. George's niece, Veronica, returned to the show to replace her as an even more Bratty Teenage Daughter with George being in charge of her trust fund.\n• The shortened fifth and final season of Fringe saw the characters of both Philip Broyles and Nina Sharp reduced to recurring status after being regulars on the show since the beginning.\n• The Office (US)'s final season had this in spades. Ed Helms (Andy) had a Written-In Absence, with his character going sailing in the Caribbean, due to Helms' commitment to various movies. Mindy Kaling (Kelly) left to write and star in her own sitcom, The Mindy Project. This is in addition to various characters that left in earlier seasons. The series also added Clark Duke and Jake Lacy to the cast. However, almost all of the characters that left made at least a cameo in the season (including , who had left the show two seasons earlier).\n• The sudden departure of the CKY Crew (Margera, Dunn, Di Camillo, Raab...) during the third and final season of Jackass. Half of them came back for the movies, though.\n• Parks and Recreation lost two major characters, Ann and Chris, during the sixth season, and gave more focus to Garry and Donna. A new character, Craig Middlebrooks, was introduced in the sixth season and added to the main cast in the seventh.\n• Though it was not the final season, the seventh series of Red Dwarf came after a three-year hiatus and the dissolution of the Grant Naylor partnership. Amongst numerous format changes, the character of Rimmer was largely supplanted by Replacement Scrappy Kristine Kochanski.\n• The final season of The West Wing saw the original main cast in only roughly half of the episodes. Every other episode would focus on the White House and the main staff remaining there, and then on one or multiple of the presidential campaigns and the staff working with the candidates. In the campaign episodes, only Josh, Donna, and Will had been series regulars prior to that season.\n• All three of the original leads of Being Human (UK) had been replaced by the time the fifth and final season aired (Mitchell at the end of series 3, George at the beginning of series 4 and Annie at the end of series 4).\n• Season four of The Secret Life of Us opened with five regular cast members gone (two of which had been there from the first episode) and five new characters either living in or about to move into the apartment block. A few episodes into the season, Evan, the show's main narrator from the beginning, moved out and was replaced, albeit by someone who had been introduced late the previous year). A few episodes later, Christian moved out and was replaced, leaving Kelly and Simon as the only main characters remaining from any previous season.\n• The final season of Once Upon a Time was a Postscript Season taking place after a Time Skip to focus on a now-adult Henry, jettisoning much of the cast from the first six seasons. Only Regina, Gold, and Hook's actors remained regulars (and in Hook's case he's not even the original deal, instead being a duplicate ), but otherwise, the cast is completely brand new. Played with in the last two episodes, as all six regulars who'd left at the end of season 6 returned for the finale, and four other regulars appeared via archive footage. The only regular not to return was Eion Bailey, with a younger version of his character cameoing instead.\n• The Wild House had the actors of the Wild parents quit before the final season; so the show had them move to the US to join Serena. Instead, a succession of babysitters and random relatives appeared to take care of remaining original cast members Natalie and Arthur (and Serena's replacement, Georgina.) This was incorporated into an episode where Natalie's teacher arranges to visit, concerned about her chaotic home life.\n• This was the case of House of Cards (US) after Netflix fired its lead Kevin Spacey during filming of the final season after numerous allegations of sexual misconduct. The final season featured Robin Wright as the sole lead.\n• An odd version with Smallville: after ten years of Long-Runner Cast Turnover, the final season had only four faces in the opening credits (Clark, Lois, Tess, and Oliver, plus Chloe in the minority of episodes in which she appeared), compared to eight in the first season (Clark, Lana, Lex, Whitney, Pete, Chloe, Martha, and Jonathan) and thereafter through season five (though with different configurations each year). One side effect was that in the final seasons the opening titles were increasingly filled out with action clips as the regular cast got smaller.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/FinalSeasonCasting", "media_links": ["/pmwiki/pmwiki.php/Series/OurMissBrooks", "/pmwiki/pmwiki.php/Series/Alias", "/pmwiki/pmwiki.php/Series/AllyMcBeal", "/pmwiki/pmwiki.php/Series/Angel", "/pmwiki/pmwiki.php/Creator/JamesMarsters", "/pmwiki/pmwiki.php/Series/BuffyTheVampireSlayer", "/pmwiki/pmwiki.php/Series/BabylonFive", "/pmwiki/pmwiki.php/Series/Charmed1998", "/pmwiki/pmwiki.php/Series/Coupling", "/pmwiki/pmwiki.php/Series/FamilyMatters", "/pmwiki/pmwiki.php/Series/Scrubs", "/pmwiki/pmwiki.php/Series/Sliders", "/pmwiki/pmwiki.php/Series/HomeImprovement", "/pmwiki/pmwiki.php/Series/SpinCity", "/pmwiki/pmwiki.php/Series/StarTrekDeepSpaceNine", "/pmwiki/pmwiki.php/Series/Becker", "/pmwiki/pmwiki.php/Series/That70sShow", "/pmwiki/pmwiki.php/Series/MASH", "/pmwiki/pmwiki.php/Series/NewsRadio", "/pmwiki/pmwiki.php/Series/TheXFiles", "/pmwiki/pmwiki.php/Series/LawAndOrderCriminalIntent", "/pmwiki/pmwiki.php/Series/WelcomeBackKotter", "/pmwiki/pmwiki.php/Series/LaverneAndShirley", "/pmwiki/pmwiki.php/Series/RobinHood", "/pmwiki/pmwiki.php/Series/ThePractice", "/pmwiki/pmwiki.php/Series/BostonLegal", "/pmwiki/pmwiki.php/Series/StargateSG1", "/pmwiki/pmwiki.php/Creator/AmandaTapping", "/pmwiki/pmwiki.php/Series/StargateAtlantis", "/pmwiki/pmwiki.php/Series/HogansHeroes", "/pmwiki/pmwiki.php/Series/SavedByTheBell", "/pmwiki/pmwiki.php/Creator/TiffaniThiessen", "/pmwiki/pmwiki.php/Creator/ElizabethBerkley", "/pmwiki/pmwiki.php/Creator/LeannaCreel", "/pmwiki/pmwiki.php/Series/BlakesSeven", "/pmwiki/pmwiki.php/Series/NorthernExposure", "/pmwiki/pmwiki.php/Series/HannahMontana", "/pmwiki/pmwiki.php/Series/PairOfKings", "/pmwiki/pmwiki.php/Series/HawaiiFiveO", "/pmwiki/pmwiki.php/Series/EarthFinalConflict", "/pmwiki/pmwiki.php/Series/House", "/pmwiki/pmwiki.php/Series/ThirdRockFromTheSun", "/pmwiki/pmwiki.php/Series/Dynasty", "/pmwiki/pmwiki.php/Series/TwentyFour", "/pmwiki/pmwiki.php/Series/JAG", "/pmwiki/pmwiki.php/Creator/JordanaSpiro", "/pmwiki/pmwiki.php/Series/LawAndOrder", "/pmwiki/pmwiki.php/Series/CriminalMinds", "/pmwiki/pmwiki.php/Series/TheWire", "/pmwiki/pmwiki.php/Series/PrincessReturningPearl", "/pmwiki/pmwiki.php/Series/HowIMetYourMother", "/pmwiki/pmwiki.php/Creator/JasonSegel", "/pmwiki/pmwiki.php/Series/Community", "/pmwiki/pmwiki.php/Series/Scrubs", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/Series/Seinfeld", "/pmwiki/pmwiki.php/WesternAnimation/SouthPark", "/pmwiki/pmwiki.php/Series/Friends", "/pmwiki/pmwiki.php/Series/TheGeorgeLopezShow", "/pmwiki/pmwiki.php/Series/Fringe", "/pmwiki/pmwiki.php/Series/TheOfficeUS", "/pmwiki/pmwiki.php/Series/TheMindyProject", "/pmwiki/pmwiki.php/Series/Jackass", "/pmwiki/pmwiki.php/Series/ParksAndRecreation", "/pmwiki/pmwiki.php/Series/RedDwarf", "/pmwiki/pmwiki.php/Series/TheWestWing", "/pmwiki/pmwiki.php/Series/BeingHumanUK", "/pmwiki/pmwiki.php/Series/TheSecretLifeOfUs", "/pmwiki/pmwiki.php/Series/OnceUponATime", "/pmwiki/pmwiki.php/Series/HouseOfCardsUS", "/pmwiki/pmwiki.php/Creator/KevinSpacey", "/pmwiki/pmwiki.php/Creator/RobinWright", "/pmwiki/pmwiki.php/Series/Smallville"], "non_media_links": ["/pmwiki/pmwiki.php/Main/LongRunners", "/pmwiki/pmwiki.php/Main/MoneyDearBoy", "/pmwiki/pmwiki.php/Main/UnCancelled", "/pmwiki/pmwiki.php/Main/RealLifeWritesThePlot", "/pmwiki/pmwiki.php/Main/OptOut", "/pmwiki/pmwiki.php/Main/FiveManBand", "/pmwiki/pmwiki.php/Main/SuspiciouslySimilarSubstitute", "/pmwiki/pmwiki.php/Main/TheGenericGuy", "/pmwiki/pmwiki.php/Main/LongRunnerCastTurnover", "/pmwiki/pmwiki.php/Main/SecondSeasonDownfall", "/pmwiki/pmwiki.php/Main/TheyChangedItNowItSucks", "/pmwiki/pmwiki.php/Main/PostScriptSeason", "/pmwiki/pmwiki.php/Main/JumpedTheShark", "/pmwiki/pmwiki.php/Main/ReplacementScrappy", "/pmwiki/pmwiki.php/Main/LaterInstallmentWeirdness", "/pmwiki/pmwiki.php/Main/AfterShow", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/ExecutiveMeddling", "/pmwiki/pmwiki.php/Main/EverytownAmerica", "/pmwiki/pmwiki.php/Main/TheMovie", "/pmwiki/pmwiki.php/Main/GrandFinale", "/pmwiki/pmwiki.php/Main/TheBusCameBack", "/pmwiki/pmwiki.php/Main/PromotionToOpeningTitles", "/pmwiki/pmwiki.php/Main/SuspiciouslySimilarSubstitute", "/pmwiki/pmwiki.php/Main/UnCancelled", "/pmwiki/pmwiki.php/Main/LoveInterest", "/pmwiki/pmwiki.php/Main/MarySue", "/pmwiki/pmwiki.php/Main/YoungerAndHipper", "/pmwiki/pmwiki.php/Main/TheScrappy", "/pmwiki/pmwiki.php/Main/LongLostSibling", "/pmwiki/pmwiki.php/Main/WoobieDestroyerOfWorlds", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/FriendOnTheForce", "/pmwiki/pmwiki.php/Main/PutOnABus", "/pmwiki/pmwiki.php/Main/TheSmartGuy", "/pmwiki/pmwiki.php/Main/ChannelHop", "/pmwiki/pmwiki.php/Main/TheNthDoctor", "/pmwiki/pmwiki.php/Main/TheOtherDarrin", "/pmwiki/pmwiki.php/Main/SeriesFinale", "/pmwiki/pmwiki.php/Main/ChuckCunninghamSyndrome", "/pmwiki/pmwiki.php/Main/ShooOutTheNewGuy", "/pmwiki/pmwiki.php/Main/GrandFinale", "/pmwiki/pmwiki.php/Main/RevolvingDoorCasting", "/pmwiki/pmwiki.php/Main/ArtifactTitle", "/pmwiki/pmwiki.php/Main/DroppedABridgeOnHim", "/pmwiki/pmwiki.php/Main/DerailingLoveInterests", "/pmwiki/pmwiki.php/Main/CreatorsPet", "/pmwiki/pmwiki.php/Main/MagicalNegro", "/pmwiki/pmwiki.php/Main/LargeHam", "/pmwiki/pmwiki.php/Main/JerkassStu", "/pmwiki/pmwiki.php/Main/PoorlyDisguisedPilot", "/pmwiki/pmwiki.php/Main/RunningGag", "/pmwiki/pmwiki.php/Main/AscendedExtra", "/pmwiki/pmwiki.php/Main/GrandFinale", "/pmwiki/pmwiki.php/Main/TheDragon", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/BackForTheFinale", "/pmwiki/pmwiki.php/Main/ReplacementScrappy", "/pmwiki/pmwiki.php/Main/EleventhHourRanger", "/pmwiki/pmwiki.php/Main/CreatorsPet", "/pmwiki/pmwiki.php/Main/PostScriptSeason", "/pmwiki/pmwiki.php/Main/OutOfFocus", "/pmwiki/pmwiki.php/Main/Lampshade", "/pmwiki/pmwiki.php/Main/ShoutOut", "/pmwiki/pmwiki.php/Main/LampshadeHanging", "/pmwiki/pmwiki.php/Main/RealLifeWritesThePlot", "/pmwiki/pmwiki.php/Main/BrattyTeenageDaughter", "/pmwiki/pmwiki.php/Main/WrittenInAbsence", "/pmwiki/pmwiki.php/Main/CreatorBreakdown", "/pmwiki/pmwiki.php/Main/ReplacementScrappy", "/pmwiki/pmwiki.php/Main/PostscriptSeason", "/pmwiki/pmwiki.php/Main/TimeSkip", "/pmwiki/pmwiki.php/Main/BackForTheFinale", "/pmwiki/pmwiki.php/Main/PutOnABus", "/pmwiki/pmwiki.php/Main/SuspiciouslySimilarSubstitute", "/pmwiki/pmwiki.php/Main/LongRunnerCastTurnover", "/pmwiki/pmwiki.php/Main/LongRunnerCastTurnover"]}