{"title": "Teaser Equipment", "content": "Don't worry Crono, you'll be able to afford that someday.\n\nThe heroes have arrived at the next town and, in standard Role-Playing Game fashion, head over to the weapon and item shop to upgrade all their gear. They count out some gold to spend, check out some Absurdly Sharp Blades, and get ready to make their purchase.\n\nOnly to find that the item is being sold for... A Million Gold?\n\nTeaser equipment occurs when a store is selling powerful and expensive weapons, armor, accessories, or other items for a price far more than the player is expected to have at that point in the game. This is primarily a RPG trope, though other games can also qualify. An instance of teaser equipment generally means one of two things - either you will return later to the town (with more levels, gold, and more powerful gear), or the gear will become more reasonably priced after you've advanced in the plot or undertaken a side-quest to lower the shop prices.\n\nTeaser equipment is incompatible with Sequence Breaking - if you come across equipment far beyond your ability to purchase because you've gone outside the plot, it is not an example of this trope. A subtrope of Game-Breaker if you are actually able to purchase the item in question, either through frugality or farming gold; may also be a Disc-One Nuke if acquired early enough. Related also to Adam Smith Hates Your Guts, the difference being that whereas the price of the equipment doesn't increase over time, it starts off prohibitively high and your wealth increases to compensate. Compare with Level-Locked Loot - instead of Character Levels prohibiting your ability to use certain items, insufficient gold blocks access; these two are not mutually exclusive. Almost never the Infinity +1 Sword, though particularly triumphant examples may be the Infinity -1 Sword.\n\nDon't confuse with A Taste of Power - that trope is when you get to use really high powered gear early in the game, only to have it taken away from you, while this one taunts you with said gear in the item shop, but you don't get to acquire it until later. Or with Equipment Spoiler (where the presence of affordable but unusable equipment foreshadows a new party member). A specific type of inversion of the Sorting Algorithm of Weapon Effectiveness.\n• Chrono Trigger:\n• The first time you arrive at Medina, the shopkeepers sell weapons three tiers above what you'll currently be using, for 10 times the gold you'd expect. This is all because the fiends of the village hate humans after losing a war 400 years ago. After you've changed history to make fiends no longer hate humans, the prices become more reasonable, but by then, the gear is outclassed.\n• At the very beginning of the game, Melchior is visiting the Millennial Fair and has a Silver Sword for sale. Unless you farm money for a long time, you won't be able to afford it until you've progressed through at least one more dungeon, at which point he leaves the fair.\n• In Cthulhu Saves the World there's some extremely high level armor for the White Magician Girl in the first shop you find. The price is suitably high.\n• In EarthBound, when guiding Jeff out of Winters to join Ness's party, you'll notice that the store outside of the Snow Wood Boarding School sells the T-Rex's Bat, Non-Stick Frying Pan, and Coin of Silence at insanely high prices, yet you don't have access to the ATM (since Jeff doesn't own an ATM card). The T-Rex's Bat is priced at $698, the Non-Stick Frying Pan at $1490, and the Coin of Silence at $2800. Granted, it is possible to grind money by selling the food items dropped from enemies outside the store, but the selling prices for them are abysmally low, only going up to $6 at most.\n• In S.T.A.L.K.E.R. at the beginning of a new campaign, the \"Tunder\" 5.45 may be bought from Sidorovich. From the moment the player starts a new game, he will randomly offer the weapon for sale at a price of 20000 RU at a time when having 200RU is an achievement. However, the \"Tunder\" 5.45 will only appear up until the Marked One speaks to Wolf after defeating the Bandits that captured Nimble. The weapon is also a Disk one Nuke since it fires the very common 5.45 round while dealing damage on par with end game weapons, prompting some players to grind money until they can afford it.\n• In the first Diablo game, the enterprising young boy Wirt randomly sells a high-level item, but you're unlikely to be able to purchase it until later. Even though that item is generated at random, it's generally of a higher level than what the normal item shops are selling, though not always relevant to your class. By the time you'll generally be able to purchase it, the gear in other shops has largely caught up.\n• Dragon Age: Origins features Blood Dragon Armor. Although you receive the breastplate for free early on, you must purchase the rest of the set for massive amounts of money. Even if you could afford it, you still wouldn't be able to equip it until you gain more levels.\n• The town of Imperia in Gladius displays high-level equipment meant for when you challenge the endgame tournament. Depending on which character you choose, it will either be the first or second region you visit.\n• Alternate clothing can be purchased from the police station early on in Persona 3. By the time you'll be able to afford it, more effective armor is already available.\n• The bicycle in Pokémon Red and Blue. When you first arrive in Cerulean City, it is on display for exactly one more unit of money than you can carry. After advancing the plot in the next town, you get a voucher to acquire one for free.\n• Star Ocean: Till the End of Time - When you first arrive in Airyglyph City, several powerful weapons and items are sold for 20,000 Fol or more when you'll have barely a tenth of that. Purchasing this gear early is a godsend on the higher difficulties.\n• In Tales of the Abyss, shops will regularly display items they do not sell at all until you partake in sidequests (the same sidequests also reduce the prices of items that you can buy.) Some shopkeepers will even have their entire stock \"Sold Out\" until you do the necessary sidequests, yet they will still thank you for \"shopping\" at their outlets.\n• It has some traditional examples, as well, such as weapons for sale in Baticul, a city reached fairly early in the game, for more than a million gald.\n• Betrayal at Krondor: The shops in the first area of the game sell some really nifty swords, armor, and crossbows, usually for around 700-800 gold a pop...at a time where you're lucky to have more than 50 or so However, while it's not exactly intended , there's many well-known tricks to allow you to earn the thousands of gold needed to buy all of this awesome gear in the first chapter .\n• In Phantasy Star III, the two Layan cities at the end of the first generation (and the very start of the second generation, if you decided to marry Maia) sell not only some of the game's strongest equipment, but also a handful of extremely powerful healing items that are not sold anywhere else. While the equipment's prices tend to keep it well out of your range, it's possible to grind enough money (much easier at the start of Ayn's path) to afford some of the healing items, which, if given to Wren and/or Mieu and held on to, can make some of the final battles much easier.\n• Seltzer in Star Ocean: The Second Story is sold at many shops throughout the game, starts out prohibitively expensive, and its price continues to rise dramatically based on the total playing time. Unlike most examples, this is just a somewhat useful out-of-battle healing item, so there's not even much reason to buy one anyhow The intended use is to buy it early, and sell it much, much later in the game, when the value has skyrocketed. But, since the buy value scales based on the amount of time spent playing the game, unless you farm the rare MoneySpiders on the first continent, you'll never be able to afford it .\n• Alundra has two separate examples of this. The first is the Inoa shop, which always has the Silver Armor in stock, but picking it up will have the shopkeeper tell you it's not for sale. You won't be able to acquire this until the very end of the game. The second example is somewhat similar to the Pokemon bicycle mentioned above. About 1/3 of the way through the game, a shop will open on the beach, which sells Life Vessels and several unique accessories for 10,000 Gilder, exactly one more than the max of 9,999. A subquest a bit later on allows you to obtain these in exchange for the Gilded Falcons you find here and there throughout the game.\n• The Fallout series occasionally has equipment sold by NPCs that maybe be just out of your price range, moreso when you've just started and lack any caps. The Gun Runner's Arsenal for New Vegas can fall into this trope heavily, as it distributes the new weapons and weapon mods throughout the game in the inventories of most vendors quite randomly, so you might wind up looking through an early-game NPC's stock to find items that you wouldn't be able to afford without procuring a downright absurd amount of loot.\n• Some of these items also disappear for a while and reappear later in each vendor's inventory, making it frustrating when you come back later and it's somehow no longer in stock.\n• Fallout 4 does this with the Cryolater in Vault 111, although the high lockpicking skill required to open the case it's in, not an exorbitant price, that causes this. You can break the game by going out of the vault, finding Dogmeat, returning to the Vault with him, and having him fetch an item while in the room with the Cryolater, which will cause him to get the gun for you. However, this was clearly not intended by the developers, so it still applies.\n• Knights of the Old Republic has a couple merchants on Dantooine with some shockingly good gear at just as shockingly high prices. The Rodian merchant outside the Jedi enclave, for example, sells one of the best heavy armors in game (Cassus Fett's armor). If you want it, you have to get very good at Pazaak, do a lot of griniding, or make a return trip before you get the third Star Map because Malak's attack on Dantooine means the merchants and their items are lost .\n• In the second game in The Denpa Men series, there's a shop that's only available before setting foot inside the Noob Cave that sells a number of rare and expensive items, including one that increases the rare item drop rate. It's normally only available as an ultra rare drop from one of the mushroom enemies in the overworld. If you don't buy it then (for 20k gold—when most enemies drop single-digit amounts), the only way to get it is either to hope it Randomly Drops or to wait for a certain shop to open up in the endgame.\n• There seems to be an example in Xenogears, with some useful but expensive accessories sold rather early in Nisan. By the time you earn enough money to comfortably buy them, they don't sell them anymore.\n• Ogre Battle 64 has the game-breakingly powerful Draconite element spell-book Annihilation available to buy at the end of the first chapter. If you're particularly frugal throughout the game, you might have enough money saved up to come back and buy one near the end of the game.\n• Legend of Dragoon features a few shops in Lohan, a city you reach very early in disc 1, selling among the best armor in the game well before you can afford it.\n• Victor Vran does this big time. The first time you get to the shopkeepers in the castle, you won't be able to buy anything. Later on in the game, perhaps you'll be able to buy one high-powered item before breaking your bank. Be very thorough in your gold scavenging and you might make it to two - by leaving yourself unable to buy anything else for many levels.\n• The Elder Scrolls III: Morrowind, being the only game in the series to date without some form of Level Scaling, has this in play. Many shops have a piece or two of late-game level equipment no matter how early you visit them, but you'll almost certainly be unable to afford it at that point. Two good examples in Balmora, likely the second town you'll visit if following the main quest, are Ra'Virr's Demon/Devil weapons (steel weapons enchanted to allow you to temporarily summon much better Daedric weapons) and Meldor's Dreugh Cuirass and Shield (extremely good medium armor).\n• Exaggerated in the free Japanese RPG . The third town has three weapons shops. One of them (the one which matches your levels when you first reach the town) sells weapons with costs in the millions and attack power in the hundreds of thousands. The second sells weapons with costs in the billions. The third sells weapons with costs and attack power in the hundreds of sextillions (which is roughly final boss tier; it's called Inflation Quest for a reason).\n• The Legend of Zelda\n• Link's Awakening features the Shovel (200 rupees), and later the Bow (980 rupees) in the item shop, long before you are expected to be able to afford them. Granted, you can cheap out the Crane Game in order to buy both items right at the beginning of the game (or just steal them)...\n• Happens a lot near the beginning of Ocarina of Time, where some shops have items whose price exceeds what you can even store in your wallet.\n• The Wind Waker has a shop in early in the game that sells bombs for more money than Link can actually carry. You can acquire these bombs for free later on when , and afterwards the shopkeeper begins to sell bombs at a more reasonable price.\n• Twilight Princess - The shop at Castle Town sells bombs, arrows, and other mundane items for thousands of rupees. The exact same gear can be bought elsewhere for 1% of the cost, or found on monsters roaming town, with the exception of a unique set of Magic Armor that costs a hundred thousand. The HD remake, which increases Link's Rupee carrying capacity, also increases the prices in the store to tens of thousands of Rupees per item, making the Magic Armor 400,000. The absolute maximum number of rupees Link can carry at all is 1,000 (9,999 in the HD version). Once you give enough money to Malo (which doesn't even come close to the amount needed to buy one pack of bombs from the Castle Town shop — go figure), he buys out the shop, which reduces the cost of items immensely.\n• Early on in Breath of the Wild, you can find an armor shop in almost every settlement in Hyrule. But even the least expensive piece from an armor set can cost several hundred rupees at a point when you'll be lucky to find red 20 rupee gems. Even in the mid- to late-game, when these armor sets are more affordable, the Ancient Armor set and various Ancient weapons sold at the Akkala Ancient Tech Lab can be this, as they not only cost lots of rupees but also require you to have components dropped by Guardians.\n• Referenced in Homestuck, after one of the characters earns a large sum of \"grist\" for leveling up: \"You can't wait to find out what amazing items this new supply of grist will be just barely insufficient to produce.\"\n• The first Dungeon Siege has some powerful items in shops literally marked \"PRICELESS\".\n• In Faxanadu, one of the game's most powerful spells and the best shield can be bought near the beginning...if you have obscene amounts of gold. You can either grind for a very long time Which turns the Death spell into a Game-Breaker for half the game , or get the spell near the end of the game (when the price has actually increased).\n• In Ratchet & Clank (2002) and Ratchet & Clank: Going Commando, the R.Y.N.O. (II) is introduced on a relatively early planet (Rilgar in the first, Barlow in the second), and costs an obscene amount of bolts. Later games avert this entirely by either introducing the weapon extremely late in the game, or requiring you to collect a certain number of out-of-the-way collectibles but then giving it to you for free afterwards.\n• Before the introduction of the Kiwame feature in Touken Ranbu, clearing stage 6-4 for the first time gives three pieces of mysterious equipment that were later revealed as Kiwame equipments once the feature is implemented.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/TeaserEquipment", "media_links": ["/pmwiki/pmwiki.php/VideoGame/ChronoTrigger", "/pmwiki/pmwiki.php/VideoGame/ChronoTrigger", "/pmwiki/pmwiki.php/VideoGame/CthulhuSavesTheWorld", "/pmwiki/pmwiki.php/VideoGame/EarthBound", "/pmwiki/pmwiki.php/VideoGame/STALKER", "/pmwiki/pmwiki.php/VideoGame/Diablo", "/pmwiki/pmwiki.php/VideoGame/DragonAgeOrigins", "/pmwiki/pmwiki.php/VideoGame/Gladius", "/pmwiki/pmwiki.php/VideoGame/Persona3", "/pmwiki/pmwiki.php/VideoGame/PokemonRedAndBlue", "/pmwiki/pmwiki.php/VideoGame/StarOceanTillTheEndOfTime", "/pmwiki/pmwiki.php/VideoGame/TalesOfTheAbyss", "/pmwiki/pmwiki.php/VideoGame/BetrayalAtKrondor", "/pmwiki/pmwiki.php/VideoGame/PhantasyStarIII", "/pmwiki/pmwiki.php/VideoGame/StarOceanTheSecondStory", "/pmwiki/pmwiki.php/VideoGame/Alundra", "/pmwiki/pmwiki.php/VideoGame/Fallout", "/pmwiki/pmwiki.php/VideoGame/FalloutNewVegas", "/pmwiki/pmwiki.php/VideoGame/Fallout4", "/pmwiki/pmwiki.php/VideoGame/KnightsOfTheOldRepublic", "/pmwiki/pmwiki.php/VideoGame/TheDenpaMen", "/pmwiki/pmwiki.php/VideoGame/Xenogears", "/pmwiki/pmwiki.php/VideoGame/OgreBattle64", "/pmwiki/pmwiki.php/VideoGame/LegendOfDragoon", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsIIIMorrowind", "/pmwiki/pmwiki.php/Franchise/TheElderScrolls", "/pmwiki/pmwiki.php/Franchise/TheLegendOfZelda", "/pmwiki/pmwiki.php/VideoGame/TheLegendofZeldaLinksAwakening", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaOcarinaOfTime", "/pmwiki/pmwiki.php/VideoGame/TheLegendofZeldaTheWindWaker", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaTwilightPrincess", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaBreathOfTheWild", "/pmwiki/pmwiki.php/Webcomic/Homestuck", "/pmwiki/pmwiki.php/VideoGame/DungeonSiege", "/pmwiki/pmwiki.php/VideoGame/Faxanadu", "/pmwiki/pmwiki.php/VideoGame/RatchetAndClank2002", "/pmwiki/pmwiki.php/VideoGame/RatchetAndClankGoingCommando", "/pmwiki/pmwiki.php/VideoGame/ToukenRanbu"], "non_media_links": ["/pmwiki/pmwiki.php/Main/RolePlayingGame", "/pmwiki/pmwiki.php/Main/AbsurdlySharpBlade", "/pmwiki/pmwiki.php/Main/SequenceBreaking", "/pmwiki/pmwiki.php/Main/GameBreaker", "/pmwiki/pmwiki.php/Main/DiscOneNuke", "/pmwiki/pmwiki.php/Main/AdamSmithHatesYourGuts", "/pmwiki/pmwiki.php/Main/LevelLockedLoot", "/pmwiki/pmwiki.php/Main/CharacterLevel", "/pmwiki/pmwiki.php/Main/InfinityPlusOneSword", "/pmwiki/pmwiki.php/Main/InfinityMinusOneSword", "/pmwiki/pmwiki.php/Main/ATasteOfPower", "/pmwiki/pmwiki.php/Main/EquipmentSpoiler", "/pmwiki/pmwiki.php/Main/SortingAlgorithmOfWeaponEffectiveness", "/pmwiki/pmwiki.php/Main/WhiteMagicianGirl", "/pmwiki/pmwiki.php/Main/DiscOneNuke", "/pmwiki/pmwiki.php/Main/RandomlyDrops", "/pmwiki/pmwiki.php/Main/LevelLockedLoot", "/pmwiki/pmwiki.php/Main/Cap", "/pmwiki/pmwiki.php/Main/GoodBadBugs", "/pmwiki/pmwiki.php/Main/DiscOneNuke", "/pmwiki/pmwiki.php/Main/MoneySpider", "/pmwiki/pmwiki.php/Main/HeartContainer", "/pmwiki/pmwiki.php/Main/NonPlayerCharacter", "/pmwiki/pmwiki.php/Main/DownloadableContent", "/pmwiki/pmwiki.php/Main/VendorTrash", "/pmwiki/pmwiki.php/Main/PermanentlyMissableContent", "/pmwiki/pmwiki.php/Main/NoobCave", "/pmwiki/pmwiki.php/Main/RandomlyDrops", "/pmwiki/pmwiki.php/Main/PermanentlyMissableContent", "/pmwiki/pmwiki.php/Main/VictorVran", "/pmwiki/pmwiki.php/Main/LevelScaling", "/pmwiki/pmwiki.php/Main/HubCity", "https://www.freem.ne.jp/win/game/9198", "/pmwiki/pmwiki.php/Main/TakeAThirdOption", "/pmwiki/pmwiki.php/Main/FridgeLogic", "/pmwiki/pmwiki.php/Main/DemonicSpiders", "/pmwiki/pmwiki.php/Main/GameBreaker", "/pmwiki/pmwiki.php/Main/InfinityPlusOneSword", "/pmwiki/pmwiki.php/Main/UniversalCurrency"]}