{"title": "Auto-Scrolling Level", "content": "A level in a Platform Game where the screen scrolls at a constant rate (like in rail shooters), no matter where the player runs or jumps to. This doesn't make any sense at all, but since you didn't care when you were 12, why start now?\n\nGenerally, the gameplay in these levels shifts from exploration towards a more \"survivalist\" task of avoiding a combination of fixed and moving obstacles. The player must choose between moving forward early, at the risk of running afoul of some not-yet-seen obstacles, or waiting to move later, where he runs the risk of being forced to move by the level's scrolling at a moment when the obstacles are more dangerous.\n\nOften you will be mortally crushed if you get caught between the advancing side of the screen and a stationary wall, making the screen boundary a kind of Advancing Wall of Doom. Only occasionally are these kinds of levels coupled with an actual Advancing Wall Of Doom, providing some justification for the enforced scrolling. Some of the time it is stated or implied in the story that there is an offscreen Advancing Wall Of Doom. It might also just mean that there is a limited amount of time for the character to reach his destination and running short of that is tantamount to failing. In vertical-scrolling levels, there will be an ever-rising bottomless pit, and solid platforms that fall below the edge of the screen will be consumed by an unknown force.\n\nThese levels can be a bit aggravating to play, particularly when combined with any number of Classic Video Game \"Screw You\"s.\n\nOften times, you can't simply fast-forward the scrolling by advancing in the direction of it, forcing you to deal with whatever speed the screen is moving at. As such, Auto-Scrolling Levels are the bane of many speedrunners and impatient players.\n\nWhen the entire game is one of these, it's an Endless Running Game. Whether Minecart Madness is a subtrope is debatable; similar to endless runners, these levels force the character to move a fixed speed, challenging the player to jump, duck, and/or attack at the right times. If this occurs during a boss battle, you may be fighting an Advancing Boss of Doom or a \"Get Back Here!\" Boss.\n• Many levels in most Super Mario Bros. games are of this type.\n• The auto-scrolling levels in Super Mario Bros. 3 include 1-4, 3-6, 5-6, 5-9, 6-2, 6-7, 7-4 and all the airship, tank and navy levels. The air force level auto-scrolls significantly faster than any other level in the game.\n• The Super Mario Bros. Game & Watch from the 80s is fixed scrolling, the first example of this trope in the Mario series.\n• The autoscrolling levels in Super Mario World 2: Yoshi's Island include 1-5, E-1, 6-5, 6-Secret and parts of 2-1 and 6-8. Yoshi's Island DS has these in 2-6, 2-Secret, 3-1,3-2, 4-1, 4-3, 5-1, 4-Secret and 5-5. In both games, the scrolling screen will go in all sorts of different directions, crossing the same part of the level more than once in more than one different direction, and there's no justification of any sort.\n• Inverted in Super Mario Galaxy. Only a part of the level is manifested physically, meaning that stepping outside the solid area drops you in a bottomless pit. Since the ratio of the solid ground moves constantly, this gives the net effect the same as a fixed scrolling screen.\n• Inverted in parts of Super Mario World and New Super Mario Bros. with some castle levels having crawling block platforms.\n• Justified in level 7-3 of New Super Mario Bros., where the entire level takes place on the back on a giant Wiggler.\n• Super Mario 3D Land and Super Mario 3D World, both playing exactly like the 2D Mario games except on a 3D plane, have these.\n• Super Mario Maker lets you create these in its course creator. There are three speeds to choose from, represented by a tortoise, a hare, and a cheetah.\n• Many levels in Kirby's Dream Land 2 and 3. Kirby Super Star had two sections like this in the \"Revenge of Meta Knight\" subgame.\n• Donkey Kong:\n• Donkey Kong Country 3: Dixie Kong's Double Trouble! has \"Ripsaw Rage\" and \"Kong-Fused Cliffs\", which have a giant saw and the rope you're climbing burning as Advancing Walls of Doom, respectively.\n• Rocket barrel levels, mine cart segments and barrel cannon sequences in Donkey Kong Country Returns and Donkey Kong Country: Tropical Freeze. The second game offers a unique twist: certain segments will provide a Camera Perspective Switch.\n• Distorted Travesty 3 has plenty of these segments. Always justified by being chased, or an Advancing Wall of Doom or riding something\n• The Jet Bike levels from the Mega Man X series. Fans do not want to remember.\n• In X6, the hidden sub-stage of Metal Shark Player's recycling facility stage has a crushing ceiling AND forced scrolling! Joy!\n• Burn Rooster's stage from X8. Many had nightmares.\n• The jetboard sections in Mega Man 8 are particularly irritating.\n• The fixed scrolling in Stage 1 of Dr. Wily's Castle in Mega Man 2 is brief, but very annoying the first time. 80% of the level scrolls normally, until the end when it suddenly begins to move on its own at a rate that's only slightly slower than the player's movement. The transition seemingly happens in the middle of a jump between two one-block-wide platforms and if the unprepared player doesn't simply miss and fall into the bottomless pit, he'll soon be knocked in anyway when a giant dragon that takes up 1/3 of the screen flies in behind him.\n• In Mega Man 4, the third level of Dr. Cossack's fortress is one of these. It had a decent number of ways to slow you down to the screen's speed and was for the most part a pretty decent level. The Awesome Music doesn't hurt, either .\n• In Mega Man 5, there is a section at the latter half of Gyro Man's stage that is exactly this, and you must dodge the spikes that you are approaching.\n• The first section of Tengu Man's stage in Mega Man & Bass auto-scrolls, and you must hop on fast-popping balloons to boot.\n• From Rom Hack Rockman 4 Minus Infinity:\n• Sections of Skull Man's stage. It has every kind of platform from the Mega Man series. Plenty of lives will be lost on those sections.\n• Wily Stage 2's second half. It has an Homage to the Gradius series' High Speed Zone stages. It even comes with the shutting doors and a song from the NES Gradius 2 soundtrack.\n• Wonder Boy III: Monster Lair alternates between autoscrolling platform stages and Shoot 'em Up boss battles.\n• In Shonen Jump's One Piece Rogue Town Part 2 is basically this, replete with enemies, obstacles, spike pits, falling platforms and some tricky jumps. Missing any of the various platforms means falling to your doom.\n• Super Smash Bros.:\n• The series features entire arenas that scroll through a continuous loop of level elements, including:\n• Dream Land and Pac-Land in 3DS and Wii U, respectively.\n• One assistance character in Brawl, the Devil, makes non-scrolling stages suddenly start scrolling in random directions for a little while. This is the only Interface Screw that can hurt the computer, because if you get scrolled too far off of the screen you'll die.\n• Some of the most annoying platforming segments in the Subspace Emissary mode of Brawl featured this too. The worst ones also included traps that would fling you offscreen if you made one misstep. Even if you can keep up with the scrolling camera admist the hordes of Goddamn Bats, trying to collect the trophies and other goodies to earn 100% at the same time almost reaches controller-breaking levels of frustration - especially on the hardest difficulties, with more traps, more knockback, and faster scrolling.\n• Every level in Balloon Kid is one of these.\n• The Subwarine levels in Wario Land The Shake Dimension are these. The first Wario Land has one of these as the first level in the Oven Canyon zone.\n• Preceding the Final Boss in Ecco the Dolphin is a forced-scroll level combined with The Maze; it takes place underwater and scrolls up, down, sideways, doubles on itself, and lasts a good five minutes. The only break the game cuts you is the level also continually regenerates your health, due to it being a giant meat grinder. Unfortunately, losing to the boss sends you back to the maze again... It even actively tries to fake you out at certain points, making you think you have to go a certain way and then turning back and trying to crush you when you do go that way. Or even making a tiny part of a chamber the only safe place where you won't get crushed. Almost no one will make it through the first time, due to the need to memorize the correct path in some places. The sequel Tides of Time has at least four on hard mode. All other modes at least two.\n• Tiny Toon Adventures Buster Busts Loose for the SNES has some levels where the edge of the screen kills you.\n• Little Nemo: The Dream Master gave us House of Toys, a level that took place on the back of a moving toy train set where you had to survive divebombing toy airplanes, bombs dropped by toy hot air balloons and plenty of instant death spikes on descending ceilings. Cloud Ruins has a section where the screen suddenly starts scrolling up, and then where it goes back down again; in both cases the bottom of the screen becomes deadly.\n• The first Rayman game has a few of these, semi-justified by a raising water level or some big enemy chasing you (Moskito with a huge spiked ball, and Mr. Stone in a later level).\n• An interesting variation: soon after acquiring a temporary flight powerup from a hippie, the start of one part of the level immediately places the eponymous hero in a situation where he has to use his helicopter hair to cut the frayed sections of two ropes, in order to drop the rocks they carry into the slowly sinking water beneath, before they drag the faster-falling ceiling below the surface... Perhaps it's better to show than to tell? (starting at around 2:25 in this video )\n• In Rayman 3: Hoodlum Havoc, after you blow up the furnace in Hoodlum Headquarters, you have to climb up a tall tower while lava rises below you.\n• Rayman Origins has some too, especially in the Tricky Treasure challenges. Once again, semi-justified by having the level start falling apart behind the treasure chest.\n• The music stages in Rayman Legends, which are justified because of their gimmick.\n• Cave Chaos replicates the effect, but at the same time shows you what the hell's happening: the floating platforms behind you are constantly breaking apart and dropping into the depths below. And to keep you from getting too far ahead, the ground ahead of you is constantly assembling out of pieces coming from offscreen. Get particularly far behind, and you may find yourself jumping from falling piece to falling piece just before each vanishes off the bottom of the screen.\n• The overhead River stage in Adventures of Tom Sawyer, and the Boss Battle in the Sky stage.\n• The final stage of Jumper is a vertical version of this.\n• The Tower, The Panic Room, and The Final Challenge in VVVVVV. Spikes of Doom appear when you near the top or bottom of the vertically scrolling screen. Also, The Tower is one of the stages available as a Time Trial.\n• Kid Chameleon had a few of these that are Advancing Walls Of DRILLS, including a cruel one that had a choice of two paths at the end, not knowing where they go. One path leads to a sign saying \"TOO BAD\" with no exit and you just get squished by it.\n• Purple features this in stages 2-3 and 5-2, with the latter even having multi-directional scrolling.\n• Castlevania III: Dracula's Curse has several automatically scrolling vertical shafts. In the case of Blocks 5-0B and 9-03, the scrolling is discontinuous—every few seconds the tower trembles and sinks a bit into the ground.\n• Putt-Putt Goes to the Moon has the minigame Bear Stormin', which plays this straight for the entire game. This was later recycled as Circus Stormin' in Putt-Putt and Fatty Bear's Activity Pack. Despite being in games made for children, they can get brutally difficult.\n• Distorted Travesty loves this trope, forcing you to race through already sadistically brutal Platform Hell sections while a wall of instakill spikes follows behind or beneath you so fast a single mistake will force you to repeat the whole section.\n• Seen in New Super Marisa Land. Which makes sense as it's essentially a Super Mario clone.\n• The first cave escape stage in Aladdin (Capcom). Actually both cave escape stages scroll automatically, but only the first has platforming.\n• Klonoa Advance 1 and 2 have some auto-scroll levels.\n• Atomic Runner Chelnov is entirely made of these (Boss Battles excepted), being essentially a Horizontal Scrolling Shooter/Platform Game hybrid.\n• Jackie Chan's Action Kung Fu has a few stages where the screen starts scrolling to the right, with pillars shooting up from the ground in places.\n• Though a top-down non-platform game, Devil World features this as its main gimmick. The Devils on the edges of the screen move a frame over the maze, trying to crush Tamagon between the frame and the maze walls.\n• Super Mario Fusion Revival\n• World 2-S5: Arabian Night. It takes place in the rooftops of an Saudi Arabian village at night. Watch out for the saber-tossing mooks and the crows.\n• World 3-4: Venomous Void. It is full of dangerous electric seaweed and electric jellyfish.\n• This is every level in the vertically scrolling Raptor: Call of the Shadows, in which the player pilots a fighter jet through enemy territories. It is at least somewhat justified, as an airborne jet can hardly be expected to remain stationary with respect to the ground.\n• Occurs in Playstation All Stars Battle Royale on Alden's Tower, though at least it's done periodically.\n• Multiple levels in Nihilumbra have you chased by The Void.\n• The collapsing castle stage in The Jungle Book for SNES.\n• Batman: Return of the Joker for NES has auto-scrolling in Stages 1-2 (Roof Hopping while being bombarded by an airship), 4-1 (Traintop Battle) and 6-2 (tank battle). The Lift of Doom areas are also inescapable until the lift stops rising.\n• One Way Heroics is a Roguelike that operates on this principle. You're forced to keep moving forward to avoid getting swallowed up by the encroaching darkness. Every move you take, whether it's to attack, talk to NPCs, use items, or change your equipment, moves the level forward. If you get caught on the left side of the screen, you die, and the game is over.\n• Something series:\n• Perilous Ice, which is made even more dangerous because of ice physics. Luckily, Yoshi is there to make things easier. You need him for the Switch Palace Exit.\n• Vertical Chao, where Mario has to ride on a tiny platform and has to dodge many enemies and obstacles.\n• Vile Vine, where Luigi has to climb a green apple vine and dodge obstacles at the same time. To get the secret exit, Luigi has to beat the green apple vine in a race.\n• Above the World is found in the Special World. Luigi has to dodge Flying Wigglers and use acorns to climb to the top. It's also a Marathon Level.\n• The boat level in The Flintstones: The Rescue Of Dino & Hoppy.\n• In TRON Maze-a-Tron, the maze constantly scrolls in one direction, with the player changing directions whenever he touches a Flip-Flop chip. Being scrolled off the screen doesn't cause you to lose a life, but it does put you back at the level's starting point.\n• Two of the levels from Ubisoft's The Smurfs 2 constantly scroll upwards, forcing the player to move upwards to avoid falling off the screen.\n• In The Adventures of Lomax, the boss stages in the first 3 worlds are like this.\n• Shovel Knight has three auto-scrolling screens, each containing unique mechanics to up the frustration.\n• Clockwork Tower: The bottom of the screen has rockets that knock you off the ladder and platforms, half of the platforms move across the screen, and the other half are conveyor belts pointed the wrong way.\n• Flying Machine: A wind is constantly blowing against the direction of travel, slowing you down. Most of the platforms are also temporary and will fall seconds after you touch them.\n• Tower of Fate: Half of the screen has slowly moving platforms that will block you from continuing and move slowly, meaning a missed opening is quickly fatal. The second half consists of digging your way upwards through the dirt while dodging exploding rats.\n• The first part of the final level of Papa Louie 2: When Burgers Attack contains an actual Advancing Wall of Doom, complete with pickets on top.\n• To dodge the thorns and Munchers at the beginning of Muncher Mountain in Super Mario World: Piranha Island, Mario must board a rocket pipe barrel and navigate his way to the end of the segment. Like the rocket barrel segments in Donkey Kong Country Returns, Mario dies if the pipe touches anything hazardous.\n• \"Raw Fish Rampage\" in The Angry Video Game Nerd II: ASSimilation, with added challenge provided by conveyor belts.\n• The Atari 2600 game Entombed by U.S. Games, where you must escape a series of scrolling mazes without being trapped in them.\n• The (sorta) surgery sim games Trauma Center Under the Knife/Second Opinion and New Blood have Pempti and Soma, respectively, be called this. Pempti can only be damaged when it takes an action, and only for a single point of damage each time, meaning the operation is essentially the same speed every time. Soma can be constantly drained and is essentially harmless unless you aren't paying attention, meaning most of the fight is just holding A and keeping the drain on it.\n• The Video Mode for Gottlieb's Super Mario Bros. and Super Mario Bros. Mushroom World have a simplified version of Super Mario Bros., where Mario moves automatically across the screen. The flipper buttons are used to either make him jump or to run faster.\n• Super Mario Bros. Mushroom World also has a Frog Mario swimming game, where Mario moves automatically and the player makes him swim up and down to avoid enemies.\n• The Video Mode for Doctor Who has the chosen Doctor escaping from Daleks, jumping to avoid obstacles in his path.\n\nCranky Kong: \"A bit aggravating,\" they call these auto-scrolling levels? Back in my day, we didn't have any scrolling whatsoever — just one static screen, maybe a different static screen for different levels! And we liked it, by gum!", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/AutoScrollingLevel?from=Main.AutoScrolling", "media_links": ["/pmwiki/pmwiki.php/Franchise/SuperMarioBros", "/pmwiki/pmwiki.php/VideoGame/SuperMarioBros3", "/pmwiki/pmwiki.php/VideoGame/YoshisIsland", "/pmwiki/pmwiki.php/VideoGame/SuperMarioGalaxy", "/pmwiki/pmwiki.php/VideoGame/NewSuperMarioBros1", "/pmwiki/pmwiki.php/VideoGame/SuperMario3DLand", "/pmwiki/pmwiki.php/VideoGame/SuperMario3DWorld", "/pmwiki/pmwiki.php/VideoGame/SuperMarioMaker", "/pmwiki/pmwiki.php/Franchise/Kirby", "/pmwiki/pmwiki.php/VideoGame/KirbySuperStar", "/pmwiki/pmwiki.php/Franchise/DonkeyKong", "/pmwiki/pmwiki.php/VideoGame/DonkeyKongCountry3DixieKongsDoubleTrouble", "/pmwiki/pmwiki.php/VideoGame/DonkeyKongCountryReturns", "/pmwiki/pmwiki.php/VideoGame/DonkeyKongCountryTropicalFreeze", "/pmwiki/pmwiki.php/VideoGame/DistortedTravesty", "/pmwiki/pmwiki.php/VideoGame/SonicTheHedgehog", "/pmwiki/pmwiki.php/VideoGame/Sonic3AndKnuckles", "/pmwiki/pmwiki.php/VideoGame/Sonic3AndKnuckles", "/pmwiki/pmwiki.php/VideoGame/SonicTheHedgehog2006", "/pmwiki/pmwiki.php/VideoGame/SonicLostWorld", "/pmwiki/pmwiki.php/VideoGame/MegaManX", "/pmwiki/pmwiki.php/VideoGame/MegaMan8", "/pmwiki/pmwiki.php/VideoGame/MegaMan2", "/pmwiki/pmwiki.php/VideoGame/MegaMan4", "/pmwiki/pmwiki.php/VideoGame/MegaMan5", "/pmwiki/pmwiki.php/VideoGame/MegaManAndBass", "/pmwiki/pmwiki.php/VideoGame/Rockman4MinusInfinity", "/pmwiki/pmwiki.php/VideoGame/Gradius", "/pmwiki/pmwiki.php/VideoGame/Gradius", "/pmwiki/pmwiki.php/VideoGame/WonderBoyIIIMonsterLair", "/pmwiki/pmwiki.php/VideoGame/ShonenJump", "/pmwiki/pmwiki.php/Manga/OnePiece", "/pmwiki/pmwiki.php/VideoGame/SuperSmashBros", "/pmwiki/pmwiki.php/VideoGame/BalloonKid", "/pmwiki/pmwiki.php/VideoGame/WarioLand", "/pmwiki/pmwiki.php/VideoGame/EccoTheDolphin", "/pmwiki/pmwiki.php/VideoGame/TinyToonAdventuresBusterBustsLoose", "/pmwiki/pmwiki.php/VideoGame/LittleNemoTheDreamMaster", "/pmwiki/pmwiki.php/VideoGame/Rayman", "/pmwiki/pmwiki.php/VideoGame/Rayman3HoodlumHavoc", "/pmwiki/pmwiki.php/VideoGame/RaymanOrigins", "/pmwiki/pmwiki.php/VideoGame/RaymanLegends", "/pmwiki/pmwiki.php/Creator/Nitrome", "/pmwiki/pmwiki.php/VideoGame/Braid", "/pmwiki/pmwiki.php/VideoGame/Jumper", "/pmwiki/pmwiki.php/VideoGame/VVVVVV", "/pmwiki/pmwiki.php/VideoGame/KidChameleon", "/pmwiki/pmwiki.php/VideoGame/Purple", "/pmwiki/pmwiki.php/VideoGame/CastlevaniaIIIDraculasCurse", "/pmwiki/pmwiki.php/VideoGame/PuttPutt", "/pmwiki/pmwiki.php/VideoGame/FattyBear", "/pmwiki/pmwiki.php/VideoGame/DistortedTravesty", "/pmwiki/pmwiki.php/VideoGame/NewSuperMarisaLand", "/pmwiki/pmwiki.php/VideoGame/AladdinCapcom", "/pmwiki/pmwiki.php/VideoGame/Klonoa", "/pmwiki/pmwiki.php/VideoGame/AtomicRunnerChelnov", "/pmwiki/pmwiki.php/VideoGame/JackieChansActionKungFu", "/pmwiki/pmwiki.php/VideoGame/DevilWorld", "/pmwiki/pmwiki.php/VideoGame/SuperMarioFusionRevival", "/pmwiki/pmwiki.php/VideoGame/RaptorCallOfTheShadows", "/pmwiki/pmwiki.php/VideoGame/PlaystationAllStarsBattleRoyale", "/pmwiki/pmwiki.php/VideoGame/InFamous", "/pmwiki/pmwiki.php/VideoGame/Nihilumbra", "/pmwiki/pmwiki.php/Disney/TheJungleBook", "/pmwiki/pmwiki.php/VideoGame/BatmanSunsoft", "/pmwiki/pmwiki.php/VideoGame/OneWayHeroics", "/pmwiki/pmwiki.php/VideoGame/Something", "/pmwiki/pmwiki.php/VideoGame/TheFlintstonesTheRescueOfDinoAndHoppy", "/pmwiki/pmwiki.php/Creator/MidwayGames", "/pmwiki/pmwiki.php/VideoGame/TRON", "/pmwiki/pmwiki.php/VideoGame/TronMazeATron", "/pmwiki/pmwiki.php/VideoGame/TheSmurfs2", "/pmwiki/pmwiki.php/VideoGame/TheAdventuresOfLomax", "/pmwiki/pmwiki.php/VideoGame/ShovelKnight", "/pmwiki/pmwiki.php/VideoGame/SuperMarioWorldPiranhaIsland", "/pmwiki/pmwiki.php/VideoGame/DonkeyKongCountryReturns", "/pmwiki/pmwiki.php/VideoGame/TheAngryVideoGameNerdIIAssimilation", "/pmwiki/pmwiki.php/VideoGame/TraumaCenter", "/pmwiki/pmwiki.php/Creator/Gottlieb", "/pmwiki/pmwiki.php/VideoGame/SuperMarioBros1"], "non_media_links": ["/pmwiki/pmwiki.php/Videogame/CastlevaniaIIIDraculasCurse", "/pmwiki/pmwiki.php/WebVideo/TheAngryVideoGameNerd", "/pmwiki/pmwiki.php/Main/PlatformGame", "/pmwiki/pmwiki.php/Main/ShootEmUp", "/pmwiki/pmwiki.php/Main/AdvancingWallOfDoom", "/pmwiki/pmwiki.php/Main/NothingIsScarier", "/pmwiki/pmwiki.php/Main/FridgeHorror", "/pmwiki/pmwiki.php/Main/ThatOneLevel", "/pmwiki/pmwiki.php/Main/ClassicVideoGameScrewYous", "/pmwiki/pmwiki.php/Main/Speedrun", "/pmwiki/pmwiki.php/Main/EndlessRunningGame", "/pmwiki/pmwiki.php/Main/MinecartMadness", "/pmwiki/pmwiki.php/Main/AdvancingBossOfDoom", "/pmwiki/pmwiki.php/Main/GetBackHereBoss", "/pmwiki/pmwiki.php/Main/ThatOneLevel", "/pmwiki/pmwiki.php/UsefulNotes/GameAndWatch", "/pmwiki/pmwiki.php/Main/AdvancingWallOfDoom", "/pmwiki/pmwiki.php/Main/AdvancingWallOfDoom", "https://www.youtube.com/watch?v=2F-5Kyz3JoQ", "/pmwiki/pmwiki.php/Main/BossBattle", "/pmwiki/pmwiki.php/Main/AdvancingWallOfDoom", "/pmwiki/pmwiki.php/Main/LethalLavaLand", "/pmwiki/pmwiki.php/Main/ObviousBeta", "/pmwiki/pmwiki.php/Main/ThatOneLevel", "/pmwiki/pmwiki.php/Main/SarcasmMode", "/pmwiki/pmwiki.php/Main/NintendoHard", "/pmwiki/pmwiki.php/SugarWiki/AwesomeMusic", "https://www.youtube.com/watch?v=MlRGotA3Yzs&feature=related", "/pmwiki/pmwiki.php/Main/RomHack", "/pmwiki/pmwiki.php/Main/Homage", "/pmwiki/pmwiki.php/Main/ShootEmUp", "/pmwiki/pmwiki.php/Main/BossBattle", "/pmwiki/pmwiki.php/Main/InterfaceScrew", "/pmwiki/pmwiki.php/Main/ThatOneLevel", "/pmwiki/pmwiki.php/Main/GoddamnBats", "/pmwiki/pmwiki.php/Main/GottaCatchEmAll", "/pmwiki/pmwiki.php/Main/FinalBoss", "/pmwiki/pmwiki.php/Main/TheMaze", "/pmwiki/pmwiki.php/Main/MarathonLevel", "/pmwiki/pmwiki.php/Main/TrialAndErrorGameplay", "/pmwiki/pmwiki.php/UsefulNotes/SuperNintendoEntertainmentSystem", "/pmwiki/pmwiki.php/Main/AdvancingWallOfDoom", "/pmwiki/pmwiki.php/Main/SpikesOfDoom", "/pmwiki/pmwiki.php/Main/DescendingCeiling", "/pmwiki/pmwiki.php/Main/BubblyClouds", "/pmwiki/pmwiki.php/Main/AdvancingWallOfDoom", "https://www.youtube.com/watch?v=y3anfBkIcn0&fmt=18", "/pmwiki/pmwiki.php/Main/MusicalGameplay", "/pmwiki/pmwiki.php/Main/BossBattle", "/pmwiki/pmwiki.php/Main/SpikesOfDoom", "/pmwiki/pmwiki.php/Main/TimeTrial", "/pmwiki/pmwiki.php/Main/AdvancingWallOfDoom", "/pmwiki/pmwiki.php/Main/ThisIsADrill", "/pmwiki/pmwiki.php/Main/SurpriseDifficulty", "/pmwiki/pmwiki.php/Main/PlatformHell", "/pmwiki/pmwiki.php/Main/BossBattle", "/pmwiki/pmwiki.php/Main/HorizontalScrollingShooter", "/pmwiki/pmwiki.php/Main/PlatformGame", "/pmwiki/pmwiki.php/Main/AdvancingWallOfDoom", "/pmwiki/pmwiki.php/Main/RoofHopping", "/pmwiki/pmwiki.php/Main/TraintopBattle", "/pmwiki/pmwiki.php/Main/LiftOfDoom", "/pmwiki/pmwiki.php/Main/Roguelike", "/pmwiki/pmwiki.php/Main/MarathonLevel", "/pmwiki/pmwiki.php/Main/LedgeBats", "/pmwiki/pmwiki.php/Main/AdvancingWallOfDoom", "/pmwiki/pmwiki.php/UsefulNotes/Atari2600", "/pmwiki/pmwiki.php/Main/Pinball", "/pmwiki/pmwiki.php/Main/VideoMode", "/pmwiki/pmwiki.php/Pinball/SuperMarioBros", "/pmwiki/pmwiki.php/Pinball/SuperMarioBrosMushroomWorld", "/pmwiki/pmwiki.php/Pinball/SuperMarioBrosMushroomWorld", "/pmwiki/pmwiki.php/Main/VideoMode", "/pmwiki/pmwiki.php/Pinball/DoctorWho"]}