{"title": "Revenge Before Reason", "content": "until the death of Hank, her sister's husband, in \"Ozymandias\". Thinking that Walter killed him (he didn't directly kill Hank, but his actions ultimately caused Hank's death), Skyler decides not to call 911 to get Walt arrested, but to take matters into her own hands. Picking up a kitchen knife instead, she tries to tell Walt to leave. However, this was a ruse, as she wouldn't let him get away with what happened to Hank (actually forcing him to leave would make him get away with his sins. ) Walt tries to talk her out of attacking and/or killing him, but she slashes him. In order to stop her harming him any further, an enraged Walt lunges at her to forcibly take the knife from her to save himself , until Walt Jr. throws him off her and then calls 911 to get Walter arrested. This eliminates the need for Skyler to attack him again, but Walt then escapes, kidnapping the only family member he didn't believe knew enough to turn against him—his infant daughter Holly. Unfortunately, he was wrong. Despite never forgiving her husband for his sins, Skyler abandoned any plans to harm Walt when he tried to exonerate her for any involvement in his crimes pretending to be an abusive husband berating her for not supporting her, and when he later returned Holly to her via the Fire Department. Not to mention when Walt came back in \"Felina\" to tell her he found another way or securing their future than drug money, gave to coordinates to Hank and Gomez's bodies, and reveal that becoming a drug dealer was for himself, not his family. Then, he left before Flynn (formerly Walter Jr.) came home, as he made it clear he wanted his father dead for his crimes in the previous episode, \"Granite State.\" Flynn got his wish off-screen by the end of the episode thought it's unclear if he ever knew or cared that Walt died partially making amends putting an end to his own drug empire.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/RevengebeforeReason", "media_links": [], "non_media_links": ["/pmwiki/pmwiki.php/Main/GetOut", "/pmwiki/pmwiki.php/Main/KarmaHoudini", "/pmwiki/pmwiki.php/Main/BerserkButton", "/pmwiki/pmwiki.php/Main/IWantMyMommy", "/pmwiki/pmwiki.php/Main/SeriesFinale"]}