{"title": "New Look, Same Great Taste!", "content": "A common Advertising Trope (and Stock Phrase) used when the packaging for something is redesigned. To reassure the consumer that, although the wrapper has changed, the underlying product is the same and there is no reason to be alarmed, the new version will proudly proclaim, \"New Look, Same Great Taste!\" or a close variant thereof, thus signaling to existing fans of the product that they have nothing to fear from the strictly-cosmetic changes.\n\nThe changes might be purely cosmetic for the consumer, but there are practical purposes for the company. Afterall, the industry often has better things to do with their time and money than attempting a visual makeover on a product with no other practical purpose that may or may not actually grab consumer's attention. Examples include changing wrappers including the use of better materials that does not damage as easily during shipping, recycles better for a greener environment or a better physical design that has less empty-wasted space inside thus allowing more of the packages to be shipped on freight at a cheaper price than delivering the same number of products on multiple trucks.\n\nCompare and contrast New and Improved.\n• Used in this Pepsi commercial. And they were justified in doing so, to reassure their customers that they were not going the way their chief competitors, Coca-Cola, had five years earlier...the disastrous \"New Coke\" campaign.\n• Pastaroni employed it after a packaging change in 2010.\n• Used by Dole in juice advertisements.\n• This Daawat basmati rice ad boasts, \"Fresh new look, same great taste.\"\n• Used by Gustafson Farm milk here.\n• Eight O'Clock Coffee provides the page image.\n• Comparably and infamously disastrous for Tropicana; their attempt to ditch their 50-year logo for a modernized look which made it look a sketchy store brand drew so much ire from consumers they switched back to the old packaging within mere weeks.\n• After the cans of Mountain Dew: Code Red were redesigned, they bore the text \"New 'do, same dew!\"\n• At a certain point, Colgate-Palmolive realized that its Darkie brand of toothpaste popular in China (where it was known as \"Black Man Toothpaste\") was causing some bad press in America: besides the name, the brand mascot was a minstrelish smiling black man in a top hat. However, they had strong brand loyalty, so it was difficult for them to change the brand completely (there really isn't that much separating different brands of toothpaste, so brand loyalty is very important in the business). Their solution? They renamed the brand \"Darlie\" and changed the minstrel to a generic, ethnically-ambiguous man in a top hat. However, they never did change the name of the brand in Chinese, and true to this trope, soon began running ads explaining that despite the logo and other packaging changes, \"Black Man Toothpaste is still Black Man Toothpaste.\"\n• In their Super Bowl Special ad, Busch Beer proclaims they have a new look, but the same everything else, and even the same sound. Cue said sound taking way too long.\n• Used by the iFuel Interactive blog here.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/NewLookSameGreatTaste", "media_links": [], "non_media_links": ["/pmwiki/pmwiki.php/Main/AdvertisingTrope", "/pmwiki/pmwiki.php/Main/StockPhrase", "/pmwiki/pmwiki.php/Main/NewAndImproved", "/pmwiki/pmwiki.php/Main/Advertising", "http://www.retrojunk.com/details_commercial/1364/", "http://dolejuice.com/images/ImgHomeToutNew.jpg", "http://www.ltoverseas.com/Upload/MediaCenter/1Daawat%20Super.jpg", "http://www.gustafsonsdairy.com/v2/Portals/0/images/newLook.jpg", "https://www.thebrandingjournal.com/2015/05/what-to-learn-from-tropicanas-packaging-redesign-failure/", "https://en.wikipedia.org/wiki/Darlie", "/pmwiki/pmwiki.php/Main/ModernMinstrelsy", "/pmwiki/pmwiki.php/Main/SuperBowlSpecial", "/pmwiki/pmwiki.php/Main/OverlyLongGag", "/pmwiki/pmwiki.php/Main/WebOriginal", "http://blogs.ifuelinteractive.com/", "http://blogs.ifuelinteractive.com/2010/03/29/notice-anything-different/"]}