{"title": "Perpetually Shiny Bodies", "content": "In a lot of comic books, characters that are supposed to have particularly \"tight\" bodies will be depicted as having a constant high-gloss on their exposed skin, even when they're supposed to be completely dry. This could be to emphasize their smooth skin, or to draw more attention to a woman's bosom or legs. If done well, it will give the impression of youthful elasticity and sturdiness. If overdone, it might lead to characters looking more like inflatable dolls, which might or might not be the desired effect.\n• An episode of Excel Saga parodied fanservicey anime by turning up the contrast and brightness of the show to achieve this effect.\n• Masamune Shirow (example pictured above) became the absolute master of this trope when he started drawing highlights on his characters with Color Dodge layers in Photoshop. Before he learned that technique, his characters came off with sort of a slightly burnt skin appearance that was still just as sexy. One of his erotic series is called \"Galgrease,\" due to the high levels of shiny.\n• The works of Satoshi Urushihara. Urushi is a sort of Japanese lacquer.\n• Most DC and Marvel characters have undergone this, depending on the artist. Especially the female ones.\n• The Stormy Knight version of Phantom Lady displayed this a lot in the mid-2000s version of Freedom Fighters. This was particularly notable since the artist didn't do this to any other character in the comic, leading to a fan theory that she was actually an Auton.\n• Mods for The Elder Scrolls and Bethesda's Fallout games are infamous of this trope.\n• WWE Day of Reckoning for the Nintendo GameCube went too far overboard with this look, leading to criticisms that created wrestlers (and their outfits) looked overly glossy to the point that they resembled action figures more than people. The next game in that series dialed it back and some newer wrestling games have a sliding bar that lets you adjust the oiled-up look yourself, from zero shine to so much gloss that wrestlers seem to give off more light than they reflect.\n• All the playable characters in the Updated Re-release of Sonic Adventure for the Nintendo GameCube, as well as everybody in Sonic Heroes.\n• The Fabulous Custodes in If the Emperor Had a Text-to-Speech Device are perpetually oiled up, as befits their Macho Camp and Stripperiffic look. The Emperor is less than amused, threatening to toss a match at them. Whammudes in particular has oiled himself up to such extents that he can slide around faster than he can walk. \"The sensation of friction is all but LOST on me!\"\n• The Order of the Stick parodied this in the strip introducing the gladiators. You will remain stripped to the waist with your muscles oiled at all times, for no apparent purpose. See the oil steward if your skin becomes dry for any reason.\n• The works of DP Ragan, particularly due to his tendency to go for Dressed All in Rubber as well.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/PerpetuallyShinyBodies", "media_links": ["/pmwiki/pmwiki.php/Creator/ShirowMasamune", "/pmwiki/pmwiki.php/Anime/ExcelSaga", "/pmwiki/pmwiki.php/Creator/MasamuneShirow", "/pmwiki/pmwiki.php/Creator/DCComics", "/pmwiki/pmwiki.php/Creator/MarvelComics", "/pmwiki/pmwiki.php/ComicBook/PhantomLady", "/pmwiki/pmwiki.php/ComicBook/FreedomFighters", "/pmwiki/pmwiki.php/Series/DoctorWho", "/pmwiki/pmwiki.php/Franchise/TheElderScrolls", "/pmwiki/pmwiki.php/Creator/Bethesda", "/pmwiki/pmwiki.php/VideoGame/Fallout", "/pmwiki/pmwiki.php/VideoGame/SonicAdventure", "/pmwiki/pmwiki.php/VideoGame/SonicHeroes", "/pmwiki/pmwiki.php/Webcomic/TheOrderOfTheStick", "/pmwiki/pmwiki.php/Creator/DPRagan"], "non_media_links": ["/pmwiki/pmwiki.php/Main/ShesGotLegs", "/pmwiki/pmwiki.php/Main/UncannyValley", "/pmwiki/pmwiki.php/Main/FanService", "/pmwiki/pmwiki.php/Main/AnimeAndManga", "/pmwiki/pmwiki.php/Main/MeaningfulName", "http://en.wikipedia.org/wiki/Japanese_lacquerware", "/pmwiki/pmwiki.php/Main/ComicBooks", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/UsefulNotes/NintendoGameCube", "/pmwiki/pmwiki.php/Main/UpdatedRerelease", "/pmwiki/pmwiki.php/UsefulNotes/NintendoGameCube", "/pmwiki/pmwiki.php/Main/WebAnimation", "/pmwiki/pmwiki.php/WebAnimation/IfTheEmperorHadATextToSpeechDevice", "/pmwiki/pmwiki.php/Main/MachoCamp", "/pmwiki/pmwiki.php/Main/Stripperiffic", "/pmwiki/pmwiki.php/Main/WebComics", "http://www.giantitp.com/comics/oots0736.html", "/pmwiki/pmwiki.php/Main/DressedAllInRubber"]}