{"title": "Man Versus Machine", "content": "And that's how you cause a bandwidth bottleneck.\n\nLadies and Germs, in this corner, we have a man. A pathetic pile of a meatbag, with skin completely incapable of preventing major lacerations. Loaded with pain receptacles that will severely dampen his ability to keep up in an environment where the hurt will lay into them endlessly and mercilessly. Only the human spirit can give this pathetic creature any hope for survival.\n\nAnd in this corner, we have the automaton. Perfect in every conceivable way, invulnerable to the wear and tear so common in humans, working tirelessly as long as it can maintain a power source. The machine has no sense of remorse or mercy and will do whatever is commanded of it to the bitter end. Alas, the machine lacks one thing — Love.\n\nWho will win? Well, that's a question for the plot. Given that good guys almost always succeed, bet on that horse first — but more often than not it's the human we're supposed to be rooting for. Since God help us if the robot revolution comes and they really are better than us.\n\nInterestingly, the machines will sometime be said to \"never get ill\" and \"never age\". If that were true, there would be no need for repairmen nor scrapyards. This generally gets a pass because a machine sufficiently advanced to challenge man would by definition be capable of self-maintenance and, likely, self-improvement to the point it would outlast anything built by man.\n\nSee Rock Beats Laser for this concept applied more broadly to technological disparities in general. This trope is concerned primarily with the struggle of human characters against robots specifically.\n\nAn often necessary part of the Robot War.\n• Magnus Robot Fighter provides the trope image, and its premise is Exactly What It Says on the Tin.\n• The Matrix shows this as the aftermath of the Robot War. The humans firmly believe that the use of their own human spirit is the only thing separating them from the machines, and is the only real advantage they have.\n• Terminator is a franchise entirely about humans fighting to save themselves from extinction by robots.\n• In Rocky IV, Rocky trains by doing manual labor in the snow and exercising in a barn. Ivan Drago trains in a lab surrounded by high-tech devices and monitored by scientists. Rocky wins the fight since he has \"heart\".\n• The classic John Henry story is what pioneered this trope. While he won in the end, he died from exertion while the machine could do it all over again the next day.\n• And it was averted humorously in the Transformers: Hearts of Steel miniseries - where the steam drill suddenly stood up and said (effectively) \"We don't have to challenge each other - why don't we be friends, instead? My name is Bumblebee!\"\n• Paul Bunyan and Babe the Blue Ox get in on the act, too, when they go up against the mechanized saw in a tree-cutting contest. Interestingly, Paul lost (by a quarter of an inch, in Walt Disney's version), and headed for the Alaskan wilderness when he realized the age of the lumberjack was drawing to a close. In other versions of the story Paul actually won, but left anyway since he realized that age and mileage would only slow him down, whereas the mechanized saw would be tweaked and upgraded and become better and better with time.\n• /Bill Door versus the combine harvester in Reaper Man, though this is a slightly unfair one, given the whole anthropomorphic personification of Death thing...\n• Not really... so is the Combine. Also, reaps one stalk at a time.\n• The John Henry legend is spoofed in Dave Barry in Cyberspace, which tells a story of the first computer ever built that Dave Barry was definitely making up: The man responsible was inventor Elias Smurton, who in 1807 built his revolutionary steam-powered computer, the Data Belle, which featured a fourteen-ton floppy diskette that required forty men and a team of horses to insert. Seeking to publicize his invention, Smurton staged a computing contest between his machine and one of the leading mathematicians of the day, John \"Henry\" LaFromage. In a dramatic demonstration of the awesome potential of automated data processing, the human competition was literally \"blown away\" when the Data Belle, attempting to add 2 and 7, exploded with such force that what was believed to be LaFromage's pancreas was found nearly four miles away. Clearly, nobody was going to stand in the way of this amazing new technology.\n• In another instance, he claims Deep Blue won chess games against human grandmasters via the unusual strategy of applying several thousand volts through their bodies.\n• A similar reason is suggested as the reason computer scientists claim computers will never rise up against humanity.\n• Legends of Dune in the Butlerian Jihad humanity was enslaved by the Thinking Machines, they overthrew the machines and banned anything similar to an AI. Later in the sequels the Thinking Machines are back and they're out for revenge against the humans.\n• Battlestar Galactica (2003) has this as an explicit ongoing theme, with humans relying on chunky old-fashioned machines with a lot of manual controls. The Cylons, by contrast, are robots with incredibly sexy starships.\n• Spoofed in Mystery Science Theater 3000 episode Time Chasers: Near the end of the film, the protagonist is climbing down a tree to get away from a crashed light aircraft that's threatening to fall on him Very reminiscent of Jurassic Park , which is indeed lampshaded . The MST crew identifies this as an example of Man Versus Machine - and immediately begin cheering \"Goooo machine!\"\n• How I Met Your Mother:\n• In one episode, every member of the group think that they have the fastest way to get across town (bus, subway, faking a heart attack to steal a ride on an ambulance, cab etc...). Marshall claims that he can run the whole seven miles faster than any machine. To his credit, everyone gets to the half-way point at the exact same time, meaning he backed up his claim fairly well. However, he only makes it another mile or two before he collapses on the sidewalk out of exhaustion, confessing that his bravado was really about being worried he might not be able to get his wife pregnant.\n• In the season 3 finale of Unbreakable Kimmy Schmidt, Kimmy competes with a robot to see who can be a better crossing guard. She wins, but the police department discovers that she's a married to a registered sex offender, so she can't be around children.\n• Acted out on several occasions on Top Gear, pitting one (or more) of the presenters in a car against one of the others using some form of muscle powered transport, either on its own or as part of a wider array of options. Several examples include Car vs Dog sled (result: Car, but it was close due to the car getting stuck in a field of ice boulders that the dog sled handled much better), Car vs Public Transport vs Bicycle vs Speed Boat across London (result: Speed Boat, followed by Bicycle, followed by Public Transport and the Car dead last) or Car vs Bicycle vs Hovercraft vs Public Transport across St Petersburg (result: Car with Bicycle and Hovercraft in a dead heat and Public Transport a Did Not Finish as the Stig got lost).\n• GURPS Reign Of Steel has the tagline \u0093The war is over. The robots won\u0094. The PCs are (usually) La Résistance in the ensuing Crapsack World.\n• The classic OGRE board game pitches a single gigantic robot tank \u0097 the Ogre \u0097 against a human Standard Sci-Fi Army, in a fair fight.\n• Sonic the Hedgehog CD has Sonic being pitted against Dr. Robotnik's latest creation, his Evil Knockoff Metal Sonic. Sonic defeats him in a race in the Stardust Speedway level. They later have a similar duel in Sonic the Hedgehog 4: Episode II.\n• Team Fortress 2's August 2012 update introduced a cooperative game mode aptly titled \"Mann Vs. Machine\" where the RED team squares off against robot knockoffs of the game's classes, created by Redmond and Blutarch Mann's long lost brother Gray Mann.\n• No Evil provides the setup for this when Paula challenges an Institute researcher with a jackhammer to see who can mine more copper, only for the townspeople to object that they're violating the terms of their agreement.\n• The TaleSpin episode \"From Here to Machinery\" has an inventor introducing the Auto-Aviator, a robot pilot. To much fanfare, Baloo competes with the Auto-Aviator in a race; unfortunately, he loses to the tireless machine, with devastating results as the successful demonstration puts the Auto-Aviator in the limelight and many pilots out of a job. However, it turns out that the Auto-Aviator has a crushing weakness: its inability to deviate from its flight plan under any circumstances, even when the plane is in danger, and Shere Khan's own plane, piloted by one of the machines, ends up flying right into an Air Pirate attack. In the end, Baloo saves the day, and Shere Khan sees that the inventor is left peddling his robots in the frozen wastes of Thembria.\n• The My Little Pony: Friendship Is Magic episode \"The Super Speedy Cider Squeezy 6000\" features the Apple family and their old-fashioned cider-making ways pitted against the Flim-Flam Brothers and their eponymous magic-powered mechanical cider press. The stakes are the rights to sell cider in Ponyville, the loss of which would force the Apples into debt and off their farm. The Flim-Flam brothers win, but no one wants to drink the cider they made because they cut so many corners in order to win the contest, and they end up leaving town in a hurry, effectively forfeiting the contest.\n• The SpongeBob SquarePants episode \"SpongBob Vs. the Patty Gadget\" has Squidward obtaining a machine that creates Krabby Patties and challenging SpongeBob for his job. SpongeBob wins when Squidward cranks the machine too high and it overloads.\n• Courage the Cowardly Dog had such an episode (\"Courage vs. Mecha-Courage\") where Courage ended up going up against his robotic doppelganger in a contest. The maker intended to prove the robot dog was 'better' and... he was. The one thing it lacked, however, was Courage's tenacity. In the end, it finally broke down, leaving Courage, battered and bruised, the winner by default.\n• In one episode of CJ the DJ, CJ has to win a DJing contest against a robotic DJ.\n• In one between-episode skit on Johnny Bravo, Johnny is in a chess match with a chess-playing robot. His constant stream of stupidity quickly causes it to overload.\n• John Henry and the Inky-Poo is a stop-motion version of the John Henry legend in which John Henry takes on a steam hammer. This animated short departs from the most common versions of the legend by making John Henry a giant Paul Bunyan-style, and by having him hammering railroad spikes instead of steel drills.\n• In Peter and the Magic Egg, Tinwhiskers challenges Peter to a plowing contest, but it's just so he can make him fall down a pit.\n• Gary Kasparov versus Deep Blue in Chess. Though as someone noted, humans programmed Deep Blue and Kasparov had electronic assistance himself and it might be more accurate to call it Chessmaster versus Techno Wizard.\n• Some years later, IBM's Watson was put on Jeopardy! against two human champions including Ken Jennings He of the 75-day winning streak . The computer cleaned their clocks, and in the last Final Jeopardy, Jennings wrote as his response \"I for one welcome our new computer overlords.\"\n• Flash forward to 2017, and Google's AlphaGo program, designed to play Go, defeated Ke Jie, the world's No. 1 ranked player with 3 wins and 0 losses, after defeating the European champion in 2015 and the Korean champion in 2016. As a result, AlphaGo was awarded an honorary professional 9-dan rank, the highest rank in Go, by the official Go associations in Korea and China. In a case of There Is No Kill Like Overkill, AlphaGo was challenged to 57 other matches by other professional Go players at the Future of Go Summit and remained undefeated.\n• And now, OpenAI has bested Danil \"Dendi\" Ishutin, widely considered to be the best professional Dota2 player, and inarguably the best midlaner, in a One-on-one Shadow Fiend Mirror Match, moving the \"AI vs Pros\" contest out of mathematically solvable games and into modern real-time ones.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/ManVersusMachine", "media_links": ["/pmwiki/pmwiki.php/ComicBook/MagnusRobotFighter", "/pmwiki/pmwiki.php/VideoGame/SystemShock", "/pmwiki/pmwiki.php/ComicBook/MagnusRobotFighter", "/pmwiki/pmwiki.php/Franchise/TheMatrix", "/pmwiki/pmwiki.php/Franchise/Terminator", "/pmwiki/pmwiki.php/Film/RockyIV", "/pmwiki/pmwiki.php/Myth/PaulBunyan", "/pmwiki/pmwiki.php/Creator/WaltDisney", "/pmwiki/pmwiki.php/WesternAnimation/MiscellaneousDisneyShorts", "/pmwiki/pmwiki.php/Creator/DaveBarry", "/pmwiki/pmwiki.php/Literature/LegendsOfDune", "/pmwiki/pmwiki.php/Literature/HuntersSandwormsOfDune", "/pmwiki/pmwiki.php/Series/BattlestarGalactica2003", "/pmwiki/pmwiki.php/Series/MysteryScienceTheater3000", "/pmwiki/pmwiki.php/Film/TimeChasers", "/pmwiki/pmwiki.php/Franchise/JurassicPark", "/pmwiki/pmwiki.php/Series/HowIMetYourMother", "/pmwiki/pmwiki.php/Series/UnbreakableKimmySchmidt", "/pmwiki/pmwiki.php/Series/TopGear", "/pmwiki/pmwiki.php/TabletopGame/GURPSReignOfSteel", "/pmwiki/pmwiki.php/TabletopGame/OGRE", "/pmwiki/pmwiki.php/VideoGame/SonicTheHedgehogCD", "/pmwiki/pmwiki.php/VideoGame/SonicTheHedgehog4", "/pmwiki/pmwiki.php/VideoGame/TeamFortress2", "/pmwiki/pmwiki.php/WesternAnimation/TaleSpin", "/pmwiki/pmwiki.php/WesternAnimation/MyLittlePonyFriendshipIsMagic", "/pmwiki/pmwiki.php/WesternAnimation/SpongeBobSquarePants", "/pmwiki/pmwiki.php/WesternAnimation/CourageTheCowardlyDog", "/pmwiki/pmwiki.php/WesternAnimation/CJTheDJ", "/pmwiki/pmwiki.php/WesternAnimation/JohnnyBravo", "/pmwiki/pmwiki.php/WesternAnimation/JohnHenryAndTheInkyPoo", "/pmwiki/pmwiki.php/Myth/PaulBunyan", "/pmwiki/pmwiki.php/WesternAnimation/PeterAndTheMagicEgg", "/pmwiki/pmwiki.php/TabletopGame/Chess", "/pmwiki/pmwiki.php/Series/Jeopardy", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/TabletopGame/Go", "/pmwiki/pmwiki.php/VideoGame/Dota2"], "non_media_links": ["/pmwiki/pmwiki.php/Main/LadiesAndGerms", "/pmwiki/pmwiki.php/Main/ThePowerOfLove", "/pmwiki/pmwiki.php/Main/MostWritersAreHuman", "/pmwiki/pmwiki.php/Main/RequiredSecondaryPowers", "/pmwiki/pmwiki.php/Main/RockBeatsLaser", "/pmwiki/pmwiki.php/Main/RobotWar", "/pmwiki/pmwiki.php/Main/ExactlyWhatItSaysOnTheTin", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/RobotWar", "/pmwiki/pmwiki.php/Main/NatureHero", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/HeartIsAnAwesomePower", "/pmwiki/pmwiki.php/Main/ButNowIMustGo", "/pmwiki/pmwiki.php/Main/EndOfAnAge", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Discworld/ReaperMan", "/pmwiki/pmwiki.php/Main/EvilKnockoff", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/LampshadeHanging", "/pmwiki/pmwiki.php/Main/TokenEvilTeammate", "/pmwiki/pmwiki.php/Main/TabletopGames", "/pmwiki/pmwiki.php/Main/LaResistance", "/pmwiki/pmwiki.php/Main/CrapsackWorld", "/pmwiki/pmwiki.php/Main/StandardSciFiArmy", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/EvilKnockoff", "/pmwiki/pmwiki.php/Main/ExactlyWhatItSaysOnTheTin", "/pmwiki/pmwiki.php/Main/LongLostRelative", "/pmwiki/pmwiki.php/Main/WebAnimation", "/pmwiki/pmwiki.php/WebAnimation/NoEvil", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/ReassignedToAntarctica", "/pmwiki/pmwiki.php/Main/GrimUpNorth", "/pmwiki/pmwiki.php/Main/Ruritania", "/pmwiki/pmwiki.php/Main/Magitek", "/pmwiki/pmwiki.php/Main/PyrrhicVillainy", "/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/Main/TheChessmaster", "/pmwiki/pmwiki.php/Main/TechnoWizard", "/pmwiki/pmwiki.php/Main/MemeticMutation", "/pmwiki/pmwiki.php/Main/TheNewTens", "https://en.wikipedia.org/wiki/AlphaGo", "/pmwiki/pmwiki.php/Main/ThereIsNoKillLikeOverkill", "https://blog.openai.com/dota-2/", "https://www.youtube.com/watch?v=92tn67YDXg0", "/pmwiki/pmwiki.php/Main/MirrorMatch"]}