{"title": "Shooting At Your Own Projectiles", "content": "Characters demonstrate Improbable Aiming Skills by shooting bullets at their own bullets, grenades, or some object launched beforehand. Examples include:\n• The Gunslinger is against a Heavily Armored Mook without any armor-piercing or Anti-Armor Trick Bullets. With only regular bullets, the gunslinger fires a bullet that lodges itself into the armor, then repeats with a volley of shots on that first bullet that constantly hammers it to the point of breaking the armor.\n• A character throws a grenade or explosive and then fires at it to immediately detonate it.\n\nCompare Puppet Gun, Splitting the Arrow, and Shoot the Bullet.\n• JoJo's Bizarre Adventure: Vento Aureo:\n• Early in Mista's fight with Sale, Mista manages to shoot his opponent in the head. Unfortunately for Mista, Sale's Stand, Kraft Work, stops the bullet's momentum, which leaves it lodged in Sale's skull while Sale himself is otherwise unharmed and able to keep going. Mista's finishing move in that fight is to shoot a second bullet into the exact same bullet hole, causing the second shot to hit the first and drive it even deeper into Sale's brain.\n• With Giorno's help, Mista shoots a metal bolt with a bullet that launches the former into the head of Ghiaccio, who is protected by his Stand White Album. Mista then fires more bullets at the bolt to knock Ghiaccio unconscious.\n• Dungeon Keeper Ami: Ami throws a hydrogen gas canister, then follows with a fire spell, to make a large hydrogen explosion.\n• Star Trek: Voyager: In the episode Workforce part 2, the Emergency Command Hologram disables some alien ships by firing a torpedo at them and then shooting the torpedo with a phaser beam to create a \"photonic shockwave\".\n• When the wedding during Crisis on Earth-X is crashed, as H.R. Wells is helping to evacuate the non-super guests, the Dark Archer (in reality, Oliver's Earth-X doppleganger) fires an arrow at him, Oliver shoots the arrow out of the air, in the .25 seconds since being fired.\n• Xenosaga has Junior, whose Storm Waltz attack consists of throwing a bunch of coins in the air before unloading his Guns Akimbo pistols at them to ricochet the bullets into his foes.\n• Overwatch\n• In Ashe's debut short film, \"Reunion\", her archnemesis McCree picks up a belt of grenades and tosses them at her, shooting them to cause an explosion and gain the upper hand against Ashe and her gang.\n• Ashe's own ability kit involves throwing a bundle of dynamite at enemies, which she can detonate prematurely by shooting it at any time.\n• Marvel vs. Capcom 3\n• Chris Redfield has a special move where he throws his grenade. It can be shot with his gun mid-flight to detonate it remotely.\n• Rocket Raccoon has a move where he throws an oil bomb out. Normally it leaves an Oil Slick on the ground, but he can also shoot the bomb with his gun to make it explode.\n• Unreal Tournament:\n• The shock rifle's alternate fire mode shoots slow-moving energy balls. Shooting one of these balls with the Hitscan beam that is the shock rifle's primary fire causes a powerful explosion.\n• Unreal Tournament 2004 and Unreal Tournament III have the Hellbender vehicle's Skymine Combo, which works the same as the Shock Rifle's but also trigger a chain explosion if other skymine cores are in proximity. In 2004 there's a dedicated seat for the Skymine weapon, but in III it's the driver's weapon.\n• In the Unreal Championship 2: The Liandri Conflict incarnation of the Shock Rifle, the Core can be frozen mid-air for a combo trap.\n• Unreal II: The Awakening:\n• Unignited napalm from the Flamethrower can be ignited with the alternate fire of the Shotgun, an incendiary grenade from the Grenade Launcher, or the Flamethrower's primary fire.\n• Firing the biomass (the alternate fire of the Spider Gun) with a steady stream of primary fire blobs, instead of a spidermine trap, spawns a medium spider that follows the player and attacks the player's enemies.\n• Warframe\n• Tenno have to throw canisters of depleted thermia at the iced-over vents of the Exploiter Orb and shoot the canisters to melt away the ice protecting the Orb's delicate parts.\n• The Quanta and its variants' Alternate Fire launches a cube that can be detonated with any weapon afterwards.\n• The Simulor and Synoid Simulor fire small orbs of energy that can be combined together when fired at each other to become more powerful.\n• Mega Man X3 The X-Buster Upgrade enables X to charge up and fire two fully-charged Buster shots in succession. If he fires quickly enough, he can hit the first shot with the second, combining the two into a huge blast that covers most of the height of the screen.\n• Devil May Cry 4: In one mission, Dante throws Yamato towards The Savior's heart, then fires his guns' bullets towards it so the sword could enter its body fully.\n• Nexuiz / Xonotic: Shooting the balls from the Electro Gun with the primary fire (a beam) causes a chain reaction of the nearby balls.\n• Persona 5: In Royale, Skull and Fox have a tag team attack that ends with Skull throwing a grenade at the enemy and Fox shoots it to detonate it.\n• Robin Hood: While in an archery competition against The Sheriff of Nottingham, Robin Hood fires an arrow at a target. However, due to the sheriff cheating, the arrow ends up being misguided. In quick response, Robin fires another arrow to send the original back on course and win the competition.\n• An episode of M.A.S.K. has Miles Mayhem using a gravity increasing ray mounted on the Switchblade. The ray has the side effect of generating a force field and Matt is unable to hit him with the Thunder Hawk's lasers. His solution: fire the Thunder Hawk's missiles at him and shoot the missiles. The concussion throws Mayhem off balance enough to retreat.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/ShootingAtYourOwnProjectiles", "media_links": ["/pmwiki/pmwiki.php/Manga/JojosBizarreAdventureVentoAureo", "/pmwiki/pmwiki.php/Series/StarTrekVoyager", "/pmwiki/pmwiki.php/VideoGame/Xenosaga", "/pmwiki/pmwiki.php/VideoGame/MarvelVsCapcom3", "/pmwiki/pmwiki.php/VideoGame/UnrealTournament", "/pmwiki/pmwiki.php/VideoGame/UnrealTournament2004", "/pmwiki/pmwiki.php/VideoGame/UnrealTournamentIII", "/pmwiki/pmwiki.php/VideoGame/UnrealChampionship2TheLiandriConflict", "/pmwiki/pmwiki.php/VideoGame/UnrealIITheAwakening", "/pmwiki/pmwiki.php/VideoGame/Warframe", "/pmwiki/pmwiki.php/VideoGame/MegaManX3", "/pmwiki/pmwiki.php/VideoGame/DevilMayCry4", "/pmwiki/pmwiki.php/VideoGame/Nexuiz", "/pmwiki/pmwiki.php/VideoGame/Xonotic", "/pmwiki/pmwiki.php/VideoGame/Persona5", "/pmwiki/pmwiki.php/Disney/RobinHood", "/pmwiki/pmwiki.php/WesternAnimation/MASK"], "non_media_links": ["/pmwiki/pmwiki.php/Main/ImprobableAimingSkills", "/pmwiki/pmwiki.php/Main/TheGunslinger", "/pmwiki/pmwiki.php/Main/HeavilyArmoredMook", "/pmwiki/pmwiki.php/Main/ArmorPiercingAttack", "/pmwiki/pmwiki.php/Main/AntiArmor", "/pmwiki/pmwiki.php/Main/TrickBullet", "/pmwiki/pmwiki.php/Main/ImprovisedScattershot", "/pmwiki/pmwiki.php/Main/PuppetGun", "/pmwiki/pmwiki.php/Main/SplittingTheArrow", "/pmwiki/pmwiki.php/Main/ShootTheBullet", "/pmwiki/pmwiki.php/Fanfic/DungeonKeeperAmi", "/pmwiki/pmwiki.php/Recap/StarTrekVoyagerS7E15Workforce", "/pmwiki/pmwiki.php/Recap/Supergirl2015S3E8CrisisOnEarthXPart1", "/pmwiki/pmwiki.php/Main/TheGunslinger", "/pmwiki/pmwiki.php/Main/GunsAkimbo", "/pmwiki/pmwiki.php/Videogame/Overwatch", "/pmwiki/pmwiki.php/Main/OilSlick", "/pmwiki/pmwiki.php/Main/HitScan", "/pmwiki/pmwiki.php/Main/AlternateFire", "/pmwiki/pmwiki.php/Main/KatanasAreJustBetter", "/pmwiki/pmwiki.php/Main/AttackOfTheFiftyFootWhatever", "/pmwiki/pmwiki.php/Main/WesternAnimation"]}