{"title": "Baseless Mission", "content": "Typically in strategy games you are given or have to build a base, so that you can have an endless supply of units as long as you have access to resources, and you can rebuild destroyed buildings.\n\nHowever, in this mission, usually a campaign mission, you don't get such a luxury.\n\nYou get a handful of units, and you must accomplish your goals without losing all of them.\n\nSuch a mission typically includes most of these elements:\n• The premise is that you are behind the enemy lines, fleeing from somebody, or exploring a new territory.\n• At least one of your soldiers is a Hero Unit, if the game includes them.\n• You lose the mission if you lose your whole army or - usually - the hero.\n• Reinforcements are acquired at certain milestones during the mission, be they found, rescued or hired.\n• You may get the base back halfway through the mission, have extremely limited resources to work with, or have the ability to capture parts of the enemy's base.\n• These missions typically become That One Level if the game is not suited for tactical combat well or the amount of units given isn't enough to deal with enemies.\n• Warcraft:\n• Warcraft: Orcs and Humans has several campaign missions like this.\n• Warcraft II: There are a total of six such missions in the vanilla game and its expansion.\n• In mission 6 of the Orc campaign, you escort a moderately-sized band of orcs and trolls led by Cho'gall to a certain location.\n• In mission 9 of the Human campaign, you receive a full army and navy in order to escort Uther Lightbringer across the map.\n• In the expansion, the first mission of each campaign gives you no peasants (although you do have access to a handful of buildings and the upgrades that can be purchased from them).\n• The seventh human mission in the expansion does give you peasants, but they can't build any military structures; and the ninth orc mission again has no peons, only a few buildings scattered across the map and a finite amount of resources to buy the upgrades from them.\n• Frequent in Warcraft III, where you usually get to play as a main hero of the current campaign plus a handful of units. There are some variations in The Frozen Throne, however:\n• The fifth Night Elf mission starts with a base and workers, but the base is heavily damaged and you have no gold mine. You need Malfurion and Tyrande to fight their way to Maiev's base before being able to claim a gold mine.\n• In the final Blood Elf mission, you have no workers but you have access to most Blood Elf and Naga military structures. To get resources to train more units, you have to find resources scattered in the Black Temple.\n• The first Undead mission has you managing three factions with only a Crypt (and access to Ghouls only) and another military structure (Slaughterhouse for Arthas and a Temple of the Damned for Necromancers for Kel'thuzad and Banshees for Sylvansa), as well as no workers, but resources are practically infinite.\n• The whole Orc campaign is RPG-style.\n• Starcraft I: Each campaign in both the vanilla game and the expansion pack has several missions like this. (Specifically, Terran mission 4, Zerg mission 5, and Protoss mission 6 in the original game; Protoss missions 1 and 5, Terran missions 2 and 7, Zerg mission 1, and the bonus mission in Brood War.) They typically require careful micro-management as there is no easy way to heal your units. These missions are often referred to as \"installation missions\" as they usually take place on maps made from the Installation tileset. Tangentially, said tileset has no tiles which allow placement of buildings.\n• Starcraft II: The baseless missions in Wings of Liberty, the first game in the Starcraft II trilogy, are considerably less frustrating than its predecessor's, and only one (the first mission) is mandatory for a given playthrough, although there are six in total. Most normal missions are tailor-built for showing off a new unit, and disallowing production of a new toy is likely not considered a sound design choice.\n• The second game in the trilogy, Heart of the Swarm has three mandatory missions with Kerrigan and a small squad that periodically receives reinforcements, and one mission with a Brood Mother who can spawn additional units without a base. But since Kerrigan levels up RPG-style throughout the campaign it's not as difficult. There are also segments of missions that are baseless, like the second-to-last alternates between baseless infiltration and destruction of power nodes, and building up units to swarm the enemy base while the protective field is down.\n• A staple trope of Command & Conquer series, encountered at least once in each installment. Each hero got at least one mission dedicated to him or her. Often doubles as Stealth-Based Mission.\n• Any of these missions from Tiberian Dawn apparently expected you to literally take on a base by yourself, making them quite Nintendo Hard. Some others would have you start as lone units and find your base, usually deprived of a Construction Yard. Later iterations would always add some sort of script or conveniently placed barrels to help you through the level.\n• In addition to standard hero-based missions, Red Alert has an interesting example in a Soviet mission where you start with three psi-soldiers and need to make your way through an extremely heavily guarded base to mind-control the U.S. President. The level is built like a puzzle with a bunch of different approaches: you can acquire barracks to build spies and disable the energy supply, control a sniper, a tank, kill said tank with the sniper to get instant veterancy, and more.\n• The series's flagship vehicle, the Mobile Construction Vehicle, gets a lot of play with these; many missions require the player to clear a landing zone or otherwise deal with a minor enemy force before deploying their MCV and expanding into a traditional mission. Sometimes, this was little more than an excuse to showcase some new units or see a bit of scripted combat, but other times it would be a full-blown Escort Mission.\n• You get to play as the main character exclusively in Impossible Creatures' campaign.\n• Empire Earth did that with Middle Ages campaign.\n• Age of Empires has at least one baseless mission in each campaign of every game, by starting you off with no Town Center and no Villagers to build one. Several missions also have you start without a base and require you build one from scratch.\n• Age of Empires has The Great Hunt and Caravan in Voices of Babylon.\n• Age of Empires II has all but one campaign in the original version, The Age of Kings, start without a base. You start Joan of Arc with just Joan and a ragtag band of supporters, and while your army increases, you never get to build a base. The second-to-last mission in the same campaign has you take Paris with a sizeable but non-replenishable army. The first Mongol mission is particularly developed, as you need to perform sidequests for the various tribes around the map to earn their allegiance as well as reinforcements. The first mission of Saladin has you lead a large army through Cairo. The Emperor's March, the fifth mission of Barbarossa (the only campaign not to start without a base), has you lead a large army through the middle east to wage the Third Crusade. The Battle of the Conquerors in The Conquerors expansion, has Agincourt, where you lead Henry V's army back to England and although you can convert villagers, you do not have the resources to start a base (unless you use resource cheats or exploit a small bug Use four villagers to collect wood, then build a farm, which will deposit the wood in your inventory, allowing you to build a lumber camp and collect more wood ).\n• Occurs with frequency in Age of Mythology, even in The Titans expansion. Notable examples include the one where your entire force is turned into pigs, the siege on Mount Olympus, and the multiple missions in the Underworld, all without access to a Town Center. The Norse and Atlanteans are able to get around this trope by way of their military units being able to construct buildings, meaning that outside of resources, they don't need a Town Center.\n• Warzone 2100 had two types of missions in its campaign mode: One involved searching the map, collecting your usual resources and expanding your base while fighting off enemy units and completing mission objectives. The other were \"transport\" missions where you loaded an air transport with a set number of units to accomplish mission objectives on a completely different map. You were, however, generally allowed to review your base's production/research schedules and arrange reinforcements from home base, with the catch that said reinforcements would often take quite a while to arrive.\n• Metal Fatigue had a level where you only had one combot and no base and had to heal it by scavenging spare parts.\n• Heroes of Might and Magic IV introduced these into its series in some campaign missions where you were just given a hero or several and no towns, and HOMM V followed suit. In previous games, you always lost the game in a week after all your towns were captured, though some missions started you off with no towns (making the first objective 'capture a town within seven days').\n• Several missions in State of War let you start with a handful of units and nothing else. Some of them let you capture enemy factories and win as usual, other (like escort missions) don't give you that luxury.\n• Inversion: mission in Greece gives you a base but no means of acquiring unit factories - you have to win by building lots and lots of towers.\n• World in Conflict doesn't have a base per se (only stationary drop zones) but most campaign missions restrict your ability to call in reinforcements at some point. There are two missions in the vanilla game where this is played straight, however:\n• In the first American mission you use a handful of squads to fight the invasion in Seattle. About halfway through you get access to the National Guard depot, however, which gives you an APC that gets replaced for free if it's destroyed.\n• In the eleventh American mission you start with only repair tanks, and have to let your AI escort do most of the fighting until you can salvage some vehicles. While technically an Escort Mission, the emphasis is on deft micro-management and clever use of support abilities.\n• Ground Control (also by Massive Entertainment, developers behind World In Conflict) is functionally baseless as well. Instead, you assemble groups of units prior to the start of every mission, loading up dropships that can be called in as you secure landing zones. This puts a lot of emphasis on keeping units alive long-term, since they also gain veterancy and become more effective. Non-Entity General is also averted, as one unit you must deploy to most mission sites is your Command APC.\n• The fourth Imperial guard mission in Warhammer 40,000: Dawn of War: Winter Assault is a baseless Escort Mission. The Land Raider you are escorting is exceptionally tough, the incredibly numerous enemies are very weak and the Space Marines get constant reinforcements. You can call in reinforcements yourself at certain points during the mission, but there are enough enemies that the production buildings get cut off when you move past them.\n• The \"Hyperion Peaks\" mission in Dark Crusade is especially hard because of this. Ironically, completing it unlocks the ability to deploy a forward base when attacking other territories.\n• Strangely, the one mission where being baseless would make sense (as it happens underground, and is a stronghold mission, all of which are heavily scripted), is not.\n• Dawn of War II however is (almost) entirely baseless. The single player campaign (up to the Retribution Expansion Pack) consists only of reinforcement points to rally around to bring depleted squads back up to full strength. The multiplayer mode has slightly more in the way of bases, in that each player has a single building as their main base, and can fortify other specific strong points, but these are pretty far removed from traditional base building.\n• Company of Heroes has a few. Mostly involving paratroopers, who have the ability to reinforce their squads anywhere, and could drop new squads with a support power. Since resources were gained by territory control, it was still possible to have income without a base.\n• Battle Zone 1998 and its sequel have several. In the first game, several missions task your squadron to escort a Recycler through Soviet-controlled canyons to the mission end, though thankfully its under your direct control. The sequel has a mission where your Drop Ship is shot down, requiring you to find your Recycler and guide it over an unstable ice-covered lake before it can reach a stable location to deploy into a base. Several mods have baseless missions and often up the ante by making enemies much more aggressive, though they often provide a Service Truck to repair your units damaged in combat.\n• Battle Realms features a handful of missions like this. The campaign's first mission is unique in that Kenji is all by himself and must decide which side to help during a battle to decide his faction affiliation. The defense of The Swan's Pool is another, more infamous example.\n• Star Wars: Galactic Battlegrounds has a great many of these, usually in situations where building a base is absurd in the context of the Star Wars setting and movies - there were not, for example, any opportunities to go for a major human recruiting drive during the Battle of Endor, nor are there any resources to mine on the Avatar Orbital Platform above Kashyyyk.\n• A couple of these appear in the LEGO browser game Cryst Alien Conflict (based on their Mars Mission sets). Fortunately, you typically get some engineers which can take over enemy installations and allow you to produce more units, and there's bound to be a few units stashed away in crates for you to find. Unfortunately, the engineers die in about one hit, and both crates and installations will be guarded by enemy units.\n• Many of the quicker, unscripted missions that can be encountered in the Conquer the World campaign mode of Rise of Nations are of the baseless \"you have a set number of units, go capture/destroy this city/these building/enough enemy units before time runs out\" type. These will usually show up when the territory being fought over is of relatively low infrastructure level. The espionage side missions one can undertake in the Cold War campaign act like these as well, as most are some variation of \"here are a set number of spies and special forces units, go infiltrate/destroy these targets before time runs out\"; one in particular for each side is instigating a popular uprising by infiltrating civilian houses and office buildings which will spawn units, rather than getting units the normal way by ordering them with resources.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/BaselessMission", "media_links": ["/pmwiki/pmwiki.php/VideoGame/Warcraft", "/pmwiki/pmwiki.php/VideoGame/WarcraftOrcsAndHumans", "/pmwiki/pmwiki.php/VideoGame/WarcraftII", "/pmwiki/pmwiki.php/VideoGame/WarcraftIII", "/pmwiki/pmwiki.php/VideoGame/StarcraftII", "/pmwiki/pmwiki.php/VideoGame/StarcraftII", "/pmwiki/pmwiki.php/VideoGame/CommandAndConquer", "/pmwiki/pmwiki.php/VideoGame/ImpossibleCreatures", "/pmwiki/pmwiki.php/VideoGame/EmpireEarth", "/pmwiki/pmwiki.php/VideoGame/AgeOfEmpires", "/pmwiki/pmwiki.php/VideoGame/AgeOfEmpiresI", "/pmwiki/pmwiki.php/VideoGame/AgeOfEmpiresII", "/pmwiki/pmwiki.php/VideoGame/AgeOfMythology", "/pmwiki/pmwiki.php/VideoGame/Warzone2100", "/pmwiki/pmwiki.php/VideoGame/MetalFatigue", "/pmwiki/pmwiki.php/VideoGame/HeroesOfMightAndMagic", "/pmwiki/pmwiki.php/VideoGame/WorldInConflict", "/pmwiki/pmwiki.php/VideoGame/GroundControl", "/pmwiki/pmwiki.php/TabletopGame/Warhammer40000", "/pmwiki/pmwiki.php/VideoGame/DawnOfWar", "/pmwiki/pmwiki.php/VideoGame/DawnOfWar", "/pmwiki/pmwiki.php/VideoGame/CompanyOfHeroes", "/pmwiki/pmwiki.php/VideoGame/StarWarsGalacticBattlegrounds", "/pmwiki/pmwiki.php/Franchise/StarWars", "/pmwiki/pmwiki.php/VideoGame/RiseOfNations"], "non_media_links": ["/pmwiki/pmwiki.php/Main/HeroUnit", "/pmwiki/pmwiki.php/Main/HeroMustSurvive", "/pmwiki/pmwiki.php/Main/ThatOneLevel", "/pmwiki/pmwiki.php/Main/ResourceGatheringMission", "/pmwiki/pmwiki.php/VIdeoGame/StarcraftI", "/pmwiki/pmwiki.php/Main/HiveQueen", "/pmwiki/pmwiki.php/Main/StealthBasedMission", "/pmwiki/pmwiki.php/Main/NintendoHard", "/pmwiki/pmwiki.php/Main/BaseOnWheels", "/pmwiki/pmwiki.php/Main/EscortMission", "/pmwiki/pmwiki.php/Main/EscortMission", "/pmwiki/pmwiki.php/Main/NonEntityGeneral", "/pmwiki/pmwiki.php/Main/ExpansionPack", "/pmwiki/pmwiki.php/Main/EscortMission", "/pmwiki/pmwiki.php/Main/ExpansionPack", "/pmwiki/pmwiki.php/Videogame/BattleZone1998", "/pmwiki/pmwiki.php/Main/EscortMission", "/pmwiki/pmwiki.php/Main/BaseOnWheels", "/pmwiki/pmwiki.php/Main/DropShip", "/pmwiki/pmwiki.php/Main/ShootTheMedicFirst", "/pmwiki/pmwiki.php/Videogame/BattleRealms", "/pmwiki/pmwiki.php/Main/TheHero", "/pmwiki/pmwiki.php/Main/ThatOneLevel", "/pmwiki/pmwiki.php/Main/CrystAlien"]}