{"title": "Reinventing the Wheel", "content": "Real-Time Strategy games often have a mechanism in place for upgrading forces by exchanging resources for various boosts to the abilities of existing units or access to new ones. When scenarios are strung together in a campaign, such upgrades must usually be purchased anew for each scenario, even when it is stated that the player controls the same force in each scenario and they are closely linked chronologically. While it might best be explained as an abstraction of requisitioning components for something, retooling for its production and outfitting one's forces with it, such upgrades are often presented as \"doing research\", so the player is apparently being forced to \"reinvent\" the upgrades many times over.\n\nWhen you finish acquiring these upgrades, some games magically deploy them for free, instantaneously, across all of your forces. Including forces that are far from your base, or even under attack.\n\nIn many ways, this is an Obvious Rule Patch. Allowing upgrades to persist across a campaign lets the player rush up the tech tree in an early campaign, and then steamroller later missions with superior tech. This is particularly easy to abuse if the player can stall by leaving the enemy crippled but still alive, take their time researching everything, and then finish off the enemy, which is equally unrealistic.\n\nSee also You Have Researched Breathing, when you realistically shouldn't have to research the skill in the first place. Compare the Bag of Spilling, where action games take away your equipment between installments or even between levels.\n• In the single-player campaign in Dawn of War, upgrades must be purchased and re-purchased for each scenario. Two of these upgrades supposedly makes the main hero (one particular character featuring in all the scenarios, which take place over a few weeks at most) more experienced and therefore tougher. That is, he begins as standard (excepting other upgrades), becomes more experienced once the relevant upgrades become available and is purchased, loses his experience for the next scenario, repurchases it and so on. Taken to its logical extreme, it would seem that between the scenarios in the campaign all the soldiers forget what they have learned since the beginning of the campaign, and also throw away the fancy gear they have acquired.\n• The Wargear upgrades in the campaigns of the Dark Crusade and Soulstorm expansions are persistent across the campaign missions. The other units' upgrades still have to be re-purchased each mission, though.\n• The Dark Crusade and Soulstorm campaigns also feature two different but equally bizarre versions of this trope. In the former any buildings (and upgrades to buildings) constructed in a province will remain there, and can be used immediately if that province is attacked, but all researches must be re-purchased. In the latter however nothing built or researched while in a province will remain there beyond that mission.\n• In the Dawn of War II campaigns, however, the only upgrades are traits available to individual squads after they increase their level, which remain for the entire campaign.\n• The Homeworld games are an exception to this: The player's space fleet and upgrades purchased are persistent through the entire campaign. This also adds to the difficulty, however: it's equally true that losing too many ships or wasting too many resources in one part of the game may prevent you from successfully completing later missions.\n• Also, the whole tree is not immediately available at the beginning. You gain the ability to research maybe one or two technologies per level, as well as trading for some with alien traders. It's not possible to finish researching the whole tree until about three-quarters of the way through the game.\n• In Cataclysm, you even had to specifically upgrade any ships you improved by research. Smaller ships would dock in the nearest carrier or command vessel, while capital ships performed these upgrades on their own, and were disabled while they took place. Any newly-built ships already came with the new technology installed.\n• The first Command & Conquer games had no \"research\" whatsoever. But Command & Conquer: Generals forces the player to repurchase any and all unit upgrades at the start of each mission.\n• Command & Conquer 3: Tiberium Wars also retained a number of upgrades. Worst of all, those can't be selected over the characteristic sidebar (even though the game already features less the classic sidebar than an easier way to access production buildings).\n• The original Warcraft, ironically, did not do this, at least for spells. One would research a spell in the level it was introduced and then, again, in the next level, but afterwards it would already be equpped on your spellcasters. This was best reflected in levels where you had no buildings.\n• Warcraft III, meanwhile, was all over it in terms of army regulars (things for them that were currently available or already obtained were entirely on an by-mission basis), but your heroes (with all their spells, items, and stats) were persistent.\n• Dungeon Keeper was interesting in this sense; in the first game, you had to have characters research in the library to learn more advanced building forms or spells. They didn't carry over from one mission to the next (most didn't, anyway). However, once researched, a spell would take the form of a small book in your library. But if you later sold your library, there wouldn't be enough space for the spell book, and thus you'd lose the spell! Apparently, it was impossible to take old books with you to a new dungeon... despite that imps can carry the books.\n• In the second game, however, once you researched a spell once and kept the library that contained its book until the end of the level, that spell would be yours for the rest of the campaign. On the other hand, each spell could be upgraded to a slightly better version of itself, and these upgrades had to be re-researched each time.\n• Galactic Civilizations II had this problem when playing the campaign mode, since it was mostly short missions from which nothing carried over into the next one. As one reviewer put it, \"It's annoying having to reinvent the wheel, then the space wheel, then the space wheel 2, then the ion wheel every time\". The campaign mode isn't really the way to play the game for most people.\n• Age of Empires. Ye gods, do those games have this.\n• Although you already have all upgrades from the earlier ages if a mission or skirmish starts you off at anything but the first age.\n• The original Age of Empires is one of the few games in which you literally reinvent the wheel.\n• Age of Mythology. Ye GODS, does this game have this. However, whereas you still need to reinvent the Ax for nearly every mission, you can have different gods each level, so it makes sense that you shouldn't carry some god improvement from one level to the next.\n• Seven Kingdoms carried over every upgrade you acquired in the (randomly generated) campaigns, but the upgrades only gradually became available as you progressed. This included researching several special buildings and a siege weapon unavailable in normal play which are easily Game-Breaker material. And very annoying in the hands of the enemy in the last stages.\n• Empire Earth's campaigns makes you re-research the same techs from map to map. If you research one tech in the first map of the WW1-campaign, be prepared to research it again the next map. And the next. Especially frustrating since the maps come in chronological order.\n• The Age of Wonders series campaign is about working to master all the spheres of magic. Consequently, you had to learn new spells for a new sphere, and, though you retained those spells, items, and heroes over the course of the sphere's three levels, \"forget\" them for each subsequent sphere.\n• Rise of Nations follows this trope, while successor Rise of Legends doesn't. Particularly egregious on the campaign modes of Rise of Nations, where you can go from the Classical Age to the Medieval age on a map, but when you get to the next scenario, you're right back to the Classical Age again (unless the whole world has advanced, which occurs every four battles). Rise of Legends, on the other hand, doesn't allow researching upgrades during battles. Instead, in between maps, you use points allocated from previous battles to do your research (going from Imperial Musketeers to Imperial Grenadiers, for example), as well as determining your persistent army and hero upgrades.\n• To make the Rise of Nations example worse, each age has different technologies that can be researched in the library, representing what was actually invented in those ages. However, each tech upgrade will do the exact same thing for that position in the other ages. Researching genetics doesn't have any advantages over researching botany.\n• Also, Rise of Legends plays it straight with some minor unit upgrades for the Vinci faction (like \"monoculars\" for your musketeers/grenadiers), explained the same way it explains the Command & Conquer Economy: you're rushing to slap together working factories wherever you go and have to take the time and invest the resources to make your latest field factory able to produce the fancier toys.\n• Starcraft plays this straight, and is possibly most noticeable with the Terran faction. The academy technologies always needed to be reinvented every mission campaign. You would think they could just send the instructions for the construction U-238 shells to command and have it distributed from there.\n• The sequel still includes this in the campaign for basic damage/armor upgrades, but tech upgrades (once bought) and alien research choices are persistent. Making the right decisions at the right times makes it slightly less difficult when trying to complete all campaign missions on Brutal. When replaying missions through the Mission Archives, you can pick the difficulty level, but will have the same units and tech as when you first played it. So, restart the campaign on Casual, picking the things you'll need for the Brutal replay.\n• Technology development and dissemination are separated in The Lord of the Rings: The Battle for Middle-Earth I and II. Upgrades have to be researched and then purchased for each individual unit (one unit of infantry or cavalry is a battalion or a horde, so this is less scary than it sounds). Also, while upgrades have to be researched each scenario along a campaign so they can be added to new units, persistent units keep their upgrades and experience levels from one scenario to the next. In fact, this and the Arbitrary Headcount Limit may prevent you from completing secondary objectives in some levels, since they require your to perform a certain unit upgrade several times. If you already have the maximum possible army you can have, and it's fully upgraded, you'd actually have to lose units in order to fulfill the secondary objective. It's usually not worth doing, though, since the reward wouldn't compensate you for losing an experienced and upgraded unit.\n• In Heroes of Might and Magic, Heroes have the option of retaining their experience between scenarios (along with, at various times, creatures, spells and artefacts). Though the ability to retain such between campaigns doesn't exist (at least in HoMM3).\n• In the last campaign of Heroes of Might and Magic 5, Zehir is allowed to retain all his buildings and upgrades throughout his entire campaign. However (much to the Djinn's Delight, and to Zehir's horror) he must pay for it in knowledge, so as to transport the city to every campaign.\n• Heroes Chronicles is made up of a series of small campaigns involving the same primary hero. Tarnum is a different class each campaign, so he has to learn how to be this class every time. Still, doesn't explain him losing non-class-specific skills such as logistics.\n• When starting a new campaign in Empire at War, the player will be given starting units which may well be units that cannot build yet, so they are unique and can't be replaced until the technology is advanced enough to build them. Where those first few examples came from is never explained.\n• Halo Wars plays this completely straight, but in some missions certain researches will be complete from the start and occasionally individual units come with upgrades (the player will still need to do the research to have all their units of that type have this upgrade in this case).\n• Tech 2 and 3 blueprints in EVE Online only allow you to to build a limited number of items. After you run out of licensed manufacturing runs, you'll have to invent or reverse engineer the blueprint again. Similarly, if you run out of manufacturing runs with your tech 1 blueprint copy, you'll have to contact an owner of an original and pay him to make more copies for you. This is because the people making copies of blueprints put in DRM.\n• In the turn based strategy game Deadlock 2: Shrine Wars every campaign mission starts with the tech tree reset. the game attempts to justify this by saying that the treaty involved in the war over the planets that is the focus of the campaign requires that each colony develop its own technology and military.\n• According to Supreme Commander II, the supercomputers doing the research have a Fatal Flaw that makes them delete all upgrades when the battle is over. The dev team for them is working on a patch, but it's never actually implemented in game — not so much addressing the problem as rubbing your face in in it.\n• In Outpost2, you could research right up until the convenient local volcano(s) or Blight actually struck your base, and that research would be one of the only things to carry over between missions. The catch, of course, was that to keep an enterprising player from researching the entire tree in a single burst of mass research during the early game (sometimes, before certain research options would even make sense in the story), only part of the tech tree would be available for each mission. Even so, this made it a viable option and effective strategy to delay completing all of the mission objectives for long enough to research as much as you could during base missions, evacuating only when you had finished everything you could accomplish or when imminent calamity made it absolutely necessary to do so.\n• In the Flash and mobile game Rebuild, after you complete the game you have the option of taking five survivors to a new city. Experience and equipment for each survivor are carried over, but all technologies must be researched anew.\n• Warzone 2100 averts this, since the whole campaign is persistent and you'll need those technologies to persist in order to combat increasingly advanced enemies. Since technologies must be captured via artifacts on missions, it's not possible to research ahead.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/ReinventingTheWheel", "media_links": ["/pmwiki/pmwiki.php/VideoGame/DawnOfWar", "/pmwiki/pmwiki.php/VideoGame/Homeworld", "/pmwiki/pmwiki.php/VideoGame/CommandAndConquer", "/pmwiki/pmwiki.php/VideoGame/CommandAndConquerGenerals", "/pmwiki/pmwiki.php/VideoGame/CommandAndConquerTiberiumWars", "/pmwiki/pmwiki.php/VideoGame/Warcraft", "/pmwiki/pmwiki.php/VideoGame/DungeonKeeper", "/pmwiki/pmwiki.php/VideoGame/GalacticCivilizations", "/pmwiki/pmwiki.php/VideoGame/AgeOfEmpires", "/pmwiki/pmwiki.php/VideoGame/AgeOfEmpiresI", "/pmwiki/pmwiki.php/VideoGame/AgeOfMythology", "/pmwiki/pmwiki.php/VideoGame/SevenKingdoms", "/pmwiki/pmwiki.php/VideoGame/EmpireEarth", "/pmwiki/pmwiki.php/VideoGame/AgeOfWonders", "/pmwiki/pmwiki.php/VideoGame/RiseOfNations", "/pmwiki/pmwiki.php/VideoGame/RiseOfLegends", "/pmwiki/pmwiki.php/VideoGame/Starcraft", "/pmwiki/pmwiki.php/VideoGame/TheBattleForMiddleEarth", "/pmwiki/pmwiki.php/VideoGame/HeroesOfMightAndMagic", "/pmwiki/pmwiki.php/VideoGame/EmpireAtWar", "/pmwiki/pmwiki.php/VideoGame/HaloWars", "/pmwiki/pmwiki.php/VideoGame/EVEOnline", "/pmwiki/pmwiki.php/VideoGame/Deadlock", "/pmwiki/pmwiki.php/VideoGame/SupremeCommander", "/pmwiki/pmwiki.php/VideoGame/Outpost2", "/pmwiki/pmwiki.php/VideoGame/Rebuild", "/pmwiki/pmwiki.php/VideoGame/Warzone2100"], "non_media_links": ["/pmwiki/pmwiki.php/Main/RealTimeStrategy", "/pmwiki/pmwiki.php/Main/TechTree", "/pmwiki/pmwiki.php/Main/GameplayAndStorySegregation", "/pmwiki/pmwiki.php/Main/InstantExpert", "/pmwiki/pmwiki.php/Main/EasyLogistics", "/pmwiki/pmwiki.php/Main/ObviousRulePatch", "/pmwiki/pmwiki.php/Main/YouHaveResearchedBreathing", "/pmwiki/pmwiki.php/Main/BagOfSpilling", "/pmwiki/pmwiki.php/Main/UnstableEquilibrium", "/pmwiki/pmwiki.php/Main/ImportedAlienPhlebotinum", "/pmwiki/pmwiki.php/Main/IncrediblyLamePun", "/pmwiki/pmwiki.php/Main/GameBreaker", "/pmwiki/pmwiki.php/UsefulNotes/WW1", "/pmwiki/pmwiki.php/JustForFun/Egregious", "/pmwiki/pmwiki.php/Main/CommandAndConquerEconomy", "/pmwiki/pmwiki.php/Main/ArbitraryHeadcountLimit", "/pmwiki/pmwiki.php/Main/HandWave", "/pmwiki/pmwiki.php/Main/FatalFlaw", "/pmwiki/pmwiki.php/Main/VoodooShark", "/pmwiki/pmwiki.php/Main/ChekhovsVolcano", "/pmwiki/pmwiki.php/Main/GreyGoo", "/pmwiki/pmwiki.php/Main/StalkedByTheBell", "/pmwiki/pmwiki.php/Main/GameplayAndStoryIntegration", "/pmwiki/pmwiki.php/Main/NewGamePlus"]}