{"title": "Shy Bladder", "content": "Some people can't \"do their business\" when there is a chance they could be seen or overheard by someone else. This is somewhat understandable and a case of Truth in Television for some people. This can vary from not wanting to be watched (which most of us can say we'd agree with) to not being able to use public conveniences even if they are the only one there.\n\nIn fiction this seems to be an affliction that tends to affect shy and/or neurotic people more than anyone else. It also seems to be something that tends to affect children. A common cry of such a character is \"I can't go with you looking at me!\" (or \"with you there\" if the person is merely in earshot).\n\nA Shy Bladder may be faked if a person needs to evade observation for some reason or if they want to avoid giving a urine sample as, at least in fiction, even prison guards will sympathize with a person over this.\n• This was the childhood Berserk Button of Madara Uchiha from Naruto - he hated people standing behind him while he was peeing. He then grew up to be one of the most feared-slash-revered shinobi in history, and is currently an unstoppable undead killing machine.\n• In Prison School, Hana demands that Kiyoshi use the toilet while she watch as payback for Kiyoshi spotting her urinating outside. Kiyoshi tells her he can't with her watching so she tries to physically force him only to end up slipping on the floor and Kiyoshi unintentionally relieving himself on her.\n• Subverted in Chapter 8 of Maka-Maka; Nene tells Jun not to look that way when the former is sitting on the toilet... but then, in a twist, relieves herself just as Jun stops brushing her teeth.\n• Felicia has to pee into a radiator in Sex Drive, because both of her friends (who are male) are too nervous to do so.\n• The Mummy Returns: Alex complains to the guard that he can't use the bathroom while he's being watched. Conveniently, this gets the guard to turn his back long enough for Alex to realize that the toilet opens directly onto the tracks; he pushes it aside and makes his escape.\n• In the movie Waiting...... one of the waiters has a problem that he can't pee in a public restroom, even if there's no one in there.\n• In Real Genius, Genki Girl Jordan follows the male lead into the bathroom, and up to a urinal. When this causes problems for him, she seems puzzled.\n• In Trick, Gabriel is trying to pee in the bathroom at a gay club. But a drag queen with a vendetta barges in and starts telling him a long story about Mark, the go-go dancer Gabe is trying to land. During this Gabriel is increasingly nervous and can't pee (he asks her to turn around and she says, \"Pee shy? Don't worry, Miss Coco's here to help.\" — she turns around, then turns right back for the next salvo). Finally the drag queen delivers the final, climactic invective against Mark, and, in a bit of auditory punctuation, Gabriel is suddenly able to pee (\"Good boy!\").\n• Avengers: Infinity War: On the way to Nidavellir, Groot really has to go. Groot: I am Groot. \n\nRocket: Tinkle in the cup. We're not looking. What's there to see? What's a twig? Everybody's seen a twig before. \n\nGroot: (whiny) I am Groo-oot! \n\nThor: Tree, pour what's in the cup out into space and go in the cup again. Tinkle in the cup. We're not looking. What's there to see? What's a twig? Everybody's seen a twig before.(whiny) I am Groo-oot!Tree, pour what's in the cup out into space and go in the cup again.\n• Still Game has this happen in the first Hogmanay special \"The Party\" when Winston, Jack, Victor, and Isa are all stuck in an elevator. Winston has drunk four cans of lager to pass the time and needs to pee, after much conflict from the other four he tries to do \"half a pee\" and intially can't because the other four are there. His soon does give way to it though.\n• Arrested Development GOB needs to poop out a key he swallowed, but he can't in \"Key Decisions\". This exact example is later inverted in \"Spring Breakout,\" where GOB tries vomiting up a key... but it's implied to have finally emerged by the opposite route.\n• Charlie Brooker's Screenwipe did a fairly brutal satire of self-improvement documentaries, with \"Konnie's Great British Wee\", where Konnie Huq (as herself) tries to fight the scourge of shy bladder syndrome by getting a group of sufferers to take a group piss on a hill.\n• It was established in season 7 of Buffy that Jonathan had a shy bladder. Andrew took advantage of that to extend his time talking to the First Evil by calling out \"You all right in there?\", making Jonathan's stay in the bathroom longer.\n• Elliot, from Scrubs has an extremely Shy Bladder. She can't go if someone speaks to her, or if they can hear her.\n• Dr. Cox and Jordan once made J.D. stop mid-stream by hovering behind him.\n• This happens several times to House in House:\n• Cuddy, rather than leaving the room, runs the water on a sink. It works. One of House's patients pulls an extreme one of these. \"I can't go in public. I have to go home.\" Essentially he wanted to bring someone else's urine to be tested, not his own.\n• In \"Top Secret\", he has a \"pee dream\" about a Marine soldier Cuddy kissed at a fundraiser. He gets woken up right before he pees, then can't, because Wilson is peeing next to him. This leads to urinary retention.\n• Roseanne: During her Sweet Polly Oliver, the eponymous heroine observes that bathroom etiquette follows 'elevator' rules: look straight ahead, no talking.\n• In an episode of Veronica Mars, clean-living Wallace (among others) somehow fails a drug test, and friend Veronica gets hold of a home testing kit to see if maybe he was slipped something surreptitiously. When Wallace suffers from shy bladder, VM's dad plays with this by shouting through the door \"Try twisting your nipples\" earning a shout of dismay from Wallace.\n• An episode of Popular had a female character with a shy bladder taking a drug test, and failing due to not being able to go. The unsympathetic teacher did not help.\n• Friends - at a restaurant bathroom, Joey admits to being pee shy - it doesn't help to have Chandler hollering at him like a drill sergeant.\n• Seinfeld - George admits to having privacy issues after getting a massage from a man, to where he can't use a urinal; he's a \"stall guy\". Kramer finds this funny.\n• NCIS mentioned the cases of people who use this excuse to evade drug tests. In real life, officers responsible for administering the test will turn around to give the person some semblance of privacy, but the officer is given a handmirror to discretely make sure that no cheating is going on.\n• In Diary of a Wimpy Kid: The Long Haul, Greg and his impromptu pet pig (long story) both need to use the bathroom. Greg says \"It was pretty awkward using the toilet with a farm animal sitting next to me, but I guess the pig was more embarrassed than ME, because when it was his turn to go, nothing happened.\"\n• In The World of Poo, Plain Old Humphrey explains to Geoffrey that having a young boy standing outside the privy waiting for you is not conductive to your business, even if you can't see him. (The fact Geoffrey has just explained his idea for a poo collection, and is waiting with a bucket certainly didn't help.)\n• American Gods: Shadow suffers from shy bladder, as evidenced when he has to ask Sam to turn around when he steps out of the car for a leak.\n• \"I Piss Alone\" by Regurgitator is about this. \"I piss alone, 'cause I don't want nobody to know/that I haven't got the pressure of some of the other boys/they make a noise that scares me so\".\n• Koit, a YouTube user who writes Squicky songs, wrote My Willy Won't Go, which is about a man having a Potty Emergency but has a very shy bladder due to not wanting people to see his penis at the urinals.\n• In Persona 4, the first time the group enters the TV world, Yosuke is in desperate need of a bathroom and resolves at one point to simply relieve himself upon the wall. He asks the other two to turn around, but in the end, he still can't bring himself to do it.\n• Spoofed in the concept trailer for Portal 2. After Chell fits Wheatley into a wall so he can open a passage, he says, \"I can't do it if you're looking.\"\n• The Rugrats episode about Chuckie moving from the potty to an adult toilet, he can't go because the adults always stay and watch him. He eventually is able to go when the other babies accompany him and then turn their backs.\n• In an episode of Chowder Chowder, Mungal, and Schnitzel are locked in the bathroom. Chowder has to go, but, Chowder can't go in front of Mungal and Schnitzel, saying they are \"all old and grody.\"\n• The Simpsons - One of the uber-nerds Homer meets when he went back to college was so timid he couldn't use the bathroom after someone knocked on the door.\n• In \"Homer the Moe\", Homer tricks the group REM into playing in his garage-turned-bar, and one of its members asks the others to stand around him so that he can pee without Lenny looking at him.\n• In Superjail!, the Warden claims to be \"pee shy\" in order to get away from the time police who have captured him.\n• Beavis And Butthead are on a \"Scared Straight\" field trip to prison. Butt-Head is straining nervously on the crapper surrounded by maliciously laughing convicts (and Beavis) - when they see one guy's Iron Maiden tattoo and they all bond over heavy metal, Butt-Head relaxes - audibly.\n• In the The Fairly Oddparents episode, \"Hail To the Chief\", when Timmy becomes Student Body President, his friends, Chester and A.J. are his bodyguards. When Timmy has the advantage of using the Presidential stall, he tries to use it, but Chester and A.J. follow him in. Timmy tells them he can't go with them watching him, but they tell him they can't stop watching him until he goes.\n• Some Japanese women are very self-conscious of the noise they make during urination, so much so that there is a device called the Otohime which makes flushing noises when it is activated. It was invented to conserve water, since women would usually cover the noise with actual (and unnecessary) flushes.\n• It's commonly accepted (well, in America, at least) that if you, a male, go into a bathroom and it's empty, you take the urinal farthest from the door or the stall. If another person comes in while you're still using the urinal, they take the one farthest from you or at least take a urinal that leaves a urinal between you. Talking or touching is not accepted, even if you're drunk; you must stare directly ahead and keep quiet. The rule is so strong that lineups sometimes form for urinals even when some are free because the free ones are between two occupied ones, though some bathrooms have mini-walls between the urinals to counteract this.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/ShyBladder", "media_links": ["/pmwiki/pmwiki.php/Film/PercyJacksonAndTheOlympians", "/pmwiki/pmwiki.php/Manga/Naruto", "/pmwiki/pmwiki.php/Manga/PrisonSchool", "/pmwiki/pmwiki.php/Film/SexDrive", "/pmwiki/pmwiki.php/Film/TheMummyReturns", "/pmwiki/pmwiki.php/Film/Waiting", "/pmwiki/pmwiki.php/Film/RealGenius", "/pmwiki/pmwiki.php/Film/Trick", "/pmwiki/pmwiki.php/Film/AvengersInfinityWar", "/pmwiki/pmwiki.php/Series/StillGame", "/pmwiki/pmwiki.php/Series/ArrestedDevelopment", "/pmwiki/pmwiki.php/Creator/CharlieBrooker", "/pmwiki/pmwiki.php/Series/Screenwipe", "/pmwiki/pmwiki.php/Series/BuffytheVampireSlayer", "/pmwiki/pmwiki.php/Series/Scrubs", "/pmwiki/pmwiki.php/Series/House", "/pmwiki/pmwiki.php/Series/Roseanne", "/pmwiki/pmwiki.php/Series/VeronicaMars", "/pmwiki/pmwiki.php/Series/Popular", "/pmwiki/pmwiki.php/Series/Friends", "/pmwiki/pmwiki.php/Series/Seinfeld", "/pmwiki/pmwiki.php/Series/NCIS", "/pmwiki/pmwiki.php/Literature/DiaryOfAWimpyKidTheLongHaul", "/pmwiki/pmwiki.php/Literature/AmericanGods", "/pmwiki/pmwiki.php/Music/Koit", "/pmwiki/pmwiki.php/Website/YouTube", "/pmwiki/pmwiki.php/VideoGame/Persona4", "/pmwiki/pmwiki.php/VideoGame/Portal2", "/pmwiki/pmwiki.php/WesternAnimation/Rugrats", "/pmwiki/pmwiki.php/WesternAnimation/Chowder", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/WesternAnimation/Superjail", "/pmwiki/pmwiki.php/WesternAnimation/BeavisAndButthead", "/pmwiki/pmwiki.php/WesternAnimation/TheFairlyOddparents"], "non_media_links": ["/pmwiki/pmwiki.php/Main/TruthInTelevision", "/pmwiki/pmwiki.php/Main/NotSoGreatEscape", "/pmwiki/pmwiki.php/Main/TheGuardsMustBeCrazy", "/pmwiki/pmwiki.php/Main/AnimeAndManga", "/pmwiki/pmwiki.php/Main/BerserkButton", "/pmwiki/pmwiki.php/Main/Subverted", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/GenkiGirl", "/pmwiki/pmwiki.php/Main/PokemonSpeak", "/pmwiki/pmwiki.php/Main/LiveActionTV", "http://en.wikipedia.org/wiki/Konnie_Huq", "/pmwiki/pmwiki.php/Main/ShyBladder", "/pmwiki/pmwiki.php/Main/RuleOfFunny", "/pmwiki/pmwiki.php/Main/SweetPollyOliver", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Discworld/TheWorldOfPoo", "/pmwiki/pmwiki.php/Main/Music", "/pmwiki/pmwiki.php/Main/Squick", "/pmwiki/pmwiki.php/Main/PottyEmergency", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/Main/MaleRestroomEtiquette"]}