{"title": "Hastily Hidden MacGuffin", "content": "A thief or smuggler is carrying some valuable thing, and the authorities are closing in. The thief cannot be caught in possession of the item, and clearly has not planned for this eventuality in advance.\n\nIn a moment of inspiration, the carrier hides the item in some handy nearby location, inside a cheap vase or a teddy bear or somebody else's suitcase — and the whole rest of the story revolves around the interested parties trying to find or get back to the thing wherever it happens to have been hidden.\n\nThe MacGuffin might even have been hidden in one of a dozen identical trinkets, forcing seekers to hunt down all of them until they find the right one.\n\nCompare I'm Dying, Please Take My MacGuffin. Versions that involve dolls or stuffed animals fall under Smuggling with Dolls.\n• Usagi Yojimbo: In the \"A Potter's Tale\" issue, a thief slips into a pottery workshop while on the run and hides a valuable gem in the wet clay of one of the bowls. So he knows which one contains the gem, he pinches the rim to make it stand out. Unfortunately for the thief, the potter sees the difference, likes the addition and does the same to all his bowls. The thief desperately buys all the bowls and smashes them to find the gem but the potter had already unknowingly given the bowl containing the gem back to the man that the thief stole it from as part of a business deal. Then thief's partners come looking for their share of the loot...\n• Blake and Mortimer: In the second book, Mortimer is held prisoner by the Yellow Empire, but manages to hide the Swordfish plans in a pyramid-shaped rock formation before he's captured. Much of the plot revolves around his trying to get the plan's location to the resistance, eventually getting it across in code. Blake is able to decypher it and get the plans to the resistance before they go rescue Mortimer.\n• In The Night of the Hunter, Ben Harper hides money that he robbed from a bank in his little daughter's doll when the police come to arrest him. The film's villain then spends the whole film looking for it, marrying and murdering Harper's wife and pursuing the runaway children.\n• In Blue Streak, Martin Lawrence's character stuffed a stolen diamond into ductwork in a building under construction. The building turned out to be a police station, and the character had to pretend to be a cop to have a chance to search for the diamond.\n• French Kiss has the thief hide his stolen necklace and contraband grape vineling in the girl's luggage, and he then has to pursue her until he recovers them.\n• In Herbie Goes to Monte Carlo, a pair of thieves steal a famous diamond and ends up hiding it in Herbie's gas tank. Cue hijinks as Herbie and its drivers get chased without knowing why.\n• In Home Alone 3, the MacGuffin is a stolen computer chip which the villains hid in a remote control car. After a mixup, the protagonist's neighbour ends up with it and gives it to him as payment for shovelling her drive.\n• In the Sherlock Holmes film The Pearl of Death, a stolen pearl is hastily hidden in a plaster bust of Napoleon — one of a set of six, which are then sold to various customers. The Creeper is sent to kill the owners of the busts, then break all the owner's dishware to disguise the fact that they're just interested in the Napoleon.\n• In Diamonds on Wheels, Billy hides the bag of stolen diamonds in the seat of his MG. After his car is wrecked and he dies, Bobby buys the seat (and a bunch of other parts) to install in his car. This leads to Mercer and his gang chasing Bobby, Charlie and Susan; knowing that the diamonds are in their car, but not where.\n• In The Circus, a pickpocketer steals a wallet and a watch from a man in the crowd. Suddenly the victim turns around and charges the thief who then shoves the valuables unnoticed into the pocket of the Tramp behind him. Hilarity Ensues when the thief later goes after the Tramp to get his loot back.\n• Much of the suspense in Enemy of the State hinges around a wildlife researcher's video recorder that captured NSA Chief Reynolds killing a congressman who opposed Reynolds' Stalinist domestic surveillance program. The wildlife researcher sees what's been recorded, and runs for his life from pursuing agents. He's able to dump the video into the shopping bag of labor lawyer Robert Dean before being killed. Later, the magic Enhance Button is able to determine that Dean now holds the incriminating video.\n• In Wait Until Dark, the MacGuffin is a heroin-stuffed doll which a young woman tries to smuggle on a plane from Montreal to New York. On arrival she notices a criminal waiting for her at the arrival zone whom she hasn't expected. She senses trouble and quickly hands the doll to an unwitting stranger she met on the plane who then carries it home with good intent. The plot revolves around the criminal and his two partners trying to get the doll back from this man's apartment.\n• Sherlock Holmes:\n• In \"The Adventure of the Six Napoleons\", a stolen pearl is hastily hidden in a plaster bust of Napoleon — one of a set of six, which are then sold to various customers, forcing the thief to seek out and smash them all.\n• In \"The Adventure of the Blue Carbuncle\", a stolen gem is hidden by being force-fed to a live goose.\n• In the third book of The Eddie Dickens Trilogy, the villain hides the priceless Dog-Bone Diamond inside Malcolm, the stuffed stoat of Eddie's insane Aunt Maud. By the third book, Eddie has gotten so used to Maud being insane (and insisting that Malcolm is alive) that he no longer listens to her (especially when she claims that Malcolm is putting on weight and getting sick). In other words, Malcolm is so familiar to Eddie as to be invisible.\n• John le Carré's spy thriller Smiley's People has Estonian ex-patriate General Vladimir contact retired British Intelligence agent George Smiley about a \"legend\" operation being conducted by Soviet mastermind Karla. \"I have two proofs, and can bring them with me.\" The General is murdered before he meets with Smiley. However, Smiley deduces from the General's footprints in the snow that the victim paused in his flight to jettison something toward a municipal park. There, Smiley finds a pack of cigarettes in a tree, which contains two compromising photo negatives.\n• The entire plot of The Twelve Chairs is built on that. Madame Petukhova, an Imperial Russian noblewoman, hid her collection of jewelry in a chair during the Revolution of 1917, to prevent the revolutionaries from confiscating them. Years later, her son-in-law Ippolit Vorobyaninoff learns about that from Madame on her deathbed, and starts to look for that chair. As you can guess from the title, there are eleven more chairs looking exactly like that one.\n• The Widow of Desire downplays this. In the last third, Natalie discovers that her husband was murdered because he had tapes of a conspiracy in the USSR to overthrow Gorbachev's government. He hid the recordings on magnetic thread within a Russian lynx coat he bought Natalie . After she finds it she then hides the tape within one of the pelts in a fur auction, so the KGB doesn't find it, but she nearly loses it when she's outbid at the auction, and has to convince a business associate to buy the lot.\n• Eragon begins with Arya teleporting a dragon egg to the Spine when Galbatorix's agents find her. Eragon finds the egg, kicking off his Hero's Journey.\n• Ken Krippene's Buried Treasure. After a German thief named Klaus Gudden acquired a pair of priceless rubies he decided to hide them. He went to a ceramic factory and purchased an unfired clay cat sculpture. He inserted the rubies into the sculpture, put a small X on it to identify it and left it to be baked. When he returned for it the police closed in and killed him when he tried to escape. The police didn't know what he had been up to and the sculpture was eventually sent to the U.S. to be sold.\n• Get Smart: Max has to smuggle some plans hidden in a tooth cap in the \"The Whole Tooth and...\" episode and when he is nearly caught by KAOS agents, he puts it on the tooth of sleeping man at a train station. After he and 99 take care of the agents they discover the man was a convict being transported to prison and spend the rest of the episode trying to get in and retrieve the plans.\n• Monk: Some men break into Natalie's house in the \"Mr. Monk and the Red Herring\" episode that show an unusual interest in Julie's aquarium. Turns out they had stolen a million-dollar moonrock from a museum but could not get it out because the guards were searching everyone so they put it in one of the aquarium kits in the gift shop. When they returned to retrieve the rock, they found that Julie had bought the kit.\n• Sherlock's episode \"The Six Thatchers\" is based on the original Sherlock Holmes short story \"The Adventure of the Six Napoleons\". In this retelling, an operation of a freelance task force called A.G.R.A. is foiled and while on the run, one of the members tries to hide his USB stick with sensitive data. He winds up in a pottery and hides the memory stick in one of six freshly made busts of Margaret Thatcher. Then he gets arrested. Years later, the man goes around stealing all identical busts in hope to find his memory stick. Sherlock puts an end to this.\n• Shadowrun supplement Portfolio of a Dragon: Dunkelzahn's Secrets. According to the dragon Dunkelzahn's will the Russian crown jewels were smuggled out of the country after the Russian Revolution inside one of the nine spinet pianos from the royal palace.\n• In The Powerpuff Girls episode \"Jewel of the Aisle\", a thief loses a jewel he stole in a cereal factory and looks frantically for the box where it fell. He finally finds the box with the jewel inside, only it's now in the possession of the girls.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/HastilyHiddenMacGuffin", "media_links": ["/pmwiki/pmwiki.php/ComicBook/UsagiYojimbo", "/pmwiki/pmwiki.php/ComicBook/BlakeAndMortimer", "/pmwiki/pmwiki.php/Film/TheNightOfTheHunter", "/pmwiki/pmwiki.php/Film/BlueStreak", "/pmwiki/pmwiki.php/Film/FrenchKiss", "/pmwiki/pmwiki.php/Film/TheLoveBug", "/pmwiki/pmwiki.php/Film/HomeAlone3", "/pmwiki/pmwiki.php/Film/ThePearlOfDeath", "/pmwiki/pmwiki.php/Film/DiamondsOnWheels", "/pmwiki/pmwiki.php/Film/TheCircus", "/pmwiki/pmwiki.php/Film/EnemyOfTheState", "/pmwiki/pmwiki.php/Theatre/WaitUntilDark", "/pmwiki/pmwiki.php/Literature/SherlockHolmes", "/pmwiki/pmwiki.php/Literature/TheEddieDickensTrilogy", "/pmwiki/pmwiki.php/Creator/JohnLeCarre", "/pmwiki/pmwiki.php/Literature/SmileysPeople", "/pmwiki/pmwiki.php/Literature/TheTwelveChairs", "/pmwiki/pmwiki.php/Literature/TheWidowOfDesire", "/pmwiki/pmwiki.php/Literature/Eragon", "/pmwiki/pmwiki.php/Series/GetSmart", "/pmwiki/pmwiki.php/Series/Monk", "/pmwiki/pmwiki.php/Series/Sherlock", "/pmwiki/pmwiki.php/TabletopGame/Shadowrun", "/pmwiki/pmwiki.php/WesternAnimation/ThePowerpuffGirls"], "non_media_links": ["/pmwiki/pmwiki.php/Main/MacGuffin", "/pmwiki/pmwiki.php/Main/ImDyingPleaseTakeMyMacGuffin", "/pmwiki/pmwiki.php/Main/SmugglingWithDolls", "/pmwiki/pmwiki.php/Main/ComicBook", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/MacGuffin", "/pmwiki/pmwiki.php/Main/NeedleInAStackOfNeedles", "/pmwiki/pmwiki.php/Main/HilarityEnsues", "/pmwiki/pmwiki.php/Main/EnhanceButton", "/pmwiki/pmwiki.php/Main/MacGuffin", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/PrettyInMink", "/pmwiki/pmwiki.php/Main/HerosJourney", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Recap/SherlockS04E01TheSixThatchers", "/pmwiki/pmwiki.php/Main/TabletopGames", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Recap/ThePowerpuffGirlss3E7JewelOfTheAisleSuperZeroes"]}