{"title": "Flynning", "content": "The classic swordplay of Swashbuckling movies: Threaten high countered by parry high, threaten low countered by parry low, lather, rinse and repeat as you climb the spiral tower staircase, until the hero can drive his sword through the villain's heart. It looks exciting, and the \"tink-tink-tink\" of sword tips clashing has become so familiar to the ear over the decades that this is what most people would think of if you asked them to imagine a \"sword fight\".\n\nBut it's not practical swordsmanship for a real, deadly fight. It wouldn't even work in a sword-based competitive sport like Olympics rules fencing or kendo. Instead, it's a type of choreographed fighting for show that we call Flynning, which often boils down to two combatants deliberately trying to hit each others' weapons with an impressive clanging sound, rather than trying to actually hit each other. Each attack will be deliberately aimed too high or off to the side so that it would miss the opponent even if they stood still without defending, and yet the defender will go out of their way to meet it in midair with a clumsy block instead of taking advantage of the attacker's mistake by avoiding and striking back in the same motion. Then the swordsman who just parried will make his own telegraphed attack for the other guy to parry, and in this fashion they take turns giving and receiving attacks as if they have an understanding not to hurt each other. In theatrics, this trick where two fighters take turns attacking and parrying in an endless loop is called \"Pirate Halves\"note Often in pirate and swashbuckling movies they wouldn't have the time (or the budget) to give everyone in the film sword fighting lessons, so they'd give some lessons to the lead actors, and tell all the extras in the background, \"just do this.\" The \"Halves\" refers to how you're basically making a half-circle with your sword with each parry, meeting at the top and bottom of each arc; a similar move, \"Pirate Fulls\", is when you're making a 360° arc with each swing to meet at the bottom of each swing). Whenever an attacker seems to attack into a parry instead of straight at their opponent's body, or the defender starts moving to parry an anticipated attack before they could have even seen it coming, it's a dead giveaway that they're following choreography. Note that just having a lot of parrying or blade-on-blade contact does not automatically make a fight Flynning, since the parry is a fundamental defensive technique in many schools of swordsmanship: what makes it Flynning is that the participants pass up the most direct and obvious opportunities to kill each other, and ignore sound principles of defense in a way that they can only get away with because they're performing a choreographed dance with each other's cooperation.\n\nIn the more flashy and energetic varieties of flynning you can expect to see a preposterously reckless offense, typically consisting of 360 degree spins and somersaults that would leave the back wide open, combined with absurdly overshot slashes and swipes that would invite a quick, lethal interruption. Despite the benefit to be gained by just sticking out their point at the right moment, the defender allows the attacker to whirl around like a dervish without taking advantage of these openings. Another hallmark of Flynning is poor application of distance or measure; They will probably spend most of the time intentionally fighting at a distance just close enough so that they can clash their swords together at the center or tip of their blades, but not close enough to hit any body part except the other swordsman's hand or forearm. At other times they might get way too close to each other for the length of weapon they are using, perhaps resulting in a Blade Lock where they push against each other while glowering between the blades, and persist in using their long weapons at the point where in a real fight both parties would switch to daggers and grappling. The Blade Lock may be broken by one fighter using a push, kick, or headbutt to knock his opponent off balance, but of course instead of rushing in for the kill he will take his time so that the other guy can recover his guard and keep fighting.\n\nTo keep the excitement up, and sometimes to distract from poor blade work, the characters may chase each other through all sorts of locations and environmental perils as they fight, such as up and down marble staircases, across the tops of tables in a tavern, on the outside of a moving vehicle, or along the narrow catwalks of a construction site or factory with No OSHA Compliance. By the end of it one may have the other cornered in a dead end or on the edge of a precipice, which either leads to the killing blow or results in the cornered party performing a major stunt such as a Chandelier Swing to escape. Exotic Weapon Supremacy will be in effect and Dual Wielding is fetishized as the mark of a superior fighter, often appearing in contexts such as Viking Age Europe where dual wielding was almost never practiced. Exotic weapons and dual wielding did actually exist in certain historical contexts, but even if they are depicted in the right time and place, don't expect to see them used with correct technique.note Curiously, the most common example of double-wielding in European history, the use of the rapier and parrying dagger, is rarely portrayed in media.\n\nFlynning exists, in live-action at least, so that non-expert actors can put on an entertaining show without causing Real Life injuries. The first problem is that most actors aren't trained fencers, and most fencers aren't trained actors. Neither skill is something you can teach someone properly in a short amount of time, and audiences are more likely to recognize (and be bothered by) wooden acting than unconvincing swordplay, so in most cases choreographers must try their best to teach people who already know how to act how to pretend they know how to fence. Usually the actors learn the sequence of moves in a fight by rote without a good understanding of the underlying principles behind them. There is usually little time to rehearse fights before filming, and with the number of behind-the-scenes moving parts that go into filming it's not uncommon for some last-minute problem to make them throw out the choreography and fall back on improvisation.\n\nThis leads into the second problem: most stage and screen fights are done without hand or face protection, and the risk of accidents is compounded when everyone is an amateur. This is a big reason for Slice-and-Dice Swordsmanship, since there is greater risk of accidental injury when thrusting is involved. Actors depend on their bodies to make a living, and any kind of disabling or disfiguring injury can be ruinous for their careers. The more famous a star, the more expensive they are to insure, and both the insurance companies and the actors' managers will throw a fit if you let them do something they consider too dangerous. There are stunt doubles for productions that can afford it, but with the amount of dialogue and acting that go into these swordfight scenes, any shots where you can clearly see the characters' faces will still have to use their real actors. Live theater presents the most chances for injury, since unlike in recorded performances the actors can't rest between takes, switch with stunt doubles, or use camera trickery to fake things. And unlike in film or television where the end of filming means that fight's in the bag, on stage the whole fight is reproduced live every night with all its chances for something to go wrong. With all of these things in mind, and since hardly anybody in the audience will know or care about the difference, it's all too understandable that choreographers would use less realistic choreography in order to minimize the risk of injury. Aside from safety, there are various other problems. If a key actor is injured or disabled, or if there's trouble with the props or costumes, then the fight director has no choice but to plan the action around those constraints.\n\nEven when you factor out the problems of live actors, Flynning still has its uses. Real combat involving swords tended to be gory and violent, usually resulting in nasty bloody wounds and body parts being chopped off. That isn't gonna fly with the Media Watchdogs and Network Censors, especially in the case of works geared toward children, so you end up with fights where swords clash but nobody dies. Another issue is that the goal of practical swordsmanship is to take the shortest possible sequence of moves that leads to your opponent being dead or incapacitated and you being unharmed, and it doesn't necessarily have to look impressive as long as it works. In contrast, a choreographer often has to contrive various ways for a fight to be as drawn out and flashy as possible, all while keeping the action comprehensible to the audience. Many highly effective real life techniques are either Boring, but Practical, so subtle or fleeting that average audience members wouldn't be able to understand what they were seeing, or so direct and effective that they would make a hyped-up fight scene end in a premature anticlimax if they were actually employed in the appropriate situation. We also can't ignore the fact that a lot of cartoons and anime depend on Limited Animation so they can be produced quickly and cheaply, and it's much easier to put together a repetitive loop of two characters whacking their blades against each other than to fully animate a sequence of unique attacks and counters. Finally, there is simply the fact that most writers, artists, and animators don't know how to fence, and if they do seek out advice it will often be from the same choreographers and stuntpersons who serve theater, film, and television. Thus, the same Flynning moves tend to show up across all kinds of media.\n\nA lot of Flynning entries will be written by people who know and care a lot more about swordsmanship than the average person, and therefore can tend toward being critical and nitpicky. Tropes Are Tools, however, and Flynning is not necessarily a \"bad\" trope: it's just that it comes out of a real-life safety concern that makes it difficult to show the full range of historical combat techniques, and it's often used as a crutch to cover up for a lack of time, money, or expertise. A significant number of fencing snobs can still acknowledge even fights that aren't technically realistic as great pieces of storytelling, and they will almost always appreciate when a production goes above and beyond to train the actors or to incorporate a cool move that has some historical plausibility. At their best, Flynning and stage combat can be like real swordsmanship filtered through Rule of Cool. Stage combat in particular is an art form in and of itself, particularly in live theatre, where well-practiced actors can get up to absurdly high levels of skill. Likewise, experienced choreographers and stunt people can help to create fight scenes both onstage and onscreen in which there's something for everybody to enjoy.\n\nThis trope is named for the film star Errol Flynn, who relied on it as the star of swashbuckling movies such as The Adventures of Robin Hood and Captain Blood. It is worth noting that, as some of the examples below illustrate, quite a number of his colleagues in early 20th century Hollywood actually were expert fencers, but rather than go for realistic fights they used their knowledge to produce something that just looked cool instead.\n\nCompare A-Team Firing, where instead of lots of sword clashing with nobody getting cut you have lots of bullets flying but nobody getting shot. Contrast Single-Stroke Battle, where both fighters are clearly aiming to kill with their first strike and which can be over in an instant. See also Anachronism Stew as swords and sword fighting techniques shown on film tend to be hundreds of years ahead of what would have been available in the time setting of a medieval film.note Might be a case of Acceptable Breaks from Reality, given that most cultures kept only haphazard records of their martial arts. On the flipside, some films use anachronistic techniques when there's a knowledge base concerning the techniques they did use. For details on how to depict sword fighting more accurately, see our Useful Notes pages on European Swordsmanship and Kenjutsu. See the Analysis page for a detailed discussion of why getting realistic fights on stage or film is a lot harder than it sounds.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/Flynning", "media_links": ["/pmwiki/pmwiki.php/Film/TheAdventuresOfRobinHood", "/pmwiki/pmwiki.php/Creator/CSLewis", "/pmwiki/pmwiki.php/Literature/PrinceCaspian", "/pmwiki/pmwiki.php/Creator/ErrolFlynn", "/pmwiki/pmwiki.php/Film/TheAdventuresOfRobinHood", "/pmwiki/pmwiki.php/Film/CaptainBlood", "/pmwiki/pmwiki.php/LightNovel/TheAsteriskWar", "/pmwiki/pmwiki.php/Anime/RevolutionaryGirlUtena", "/pmwiki/pmwiki.php/Anime/SuperDimensionFortressMacross", "/pmwiki/pmwiki.php/Franchise/Gundam", "/pmwiki/pmwiki.php/Anime/MobileSuitGundamWing", "/pmwiki/pmwiki.php/Anime/MobileSuitGundam", "/pmwiki/pmwiki.php/Manga/OnePiece", "/pmwiki/pmwiki.php/Manga/Bleach", "/pmwiki/pmwiki.php/Manga/KatekyoHitmanReborn", "/pmwiki/pmwiki.php/Manga/HayateTheCombatButler", "/pmwiki/pmwiki.php/Anime/LeChevalierDEon", "/pmwiki/pmwiki.php/Manga/AkameGaKill", "/pmwiki/pmwiki.php/Manga/Naruto", "/pmwiki/pmwiki.php/Manga/YuYuHakusho", "/pmwiki/pmwiki.php/LightNovel/Slayers", "/pmwiki/pmwiki.php/Manga/MyBrideIsAMermaid", "/pmwiki/pmwiki.php/ComicBook/JonSableFreelance", "/pmwiki/pmwiki.php/ComicBook/TexWiller", "/pmwiki/pmwiki.php/Webcomic/HowIBecameYours", "/pmwiki/pmwiki.php/Literature/Discworld", "/pmwiki/pmwiki.php/Creator/AAPessimal", "/pmwiki/pmwiki.php/WesternAnimation/TheRoadToElDorado", "/pmwiki/pmwiki.php/WesternAnimation/WonderWoman", "/pmwiki/pmwiki.php/Film/TheMaskOfZorro", "/pmwiki/pmwiki.php/Series/Zorro", "/pmwiki/pmwiki.php/Creator/GuyWilliams", "/pmwiki/pmwiki.php/Franchise/Zorro", "/pmwiki/pmwiki.php/Film/TheMarkOfZorro", "/pmwiki/pmwiki.php/Film/LostInSpace", "/pmwiki/pmwiki.php/Film/TheLegendOfZorro", "/pmwiki/pmwiki.php/Film/MontyPythonAndTheHolyGrail", "/pmwiki/pmwiki.php/Literature/SienkiewiczTrilogy", "/pmwiki/pmwiki.php/Film/TheGreatRace", "/pmwiki/pmwiki.php/Film/ThePrincessBride", "/pmwiki/pmwiki.php/Franchise/StarWars", "/pmwiki/pmwiki.php/Film/ANewHope", "/pmwiki/pmwiki.php/Creator/DavidProwse", "/pmwiki/pmwiki.php/Film/TheEmpireStrikesBack", "/pmwiki/pmwiki.php/Film/ReturnOfTheJedi", "/pmwiki/pmwiki.php/Creator/GeorgeLucas", "/pmwiki/pmwiki.php/Literature/XWingSeries", "/pmwiki/pmwiki.php/Creator/BasilRathbone", "/pmwiki/pmwiki.php/Film/CaptainBlood", "/pmwiki/pmwiki.php/Film/TheAdventuresOfRobinHood", "/pmwiki/pmwiki.php/Franchise/SherlockHolmes", "/pmwiki/pmwiki.php/Creator/DannyKaye", "/pmwiki/pmwiki.php/Film/TheCourtJester", "/pmwiki/pmwiki.php/Film/TheSeaHawk", "/pmwiki/pmwiki.php/Film/Scaramouche", "/pmwiki/pmwiki.php/Film/PiratesOfTheCaribbeanDeadMansChest", "/pmwiki/pmwiki.php/Film/PiratesOfTheCaribbeanTheCurseOfTheBlackPearl", "/pmwiki/pmwiki.php/Film/PiratesOfTheCaribbeanAtWorldsEnd", "/pmwiki/pmwiki.php/Film/TheThreeMusketeers1973", "/pmwiki/pmwiki.php/Creator/ChristopherLee", "/pmwiki/pmwiki.php/Creator/OliverReed", "/pmwiki/pmwiki.php/Film/BroadwayMelody", "/pmwiki/pmwiki.php/Film/RobRoy", "/pmwiki/pmwiki.php/Film/SeventeenSeventySix", "/pmwiki/pmwiki.php/Film/RobinHoodMenInTights", "/pmwiki/pmwiki.php/Film/Troy", "/pmwiki/pmwiki.php/Film/NateAndHayes", "/pmwiki/pmwiki.php/Film/Highlander", "/pmwiki/pmwiki.php/Film/Hook", "/pmwiki/pmwiki.php/Creator/RogerEbert", "/pmwiki/pmwiki.php/Film/CutthroatIsland", "/pmwiki/pmwiki.php/Film/TheAdventureOfSherlockHolmesSmarterBrother", "/pmwiki/pmwiki.php/Film/ShanghaiKnights", "/pmwiki/pmwiki.php/Film/Gladiator", "/pmwiki/pmwiki.php/Film/If", "/pmwiki/pmwiki.php/Film/CyranoDeBergerac", "/pmwiki/pmwiki.php/Film/SherlockHolmes2009", "/pmwiki/pmwiki.php/Film/SherlockHolmesAGameOfShadows", "/pmwiki/pmwiki.php/Film/RedSonja", "/pmwiki/pmwiki.php/Film/TheLordOfTheRings", "/pmwiki/pmwiki.php/Film/TheRocketeer", "/pmwiki/pmwiki.php/Film/TheScarletPimpernel1982", "/pmwiki/pmwiki.php/Film/RobinAndMarian", "/pmwiki/pmwiki.php/Film/TheThreeMusketeers1973", "/pmwiki/pmwiki.php/Film/KingdomOfHeaven", "/pmwiki/pmwiki.php/Creator/JohnRitter", "/pmwiki/pmwiki.php/Film/StayTuned", "/pmwiki/pmwiki.php/Film/MyFavoriteYear", "/pmwiki/pmwiki.php/Film/ThePhantom1996", "/pmwiki/pmwiki.php/Film/ByTheSword", "/pmwiki/pmwiki.php/Film/AnneOfTheIndies", "/pmwiki/pmwiki.php/Film/Paddington2", "/pmwiki/pmwiki.php/Film/Centurion", "/pmwiki/pmwiki.php/Film/DieAnotherDay", "/pmwiki/pmwiki.php/Film/MastersOfTheUniverse", "/pmwiki/pmwiki.php/Literature/Discworld", "/pmwiki/pmwiki.php/Literature/TheSagaOfDarrenShan", "/pmwiki/pmwiki.php/Literature/HeraldsOfValdemar", "/pmwiki/pmwiki.php/Literature/GentlemanBastard", "/pmwiki/pmwiki.php/Literature/TheCurseOfChalion", "/pmwiki/pmwiki.php/Literature/KingpriestTrilogy", "/pmwiki/pmwiki.php/Literature/PrinceCaspian", "/pmwiki/pmwiki.php/Literature/PerryRhodan", "/pmwiki/pmwiki.php/Literature/TheBelgariad", "/pmwiki/pmwiki.php/Literature/TheElenium", "/pmwiki/pmwiki.php/Literature/ElsabethSoesten", "/pmwiki/pmwiki.php/Literature/Sandokan", "/pmwiki/pmwiki.php/Creator/CliveCussler", "/pmwiki/pmwiki.php/Literature/DirkPittAdventures", "/pmwiki/pmwiki.php/Literature/TheStormlightArchive", "/pmwiki/pmwiki.php/Literature/TheWheelOfTime", "/pmwiki/pmwiki.php/Literature/TheBrotherhoodOfTheBlackFlag", "/pmwiki/pmwiki.php/Series/Angel", "/pmwiki/pmwiki.php/Series/BuffyTheVampireSlayer", "/pmwiki/pmwiki.php/Series/Cadfael", "/pmwiki/pmwiki.php/Series/DoctorWho", "/pmwiki/pmwiki.php/Series/Frasier", "/pmwiki/pmwiki.php/Series/MightyMorphinPowerRangers", "/pmwiki/pmwiki.php/Series/Firefly", "/pmwiki/pmwiki.php/Film/HelenOfTroy", "/pmwiki/pmwiki.php/Series/Highlander", "/pmwiki/pmwiki.php/Creator/AdrianPaul", "/pmwiki/pmwiki.php/Series/HowIMetYourMother", "/pmwiki/pmwiki.php/Series/ICarly", "/pmwiki/pmwiki.php/Series/KamenRider555", "/pmwiki/pmwiki.php/Franchise/KamenRider", "/pmwiki/pmwiki.php/Series/LegendOfTheSeeker", "/pmwiki/pmwiki.php/Series/Merlin2008", "/pmwiki/pmwiki.php/Series/OnceUponATime", "/pmwiki/pmwiki.php/Series/Primeval", "/pmwiki/pmwiki.php/Myth/RobinHood", "/pmwiki/pmwiki.php/Series/RobinOfSherwood", "/pmwiki/pmwiki.php/Series/Sharpe", "/pmwiki/pmwiki.php/Literature/Shogun", "/pmwiki/pmwiki.php/Series/SlingsAndArrows", "/pmwiki/pmwiki.php/Series/SpartacusBloodAndSand", "/pmwiki/pmwiki.php/Series/StudioC", "/pmwiki/pmwiki.php/VideoGame/FullTiltPinball", "/pmwiki/pmwiki.php/TabletopGame/Warhammer40000", "/pmwiki/pmwiki.php/TabletopGame/DungeonsAndDragons", "/pmwiki/pmwiki.php/TabletopGame/RoleMaster", "/pmwiki/pmwiki.php/Theatre/SeventeenSeventySix", "/pmwiki/pmwiki.php/Theatre/Macbeth", "/pmwiki/pmwiki.php/Franchise/FinalFantasy", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyIX", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyXII", "/pmwiki/pmwiki.php/VideoGame/DevilMayCry", "/pmwiki/pmwiki.php/VideoGame/MonkeyIsland", "/pmwiki/pmwiki.php/Film/PiratesOfTheCaribbeanDeadMansChest", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaTwilightPrincess", "/pmwiki/pmwiki.php/Franchise/FireEmblem", "/pmwiki/pmwiki.php/VideoGame/FireEmblemJugdral", "/pmwiki/pmwiki.php/VideoGame/FireEmblemElibe", "/pmwiki/pmwiki.php/VideoGame/FireEmblemTheSacredStones", "/pmwiki/pmwiki.php/VideoGame/WorldOfWarcraft", "/pmwiki/pmwiki.php/VideoGame/BushidoBlade", "/pmwiki/pmwiki.php/VideoGame/SoulSeries", "/pmwiki/pmwiki.php/VisualNovel/FateStayNight", "/pmwiki/pmwiki.php/VideoGame/PrinceOfPersia1", "/pmwiki/pmwiki.php/Creator/ErrolFlynn", "/pmwiki/pmwiki.php/Creator/BasilRathbone", "/pmwiki/pmwiki.php/Film/TheAdventuresOfRobinHood", "/pmwiki/pmwiki.php/VideoGame/MetalGearSolid4GunsOfThePatriots", "/pmwiki/pmwiki.php/Creator/NealStephenson", "/pmwiki/pmwiki.php/VideoGame/SidMeiersPirates", "/pmwiki/pmwiki.php/VideoGame/MountAndBlade", "/pmwiki/pmwiki.php/VideoGame/Nidhogg", "/pmwiki/pmwiki.php/VideoGame/BattleChess", "/pmwiki/pmwiki.php/Film/RyanVsDorkman", "/pmwiki/pmwiki.php/WesternAnimation/AvatarTheLastAirbender", "/pmwiki/pmwiki.php/WesternAnimation/FamilyGuy", "/pmwiki/pmwiki.php/WesternAnimation/StarWarsCloneWars", "/pmwiki/pmwiki.php/Franchise/StarWars", "/pmwiki/pmwiki.php/WesternAnimation/StarWarsTheCloneWars", "/pmwiki/pmwiki.php/WesternAnimation/StarWarsRebels", "/pmwiki/pmwiki.php/WesternAnimation/LooneyTunes", "/pmwiki/pmwiki.php/WesternAnimation/TheScarletPumpernickel", "/pmwiki/pmwiki.php/WesternAnimation/DaffyDuck", "/pmwiki/pmwiki.php/WesternAnimation/StevenUniverse"], "non_media_links": ["/pmwiki/pmwiki.php/Main/SwordFight", "/pmwiki/pmwiki.php/Main/Swashbuckler", "/pmwiki/pmwiki.php/Main/Movies", "/pmwiki/pmwiki.php/Main/TheCoconutEffect", "/pmwiki/pmwiki.php/UsefulNotes/Kendo", "/pmwiki/pmwiki.php/Main/EverythingsBetterWithSpinning", "/pmwiki/pmwiki.php/Main/BladeLock", "/pmwiki/pmwiki.php/Main/BladeLock", "/pmwiki/pmwiki.php/Main/NoOSHACompliance", "/pmwiki/pmwiki.php/Main/ChandelierSwing", "/pmwiki/pmwiki.php/Main/ExoticWeaponSupremacy", "/pmwiki/pmwiki.php/Main/DualWielding", "/pmwiki/pmwiki.php/Main/ImprobableUseOfAWeapon", "/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/Main/SliceAndDiceSwordsmanship", "/pmwiki/pmwiki.php/Main/MediaWatchdog", "/pmwiki/pmwiki.php/Main/ThinkOfTheChildren", "/pmwiki/pmwiki.php/Main/BoringButPractical", "/pmwiki/pmwiki.php/Main/Anticlimax", "/pmwiki/pmwiki.php/Main/Anime", "/pmwiki/pmwiki.php/Main/LimitedAnimation", "/pmwiki/pmwiki.php/Administrivia/TropesAreTools", "/pmwiki/pmwiki.php/Main/RuleOfCool", "/pmwiki/pmwiki.php/Main/RuleOfCool", "/pmwiki/pmwiki.php/Main/ATeamFiring", "/pmwiki/pmwiki.php/Main/SingleStrokeBattle", "/pmwiki/pmwiki.php/Main/AnachronismStew", "/pmwiki/pmwiki.php/Main/AcceptableBreaksFromReality", "/pmwiki/pmwiki.php/Main/UsefulNotes", "/pmwiki/pmwiki.php/UsefulNotes/EuropeanSwordsmanship", "/pmwiki/pmwiki.php/UsefulNotes/Kenjutsu", "/pmwiki/pmwiki.php/Analysis/Flynning", "/pmwiki/pmwiki.php/Main/ClothingDamage", "/pmwiki/pmwiki.php/Main/Deconstruction", "/pmwiki/pmwiki.php/Main/LampshadeHanging", "/pmwiki/pmwiki.php/Main/FlawExploitation", "/pmwiki/pmwiki.php/Main/KnifeFight", "/pmwiki/pmwiki.php/Main/HumongousMecha", "/pmwiki/pmwiki.php/Main/TechnicalPacifist", "/pmwiki/pmwiki.php/Main/MadeOfIron", "/pmwiki/pmwiki.php/Main/PsychoForHire", "/pmwiki/pmwiki.php/Main/OneHitKill", "/pmwiki/pmwiki.php/Main/ArtisticLicenseMartialArts", "/pmwiki/pmwiki.php/Roleplay/RecordOfLodossWar", "/pmwiki/pmwiki.php/Main/LaResistance", "/pmwiki/pmwiki.php/Main/ObviouslyEvil", "/pmwiki/pmwiki.php/Main/Justified", "/pmwiki/pmwiki.php/Main/OneHitKill", "/pmwiki/pmwiki.php/Main/LifeOrLimbDecision", "/pmwiki/pmwiki.php/Main/AvertedTrope", "/pmwiki/pmwiki.php/Main/JustifiedTrope", "/pmwiki/pmwiki.php/Main/CharlesAtlasSuperpower", "/pmwiki/pmwiki.php/Main/SingleStrokeBattle", "/pmwiki/pmwiki.php/Main/MistakenForDying", "/pmwiki/pmwiki.php/Main/Averted", "/pmwiki/pmwiki.php/Main/CruelMercy", "/pmwiki/pmwiki.php/Main/JustifiedTrope", "/pmwiki/pmwiki.php/Main/RealityEnsues", "https://www.fanfiction.net/s/10757566/1/Danny-Phantom-Unlimited-Halloween", "/pmwiki/pmwiki.php/Main/DepartmentOfRedundancyDepartment", "/pmwiki/pmwiki.php/Main/ExpandedUniverse", "https://www.fanfiction.net/s/5598298/1/Il-se-passait-au-nuit-du-P<!--C3-->A8re-Porcher", "/pmwiki/pmwiki.php/Main/TookALevelInBadass", "https://www.youtube.com/watch?v=ARbcD3lhXEU", "/pmwiki/pmwiki.php/WebVideo/ScholaGladiatoria", "/pmwiki/pmwiki.php/Main/SliceAndDiceSwordsmanship", "/pmwiki/pmwiki.php/Main/ForcedPerspective", "/pmwiki/pmwiki.php/Main/BladeLock", "/pmwiki/pmwiki.php/Main/PlayedForLaughs", "/pmwiki/pmwiki.php/Main/YouShallNotPass", "/pmwiki/pmwiki.php/Main/BloodyHilarious", "/pmwiki/pmwiki.php/Main/SkewedPriorities", "https://www.youtube.com/watch?v=ljExTEPNFnM", "/pmwiki/pmwiki.php/Main/GetItOverWith", "/pmwiki/pmwiki.php/Main/WordOfGod", "/pmwiki/pmwiki.php/Main/IAmNotLeftHanded", "/pmwiki/pmwiki.php/Main/CombatPragmatist", "/pmwiki/pmwiki.php/Main/HeroicSecondWind", "https://www.youtube.com/watch?v=a9J1vC-4wTs", "/pmwiki/pmwiki.php/Main/ChekhovsSkill", "https://www.youtube.com/watch?v=J0mUVY9fLlw", "/pmwiki/pmwiki.php/Main/DownPlayedTrope", "/pmwiki/pmwiki.php/Main/AWizardDidIt", "http://starwars.wikia.com/wiki/Lightsaber_combat", "/pmwiki/pmwiki.php/Main/ArchaicWeaponForAnAdvancedAge", "/pmwiki/pmwiki.php/Main/DuelToTheDeath", "/pmwiki/pmwiki.php/UsefulNotes/TheGoldenAgeOfHollywood", "/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/SugarWiki/MomentOfAwesome", "/pmwiki/pmwiki.php/SugarWiki/MomentOfAwesome", "https://www.youtube.com/watch?v=p2r7hq5Wkrs", "/pmwiki/pmwiki.php/Main/BareHandedBladeBlock", "https://www.youtube.com/watch?v=27M5KWI_q50", "/pmwiki/pmwiki.php/Main/CherryTapping", "/pmwiki/pmwiki.php/Main/JustifiedTrope", "/pmwiki/pmwiki.php/Main/ExcuseMeWhileIMultitask", "https://en.wikipedia.org/wiki/Bartitsu", "/pmwiki/pmwiki.php/Main/CombatPragmatism", "/pmwiki/pmwiki.php/Main/GetItOverWith", "/pmwiki/pmwiki.php/Main/DuelToTheDeath", "/pmwiki/pmwiki.php/Main/DiscussedTrope", "/pmwiki/pmwiki.php/Main/AwesomeButImpractical", "/pmwiki/pmwiki.php/Main/HypocriticalHumor", "/pmwiki/pmwiki.php/Main/OneWingedAngel", "/pmwiki/pmwiki.php/Discworld/Maskerade", "/pmwiki/pmwiki.php/Discworld/MovingPictures", "/pmwiki/pmwiki.php/Discworld/WyrdSisters", "/pmwiki/pmwiki.php/Main/Exploited", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Discworld/MonstrousRegiment", "/pmwiki/pmwiki.php/Main/LampshadeHanging", "/pmwiki/pmwiki.php/Main/LampshadeHanging", "/pmwiki/pmwiki.php/Main/ImpostorForgotOneDetail", "/pmwiki/pmwiki.php/Main/ShownTheirWork", "/pmwiki/pmwiki.php/Main/RatedMForManly", "https://www.youtube.com/watch?v=zGQ0epxHd8I", "/pmwiki/pmwiki.php/Main/NoodleIncident", "/pmwiki/pmwiki.php/Recap/AngelS03E06Billy", "/pmwiki/pmwiki.php/Recap/DoctorWhoS9E3TheSeaDevils", "/pmwiki/pmwiki.php/Recap/DoctorWhoS16E4TheAndroidsOfTara", "/pmwiki/pmwiki.php/Recap/DoctorWhoS20E6TheKingsDemons", "https://www.youtube.com/watch?v=tQwYpezshCE", "/pmwiki/pmwiki.php/Recap/DoctorWhoS26E1Battlefield", "/pmwiki/pmwiki.php/Recap/DoctorWho2005CSTheChristmasInvasion", "/pmwiki/pmwiki.php/Recap/DoctorWhoS34E3RobotOfSherwood", "/pmwiki/pmwiki.php/Main/FridgeBrilliance", "/pmwiki/pmwiki.php/Main/TechnicalPacifist", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Main/JustifiedTrope", "/pmwiki/pmwiki.php/Recap/FireflyE04Shindig", "/pmwiki/pmwiki.php/Main/SwordFight", "https://www.youtube.com/watch?v=qFBK-eVl76M", "/pmwiki/pmwiki.php/Main/RuleOfCool", "/pmwiki/pmwiki.php/Main/TheOner", "/pmwiki/pmwiki.php/Main/FridgeBrilliance", "/pmwiki/pmwiki.php/Main/TheRival", "/pmwiki/pmwiki.php/Recap/MerlinS03E11TheSorcerersShadow", "/pmwiki/pmwiki.php/Main/GoryDiscretionShot", "/pmwiki/pmwiki.php/Main/BloodlessCarnage", "/pmwiki/pmwiki.php/Main/FridgeBrilliance", "/pmwiki/pmwiki.php/Recap/SharpeS2E3SharpesHonour", "/pmwiki/pmwiki.php/CombatPragmatist/RealLife", "https://www.youtube.com/watch?v=xGv7Cc7zpAE", "/pmwiki/pmwiki.php/Main/DamselInDistress", "/pmwiki/pmwiki.php/Main/ExcuseMeWhileIMultitask", "/pmwiki/pmwiki.php/Main/CleanCut", "/pmwiki/pmwiki.php/Main/EverythingsBetterWithSpinning", "/pmwiki/pmwiki.php/Pinball/BlackRose", "/pmwiki/pmwiki.php/Pinball/PiratesOfTheCaribbean", "/pmwiki/pmwiki.php/Main/MatchSequence", "/pmwiki/pmwiki.php/Pinball/Hook", "/pmwiki/pmwiki.php/Main/ImprovisedWeapon", "/pmwiki/pmwiki.php/Main/LeeroyJenkins", "https://en.wikipedia.org/wiki/Risk_compensation#Peltzman_effect", "https://en.wikipedia.org/wiki/Flick_(fencing)", "/pmwiki/pmwiki.php/Main/SeriousBusiness", "/pmwiki/pmwiki.php/UsefulNotes/Kenjutsu", "/pmwiki/pmwiki.php/Main/WoodenKatanasAreEvenBetter", "/pmwiki/pmwiki.php/UsefulNotes/WorldWarII", "https://en.wikipedia.org/wiki/Academic_fencing", "/pmwiki/pmwiki.php/Main/DuelingScar", "/pmwiki/pmwiki.php/Main/AwesomeButImpractical", "/pmwiki/pmwiki.php/TableTopGame/Pathfinder", "/pmwiki/pmwiki.php/Main/GladiatorGames", "/pmwiki/pmwiki.php/Main/RuleOfCool", "/pmwiki/pmwiki.php/Main/GunTwirling", "/pmwiki/pmwiki.php/Main/RealityEnsues", "/pmwiki/pmwiki.php/Main/YouFightLikeACow", "/pmwiki/pmwiki.php/UsefulNotes/Wii", "/pmwiki/pmwiki.php/Main/EverythingsBetterWithSpinning", "/pmwiki/pmwiki.php/Main/AudibleSharpness", "/pmwiki/pmwiki.php/Main/OurElvesAreBetter", "/pmwiki/pmwiki.php/Main/FightingGame", "/pmwiki/pmwiki.php/Main/HitPoints", "/pmwiki/pmwiki.php/Main/OnlyAFleshWound", "/pmwiki/pmwiki.php/Main/BFS", "/pmwiki/pmwiki.php/Main/NighInvulnerable", "http://www.kickstarter.com/projects/260688528/clang", "/pmwiki/pmwiki.php/Main/BreakableWeapons", "/pmwiki/pmwiki.php/Main/CrossCounter", "/pmwiki/pmwiki.php/Main/ConfusionFu", "/pmwiki/pmwiki.php/Main/WhyDontYaJustShootHim", "/pmwiki/pmwiki.php/WebVideo/TheGuild", "/pmwiki/pmwiki.php/WebVideo/SuburbanKnights", "/pmwiki/pmwiki.php/Main/Mooks", "https://www.youtube.com/watch?v=RATMJ8JH1qo", "https://www.youtube.com/watch?v=Cn36Pb8z3yI", "https://youtu.be/B2w5ciclhg8", "/pmwiki/pmwiki.php/UsefulNotes/KnightFever", "/pmwiki/pmwiki.php/Main/DVDCommentary", "/pmwiki/pmwiki.php/Main/SingleStrokeBattle", "/pmwiki/pmwiki.php/Main/AttackItsWeakPoint", "/pmwiki/pmwiki.php/Main/SecretTestOfCharacter", "/pmwiki/pmwiki.php/Main/SwordFight", "/pmwiki/pmwiki.php/Main/AffectionateParody", "/pmwiki/pmwiki.php/Main/CombatPragmatist", "/pmwiki/pmwiki.php/Main/MasterSwordsman", "/pmwiki/pmwiki.php/Main/NoFourthWall", "/pmwiki/pmwiki.php/Recap/StevenUniverseS1E16StevenTheSwordFighter"]}