{"title": "Symbolic Baptism", "content": "\"Young I was, and vain, but the sea washed my follies and my vanities away. That man drowned, nephew. His lungs filled with seawater, and the fish ate the scales off his eyes. When I rose again, I saw clearly.\"\n\nA common sacrament among strains of Christianity is baptism , where a person is either immersed or washed in water as part of their initiation into the Church. The person is thus washed \"clean\" of their past sins, and is ready to begin a new life as a Christian.\n\nIn fiction, \"symbolic\" baptism can be a sign of Character Development, where swimming or watery immersion marks a major turning point in the characters' life. Most commonly, it marks the point where the character begins to let go of the past, or is initiated into a new phase of their life. Sometimes such scenes are a Near-Death Experience with the character almost drowning, reinforcing the notion of spiritual rebirth.\n\nSister Trope to Redemption in the Rain.\n• Final Fantasy VII: Advent Children ends with a heroic character creating a pool of water beyond the grave. This mysterious pool cures Geostigma, a disease born of the villain's hatred, of anyone who steps in the pool.\n• Book 5 Chapter 0 of Princeless features main character Adrienne and sidekick Bedelia having fun in a lake and swimming around. As they play, Adri talks about her experiences with her hair and how she was insecure about it and how it hindered her. She convinces herself to cut it all off and feels much better about herself and her journey.\n• In the Empath: The Luckiest Smurf story \"The Innocence Of A Smurf\", Empath goes through a baptism in the Pool of Souls as a young Smurf to be initiated as a member of the Smurfs, with Tapper acting in the role of John the Baptist. The annual ritual of swimming across the Pool of Souls during Redemption Day to test one's innocence results in Empath dying in that story's particular instance for taking the life of a Psyche during a training fight, only to be resurrected as the spirits of the Pool judge him worthy of a second chance at life.\n• Pentecostal preacher Sonny Dewey from The Apostle 1997 flees Texas after cracking the head of his wife's lover with a bat. While a fugitive in Louisiana, Dewey takes a new identity as \"the Apostle E.F.\" during a self-baptism in a local river.\n• Dogma: Bethany, having just learned that she is the descendant of Jesus Christ , takes of running in a blind panic, falling in a creek and flailing about helplessly in the water as she screams at the heavens demanding to know why she has to carry this burden. The Metatron soon arrives to calm her down, agree with her that it is horribly unfair to her, just as it was for Jesus to learn he was the son of the Almighty, and convincing her to continue her mission.\n• Forrest Gump: Lt. Dan swimming in the ocean after a hurricane almost destroys his and Gump's shrimp boat, where he comes to terms with his PTSD. Forrest believes that's the moment where \"he made his peace with God.\"\n• Gattaca: The protagonist competes routinely with his genetically superior younger brother in swimming races out to the furthest possible point. A pivotal moment in his childhood and resolving to lie about his genetic status comes when he finally wins a race against his brother, proving that he could do anything he set his mind too, genetics be damned. When the stunt is repeated late in life and he once again triumphs, he reveals his secrete to success with his brother He never planned to make the return trip and was determined to swim out as far as he could, return trip be damned. He was counting on his brother calculating for the return trip.\n• Gravity ends with Dr. Stone unsteadily walking out of a lake: a literal return to life on Earth after a grueling trial to escape death on a space mission gone wrong.\n• Justice League (2017): Superman's resurrection via Motherbox involves immersing him in water.\n• Marvel Cinematic Universe:\n• Captain America: The Winter Soldier: Bucky/The Winter Soldier dives into the Potomac and rescue an unconscious Steve, explicitly disobeying HYDRA (who ordered him to kill Steve) for the first time onscreen. When we next see him he's visiting the Howling Commando's exhibit, seemingly on the way to reclaiming his life.\n• Doctor Strange (2016): The car crash which damages Stephen's hands (and consequently sets him off his Character Development) ends with the car backflipping into the water.\n• The Matrix: When Neo is first unplugged from the Matrix, he wakes up in womb-like a pod filled with a reddish liquid which drains and flushes him into the hands of his allies. This is his first experience in actual reality.\n• Moonlight: Juan taking Chiron into the ocean to teach him how to swim, marking the moment when Chiron learns how to become self-reliant. Director Barry Jenkins even described it as \"a baptism\"\n• Played for Laughs in O Brother, Where Art Thou? when the escaped convicts Pete and Delmar stumble onto a group baptism in a river and jump at the chance to start over with a clean slate... which mostly means doing exactly what they were before. They're also a bit confused to hear that it doesn't actually do anything for their criminal records. Delmar: But they was witnesses that seen us redeemed. \n\nEverett: Even if it did put you square with the Lord, the state of Mississippi's a little more hard-nosed.\n• Spider-Man 3: Cranked Up to Eleven. After freeing himself from the symbiote at the church, Peter takes a long hot shower, marking that he's let go of the symbiote and all the negativity it represented.\n• The Truman Show: Water plays a huge role in the film, marking Truman's conflicting fear of and desire for freedom. It's only by passing through the ocean and storm that he ultimately escapes the show.\n• The Godfather: While Michael Corleone is standing as godfather to his nephew Michael Rizzi, he's got his soldiers performing a coordinated hit against the heads of the rival Five Families. While his nephew is being sincerely baptized by the Church, Michael is being baptized symbolically in the blood of his family's enemies as a Mafia don.\n• It: Chapter Two: The first thing the Losers do after is going to the quarry and jumping into the river below, to clean themselves literally and spiritually.\n• The Divine Comedy:\n• At the foot of Mount Purgatory, Dante bathes himself in the water of Lethe, the Greek river believed to erase memories, to wash away the grime of Hell. Without that stain, Dante can start to ascend towards the heavens.\n• At the peak of Mount Purgatory, Dante is again bathed in the water of Lethe, apparently not having fully let go of his memory of evil. After this, Dante is bathed in the waters of Eunoe to prepare himself to enter Heaven, but Purgatorio has to skip over this event to fit into the poem's rigid structure.\n• The Trope Codifier is the baptism of Jesus in The Four Gospels, where the Messiah agrees to be submerged in water not to begin his own rebirth (he was cool with the whole perfect God thing), but to mark the redemption of all of mankind. This ritual would go on to mark the beginning of Christian life for converts mentioned in the Acts of the Apostles and others that appeared in the two millennia afters Acts was written.\n• A Song of Ice and Fire: Theon's uncle Aerion goes from a hedonistic party animal to a grim priest after almost drowning.\n• Star Wars: From a Certain Point of View implies that Luke being attacked by the Dianoga was meant to be this, forcing him to face near-certain death with only his friends to help him, with the Dianoga only doing the Force's will.\n• In an episode of 21 Jump Street, when a pastor's son touches a fellow female student of a Bible study group that he is attracted to, he ends up going into a river to frantically wash himself from that \"sin\" he committed by repeated baptism.\n• BioShock begins with the protagonist Jack being the only survivor of a plane crash into the ocean, then swimming up to the lighthouse. He then takes the bathysphere down to Rapture, where he learns the truth about his birth/creation, and where his decisions to save or harvest the Little Sisters ultimately determine the kind of person he becomes when he returns to the surface.\n• Bioshock Infinite: Motif throughout the game.\n• When Booker enters the lighthouse he can examine and dismiss a wash basin, foreshadowing the plot twist regarding Booker's decision to reject the baptism and live with his sins .\n• Zachary Comstock's baptism after partaking in the Wounded Knee Massacre marks his Start of Darkness as he reforms into a radical with murderous zeal. After The Reveal that is Comstock from an alternate universe who wasn't baptized, Elizabeth decides to prevent Comstock from being \"born\" and drown all possible versions of him at his baptism.\n• In The Stinger of Final Fantasy X Tidus, after fading away during the ending, is more or less literally reborn underwater.\n• Kingdom Hearts I begins with Sora falling deep into the ocean. While the ambiguously underwater setting is mainly a tutorial session, it also marks when Sora is first made aware of his destiny as a Keyblade master.\n• In the opening of Life Is Strange, Max excuses herself to the ladies room to splash water on her face. She then promptly acquires her Time Master powers (which make up the main game mechanic). At the end of the game this moment is what she jumps back to, if the player chooses to sacrifice Chloe and Cosmic Retcon away the entire game's events.\n• During the fifth season of Samurai Jack, Ashi, as part of her Heelface Turn, jumps into a lake to scrub the black ash covering her body and fashions a new outfit out of weeds.\n• Star Wars Resistance: In the penultimate episode of season 1, Yeager shoves Kaz into the ocean to cover his escape, getting captured in the meanwhile. Losing the last authority figure in his life completes Kaz's arc of learning to stand on his own, and by the time he gets out, he's ready to lead the others in taking back the Colossus.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/SymbolicBaptism", "media_links": ["/pmwiki/pmwiki.php/Literature/AFeastForCrows", "/pmwiki/pmwiki.php/Anime/FinalFantasyVIIAdventChildren", "/pmwiki/pmwiki.php/ComicBook/Princeless", "/pmwiki/pmwiki.php/Film/TheApostle1997", "/pmwiki/pmwiki.php/Film/Dogma", "/pmwiki/pmwiki.php/Film/ForrestGump", "/pmwiki/pmwiki.php/Film/Gattaca", "/pmwiki/pmwiki.php/Film/Gravity", "/pmwiki/pmwiki.php/Film/JusticeLeague2017", "/pmwiki/pmwiki.php/Franchise/MarvelCinematicUniverse", "/pmwiki/pmwiki.php/Film/CaptainAmericaTheWinterSoldier", "/pmwiki/pmwiki.php/Film/DoctorStrange2016", "/pmwiki/pmwiki.php/Film/TheMatrix", "/pmwiki/pmwiki.php/Film/Moonlight", "/pmwiki/pmwiki.php/Film/OBrotherWhereArtThou", "/pmwiki/pmwiki.php/Film/SpiderMan3", "/pmwiki/pmwiki.php/Film/TheTrumanShow", "/pmwiki/pmwiki.php/Film/TheGodfather", "/pmwiki/pmwiki.php/Film/ItChapterTwo", "/pmwiki/pmwiki.php/Literature/TheDivineComedy", "/pmwiki/pmwiki.php/Literature/TheFourGospels", "/pmwiki/pmwiki.php/Literature/ActsOfTheApostles", "/pmwiki/pmwiki.php/Literature/ASongOfIceAndFire", "/pmwiki/pmwiki.php/Franchise/StarWars", "/pmwiki/pmwiki.php/Literature/FromACertainPointOfView", "/pmwiki/pmwiki.php/Film/ANewHope", "/pmwiki/pmwiki.php/Series/TwentyOneJumpStreet", "/pmwiki/pmwiki.php/VideoGame/BioShock1", "/pmwiki/pmwiki.php/VideoGame/BioshockInfinite", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyX", "/pmwiki/pmwiki.php/VideoGame/KingdomHeartsI", "/pmwiki/pmwiki.php/VideoGame/LifeIsStrange", "/pmwiki/pmwiki.php/WesternAnimation/SamuraiJack", "/pmwiki/pmwiki.php/WesternAnimation/StarWarsResistance"], "non_media_links": ["https://en.wikipedia.org/wiki/Baptism", "/pmwiki/pmwiki.php/Main/CharacterDevelopment", "/pmwiki/pmwiki.php/Main/NearDeathExperience", "/pmwiki/pmwiki.php/Main/SisterTrope", "/pmwiki/pmwiki.php/Main/RedemptionInTheRain", "/pmwiki/pmwiki.php/Main/Anime", "/pmwiki/pmwiki.php/Main/Manga", "/pmwiki/pmwiki.php/Main/FanWorks", "/pmwiki/pmwiki.php/Fanfic/EmpathTheLuckiestSmurf", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/SmiteMeOhMightySmiter", "/pmwiki/pmwiki.php/Main/MissionFromGod", "/pmwiki/pmwiki.php/Main/CharacterDevelopment", "/pmwiki/pmwiki.php/Main/PlayedForLaughs", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/LaserGuidedAmnesia", "/pmwiki/pmwiki.php/Main/TropeCodifier", "/pmwiki/pmwiki.php/UsefulNotes/Jesus", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/UnderwaterCity", "/pmwiki/pmwiki.php/UsefulNotes/NativeAmericans", "/pmwiki/pmwiki.php/Main/StartOfDarkness", "/pmwiki/pmwiki.php/Main/TheReveal", "/pmwiki/pmwiki.php/Main/TheStinger", "/pmwiki/pmwiki.php/Main/PlayerCharacter", "/pmwiki/pmwiki.php/Main/TimeMaster", "/pmwiki/pmwiki.php/Main/CosmicRetcon", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/HeelfaceTurn"]}