{"title": "First Father Wins", "content": "One quick way to establish conflict for a male lead (and it is almost always a guy used in this trope) is to make them a divorced father. The story will usually open with a first act divorce or some time after it has taken place, with the children old enough to start resenting their dad for \"leaving them\". For whatever reason things didn't work out with his Love Interest and they separated, with her usually keeping near complete custody.\n\nFor whatever reason, it's always implied it's the dad whose flaw(s) led to the divorce; While the ex may be snarky, resentful or exasperated in their interactions, neither the lead nor usually the children will act as if she was the problem. Still, just as often this makes us sympathise with the father more, if she comes off as seriously insensitive or unforgiving in the course of this.\n\nShe will have either remarried, gotten a fiancé or is seriously dating someone else. Since she has custody of the kids, the First Dad will be worried the Step Dad will win them over because he has more time with them and he's handsomer, more successful, more empathetic and an all around better dad (though a painfully dull and \"safe\" rebound guy is also possible). The kids, usually boy and girl pair, will have one of four relationships with the First Dad and Step Dad: passive aggressiveness, wary distance, civil cohabitation, or a loving and respectful rapport. For variety and contrast, they usually each have a different relationship with the dad and step dad.\n\nThere are two variants:\n\nFamily-focus variant: The lead thinks they should get back together, which his ex wife will rebuff because \"You haven't changed\" the underlying character flaws that led to the divorce. As the plot progresses, he'll win back his ex wife, the Step Dad will be revealed to be a Jerkass and get killed off or sent packing, he'll completely patch up his relationship with his kids and they'll all reunite and live Happily Ever After.\n\nChild-focus variant: This variant focuses on the child (and in this case, it's almost always a single child) over the family as a group. The lead and his ex-wife will be relatively civil, with surprisingly little UST (although he'll still needle her over her new significant other, and she may throw some snark his way). In this case the ex wife usually wants to be supportive of the lead, but is seeing the way his character flaw hurts the child. Expect the lead to be given \"one last chance\" often with the threat of a new job that will take the child to a different city. Of course, the lead blows it, leading his child to think he doesn't love them, before he makes it up to them in some over-the-top fashion and convinces his ex-wife to stay. Either he and the step-father will learn to respect each other and share their role in the child's life, or the step-father will bow out of the way for the good of the child (often leaving for the aforementioned new job).\n\nContrast Parent with New Paramour, where we usually root for the stepdad who's trying to win over the kids (in these stories, there usually isn't a First Dad around to hog the sympathy).\n\nIf the Kids Play Matchmaker, they may Invoke this trope to pair their mother back up with their father.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/FirstFatherWins", "media_links": ["/pmwiki/pmwiki.php/ComicBook/CassieLang", "/pmwiki/pmwiki.php/Film/TwoThousandTwelve", "/pmwiki/pmwiki.php/Film/AntMan", "/pmwiki/pmwiki.php/Film/BringingDownTheHouse", "/pmwiki/pmwiki.php/Film/DaddysHome", "/pmwiki/pmwiki.php/Creator/MarkWahlberg", "/pmwiki/pmwiki.php/Creator/WillFerrell", "/pmwiki/pmwiki.php/Film/DefinitelyMaybe", "/pmwiki/pmwiki.php/Film/DomesticDisturbance", "/pmwiki/pmwiki.php/Film/FallingDown", "/pmwiki/pmwiki.php/Film/TheFullMonty", "/pmwiki/pmwiki.php/Film/LiarLiar", "/pmwiki/pmwiki.php/Film/MrsDoubtfire", "/pmwiki/pmwiki.php/Creator/RobinWilliams", "/pmwiki/pmwiki.php/Film/NightAtTheMuseum", "/pmwiki/pmwiki.php/Film/OBrotherWhereArtThou", "/pmwiki/pmwiki.php/Film/TheRoyalTenenbaums", "/pmwiki/pmwiki.php/Film/RunFatboyRun", "/pmwiki/pmwiki.php/Film/TheSantaClause", "/pmwiki/pmwiki.php/Film/Sharknado", "/pmwiki/pmwiki.php/Film/Taken", "/pmwiki/pmwiki.php/Film/TheWarOfTheWorlds", "/pmwiki/pmwiki.php/Creator/TomCruise", "/pmwiki/pmwiki.php/Film/Weatherman", "/pmwiki/pmwiki.php/Literature/TheStrain", "/pmwiki/pmwiki.php/Series/Banshee", "/pmwiki/pmwiki.php/Series/HawaiiFive0", "/pmwiki/pmwiki.php/Series/Hung", "/pmwiki/pmwiki.php/Series/Innocent", "/pmwiki/pmwiki.php/Series/Justified", "/pmwiki/pmwiki.php/Series/MyNameIsEarl", "/pmwiki/pmwiki.php/Series/UnhappilyEverAfter", "/pmwiki/pmwiki.php/Film/TheHotChick", "/pmwiki/pmwiki.php/Series/TheWire", "/pmwiki/pmwiki.php/VideoGame/Persona3", "/pmwiki/pmwiki.php/Webcomic/BiterComics", "/pmwiki/pmwiki.php/Webcomic/Shortpacked", "/pmwiki/pmwiki.php/Creator/JamesMarsden", "/pmwiki/pmwiki.php/WesternAnimation/ToyStory"], "non_media_links": ["/pmwiki/pmwiki.php/Main/LoveInterest", "/pmwiki/pmwiki.php/Main/DerailingLoveInterests", "/pmwiki/pmwiki.php/Main/JerkAss", "/pmwiki/pmwiki.php/Main/CleaningUpRomanticLooseEnds", "/pmwiki/pmwiki.php/Main/HappilyEverAfter", "/pmwiki/pmwiki.php/Main/UST", "/pmwiki/pmwiki.php/Main/ParentWithNewParamour", "/pmwiki/pmwiki.php/Main/DisappearedDad", "/pmwiki/pmwiki.php/Main/KidsPlayMatchmaker", "/pmwiki/pmwiki.php/Main/InvokedTrope", "/pmwiki/pmwiki.php/Main/NiceGuy", "/pmwiki/pmwiki.php/Wrestling/JohnCena", "/pmwiki/pmwiki.php/Main/HereWeGoAgain", "/pmwiki/pmwiki.php/Main/AlasPoorVillain", "/pmwiki/pmwiki.php/Main/SuicideByCop", "http://www.imdb.com/title/tt0116581/", "/pmwiki/pmwiki.php/Main/UST", "/pmwiki/pmwiki.php/Main/DoubleSubverted", "/pmwiki/pmwiki.php/Main/PlayedWith", "/pmwiki/pmwiki.php/Main/SantaClaus", "/pmwiki/pmwiki.php/Main/JerkAss", "/pmwiki/pmwiki.php/Main/WildMassGuessing", "/pmwiki/pmwiki.php/Main/PoesLaw", "/pmwiki/pmwiki.php/Main/ShipTease", "/pmwiki/pmwiki.php/Main/SquaringTheLoveTriangle", "/pmwiki/pmwiki.php/Main/StatusQuoIsGod", "/pmwiki/pmwiki.php/Main/ZombieApocalypse", "http://www.bitercomics.com/comic/claus-effect/", "/pmwiki/pmwiki.php/Main/RomanticFalseLead", "http://www.shortpacked.com/index.php?id=1974"]}