{"title": "Cosmic Lottery Winner", "content": "There are many ways to cheat death. However, it is seldom that Death fumbles all of his die rolls without your intervention.\n\nThis is when a person just happens to survive something that should have killed them stone dead. There is no Death by Irony, Balancing Death's Books or playing chess. There is absolutely no catch whatsoever. The only possible explanation as to why that person survived is that every probability curve has a far end.\n• In Half Life: Full Life Consequences: Free Man, John Freeman, after being stabbed in the back, riddled with machine gun bullets and hit with a rocket, gets up to keep fighting the combine.\n• In This Bites!, through all his Tarot Troubles during , Basil Hawkins sees this with Luffy, as no matter how he shuffles his deck, all the cards representing hope and victory end up at the top and the one representing disaster ends up on the bottom.\n• In Pulp Fiction, two characters are fired upon from only a few feet away. The shooter empties the gun. They are completely unharmed. A little later in the scene, when they move away, you can see bullet holes in the wall behind them.\n• In Kill Bill, the Bride is shot point-blank in the head. She's in a coma for a few years, and it takes some time (read: a few hours, where it should take months) to recover full motor control. But otherwise, she suffers no ill effects.\n• In The Suicide Theory, Percival has tried repeatedly to commit suicide, even going so far as to hire a hit man on himself, but he survives a fall from a building onto a car, a savage beating, and three point-blank shots to the head during the course of the movie, plus any number of failed suicide attempts offscreen.\n• The Castle episode \"Dead Again\" features a fellow who manages to survive three murder attempts, including being shot point blank in the head. Unlike the Bride, he's perfectly fine pretty much right afterwards except for having a few drops of blood there.\n• The first story on this page describes a player whose character was at ground zero of a suitcase nuke explosion. He convinced the GM to grant him a one-in-a-million shot at survival. The room exploded with cheers when this trope came to life.\n• In the creepypasta story \"Quantum Immortality\", the laws of probability prevent the main character from dying, even of old age; every bullet turns out to be a dud, he throws up an overdose of pills, he \"miraculously\" survives one accident after another, and he just keeps getting older and older... all because the titular phenomenon means that if there is even the tiniest chance he will survive in any alternate universe, he will.\n• Around three thousand people died on the morning of September 11, 2001 when the towers fell. Pasquale Buzzelli was on the 22nd story when they collapsed. He awoke several hours later on top of debris with only minimal injuries.\n• A fighter pilot in in World War II lost his parachute and had to jump from a burning plane at around ten thousand feet. A while later, German patrols found him unconscious on top of a snow pile, with just a twisted ankle. He later received praise from his German captors at a POW camp.\n• Even better real life example Vesna Vulović, who survived a 33,000 foot fall from an exploded plane in 1972. She was temporarily paralyzed from the waist down but later recovered enough to be able to walk.\n• Tsutomu Yamaguchi had the misfortune of being in Hiroshima about a mile from ground zero when the first atomic bomb was dropped. He survived and returned to his home in Nagasaki the following day to recover from the serious burns he had sustained. A few days later he was, again, about a mile from ground zero when the second atomic bomb was dropped. Tsutomu Yamaguchi lived to the age of 93, passing away from stomach cancer in early 2010, although at 93 years of age such a cancer could never be linked to the events of 50 years ago.\n• These two Cracked articles describe a few more.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/CosmicLotteryWinner", "media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/Film/PulpFiction", "https://tvtropes.org/pmwiki/pmwiki.php/Film/KillBill", "https://tvtropes.org/pmwiki/pmwiki.php/Film/TheSuicideTheory", "https://tvtropes.org/pmwiki/pmwiki.php/Series/Castle", "https://tvtropes.org/pmwiki/pmwiki.php/Website/Cracked"], "non_media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/Main/DeathByIrony", "https://tvtropes.org/pmwiki/pmwiki.php/Main/BalancingDeathsBooks", "https://tvtropes.org/pmwiki/pmwiki.php/Main/ChessWithDeath", "https://tvtropes.org/pmwiki/pmwiki.php/Main/DeusExMachina", "https://tvtropes.org/pmwiki/pmwiki.php/FanFic/ThisBites", "https://tvtropes.org/pmwiki/pmwiki.php/Main/TarotTroubles", "http://unicornjelly.com/urulesmystories.html", "https://tvtropes.org/pmwiki/pmwiki.php/UsefulNotes/WorldWarII", "http://www.cracked.com/article_17573_7-fatal-injuries-that-people-somehow-survived.html", "http://www.cracked.com/article_16497_7-people-who-cheated-death-then-kicked-it-in-balls.html"]}