{"title": "Attractiveness Discrimination", "content": "There are a plethora of different reasons for prejudice in different societies. Whether it be race, religion, political beliefs, or socioeconomic status, prejudice is present in many situations, both fictional and non-fictional. However, one of the oldest forms of prejudice was formed for no more reason than simply being too attractive or not attractive enough to earn another's respect. This is where this trope kicks in.\n\nAlso termed as Lookism, this trope involves the circumstance in a story or setting where an individual or group are blatantly given preferential or prejudiced treatment based on their level of physical attractiveness. More often than not, this trope comes into play to show the negative aspects of valuing The Beautiful Elite along with the fallacies of adhering to Beauty = Goodness. Considering the so-called elite and good are such because they are viewed as beautiful, expect Hilarity to Ensue when the personal flaws outside of attractiveness come to light. After all, simply supporting or accommodating an individual because they are attractive tends to not progress well if they are meant to provide more than a pretty face. See Beauty Is Bad as examples along with characters displaying disregard for morality or decency because of beliefs in Screw the Rules, I'm Beautiful! or I Have Boobs, You Must Obey!.\n\nThose that fall on the unattractive end of the treatment in stories tend to suffer from varying degrees of social stigma. Some of these levels include suffering from Fantastic Slurs, being rounded up inside a Fantastic Ghetto, being killed off out of disgust by the \"beautiful people\", and/or becoming targets of slavery in most stories. The \"unattractive people\" are often used as an abused workforce or denied any attention whatsoever due to employers either seeing them as inferior or not wanting them around.\n\nThe circumstance of \"pretty\" people being prejudiced for being pretty can also be present depending on the rules of the setting in addition to acts of Positive Discrimination. Such cases are presented in a manner displaying physical beauty as a condescending trait that breeds animosity or disdain in others reminiscent to Tall Poppy Syndrome. See Beauty Is Bad, Makeup Is Evil, and So Beautiful, It's a Curse.\n\nThere's a strong case of Truth in Television, considering studies have shown that human infants as young as 14 hours from birth prefer to look at attractive faces rather than unattractive faces. This preference for the \"beautiful\" often extends into the workplace due to prospective workers being mainly or only Hired for Their Looks at worst, the dating world, and even media.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/AttractivenessDiscrimination", "media_links": ["/pmwiki/pmwiki.php/Disney/TheHunchbackOfNotreDame", "/pmwiki/pmwiki.php/Film/TheGarbagePailKidsMovie", "/pmwiki/pmwiki.php/Creator/JamesClavell", "/pmwiki/pmwiki.php/Literature/GaiJin", "/pmwiki/pmwiki.php/Literature/TheUglyDuckling", "/pmwiki/pmwiki.php/Series/TheTwilightZone1959", "/pmwiki/pmwiki.php/TabletopGame/GURPS", "/pmwiki/pmwiki.php/TabletopGame/DungeonsAndDragons", "/pmwiki/pmwiki.php/TabletopGame/Warhammer40000", "/pmwiki/pmwiki.php/VideoGame/DragonQuestVIII", "/pmwiki/pmwiki.php/Webcomic/Lookism", "/pmwiki/pmwiki.php/Series/PhineasAndFerb", "/pmwiki/pmwiki.php/WesternAnimation/Kaeloo"], "non_media_links": ["/pmwiki/pmwiki.php/Main/TheBeautifulElite", "/pmwiki/pmwiki.php/Main/BeautyEqualsGoodness", "/pmwiki/pmwiki.php/Main/HilarityEnsues", "/pmwiki/pmwiki.php/Main/BeautyIsBad", "/pmwiki/pmwiki.php/Main/ScrewTheRulesImBeautiful", "/pmwiki/pmwiki.php/Main/IHaveBoobsYouMustObey", "/pmwiki/pmwiki.php/Main/FantasticSlurs", "/pmwiki/pmwiki.php/Main/FantasticGhetto", "/pmwiki/pmwiki.php/Main/PositiveDiscrimination", "/pmwiki/pmwiki.php/Main/TallPoppySyndrome", "/pmwiki/pmwiki.php/Main/BeautyIsBad", "/pmwiki/pmwiki.php/Main/MakeupIsEvil", "/pmwiki/pmwiki.php/Main/SoBeautifulItsACurse", "/pmwiki/pmwiki.php/Main/TruthInTelevision", "/pmwiki/pmwiki.php/Main/HiredForTheirLooks", "/pmwiki/pmwiki.php/Comicbook/Axis", "/pmwiki/pmwiki.php/Comicbook/GodIsDead", "/pmwiki/pmwiki.php/FanFic/WitnessGoodNeighbors", "/pmwiki/pmwiki.php/Main/JerkassHasAPoint", "/pmwiki/pmwiki.php/Main/FantasticGhetto", "/pmwiki/pmwiki.php/Main/PC", "/pmwiki/pmwiki.php/Main/Gonk", "/pmwiki/pmwiki.php/Main/WretchedHive", "/pmwiki/pmwiki.php/Main/PlayedForLaughs", "/pmwiki/pmwiki.php/Main/UpToEleven"]}