{"title": "Set Piece Puzzle", "content": "Puzzles in Adventure Games and Adventure-hybrids tend to fall into one of two categories: the Lock and Key Puzzle, wherein the player must collect and use objects from around the model world to effect changes to the state of the game, and the Set Piece Puzzle, which consists of a single object to be manipulated.\n\nA Set Piece Puzzle is typically some sort of device, usually a complicated machine, whose controls must be operated in a particular way to solve the puzzle. Most often, interacting with the puzzle will bring up a new user interface, distinct from the one used for playing most of the game.\n\nThere are many possible sorts of set piece puzzles, often based on traditional non-computer puzzle toys. For many years, the most popular of these was the 15 Puzzle or sliding-tile puzzle. The Towers of Hanoi (with a small number of disks) is another favorite. A single round of a Puzzle Game can often be found built into the mechanism.\n\nAdventure games have long used a combination of the two types of puzzle, though the Set Piece Puzzle became overwhelmingly popular to the point of excluding all others during the dominance of Myst-clones. These puzzles were popular with designers because, isolated as they were from the rest of the model world, they were technically easier to design and avoided the problem of Combinatorial Explosion. A game consisting of only this sort of puzzle need not, for example, provide a player inventory at all.\n\nTo the player, a mix of both puzzle types adds variety, though overuse of the Set Piece Puzzle makes the puzzles feel disconnected from the narrative, and can lead him to feel that he's dealing with a Solve the Soup Cans puzzle.\n\nOn occasion, the player may be faced with a broken Set Piece Puzzle, and would have to find an item that repairs the puzzle before it can be played. Examples of this are sporadic, but games that feature both Set-Piece and Lock-And-Key will usually have at least one.\n• The illustrated Interactive Fiction adventures of Legend Entertainment typically threw in a handful of these each.\n• Zork Zero, for example, actually had the Towers of Hanoi.\n• The 7th Guest begat the genre of basing games around a collection of set piece puzzles.\n• Myst, as noted, popularized the format, and many other games of the era followed suit: Shivers, Amber, The Lighthouse, etc.\n• Prince of Persia: The Sands of Time included a puzzle sequence to activate the castle's security systems, consisting of a platform that could rotate and move up and down, which you had to use to pick up rods in the correct order and then slot them into the right holes. It's much harder to describe than it is to solve.\n• Prince of Persia: Warrior Within has two: One where you have to open a sluice gate to fill a couple of garden fountains with water, and one where you had to trick a boss into helping you get an old clockwork started.\n• Every Pokémon game had several of these, involving the Strength HM and Boulders in a cavern, all of which could be reset by leaving the cavern or room and reentering.\n• Legacy of Kain: Soul Reaver features some puzzles involving putting a stone block on the right slot on the wall to complete the illustration. The fact that the blocks can be turned over adds some smooth difficulty to its solving.\n• The Lufia games for the Super Nintendo had a great many of these.\n• Each level of 3 in Three is of this form.\n• Resident Evil was fond of these in addition to Lock And Key Puzzles. One notable example occurred in \"Outbreak,\" when you would have to turn on power to an elevator by solving one of these puzzles while zombies smacked in the door in real-time.\n• Resident Evil 4 has a few of these, including a sliding tile puzzle used to unlock a mechanism\n• Any Zelda game ever contains loads of these, mostly involving pushing blocks around.\n• Skyward Sword takes it further by having several \"alternate interface\" puzzles. Most of them involve the Boss Keys, which need to be rotated a certain way before they can open the door to the boss. One of them combines this with the usual Dungeon Crawling by having you rearrange the whole dungeon like a sliding puzzle.\n• The Xenosaga series has a lot of these. From stacking/exploding block puzzles, to audio puzzles, to balancing puzzles. Some were good, some went right into guide dang it.\n• LucasArts' Indiana Jones and the Fate of Atlantis contains several of them, often involving inventory, so it's a mix of the two puzzle types.\n• Castlevania: Dawn of Sorrow contains the 15-tile puzzle in the middle of the Demon Guest House.\n• Chrono Cross contains a bunch of these, mainly in Fort Dragonia.\n• Hotel Dusk: Room 215 is full of these; they tend to be pretty simple though.\n• BioWare's very fond of the Tower of Hanoi. They also frequently use the \"press the lit button and the buttons surrounding it light up\" puzzle.\n• They also did that three-unit container + five-unit container with a need to get four units. You know, the one from Die Hard with a Vengeance. Easy When You Know How.\n• Featured in Tales of Symphonia, though most of the puzzles in the game were Block Puzzles instead.\n• Like previous games in the series, Return to Ravenhearst is mostly a Set Piece Puzzle, but oftentimes an item must be discovered and introduced into the puzzle to allow it to be used and/or completed.\n• The Nancy Drew video games have at least one in each game.\n• The final puzzle of Clash at Demonhead involves placing the MacGuffins in a Mastermind puzzle to disarm the Big Bad's Doomsday Device.\n• Final Fantasy Mystic Quest often makes you move pillars, blow holes or jump gaps in sequence to progress. This makes it unique as far as Final Fantasy goes.\n• The Perils of Akumos dolls up its puzzle set piece as a munitions factory.\n• Duke Nukem has a point where you have to demolish a building to be able to continue the level, by setting the correct on/off sequence of four buttons that are initially all off.\n• The Witness: The landscape is incorporated into many of the island's puzzles. And in plenty of instances, the landscape is the puzzle.\n• Undertale: Unusually, NPCs show awareness of the set-piece puzzles as obstacles to themselves, and two major characters are heavily invested in creating them. A lot of these puzzles are introduced with humorous explanations (there are even a few fake puzzles), and it's a sign of the seriousness of the endgame areas that they use Lock And Key Puzzles instead.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/SetPiecePuzzle", "media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/Undertale", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/Myst", "https://tvtropes.org/pmwiki/pmwiki.php/Creator/LegendEntertainment", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/ZorkZero", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/TheSeventhGuest", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/Myst", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/AmberJourneysBeyond", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/LighthouseTheDarkBeing", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/PrinceOfPersiaTheSandsOfTime", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/PrinceOfPersiaWarriorWithin", "https://tvtropes.org/pmwiki/pmwiki.php/Franchise/Pokemon", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/LegacyOfKain", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/ThreeInThree", "https://tvtropes.org/pmwiki/pmwiki.php/Franchise/ResidentEvil", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaSkywardSword", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/Xenosaga", "https://tvtropes.org/pmwiki/pmwiki.php/Creator/LucasArts", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/IndianaJonesAndTheFateOfAtlantis", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/CastlevaniaDawnOfSorrow", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/ChronoCross", "https://tvtropes.org/pmwiki/pmwiki.php/VisualNovel/HotelDuskRoom215", "https://tvtropes.org/pmwiki/pmwiki.php/Creator/BioWare", "https://tvtropes.org/pmwiki/pmwiki.php/Film/DieHardWithAVengeance", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/TalesOfSymphonia", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/NancyDrew", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/FinalFantasyMysticQuest", "https://tvtropes.org/pmwiki/pmwiki.php/Franchise/FinalFantasy", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/ThePerilsOfAkumos", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/DukeNukem", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/TheWitness", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/Undertale"], "non_media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/Main/AdventureGame", "https://tvtropes.org/pmwiki/pmwiki.php/Main/LockAndKeyPuzzle", "https://tvtropes.org/pmwiki/pmwiki.php/Main/FifteenPuzzle", "https://tvtropes.org/pmwiki/pmwiki.php/Main/TowersOfHanoi", "https://tvtropes.org/pmwiki/pmwiki.php/Main/PuzzleGame", "https://tvtropes.org/pmwiki/pmwiki.php/Main/CombinatorialExplosion", "https://tvtropes.org/pmwiki/pmwiki.php/Main/SolveTheSoupCans", "https://tvtropes.org/pmwiki/pmwiki.php/Main/BrokenBridge", "https://tvtropes.org/pmwiki/pmwiki.php/Main/PuzzleReset", "https://tvtropes.org/pmwiki/pmwiki.php/Main/InteractiveFiction", "https://tvtropes.org/pmwiki/pmwiki.php/Main/TowersOfHanoi", "https://tvtropes.org/pmwiki/pmwiki.php/Main/LockAndKeyPuzzles", "https://tvtropes.org/pmwiki/pmwiki.php/Main/DungeonCrawling", "https://tvtropes.org/pmwiki/pmwiki.php/Main/GuideDangIt", "https://tvtropes.org/pmwiki/pmwiki.php/Main/EasyWhenYouKnowHow", "https://tvtropes.org/pmwiki/pmwiki.php/Main/BlockPuzzle", "https://tvtropes.org/pmwiki/pmwiki.php/Videogame/ClashAtDemonhead", "https://tvtropes.org/pmwiki/pmwiki.php/Main/MacGuffin", "https://tvtropes.org/pmwiki/pmwiki.php/Main/LuckBasedMission", "https://tvtropes.org/pmwiki/pmwiki.php/Main/BigBad", "https://tvtropes.org/pmwiki/pmwiki.php/Main/DoomsdayDevice", "https://tvtropes.org/pmwiki/pmwiki.php/Main/LockAndKeyPuzzle"]}