{"title": "Host Club", "content": "Want a relaxing night away from the office, your college, or your stupid boyfriend? If you're female, 18+, and you live in Japan, maybe you could go to a Host Club.\n\nA host club is an establishment with a roster of all types of attractive men who will offer flirting, flattery, pampering, and companionship in a congenial environment and at an exorbitant rate. A typical host will wear a suit and pointed toe boots, along with heavy eye make-up, circle lenses, and wild, improbable Final Fantasy hairstyles that are usually dyed. Besides service, most of the commission a host gets comes from expensive alcohol ordered by their customers, so expect hosts to try to get you to throw down thousands of yen for a bottle of champagne. Hosts do not offer actual sex, though it's pretty common for them to sleep with their clients after hours. Customers at host clubs are eventually expected to pick a favorite, known as a \"tantou\", who will eventually become their main entertainer.\n\nThe Distaff Counterpart of a host club is a hostess club. While the main market for hostess clubs are White Collar Workers, frequent patrons of host clubs mostly consist of women who work in hostess clubs and other parts of the entertainment industry, looking to relax after a long hard night of being nice to inebriated, sexually-harassing Salarymen. Since host clubs are mostly owned by the same people who own hostess clubs, this has the net effect of recouping some of the hostess' income, and thus hostesses are encouraged to partake of this form of entertainment.\n\nStandard host clubs discourage male customers, and there are separate \"host bars\" aimed at gay men. Many host clubs also bar foreigners from entering due to language, cultural, and economic issues. They don't welcome customers who only want to enter for the experience and don't intend to become regular paying clients.\n\nThe majority of host clubs are located in the Red Light District and are closely affiliated with the Yakuza. If you ordered that bottle of expensive wine but didn't want to pay? Expect them to beat you up, force you into prostitution to pay it off, or straight up murder you. Host clubs also generally have a very sleazy reputation and it is heavily frowned upon to even go to one.\n\nFor the younger set, Butler Cafes have a similar premise, only with afternoon tea rather than late-night booze.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/HostClub?from=Main.HostessClub", "media_links": ["/pmwiki/pmwiki.php/Franchise/FinalFantasy", "/pmwiki/pmwiki.php/Manga/OuranHighSchoolHostClub", "/pmwiki/pmwiki.php/Anime/WelcomeToTheNHK", "/pmwiki/pmwiki.php/Anime/TigerAndBunny", "/pmwiki/pmwiki.php/Manga/Gintama", "/pmwiki/pmwiki.php/Manga/SweetGuiltyLoveBites", "/pmwiki/pmwiki.php/Manga/Sekirei", "/pmwiki/pmwiki.php/Manga/Bokurano", "/pmwiki/pmwiki.php/Manga/SuperLovers", "/pmwiki/pmwiki.php/Manga/AoharuXMachinegun", "/pmwiki/pmwiki.php/Film/TheGreatHappinessSpace", "/pmwiki/pmwiki.php/LightNovel/Toradora", "/pmwiki/pmwiki.php/Series/CSI", "/pmwiki/pmwiki.php/Series/CabasukaGakuen", "/pmwiki/pmwiki.php/Manga/SuperLovers", "/pmwiki/pmwiki.php/Music/Winds", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyThe4HeroesOfLight", "/pmwiki/pmwiki.php/VisualNovel/SweetFuseAtYourSide", "/pmwiki/pmwiki.php/VideoGame/Yakuza"], "non_media_links": ["/pmwiki/pmwiki.php/Main/AnimeHair", "/pmwiki/pmwiki.php/Main/AnimeHair", "/pmwiki/pmwiki.php/Main/PlatonicProstitution", "/pmwiki/pmwiki.php/Main/DistaffCounterpart", "/pmwiki/pmwiki.php/Main/WhiteCollarWorker", "/pmwiki/pmwiki.php/Main/Salaryman", "/pmwiki/pmwiki.php/Main/RedLightDistrict", "/pmwiki/pmwiki.php/Main/Yakuza", "/pmwiki/pmwiki.php/Main/ButlerCafe", "/pmwiki/pmwiki.php/Main/WorkOffTheDebt", "/pmwiki/pmwiki.php/Main/Bifauxnen", "/pmwiki/pmwiki.php/Main/VirginityMakesYouStupid", "/pmwiki/pmwiki.php/Main/GenderBender", "/pmwiki/pmwiki.php/Main/CompensatedDating", "/pmwiki/pmwiki.php/Main/SonOfAWhore", "/pmwiki/pmwiki.php/Main/JapaneseDelinquents", "/pmwiki/pmwiki.php/Main/SavingTheOrphanage", "/pmwiki/pmwiki.php/WebVideo/WhereTheHellIsMatt", "/pmwiki/pmwiki.php/Main/Meido"]}