{"title": "Invented Linguistic Distinction", "content": "In Real Life, even when people from different places technically speak the same basic language, they don't always all talk the same. People from different regions, ethnic groups, and socioeconomic strata have different pronunciations, rhythms, slang terms, and idioms. In some works of fiction, this isn't true; they adhere to the Planet of Hats linguistically. On the other hand, there's this trope, where a work creator has created variety within the languages used in The \u0092Verse, typically as a means of World Building.\n\nBob, from New York, speaks with an American accent. This contrasts him with Aerith, who comes from a magical alternate reality hidden inside of a wardrobe, who speaks with a British one, despite not actually being from Britain. All of the people from Aerith's world speak similarly to herself, with maybe some variation between the different kingdoms or social classes of her land. The point is, people from Aerith's world have linguistic quirks that set them apart from people in the Bob's world as a result of the distance between them. Though the quirks in this example are inexplicably borrowed from a real world place that supposedly also exists in the setting, the proper creative intention is there and it still counts as an example.\n\nIf Bob and Aerith are both from fictional places, say they're both from two different planets in a sci-fi setting totally disconnected from the real world, and these differences still apply, then that's also an example of the trope. If the author goes a step further and has them speaking in two different real world languages, or using two different real world writing systems, or even both speaking and writing in their own separate made up languages, that also applies. The point is that the author invents unique linguistic traits for a fictional group of people, whether they be recycled real world linguistic traits or made from scratch, to make them more realistically foreign to the audience and/or each other.\n\nThe creative decision to more realistically define a fictional culture through language, where such distinctions do not already inherently exist due to the culture not existing in the real world, or existing in the real world, but being far enough in the future that major changes in language are justified, is key to the trope. Localizing linguistic differences to characters based solely on personality or to more accurately depict real world locations and cultures is not this trope. If Aerith only sounds British to show that she's a genius, not because she's fictionally foreign, then that isn't the trope . If Bob is from modern New York and Aerith is from past France and they both sound appropriately different and accurate to what a person from those times and places should sound like (or they don't, but that was the intent) that's just regular old realism, not the trope. It has to be fictional cultures, but realistically utilized linguistics.\n\nA Subtrope of Multicultural Alien Planet. Compare Aliens of London, another trope that deals with giving accents to fictional races. Contrast Smart People Speak the Queen's English, where an accent is used as a shortcut to show a character's personality rather than because of their nationality, Aliens Speaking English, where people from fictional populations from outside of Earth speak Earth languages without explanation, or Anime Accent Absence, a tendency in Japanese media to not bother giving foreign characters distinguished accents at all.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/InventedLinguisticDistinction", "media_links": ["/pmwiki/pmwiki.php/Literature/Foundation", "/pmwiki/pmwiki.php/Creator/DianeDuane", "/pmwiki/pmwiki.php/Literature/Rihannsu", "/pmwiki/pmwiki.php/Franchise/StarWarsLegends", "/pmwiki/pmwiki.php/Literature/XWingSeries", "/pmwiki/pmwiki.php/Film/StarWars", "/pmwiki/pmwiki.php/Literature/TheWheelOfTime", "/pmwiki/pmwiki.php/Series/Krypton", "/pmwiki/pmwiki.php/VideoGame/DragonQuestVIII", "/pmwiki/pmwiki.php/VideoGame/Xenoblade", "/pmwiki/pmwiki.php/VideoGame/XenobladeChroniclesX", "/pmwiki/pmwiki.php/VideoGame/XenobladeChronicles2", "/pmwiki/pmwiki.php/Webcomic/FoundationThePsychohistorians", "/pmwiki/pmwiki.php/Literature/ThePsychohistorians", "/pmwiki/pmwiki.php/Literature/Foundation1951", "/pmwiki/pmwiki.php/Creator/JonathonDalton", "/pmwiki/pmwiki.php/WesternAnimation/OKKOLetsBeHeroes"], "non_media_links": ["/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/Main/PlanetOfHats", "/pmwiki/pmwiki.php/Main/TheVerse", "/pmwiki/pmwiki.php/Main/WorldBuilding", "/pmwiki/pmwiki.php/Main/SmartPeopleSpeakTheQueensEnglish", "/pmwiki/pmwiki.php/Main/MisplacedAccent", "/pmwiki/pmwiki.php/Main/AsLongAsItSoundsForeign", "/pmwiki/pmwiki.php/Main/MulticulturalAlienPlanet", "/pmwiki/pmwiki.php/Main/AliensOfLondon", "/pmwiki/pmwiki.php/Main/SmartPeopleSpeakTheQueensEnglish", "/pmwiki/pmwiki.php/Main/AliensSpeakingEnglish", "/pmwiki/pmwiki.php/Main/AnimeAccentAbsence", "/pmwiki/pmwiki.php/Fanfic/TheWarOfTheMasters", "/pmwiki/pmwiki.php/Main/TranslationConvention", "/pmwiki/pmwiki.php/Main/FunetikAksent", "/pmwiki/pmwiki.php/Fanfic/RemembranceOfTheFallen", "/pmwiki/pmwiki.php/Fanfic/CreateYourOwnFate", "/pmwiki/pmwiki.php/Main/FloweryElizabethanEnglish", "/pmwiki/pmwiki.php/Main/ConLang", "/pmwiki/pmwiki.php/Main/LostColony", "/pmwiki/pmwiki.php/Main/InternalMonologue", "/pmwiki/pmwiki.php/Main/EvilBrit", "/pmwiki/pmwiki.php/Main/CreepyMonotone", "/pmwiki/pmwiki.php/Main/FinalBattle", "/pmwiki/pmwiki.php/Main/FullNameBasis", "/pmwiki/pmwiki.php/Main/HandWave", "/pmwiki/pmwiki.php/Main/MerchantCity", "/pmwiki/pmwiki.php/Main/FunetikAksent", "/pmwiki/pmwiki.php/Main/RunningGag", "/pmwiki/pmwiki.php/Main/WhereTheHellIsSpringfield"]}