{"title": "\"Getting My Own Room\" Plot", "content": "Getting My Own Room Plot is when a person wants their very own room.\n\nOften seen in a family setting in which one of the children has to share a room with either an Annoying Younger Sibling or a Big Brother Bully and wanting their own room to get as far away from them. Though, being part of a large family with zero privacy will have the same effect. In another case, bickering roommates would end up getting tired of living with each other with one of them wanting to move out.\n\nEspecially in shows where Status Quo Is God, expect the person to actually get their own room or place but suffer a Be Careful What You Wish For situation; since they were so used to the people around them they end up feeling lonely or even scared. When that happens, expect them to go right back to their original room arrangement. In shows that don't care that much about their status quo however, the change is more likely to be permanent.\n• One Zillow commercial features two brothers roughhousing with the older one asking his parents when will he get his own room. After the parents buy a new house with two rooms for their kids, they find their older son sleeping on the floor in his little brother's room, missing his company.\n• After starting high school, Maho from Wandering Son requests her own room from her younger sibling. Her parents don't have the room, so they remove the bunk-beds and instead put a curtain between Nitori's half and Maho's half of the room.\n• Craig and his brother complain about sharing a bed in Blankets, so their father makes one of them sleep in a closet for the night. Later on, they get separate rooms but they find it lonely at first.\n• Inverted in Runaways, where Molly Hayes seems to prefer sharing a room with someone else.\n• A variation occurs at the beginning of Peter Pan when Mr. Darling decides that Wendy is old enough to have her own room instead of sleeping in the nursery with her two younger brothers. Wendy doesn't want this, because the nursery represents childhood and she doesn't want to grow up \u0096 this is a main reason why she flies away with Peter Pan that night. In the end, her father changes his mind and lets her stay in the nursery a while longer.\n• Inverted in Frozen. The story starts off with 8-year old Elsa and her 5-year old sister Anna being suddenly separated into different bedrooms because their parents want to keep Anna safe from Elsa's ice powers.\n• Adam-12- a string of small-item thefts in a neighborhood leads the officers to a kid who stole the stuff and set it up in a cave because his stepdad wouldn't give him his own room. The problem is, the cave collapses and the boy nearly dies.\n• In Boy Meets World, Cory gets his own room after Eric goes to college. However, after a rooming mishap, Eric comes back home which really upsets Cory. Cory then spends the day trying to find an apartment for Eric so he could move out.\n• In The Brady Bunch episode \"Our Son, the Man\", Greg decides he wants his own bedroom, now that he's in high school and is too mature to share one with his 2 little brothers. He manages to take over his father's den, but he is back to the shared bedroom by the end of the episode. Ironically, Greg did get his own room 2 seasons later, in the attic, in the episode \"A Room at the Top\", though his oldest sister, Marcia (who also shared her room with two younger ones) also tried to claim it. There was an infamous continuity error here since, in the earlier episode, the attic was ruled out as a bedroom for having too low a ceiling.\n• An episode of Full House has DJ wanting her own room after dealing with Stephanie's snooping one too many times. DJ ends up getting the approval of Danny and moves into Michelle's room, while Michelle moves in with Stephanie who was against the move since she was afraid she and DJ will drift apart.\n• Good Luck Charlie\n• In \"All Fall Down\", Gabe tries to find a new room for himself in the Duncan family house, since youngest sibling Toby is now sleeping in his room. He eventually finds a place in the attic, but his new room is short-lived when the Brazilian termites that Bob brought home reproduce and tear the house apart.\n• In \"Driving Mrs. Dabney\", on Teddy's 16th birthday, P.J., Gabe, and Charlie sing a rap song for Teddy, and at one point in the song, Gabe mentions that when Teddy moves out in the next few years, he's going to move into her bedroom.\n• Home Improvement\n• One episode has Brad successfully lobby Tim and Jill to give him his own room, forcing Randy and Mark to share a room. This did cause some problems for Randy since he felt Brad was leaving him behind. Hilariously Brad finds out having his own room wasn't all that great since it meant he was expected to take on more responsibilities.\n• Another episode has Tim build Randy his new room in the basement. Unfortunately, he wasn't prepared for the strange noises in the night and slept in the living in fright. Thankfully Tim was able to ease him back to the basement.\n• A variant shows up in the Malcolm in the Middle episode Butterflies; Dewey is overjoyed to have an entire bed to himself at night because Malcolm is now working the night shift at Lucky Aide.\n• On a season 1 episode of The Bernie Mac Show Vanessa, the oldest daughter, is fed up with sharing a bedroom with her little brother and sister now that she's in high school, what results in Vanessa getting her bedroom for herself is her sister and brother crashing her slumber party and bothering her and her friends.\n• In All Grown Up!, this is downplayed with twins Phil and Lil. She actually gets her own room pretty quickly, but this is just part of a bigger problem that she wants to have more independence from her brother while he wants to remain close.\n• In the Arthur episode, \"Francine Redecorates\", Francine and Catherine get into a feud over how they should have their bedroom redecorated, Catherine decides to move into the living room. Francine soon finds it dull having no one to share her bedroom with, and she and Catherine form a compromise near the end. In the same episode, D.W. imagines what it would be like if she had her own bedroom in the garage, away from Kate, her baby sister.\n• Gerald from Hey Arnold! ends up moving into Arnold's grandpa's boarding house after being tired of dealing with both an Annoying Younger Sibling and Big Brother Bully and feeling shafted as the middle child. It wasn't as good as he thought since he was now on his own and had to take care of himself.\n• Jacob Two-Two: The first episode, \"Jacob Two Two vs. the Hooded Fang\", has this as a subplot; the family has just moved to their house in Montreal, and Jacob has to share a room here with his annoying brother Noah. He convinces his parents to give him the attic as his room if he can prove he's able to spend a night there without getting scared. By the end of the episode, he succeeds, and the attic thus becomes his room for the remainder of the series.\n• The Loud House\n• Inverted for Lisa in Room with a Feud. When Lisa comes up for alternate roommate arrangements for the siblings, she is the only one with her own room. Lincoln accuses her of rigging the result so she could have her own room but Lisa actually prefers a roommate since it gives her an already available test subject.\n• In Garage Banned, Lori ends up getting fed up with the chaotic nature of her younger siblings and demands her own room. While the younger Louds don't like the idea, Lori is given her own room in the Loud's shed. Unfortunately, the situation isn't ideal for Lori because not only is it boring, but during the night, she is unable to sleep because she is too scared. She then spends the rest of the episode trying to get back to her room but is unintentionally foiled by her siblings. She does move back after finally admitting she misses them.\n• A variation occurs in The Mad Scientist. Lisa gets invited to a science institute to get away from her crazy household so she could be able to finish her work. She is then offered a permanent stay in the institute. While her family is against it since she is only 4 years old, she is able to convince them to let her stay since she assumes she has a low family attachment. Lisa soon finds out it wasn't all that great and actually starts missing her family.\n• In Gravity Falls episode \"Carpet Diem\", Dipper and Mabel decide they don't want to share the attic bedroom anymore and try to win a room containing a body-swapping carpet that creates even more confusion. In the end, however, both twins change their minds and decide to again share the attic bedroom.\n• In the F is for Family episode \"The Liar's Club\", Kevin moves out of the room he shared with Bill and starts living in the basement. The main motive behind this was he was annoyed by Bill touching his stuff, waking him up at 5 A.M. while getting ready for his morning paper route, and walking in on him masturbating. Unlike most examples of this trope, both Kevin and Bill are happy with having their own private rooms and the former has stayed in the basement since.\n• The Foster's Home for Imaginary Friends episode \"Room With a Feud\" has Bloo, Wilt, Coco, and Eduardo fighting over a single room that opens up.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/GettingMyOwnRoomPlot", "media_links": ["/pmwiki/pmwiki.php/Manga/WanderingSon", "/pmwiki/pmwiki.php/ComicBook/Blankets", "/pmwiki/pmwiki.php/ComicBook/Runaways", "/pmwiki/pmwiki.php/Disney/PeterPan", "/pmwiki/pmwiki.php/Disney/Frozen", "/pmwiki/pmwiki.php/Series/AdamTwelve", "/pmwiki/pmwiki.php/Series/BoyMeetsWorld", "/pmwiki/pmwiki.php/Series/TheBradyBunch", "/pmwiki/pmwiki.php/Series/FullHouse", "/pmwiki/pmwiki.php/Series/GoodLuckCharlie", "/pmwiki/pmwiki.php/Series/HomeImprovement", "/pmwiki/pmwiki.php/Series/MalcolmInTheMiddle", "/pmwiki/pmwiki.php/Series/TheBernieMacShow", "/pmwiki/pmwiki.php/WesternAnimation/AllGrownUp", "/pmwiki/pmwiki.php/WesternAnimation/Arthur", "/pmwiki/pmwiki.php/WesternAnimation/HeyArnold", "/pmwiki/pmwiki.php/WesternAnimation/JacobTwoTwo", "/pmwiki/pmwiki.php/WesternAnimation/TheLoudHouse", "/pmwiki/pmwiki.php/WesternAnimation/GravityFalls", "/pmwiki/pmwiki.php/WesternAnimation/FIsForFamily", "/pmwiki/pmwiki.php/WesternAnimation/FostersHomeForImaginaryFriends"], "non_media_links": ["/pmwiki/pmwiki.php/Main/ExactlyWhatItSaysOnTheTin", "/pmwiki/pmwiki.php/Main/AnnoyingYoungerSibling", "/pmwiki/pmwiki.php/Main/BigBrotherBully", "/pmwiki/pmwiki.php/Main/StatusQuoIsGod", "/pmwiki/pmwiki.php/Main/BeCarefulWhatYouWishFor", "/pmwiki/pmwiki.php/Main/Advertising", "/pmwiki/pmwiki.php/Main/Anime", "/pmwiki/pmwiki.php/Main/Manga", "/pmwiki/pmwiki.php/Main/ComicBooks", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/GrowingUpSucks", "/pmwiki/pmwiki.php/Main/AnIcePerson", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/AnnoyingYoungerSibling", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/StatusQuoIsGod", "/pmwiki/pmwiki.php/Main/ImagineSpot", "/pmwiki/pmwiki.php/Main/AnnoyingYoungerSibling", "/pmwiki/pmwiki.php/Main/BigBrotherBully", "/pmwiki/pmwiki.php/Main/MiddleChildSyndrome", "/pmwiki/pmwiki.php/Recap/TheLoudHouseS2E14OutOfThePictureRoomWithAFeud", "/pmwiki/pmwiki.php/Recap/TheLoudHouseS2E17ArgghYouForRealGarageBanned", "/pmwiki/pmwiki.php/Recap/TheLoudHouseS3E9TheMadScientistMissedConnection", "/pmwiki/pmwiki.php/Main/CaughtWithYourPantsDown", "/pmwiki/pmwiki.php/Main/ADateWithRosiePalms"]}