{"title": "Plot Allergy", "content": "Allergies are no fun, but they can be a useful device in fiction.\n\nWant Alice to be able to go somewhere where Bob can't but don't want to introduce fantasy elements? Have her start coughing whenever she gets near it. Want a tough character to be really afraid of just one thing? Have him be allergic to it.\n\nIn real life allergies can cause a number of problems from sneezing to death by throat closure, but fictional examples will usually just include sneezing, streaming eyes and occasionally hives. Also covered would be \"intolerances\", which generally cause stomach troubles; for example, lactose intolerance.\n\nPlease note: Danger is not an actual allergy. Neither is love, evil or routine.\n\nCan result in a Sneeze of Doom.\n\nThe movement restriction allergy \n\n \"I can't go there! I'm allergic to X!\"\n\nThe relationship hitch allergy \n\n\"My new girlfriend has a cat/sent me flowers, guess what I'm allergic to\"\n\nThe detection allergy \n\n\"We need to find / be warned about a certain creature, and happen to be allergic to it!\"\n\nThe assassin allergy \n\n \"He was killed with the previously unknown allergy to a X!\"\n\nThe manipulation allergy \n\n \"I have your allergen, you will obey me!\"\n• Anime gives us an example of allergy as code phrase: in Weiß Kreuz Verbrechen & Strafe, one of the operatives signals her team that something is amiss by referring to a flower allergy she doesn't actually have. (They know she's faking because the other operatives are all florists.)\n• An episode of the first Dirty Pair TV series had as the antagonist a man allergic to women. Mostly played for laughs , and eventually revealed to be psychosomatic.\n• In episode of Love, Chunibyo & Other Delusions, Touka is allergic to cats, so when her younger sister Rikka brings one home, she requests Yuuta to help her get rid of it. When Yuuta expresses reluctance, she presents him an audio clip of one of his rants as the \"Dark Flame Master\".\n• Happy Heroes:\n• In one episode, an assassin cat tries to kill Careful S. but gets mistaken to be a stray cat. Careful S. takes care of him despite being allergic to cat fur. However, this allergy highlights the irony with Careful S' appearance (he looks like a black cat).\n• In one episode of Season 11, Moondance is shown to have an allergic reaction to mango when she eats Sweet S.'s pudding, which contains it.\n• In First Try Series, the whole plot is set in motion due an exam proctor's unfortunate allergy to peanuts. The exam proctor had to be replaced and the replacement tested Naruto, which allowed him to pass on the first try.\n• In This Bites!, eating biscuits gives Cross an instantaneous and horrible case of diarrhea. It's unclear why, and it's not much of a plot point; it's barely even a Running Gag.\n• A few Miraculous Ladybug fics bring up Adrien/Chat Noir's allergy to feathers when the Peacock kwami Duusu or his holder is involved.\n• Back To Us first brings it up during his first encounter with the Peacock Miraculous holder Pavone, and again when he goes into a sneezing fit in Felix's car - when Bridgette asks if Felix has a pet bird, he replies, \"Something like that.\"\n• turns it into a running gag, because the Peacock holder in this universe is Marinette. Though when Adrien is forced to use the Peacock Miraculous in her place, he's explicitly not allergic to himself.\n• In The Man Who Knew Too Little, Wallace complains several times about Boris \"The Butcher\" wearing Old Spice; his violent sniffling and sneezing actually helps him to escape Boris' custody at one point. At the very end, we learn that it wasn't Old Spice causing Wallace's reactions—it was an otherwise-undetectable Amazonian arrow-frog toxin.\n• Addicted to Love: Meg hides crushed strawberries under her ex's pillow, causing him to break out in an embarrassing skin rash and sabotaging his modeling career.\n• In The Boxtrolls, Archibald's severe lactose intolerance (he swells up from a tiny sliver of extra mild Cheddar) is part of what prevents him from joining the White Hats and eventually leads to his Karmic Death .\n• In Peter Rabbit, Thomas McGregor is allergic to blackberries. Later the rabbits pelt him with blackberries, eventually landing one directly in his mouth, but he gives himself an injection.\n• In Pound Puppies and the Legend of Big Paw, the main villain Marvin McNasty happens to be allergic to cats. Cooler eventually takes advantage of this when McNasty orders his henchmen Lumpy and Bones to take away the Pound Purries Hairball and Charlemange by disguising himself as cat so he'd be taken out of McNasty's house with the Pound Purries.\n• Rachel ends up with an alien allergy to crocodile DNA in one Animorphs book. She morphs out of control, which is the equivalent of a sneeze, according to Ax, and has to deal with the allergy until she burps up the DNA-in the form of a whole crocodile.\n• What started the plot of the fourth Tantei Team KZ Jiken Note, The Egg Hamburg Steak Knows, was an allergy that causes a breakup but hardly \"the relationship hitch allergy.\" Wakatake woke up on Friday and found his face covered with allergy hives, which obviously is not in a state to attend the date later that day. But the unnamed girlfriend decided to break up instead without even asking why he couldn't attend. (The bulk of the novel is about investigating how there could be pork in a egg burger steak supposedly made with 100% beef, and who put it there).\n• In Stephen King's Sherlock Holmes story The Doctor's Case, the reason Watson is the one to solve the case is that Holmes is seriously impaired by two factors: there are ten cats in the house the case is in, and Holmes is allergic to cats. It really doesn't help that one of the cats becomes very fond of Holmes immediately and gets snuggly.\n• In one episode of Imagination Movers, the Movers get their Idea Emergency when they need to figure out why Dave keeps sneezing. Turns out, he was allergic...to wool (Scott was wearing wool socks).\n• On The Big Bang Theory, Howard needs to keep Leonard away while the others plan a surprise birthday party for Leonard, so he uses his peanut allergy as an excuse to take Leonard to the hospital. When things get desperate, Howard has to actually trigger his allergy to keep Leonard from going back.\n• On Seinfeld the guys suspect that Jerry's new accountant is a cocaine fiend because he's always sniffling and wiping his nose when they're around. Turns out he's just allergic to Jerry's sweater. Then, after they apologize and rehire him, it turns out he really WAS on drugs.\n• In one episode of The Brady Bunch, they think Jan is allergic to Tiger, because he makes her sneeze. But it's really the flea powder.\n• Several CSI franchise victims of the week were killed by allergies.\n• On CSI, the initial reason for a holdout juror's death is thought to be peanut butter in his chili, but they later determine that the would-be killer took the laced food for herself, and a bee sting allergy actually killed the guy.\n• An attempt to kill a boxer in 'Ending Happy' involved getting him to absorb shellfish residue through his male organ. It wasn't the final cause of death, though.\n• CSI NY had a case where some guys played a prank on another guy by lacing his soup with shellfish. He went into anaphylaxis and grabbed for his medication, but the guys had replaced it with an empty one. He died before help arrived.\n• On an episode of Wishbone, Sam, the one chosen to represent her team for a spelling bee starts eating a snack brought by David, but learns too late that it contains coconut, which she's allergic to. It isn't life-threatening, but she can't go to school and David has to take her place, despite being less confident.\n• Averted in the character of Nathaniel, who has a bunch of allergies, including dogs. He spends the night at Joe's house, which forces Wishbone into being shut away in another room. It turns out his allergy to dogs is psychosomatic, induced by his mother because she doesn't like them. (He may have other real allergies, but none of them get near as much attention.)\n• On an episode of Brooklyn Nine-Nine, Captain Holt attempts to give away a small puppy. Santiago immediately volunteers to adopt it, despite being violently allergic to dogs. but Captain Holt doesn't let her.\n• The season finale of Other Space hinges on a big date between a person and the ship's computer, with the latter using a number of accessories to manipulate a willing proxy. The date ends badly when the computer causes her proxy to eat shellfish, to which the proxy reacts very badly.\n• An episode of Flight 29 Down has as one of its subplots the character Eric acting very lethargic. Since he's known as a Lazy Bum among the group, no one thinks much of it until he collapses on the beach and is unresponsive. While they manage to work out that he's having a reaction to the oysters the group had collected and eaten earlier, it's a very near thing and even when Melissa plays The Medic and doses him with an epi-pen, it's painfully clear that she's scared to death she's too late.\n• Monk, \"Mr. Monk and the Case of the Missing Granny\". Randy has an allergy to cats, which makes things difficult as Mrs. Parlo owned one. This turns out to be the thing that keeps the perps of the week from getting away with their crime. They claim the chair belongs to them, which Monk and company can't disprove until Monk realizes that Randy showed signs of allergy when he was in their house. They claimed they didn't have a cat, so Randy shouldn't have had any symptoms.\n• The main character of That's So Raven had a severe mushroom allergy that causes her to comically swell up when it's triggered during a cooking competition. A later episode had her unknowingly washing her hair with a shampoo that contained mushroom extract, which affected her ability to see the future instead.\n• The Swinging episode \"The Big Sneeze\" is about Augustus suddenly sneezing constantly and thinking he might have an allergy to his daughter Rosy. It's actually an allergic reaction to a flower decoration Rosy is wearing in her hair\n• In MySims Agents, a man delivered Evelyn's father's journal into the hands of a MorcuCorp minion. You, with the help of Roxie, prove that the man who made the delivery was , partially thanks to .\n• The protagonist of Undertale is apparently allergic to Temmies, which explains why the otherwise-harmless creatures can damage them when they try to \"pet the cute human.\" A Temmie NPC also has the same allergy (yes, they're allergic to themselves), and promptly breaks out in \"HOIves\" after talking to them.\n• Haruka from Little Busters! loves making egg dishes - in fact, they're the only thing she can cook at all - because she believes that has an allergy to eggs, so Haruka wants to assert this as the one place she is truly the best.\n• New Dangan Ronpa V 3: Tsumugi Shirogane, the Ultimate Cosplayer, suffers a bizarre allergic reaction if she tries to dress up as a real person, which means that she cannot disguise herself as her fellow classmates as a Murder Mystery trick. In the climax of the story, Tsumugi starts cosplaying as characters from previous Dangan Ronpa entries, indicating that in this canon, the previous games are in-universe fiction.\n• Double subverted in Homestuck. John is mentioned early on to be deathly allergic to peanuts, but it doesn't come up for him beyond a few narration asides. Later on, Jake's dreamself, who is , is discovered dead. Cause of death? The Courtyard Droll force-feeding him peanuts in his sleep.\n• Of course, being Courtyard Droll, he actually just stuffed so many unshelled peanuts in his mouth that he choked.\n• In Kevin & Kell, while running Herd Thinners, Angelique manages to apply an allergen to Kell that leaves Lindesfarne (a hedgehog) unable to live with her without spraying quills every time she sneezes, at least until it's found out and Kell gets it cleaned off. Lindesfarne does manage to get revenge, with the help of one of Angelique's skunk step-children.\n• In Dragon Ball Abridged, turns out Goku is allergic to grapes. When Future Trunks gives Goku his cholesterol medication, he has to be convinced by Trunks that it's actually bacon-flavored because it was grapes and he hates grapes. Turns out he's so allergic to them, he turns purple and starts sweating purple.\n• In Sam & Mickey's The Barbie Cooking Show episode 2, Barbie needs to find a new co-host after Chelsea's allergy to almonds lands her in the ICU after handling the first ingredient of Barbie's red velvet cake recipe - almond meal flour.\n• How To Hero mentions allergies as a topic of friction that might come up within a superhero's support-squad. Citing Karen, the mutant-toucan handler who is allergic to peanuts, as an example.\n• Butch Cassidy and the Sundance Kids. The artificially intelligent computer who sent the team on missions was allergic to dogs, one of which is the Team Pet.\n• Played with in the Regular Show episode \"Eggscellent\". Rigby enters a contest where he must eat a gigantic twelve-egg omelet in order to win a hat. Problem is, he's allergic to eggs. This does not stop him from trying anyway (he really wants that hat!), and a Gilligan Cut later he's being rushed to the hospital, causing a Last Crusade-esque plot to kick in.\n• Franklin had one in which Franklin kept sneezing. The characters tested a number of possible causes and finally concluded that he was allergic to his best friend, Bear, as he only sneezed when he was around Bear or handled things that Bear gave to him. The two stayed apart for a while, but Franklin eventually decided he didn't mind sneezing if he could play with his best friend. He then found that he didn't sneeze around Bear when Bear was covered in mud. Then, when he went to Bear's house, he got a bath and it was discovered that it was actually the new bubble bath that Bear was using that was causing the sneezing.\n• In an episode of CatDog \"Sneezie Dog,\" Dog suddenly develops an allergy. They go to the doctor, who thinks that Dog may be allergic to Cat. Winslow decides to help Dog out, and takes the opportunity to torture Cat, as usual, up to shaving him bald and placing a brick wall between them. Eventually they find out Dog is actually allergic to Winslow, and they shave him bald as payback.\n• In Rugrats, the babies believe Chuckie is allergic to Kimi since he begins to sneeze whenever she's near him or passes by him. Fearing that the adults would get rid of her if they find out, they try to keep him away from Kimi. It later turned out that Kimi had a bunch of dandelions in her diaper which she was planning to give to Chuckie as a gift.\n• Four episodes of Grojband shows that Corey's allergic to cats, specifically cat dander, since the cats featured in the episode \"Super Zeroes\" doesn't have any, while the cats featured in \"One Plant Band\" (which also incidentally snapped him out of his brainwashing) and \"Love in an Nethervator\" do.\n• In the episodes \"Kon-Fusion\" and \"Pop Goes the Bubble\", Trina is allergic to bread crust and bubbles.\n• The Sofia the First episode \"When You Wish Upon a Well\" reveals that King Roland is allergic to cats, so Amber, upset that he's been spending more time with Sofia than her, wishes that he was allergic to her sister, which results in Sofia turning into a cat.\n• In The Smurfs episode \"The Sky Is Smurfing, The Sky Is Smurfing\", Papa Smurf comes down with an allergy which happens around the same time that a volcano named Mount St. Smurf is preparing to erupt. However, nobody is able to connect the dots together that Papa Smurf is allergic to volcanic dust until the eruption occurs and he calls for all the Smurfs to evacuate the village.\n• In the Wander over Yonder episode \"The Flower\", Lord Dominator is about to crush a dying flower Wander and Sylvia have spent the whole episode trying to save, when it spews a cloud of pollen in her face. Turns out Dominator has hay fever and she starts sneezing uncontrollably, giving Wander and Sylvia time to grab the flower and escape.\n• In one episode of Regal Academy, the students are tasked with finding a plant that has only recently been discovered, so they don't have any idea of what it looks like. Astoria remembers the teacher mentioning dragons are allergic to it, and figures they'll find it at a pond the dragons always avoid. Once they do find the plant, they confirm it's the right one by having a dragon sniff it, making him start sneezing.\n• In an episode of The Amazing World of Gumball, Darwin suddenly sneezes a lot, and is assumed to have an allergy to stupidity, so the characters attempt to find a cure before it worsens. In the end, it's revealed that he isn't allergic to stupidity, he just has a feather from a pillow fight stuck in his gills.\n• Daniel Tiger's Neighborhood has an episode in which Daniel is revealed to be allergic to peaches, mainly to serve the show's purpose of teaching children about this subject matter. He's taught what to do to help others to deal with his own allergy as well, such as making sure to ask before eating anything if it has any peaches in it and also informing others of his allergy, so they know to be sure to keep it in mind.\n• Arthur has an episode in which Binky is revealed to be allergic to peanuts, for similar reasons as the above Daniel Tiger example. Binky's peanut allergy is occasionally mentioned in later installments.\n• On JoJo's Circus, JoJo has a plot allergy to merryberries, a type of berry found only within the show's setting of Circus Town. In \"Tickled Pink,\" JoJo eats some merryberries, which causes her nose to swell and honk and her skin to turn pink and tingly. Fortunately, she visits her friendly family doctor, Skeebo's mother Dr. Seltzer, who gives her an easy cure - to pat her tummy and rub her nose, then rub her tummy and give her nose a pat. The moral of the story is \"So if you feel low / If you feel sad / If allergies make you feel real bad / For upset tummies or aching heads / Listen to your doctor and do what she says / If you wanna get better / Listen to your doctor and do what she says.\" Also \"If you are allergic to a food, never eat it because it can make you really, really sick, and don't be afraid to tell someone if you have an allergy.\"\n• On Peg + Cat in \"The Allergy Problem,\" Peg fears that she might be allergic to Cat, but turns out to actually be allergic to four-leaf clovers. They make her sneeze. This one can be chalked up as Artistic License \u0096 Biology, since four-leaf covers aren't chemically any different from regular clovers, they just have an extra leaf. If four-leaf clovers caused someone to sneeze, then surely regular ones would as well.\n• Totally Spies!: In \"Wild Style\", the girls sneak into the lair of a villain who is turning people into animals to make fashion out of them. While Clover is turning into a leopard, Alex blows their cover when her allergy to cats acts up.\n• Sid the Science Kid has \"The Reason Sid's Sneezin'\" which brings the learning aspect again as Sid learns about allergies after discovering that he's allergic to pollen like his father.\n• The Spider-Man (1981) episode \"Lizards, Lizards Everywhere\" had Spider-Man have difficulty taking down the Lizard because of sneezing fits. After he finally manages to defeat the Lizard and consults a doctor, he is informed that the sneezing was because he was allergic to reptiles.\n• In Detentionaire, Lee's father and the Serpent share an allergy to fish, which foreshadows the reveal that the latter is the long-lost son of the former.\n• Thunder and the House of Magic: Thunder, a magician's cat, uses Daniel's cat allergies against him in order to keep him out of the house and selling it behind the owner's back. Usually, just a tail across the face or even just simply sitting around inside the house is enough to get him out the door. However, the payout from selling the house is high enough to motivate Daniel to keep coming back, and even Daniel wisens up to the tactic over time, usually by either using his nose to look for the cat or putting on a hazmat suit to venture in the house without risking a breakout, making this an example of both Movement Restriction and Detection Allergy.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/PlotAllergy", "media_links": ["/pmwiki/pmwiki.php/VideoGame/MassEffect3", "/pmwiki/pmwiki.php/ComicBook/Runaways", "/pmwiki/pmwiki.php/WesternAnimation/CloudyWithAChanceOfMeatballs", "/pmwiki/pmwiki.php/WesternAnimation/AdventuresOfSonicTheHedgehog", "/pmwiki/pmwiki.php/ComicBook/SonicTheHedgehog", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/WesternAnimation/Arthur", "/pmwiki/pmwiki.php/WesternAnimation/GarfieldAndFriends", "/pmwiki/pmwiki.php/WesternAnimation/WallaceAndGromit", "/pmwiki/pmwiki.php/Webcomic/QuestionableContent", "/pmwiki/pmwiki.php/Series/TheBradyBunch", "/pmwiki/pmwiki.php/Webcomic/PvP", "/pmwiki/pmwiki.php/Webcomic/LasLindas", "/pmwiki/pmwiki.php/Anime/TheCatReturns", "/pmwiki/pmwiki.php/Series/Smallville", "/pmwiki/pmwiki.php/ComicBook/JimmyOlsen", "/pmwiki/pmwiki.php/WesternAnimation/DuckTales1987", "/pmwiki/pmwiki.php/Series/UntoldStoriesOfTheER", "/pmwiki/pmwiki.php/Manga/OmamoriHimari", "/pmwiki/pmwiki.php/WesternAnimation/TeenTitans", "/pmwiki/pmwiki.php/WesternAnimation/TheSecretOfNIMH", "/pmwiki/pmwiki.php/Literature/Goosebumps", "/pmwiki/pmwiki.php/VisualNovel/Snatcher", "/pmwiki/pmwiki.php/Series/NCIS", "/pmwiki/pmwiki.php/WesternAnimation/StormHawks", "/pmwiki/pmwiki.php/WesternAnimation/TheTick", "/pmwiki/pmwiki.php/Series/DoctorWho", "/pmwiki/pmwiki.php/ComicBook/DisneyDucksComicUniverse", "/pmwiki/pmwiki.php/WesternAnimation/MiraculousLadybug", "/pmwiki/pmwiki.php/Series/MurderSheWrote", "/pmwiki/pmwiki.php/WesternAnimation/ScoobyDooMysteryIncorporated", "/pmwiki/pmwiki.php/Literature/EmpireOfTheAnts", "/pmwiki/pmwiki.php/WesternAnimation/TheBotsMaster", "/pmwiki/pmwiki.php/WesternAnimation/Duckman", "/pmwiki/pmwiki.php/Series/MurdochMysteries", "/pmwiki/pmwiki.php/Literature/BenjaminJanuary", "/pmwiki/pmwiki.php/Series/DesperateHousewives", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/Series/StargateAtlantis", "/pmwiki/pmwiki.php/Series/StargateSG1", "/pmwiki/pmwiki.php/Anime/WeissKreuz", "/pmwiki/pmwiki.php/LightNovel/DirtyPair", "/pmwiki/pmwiki.php/LightNovel/LoveChunibyoAndOtherDelusions", "/pmwiki/pmwiki.php/Animation/HappyHeroes", "/pmwiki/pmwiki.php/Manga/Naruto", "/pmwiki/pmwiki.php/WesternAnimation/MiraculousLadybug", "/pmwiki/pmwiki.php/Film/TheManWhoKnewTooLittle", "/pmwiki/pmwiki.php/Film/AddictedToLove", "/pmwiki/pmwiki.php/WesternAnimation/TheBoxtrolls", "/pmwiki/pmwiki.php/Film/PeterRabbit", "/pmwiki/pmwiki.php/WesternAnimation/PoundPuppiesAndTheLegendOfBigPaw", "/pmwiki/pmwiki.php/Literature/Animorphs", "/pmwiki/pmwiki.php/Literature/TanteiTeamKZJikenNote", "/pmwiki/pmwiki.php/Creator/StephenKing", "/pmwiki/pmwiki.php/Franchise/SherlockHolmes", "/pmwiki/pmwiki.php/Literature/NightmaresAndDreamscapes", "/pmwiki/pmwiki.php/Series/ImaginationMovers", "/pmwiki/pmwiki.php/Series/TheBigBangTheory", "/pmwiki/pmwiki.php/Series/Seinfeld", "/pmwiki/pmwiki.php/Series/TheBradyBunch", "/pmwiki/pmwiki.php/Series/CSI", "/pmwiki/pmwiki.php/Series/CSI", "/pmwiki/pmwiki.php/Series/CSINY", "/pmwiki/pmwiki.php/Series/Wishbone", "/pmwiki/pmwiki.php/Series/BrooklynNineNine", "/pmwiki/pmwiki.php/Series/OtherSpace", "/pmwiki/pmwiki.php/Series/Flight29Down", "/pmwiki/pmwiki.php/Series/Monk", "/pmwiki/pmwiki.php/Series/ThatsSoRaven", "/pmwiki/pmwiki.php/Series/Swinging", "/pmwiki/pmwiki.php/VideoGame/MySims", "/pmwiki/pmwiki.php/VideoGame/Undertale", "/pmwiki/pmwiki.php/VisualNovel/LittleBusters", "/pmwiki/pmwiki.php/Webcomic/Homestuck", "/pmwiki/pmwiki.php/Webcomic/KevinAndKell", "/pmwiki/pmwiki.php/Creator/SamAndMickey", "/pmwiki/pmwiki.php/WesternAnimation/ButchCassidyAndTheSundanceKids", "/pmwiki/pmwiki.php/WesternAnimation/RegularShow", "/pmwiki/pmwiki.php/Film/IndianaJonesAndTheLastCrusade", "/pmwiki/pmwiki.php/WesternAnimation/Franklin", "/pmwiki/pmwiki.php/WesternAnimation/CatDog", "/pmwiki/pmwiki.php/WesternAnimation/Rugrats", "/pmwiki/pmwiki.php/WesternAnimation/Grojband", "/pmwiki/pmwiki.php/WesternAnimation/SofiaTheFirst", "/pmwiki/pmwiki.php/WesternAnimation/TheSmurfs", "/pmwiki/pmwiki.php/WesternAnimation/WanderOverYonder", "/pmwiki/pmwiki.php/WesternAnimation/RegalAcademy", "/pmwiki/pmwiki.php/WesternAnimation/TheAmazingWorldOfGumball", "/pmwiki/pmwiki.php/WesternAnimation/DanielTigersNeighborhood", "/pmwiki/pmwiki.php/WesternAnimation/Arthur", "/pmwiki/pmwiki.php/WesternAnimation/JoJosCircus", "/pmwiki/pmwiki.php/WesternAnimation/PegPlusCat", "/pmwiki/pmwiki.php/WesternAnimation/TotallySpies", "/pmwiki/pmwiki.php/WesternAnimation/SidTheScienceKid", "/pmwiki/pmwiki.php/WesternAnimation/SpiderMan1981", "/pmwiki/pmwiki.php/WesternAnimation/Detentionaire", "/pmwiki/pmwiki.php/WesternAnimation/ThunderAndTheHouseOfMagic"], "non_media_links": ["/pmwiki/pmwiki.php/Main/DownloadableContent", "/pmwiki/pmwiki.php/Main/AllergicToLove", "/pmwiki/pmwiki.php/Main/AllergicToEvil", "/pmwiki/pmwiki.php/Main/AllergicToRoutine", "/pmwiki/pmwiki.php/Main/SneezeOfDoom", "/pmwiki/pmwiki.php/Fanfic/HigherFlierOrMyLittleBlackbird", "/pmwiki/pmwiki.php/Main/AffablyEvil", "/pmwiki/pmwiki.php/Main/StatusQuoIsGod", "/pmwiki/pmwiki.php/Main/StatusQuoIsGod", "http://questionablecontent.net/view.php?comic=1123", "/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/Main/AuthorExistenceFailure", "/pmwiki/pmwiki.php/Main/TheReasonYouSuckSpeech", "/pmwiki/pmwiki.php/Main/FreezeSneeze", "/pmwiki/pmwiki.php/Recap/DuckTalesADuckTalesValentine", "/pmwiki/pmwiki.php/Main/UnwantedHarem", "/pmwiki/pmwiki.php/AudioPlay/BigFinishDoctorWho", "/pmwiki/pmwiki.php/Main/DonaldDuck", "/pmwiki/pmwiki.php/Recap/MurderSheWroteS3E12CrossedUp", "/pmwiki/pmwiki.php/Main/BlackWidow", "/pmwiki/pmwiki.php/Main/PopGoesTheHuman", "/pmwiki/pmwiki.php/Main/FanWank", "/pmwiki/pmwiki.php/Main/Anime", "/pmwiki/pmwiki.php/Main/Manga", "/pmwiki/pmwiki.php/Main/Blackmail", "/pmwiki/pmwiki.php/Main/OldShame", "/pmwiki/pmwiki.php/Main/AsianAnimation", "/pmwiki/pmwiki.php/Main/FanWorks", "/pmwiki/pmwiki.php/Fanfic/FirstTrySeries", "/pmwiki/pmwiki.php/Main/TitleDrop", "/pmwiki/pmwiki.php/FanFic/ThisBites", "/pmwiki/pmwiki.php/Main/RunningGag", "/pmwiki/pmwiki.php/Fanfic/BackToUs", "http://archiveofourown.org/works/7658497/", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/KarmicDeath", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/HotBlooded", "/pmwiki/pmwiki.php/Main/AmateurSleuth", "/pmwiki/pmwiki.php/Main/TamperingWithFoodAndDrink", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/OnceAnEpisode", "/pmwiki/pmwiki.php/Main/ItMakesSenseInContext", "/pmwiki/pmwiki.php/Main/GenderBlenderName", "/pmwiki/pmwiki.php/Main/LazyBum", "/pmwiki/pmwiki.php/Main/TheMedic", "/pmwiki/pmwiki.php/Recap/MonkS2E13MrMonkAndTheMissingGranny", "/pmwiki/pmwiki.php/Main/Seers", "/pmwiki/pmwiki.php/Main/FlowerInHerHair", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/RidiculouslyCuteCritter", "/pmwiki/pmwiki.php/Main/IronicAllergy", "/pmwiki/pmwiki.php/Main/VisualNovels", "/pmwiki/pmwiki.php/Main/OneNoteChef", "/pmwiki/pmwiki.php/Main/NewDanganRonpaV3", "/pmwiki/pmwiki.php/Main/MurderMystery", "/pmwiki/pmwiki.php/Main/Webcomics", "/pmwiki/pmwiki.php/Main/BrickJoke", "/pmwiki/pmwiki.php/Main/CloudCuckooLander", "/pmwiki/pmwiki.php/Main/WebOriginal", "/pmwiki/pmwiki.php/WebVideo/DragonBallAbridged", "/pmwiki/pmwiki.php/WebOriginal/HowToHero", "/pmwiki/pmwiki.php/Main/MissionControl", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/TeamPet", "/pmwiki/pmwiki.php/Main/GilliganCut", "/pmwiki/pmwiki.php/Main/FantasticFlora", "/pmwiki/pmwiki.php/Main/AnAesop", "/pmwiki/pmwiki.php/Main/ArtisticLicenseBiology", "/pmwiki/pmwiki.php/Main/CruellaToAnimals", "/pmwiki/pmwiki.php/Main/TheHeavy", "/pmwiki/pmwiki.php/Main/LongLostRelative", "/pmwiki/pmwiki.php/Main/ShadyRealEstateAgent", "/pmwiki/pmwiki.php/Main/Greed", "/pmwiki/pmwiki.php/Main/GenreSavvy", "/pmwiki/pmwiki.php/Main/TheNoseKnows"]}