{"title": "Quickly-Demoted Woman", "content": "A female character of significant rank or status who exists solely to lose said rank or status barely five minutes into the story... and long before she can get any decent characterization.\n\nThis is an unfortunate variation of the Quickly Demoted Leader, where the sole qualification for getting a demotion is possessing girly parts.\n\nIn some cases, the writers of a show with a male demographic want to acknowledge that females exist in this universe, even if the main characters are nearly all boys/men. As a sort of compromise, they often introduce a high-ranking female at the end of her career. The (male) protagonist meets her briefly, probably mentioning her former achievements as he does so, and then she politely vacates the spotlight so that the boys can get on with things, her pride and former glory intact. Depending on the cultural background of the work, her retirement may be less about age or ability and more about leaving to start a family. In these cases, she may make a speech about how a woman's place is in the home, and everyone will applaud her departure into domesticity. (If she is leaving to take a promotion or a transfer, this trope does not apply.)\n\nUnfortunately, there's also a more misogynistic, Writer on Board variation. These will have the woman demoralised to make a point, and that point is that women aren't made to rule. Either she screws up badly and gets fired or demoted, or she's completely overruled and undermined by a male character who automatically assumes control of the situation through no qualification other than having a Y-chromosome. She will either immediately accept this and take on a more stereotypically female role (most likely The Chick), or protest this demotion and be punished by the plot. Expect her to become a love-interest whether it makes sense or not.\n\nThis can sometimes be the official form of Chickification, since the reduction in rank is often accompanied by a reduction in ability or effectiveness (making you wonder how she got promoted in the first place). If she stays in the story, the focus often shifts away from her career and more towards her emotional and romantic life.\n\nNote that not all female characters who get demoted fit into this trope — this is for examples where sexism (either in-setting or by the writer) is clearly the primary factor. Quickly Demoted Leader is for when gender-neutral circumstances create the same problem.\n\nCompare Hysterical Woman, which may go hand in hand with this trope.\n• In the manga Mars, male protagonist Rei originally has a female senior racing partner, Kyoko — an experienced motorcycle rider who teams up with him for the 8-Endurance race. After the race, Kyoko tells Rei's girlfriend, Kira, that that event was her last. She retires to support her husband, Akitaka \"as his wife.\" Given that Akitaka (formerly a racer himself) lost a leg thanks to reckless riding, perhaps this would be understandable...except that he doesn't give up motorcycles, staying on to coach Rei while Kyoko fades from the picture. Just to add insult to injury, a later conversation notes that it was probably best that Kyoko retired when she did, since motorcycling is no sport for a woman and she'd just have been humiliated by the male racers if she'd stayed on.\n• Kyoko Aoi from Future GPX Cyber Formula SAGA gets demoted to vice-president of Aoi after Nagumo takes over the ownership of the team during the merge of the 2 Aoi teams, which resulted in Naoki Shinjyo fired from Aoi and he transfers to Union Savior. Subverted later when she gets her position back at the end of SAGA once Nagumo's true intentions are revealed.\n• Averted in Berserk. When Guts, The Protagonist, was officially initiated into the Band of the Hawk, he was quickly given a very important job and soon after rank in the mercenary band as the captain of the raiders and his sword skills outmatched Casca's, whose skills were formally second to their leader's, Griffith. Despite this, Casca still remained Griffith's second in command and remained highly respected by her comrades. However, Casca did feel emotionally demoted by Griffith's relationship toward Guts.\n• Played with in the case of Hungary, in Axis Powers Hetalia. Upon discovering she's a woman, she decides it's time to give up her life as a soldier in favor of being \"a freaking lady\" and Austria's maid. Some time after her maid days, she shows up again in charge of her country's military, having gotten over her former trepidations. Given that Hungary's actions are meant to be an allegory for the real-life situation of the country of Hungary, this all is justified.\n• Buddy Complex features this with Margaret, who started out as Great Zogilla's special agent, whose task was to make sure that the Zogillan forces take control of what key possessions the Alliance had. She often butted heads with Alfried, who had more experience and understood military combat, and would often try, without avail, to get any of her plans executed. When Margaret finally got a chance to achieve her plan, however, it consisted of nothing more than an Attack! Attack! Attack! sequence that consists of a head-on attack and heavy missle bomardment that could easily be countered. Not only that, but Margaret almost dies in the process. Because this was an \"all-or-nothing\" plan to please her bosses, Margaret lost her job.\n• In Marvel both Maria Hill and Ultimate Carol Danvers were in control of S.H.I.E.L.D. but was then replaced by a Stark. Maria Hill stepped down of her own volition, while Danvers was replaced while she was in a coma, then she was replaced permanently by Nick Fury, her old boss.\n• Daisy Johnson briefly took over as well, but was replaced by Maria Hill.\n• Inverted in Rainbow Rowell's Runaways, where Chase became the de facto leader of the team after Nico quit, only for the team to fall apart because everyone else left. When the team reforms, Nico becomes the leader again, Gert resumes being her second-in-command, and Chase gets treated like the team's errand boy again.\n• 1938 theatrical serial Buck Rogers features Lt. Wilma Dearing, a capable commander in Earth's military forces of the 25th Century... until the arrival of Fish out of Temporal Water Buck Rogers, who strides in and immediately assumes command, as if it were his inherent right to do so. And she just steps to the wayside, basking in his masculine superiority without argument; she even takes orders from him! The application of the trope in this instance is (very slightly) tempered by the era in which it was made.\n• By way of contrast, the television series from the 1970s was only marginally better in this regard. Though Buck was a Marty Stu in general in that series, with military commanders, scientists, and superhuman AI's bending themselves backwards to accommodate his old-fashioned ways— which always proved superior.\n• MST3K target Project Moonbase was ripped on mercilessly for its blatant sexism. The female Colonel Briteis, who apparently was better than the male Major Moore and now outranks him, is immediately subjected to blatant sexism when they are placed on a mission together. Her superiors jokingly threaten to spank her if she gets out of line and she spends the rest of the movie subservient to someone she actually outranks. In any situation of peril, she fails and the male hero is always lauded for his manly heroics. The Colonel even apologizes for \"getting all female\". The actual demotion doesn't happen until the end of the film, where Moore is promoted to Brigadier after they get married entirely because a woman has to be subservient to her husband. Despite how late this happens, the whole movie seems dedicated to this concept.\n• Averted in Warhammer 40,000's Ciaphas Cain, Hero of the Imperium series: When the 597th Valhallan is formed from what's left of two regiments, one all-male and one all-female, after being chewed up and spat out by the Tyranids, the post of colonel goes to the female Kasteen due to her being a few months senior. Cain, THE HERO OF THE IMPERIUM, notes on how this wasn't well-received by the remnants of the male regiment - the women were a garrison regiment while the men were actual front-line fighters (and their major had more combat experience). After teething troubles in the first book, the point is never raised again and the regiment works rather well.\n• An in-universe example comes from the Robotech novelizations. Miriya Sterling is the second-best pilot on Earth, and she's clearly willing to fight during the Malcontent Uprisings, but the brass consider her more useful as a propaganda tool; namely, as a wife and mother, and thus an example of a perfectly acculturated and civilized Zentraedi.\n• In Vampire Academy, following the battle at her Academy, Ellen Kirova is demoted from headmistress to mere teacher. Replaced by Eugene Lazar, a royal.\n• The second Noob novel mentions the retired Mist (female), the first top player ever for the the fictional MMORPG in which the story is set, whose fame got overshadowed by her Living Legend male successor, Spectre. After Spectre himself retired, the two following top players were male as well. The trope is subverted when Mist comes out of retirement in the fourth novel, as she mentions having done quite well for herself on other online games.\n• Samantha Carter seems aware of and worried about this trope in the pilot of Stargate SG-1, as she's noticeably defensive about a male who outranks her being brought in to potentially lead another Stargate expedition. Fortunately, her apparent fears are unfounded, as Colonel O'Neill was tapped for a perfectly good reason and, witty banter aside, is perfectly respectful of women (scientists, on the other hand, have to do some proving of themselves.) Carter quickly becomes the show's Lancer and co-Smart Guy, and leads the team after Jack's eventual departure.\n• In the later seasons you had Colonel Mitchell being brought in to lead SG-1 after O'Neill's departure, despite Carter being of equal rank and actually having been on the team much longer. Indeed, many fans complained that Mitchell only made it on the team for failing to die after crashing his plane in the middle of a firefight. Although ultimately the trope was averted in that Carter and Mitchell both seemed to share equal command responsibility, and Mitchell's status got him the Butt-Monkey treatment on more than a few occasions (\"Don't touch that! <rolls eyes>. New guy!\").\n• Then she became The Leader of the Atlantis expedition by replacing the previous also female leader.\n• Then her web-series got picked up and she was put through a wormhole. The Obstructive Bureaucrat took her place. Talk about Real Life Writes the Plot.\n• SG-1 being nothing more than an official TOE at the time, Col Mitchell's heading the team is more Jack O'Neill's idea of a practical joke than any denigration of Col Carter, who was by all accounts very very very happily heading up Area 51's R&D - and who refused to rejoin the team for some time.\n• Subverted on Homicide: Life on the Street. Shortly after Lieutenant Megan Russert is promoted to Captain, she is double-demoted back down to Detective. Although her initial promotion was an example of Political Correctness Gone Mad (it is flat-out stated that she was picked because 60% of registered Baltimore voters are female), she has proven herself to be a competent and well-liked administrator. Her demotion, therefore, is used as still further proof that Colonel Barnfather is a Pointy-Haired Boss. Due to Isabella Hofmann leaving the cast, Russert takes an open-ended administrative leave soon after.\n• In a 7Days episode, a new top-of-the-line American destroyer is sunk by a Chinese submarine, after the former opens fire (both are destroyed). A high-ranking admiral is on-board the ship at the time. Parker goes back in time to prevent the incident. Incidentally, the captain is an old friend, and flame, of his, being the first female captain in the US Navy. One officer even complains about the situation to his wife prior to boarding. Shortly after leaving port, the captain nearly shoots down a civilian airplane that was experiencing radio trouble and couldn't identify itself. The admiral has her relieved and takes command. Thing is, she acted in accordance with official policy when an unidentified aircraft entered range. The fact that she didn't open fire could probably be a violation. Subverted in that It turns out that it is the admiral who is the crazy one. He intends to martyr himself to fire the first shot in a war between the \"Red Dragon\" and the US. Luckily, the President outranks him. In the end, the same officer who complained expresses the desire to serve under the captain.\n• This happened so early in CSI: Miami it actually happened before the timeframe of the series: The pilot featured Megan Donner, the former day shift supervisor who comes back after a 6 months leave, only to find Horatio Caine in her position (and with no apparent hope of getting it back). It seems also that while H is kind of a Team Dad for the group Megan has a cold or simply professional relationship with most of its members. The character was eventually Put on a Bus when producers decided actress Kim Delaney had not enough onscreen chemistry with David Caruso.\n• A later flashback episode puts Caine on the case that would lead to CSI's creation with no mention of Donner.\n• CSI original version averted it for the most part-Catherine was a Supervisor for several years, then became head of the Graveyard shift, though that only lasted two seasons. In the end, her demotion wasn't because of incompetence but because she chose to assume some of the blame for Ray Langston's rampant insubordination while saving his ex-wife from a serial killer. And when she finally got Put Ona Bus, the bus took her to a plum job at the US Justice Department.\n• In first colour Doctor Who serial we are introduced to U.N.I.T.'s specialist scientific advisor, Dr Elizabeth Shaw. Demoted to assistant to the specialist scientific advisor when The Doctor turns up and takes on that role. It is Lampshaded that her departure at the end of the season is due to her distaste for this turn of events.\n• Power Rangers Wild Force had this. Unlike Power Rangers Time Force, where Pink Ranger Jen was the Leader no matter what, the series started out with Yellow Ranger Taylor as leader of the team. When Rookie Red Ranger Cole shows up and is declared leader, Taylor isn't thrilled and spends at least another episode still trying to hold on to that command before giving up and letting Cole take control. Sadly, this was because director Jonathan Tzachor decided to recreate Hyakujuu Sentai Gaoranger, where the Yellow Ranger was a guy there.\n• Kaoru Shiba of Samurai Sentai Shinkenger, the real head of the Shiba clan, who was using Takeru as a decoy to protect her. However, when she sees her vassals' unfailing loyalty to Takeru and is then unable to defeat Doukoku by herself, she steps down and formally adopts him so he can take over as clan leader in her place.\n• It's done differently in Power Rangers Samurai - Lauren Shiba arrives and wants to be co-leaders with her younger brother Jayden, but Jayden refuses and leaves as there should only be one leader. However, the other Rangers don't take too kindly to Jayden bailing and aren't too thrilled at Lauren taking over. When her sealing spell fails to work on Xandred and Jayden returns, she gladly returns control back to Jayden, realizing taking over a team that he had worked with and built up was stupid.\n• In season two of Continuum, the male inspector Dillon is replaced by a new female Da Chief. A few episodes later the new female boss is demoted and Dillon is back in charge. She is extremely upset about the turn of events and accuses Dillon of conspiring to force her out of the job because of her gender. However, the truth is much, much darker. Dillon got the job back because he made a Deal with the Devil and agreed to spear head the effort to turn the Vancouver Police Department into the corporate owned police force that we see in the bad future . The female inspector would have never agreed to this so was forced out.\n• Radiata Stories has an odd situation with Ridley and Jack.\n• Ridley. After her second mission Ridley is promoted to Knight Captain, not because she earned it, but because her Dad (the Lord Chamberlain) wants all her subordinates to act as bodyguards because he doesn't think she can handle being a knight on her own merits. In other words, it's a promotion instead of a demotion but the sexism is still there.\n• Jack. In order to become a knight, one has to win the Knight Selection Trials. Jack loses his first bout (To Ridley no less) and yet he is selected to be a knight because of his father's fame.\n• Maria in Sakura Wars is demoted to vice-captain before the beginning of the first game to allow an inexperienced male ensign to come in and take over the Flower Division, despite her being a highly experienced veteran. She even comments in the OVA that it's because she's a women that the team doesn't listen to her, despite still showing great command skill as Ogami's Number Two. While she doesn't hesitate to be blunt with her new commander, and the game itself kind of implies that her genuine lack of people skills are what led to her demotion, it's still pretty obvious (and kind of lame) that this was done mainly to justify the game's Dating Sim mechanic.\n• She is much more resentful of losing her position in the anime adaptation, but said adaptation makes it clearer that it's her lack of empathy and personal skills that led to her demotion, not her gender.\n• Averted in Sakura Wars: So Long, My Love; while Captain Ratchet's loss of spiritual power leaves her incapable of directly fighting alongside the rest of the Star Division, she remains its overall leader, with Shinjiro simply taking over her frontline duties. He doesn't even take her place as captain until near the end of the game.\n• In SuikodenI, the leader of the resistance Odessa is soon demoted upon meeting the hero to \"dead\", though not before she becomes an implied love interest (\"You couldn't sleep either?\" + speaking while looking at the stars = Love trope). She specifically comments on how she can't be a heroic leader and a woman at the same time when she shields a little kid from arrows. (Because, you know, the male hero would never do that and just let the kid die.) Her last words are essentially to never mention her again and throw her corpse into the sewers to never be found (both to keep the resistance hidden), and then find her big brother. The only sign of her existence in later games is that Flik names his sword after her.\n• Apple in Suikoden II. After screwing up as a strategist, she decides (explicitly) that it is because she is a woman, and has you seek out a proper male strategist who can win battles. This is implied to be more her lack of self-confidence than anything else, though, as she still comes up with good ideas even after you find the new strategist.\n• Callo Merlose in Vagrant Story. Although she carries the title of \"Inquisitor\", she's told to stay out of the plot (lacking combat experience) before the opening sequence is even over, immediately gets kidnapped, and spends the rest of the game just standing around. This turns out to be her job: proximity to Lea Monde's aura is giving her a psychic talent that allows her to read people's innermost thoughts, sometimes without their knowledge, whether they want her to or not... which means the longer she stays with the villains who kidnapped her, the more she's finding out without having to actually do anything but stand around, demand answers, and get them.\n• Alys of Phantasy Star IV, who dies about halfway through the first act of the game, leaving her student, Chaz, as de facto leader. Unlike most other examples, she gets plenty of development (to the point of being a Decoy Protagonist), and appears at the end of the game as one of the spirits sheltered by Elsydeon .\n• Final Fantasy VIII has Quistis Trepe who starts as an instructor. Her demotion comes from her youth (she's eighteen) ultimately having her fail to show sufficient leadership qualities. She quickly follows Squall's lead, despite him being even younger and with even less leadership training, and just freshly graduated.\n• Captain I. Burton is the head of the Cruiser Tobermoon in the backstory of Star Control II: The Ur-Quan Masters, eventually heading the mission on Vela 2 to restore the Precursor facility and build a flagship with its equipment. However, her demotion is more justified than usual, as the player character had an uncanny knack for working with Precursor technology, allowing him to pilot the alien starship while Burton commanded the Tobermoon again as they set course for Earth. She was killed by a Slylandro Probe during the trip, making the PC the de facto leader of the entire mission from there on.\n• Bazett Fraga McRemitz of Fate/stay night, Lancer's Master and the only female Master who isn't from one of the three families, is killed without appearing onscreen, and Lancer comes under Kotomine's control. However, she gets rescued by the Sequel, where she is the center of events.\n• In Arthur, King of Time and Space, Arthur announces that Guenevere will be in charge of the kingdom during the Roman Wars. In the baseline arc (and only there), the reaction of the people means that Merlin gets put in charge instead. Subverted since Merlin has no intentions of doing something as boring as running a kingdom, and makes Guenevere the default ruler anyway.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/QuicklyDemotedWoman", "media_links": ["/pmwiki/pmwiki.php/Manga/Mars", "/pmwiki/pmwiki.php/Anime/FutureGPXCyberFormula", "/pmwiki/pmwiki.php/Manga/Berserk", "/pmwiki/pmwiki.php/Webcomic/AxisPowersHetalia", "/pmwiki/pmwiki.php/Anime/BuddyComplex", "/pmwiki/pmwiki.php/ComicBook/UltimateMarvel", "/pmwiki/pmwiki.php/ComicBook/MsMarvel", "/pmwiki/pmwiki.php/ComicBook/SHIELD", "/pmwiki/pmwiki.php/ComicBook/IronMan", "/pmwiki/pmwiki.php/ComicBook/NickFury", "/pmwiki/pmwiki.php/ComicBook/RainbowRowellsRunaways", "/pmwiki/pmwiki.php/Series/BuckRogersInTheTwentyFifthCentury", "/pmwiki/pmwiki.php/Series/MysteryScienceTheater3000", "/pmwiki/pmwiki.php/Film/ProjectMoonbase", "/pmwiki/pmwiki.php/TabletopGame/Warhammer40000", "/pmwiki/pmwiki.php/Literature/CiaphasCain", "/pmwiki/pmwiki.php/Anime/Robotech", "/pmwiki/pmwiki.php/Literature/VampireAcademy", "/pmwiki/pmwiki.php/Literature/Noob", "/pmwiki/pmwiki.php/Series/StargateSG1", "/pmwiki/pmwiki.php/Series/StargateAtlantis", "/pmwiki/pmwiki.php/Series/HomicideLifeOnTheStreet", "/pmwiki/pmwiki.php/Series/SevenDays", "/pmwiki/pmwiki.php/Series/CSIMiami", "/pmwiki/pmwiki.php/Series/CSI", "/pmwiki/pmwiki.php/Series/DoctorWho", "/pmwiki/pmwiki.php/Series/PowerRangersWildForce", "/pmwiki/pmwiki.php/Series/PowerRangersTimeForce", "/pmwiki/pmwiki.php/Series/HyakujuuSentaiGaoranger", "/pmwiki/pmwiki.php/Series/SamuraiSentaiShinkenger", "/pmwiki/pmwiki.php/Series/PowerRangersSamurai", "/pmwiki/pmwiki.php/Series/Continuum", "/pmwiki/pmwiki.php/VideoGame/RadiataStories", "/pmwiki/pmwiki.php/VideoGame/SakuraWars", "/pmwiki/pmwiki.php/Anime/SakuraWarsTV", "/pmwiki/pmwiki.php/VideoGame/SakuraWarsSoLongMyLove", "/pmwiki/pmwiki.php/VideoGame/SuikodenI", "/pmwiki/pmwiki.php/VideoGame/SuikodenII", "/pmwiki/pmwiki.php/VideoGame/VagrantStory", "/pmwiki/pmwiki.php/VideoGame/PhantasyStarIV", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyVIII", "/pmwiki/pmwiki.php/VideoGame/StarControl", "/pmwiki/pmwiki.php/VisualNovel/FateStayNight", "/pmwiki/pmwiki.php/Webcomic/ArthurKingOfTimeAndSpace"], "non_media_links": ["/pmwiki/pmwiki.php/Main/QuicklyDemotedLeader", "/pmwiki/pmwiki.php/Main/AlwaysFemale", "/pmwiki/pmwiki.php/Main/RememberWhenYouBlewUpASun", "/pmwiki/pmwiki.php/Main/ValuesDissonance", "/pmwiki/pmwiki.php/Main/StayInTheKitchen", "/pmwiki/pmwiki.php/Main/WriterOnBoard", "/pmwiki/pmwiki.php/Main/FamilyUnfriendlyAesop", "/pmwiki/pmwiki.php/Main/StayInTheKitchen", "/pmwiki/pmwiki.php/Main/TheChick", "/pmwiki/pmwiki.php/Main/TheComplainerIsAlwaysWrong", "/pmwiki/pmwiki.php/Main/StrangledByTheRedString", "/pmwiki/pmwiki.php/Main/Chickification", "/pmwiki/pmwiki.php/Main/QuicklyDemotedLeader", "/pmwiki/pmwiki.php/Main/HystericalWoman", "/pmwiki/pmwiki.php/Main/Anime", "/pmwiki/pmwiki.php/Main/Manga", "/pmwiki/pmwiki.php/Main/TheProtagonist", "/pmwiki/pmwiki.php/Main/NumberTwo", "/pmwiki/pmwiki.php/Main/GreenEyedMonster", "/pmwiki/pmwiki.php/Main/TheLancer", "/pmwiki/pmwiki.php/Main/AttackAttackAttack", "/pmwiki/pmwiki.php/Main/ComicBooks", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/ComicStrip/BuckRogers", "/pmwiki/pmwiki.php/Main/FishOutOfTemporalWater", "/pmwiki/pmwiki.php/Main/ValuesDissonance", "/pmwiki/pmwiki.php/Main/MartyStu", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/MMORPG", "/pmwiki/pmwiki.php/Main/LivingLegend", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/TheLancer", "/pmwiki/pmwiki.php/Main/TheSmartGuy", "/pmwiki/pmwiki.php/Main/ButtMonkey", "/pmwiki/pmwiki.php/Main/TheLeader", "/pmwiki/pmwiki.php/Main/PutOnABus", "/pmwiki/pmwiki.php/Main/ObstructiveBureaucrat", "/pmwiki/pmwiki.php/Main/RealLifeWritesThePlot", "http://en.wikipedia.org/wiki/Table_of_Organization_and_Equipment", "/pmwiki/pmwiki.php/Main/PoliticalCorrectnessGoneMad", "/pmwiki/pmwiki.php/Main/PointyHairedBoss", "/pmwiki/pmwiki.php/Main/RealLifeWritesThePlot", "/pmwiki/pmwiki.php/Main/InsaneAdmiral", "/pmwiki/pmwiki.php/Main/TeamDad", "/pmwiki/pmwiki.php/Main/PutOnABus", "/pmwiki/pmwiki.php/Main/PutOnaBus", "/pmwiki/pmwiki.php/Main/Lampshaded", "/pmwiki/pmwiki.php/Main/RookieRedRanger", "/pmwiki/pmwiki.php/Main/ShesAManInJapan", "/pmwiki/pmwiki.php/Main/DaChief", "/pmwiki/pmwiki.php/Main/DealWithTheDevil", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/NumberTwo", "/pmwiki/pmwiki.php/Main/DatingSim", "/pmwiki/pmwiki.php/Main/ICallItVera", "/pmwiki/pmwiki.php/Main/DecoyProtagonist", "/pmwiki/pmwiki.php/Main/TheHero", "/pmwiki/pmwiki.php/Main/VisualNovels", "/pmwiki/pmwiki.php/Main/NeverASelfMadeWoman"]}