{"title": "I Can Live With That", "content": "A Stock Phrase, commonly heard in the mouths of your Anti-Hero and your Tragic Villain. It comes in two main types:\n• Type 1: Someone is resigned/willing to accept (or at least start accepting) a negative situation: that they're a failure, that they're acting in an evil manner, that their actions will cause problems, etc.\n• Type 2: A person gets an unexpected break or finds out that things aren't as bad as they thought.\n\nIn other words, Type 1 is basically the \"negative\" version of the trope example:\n\n\n\n\" I can live with that.\" \"You've rescued your wife, but the bus full of nuns drove into the swamp and exploded , and she had a heart attack! You are doomed to be single forever!\"\" I can live with that.\"\n\nType 1 also overlaps with I Did What I Had to Do—the difference being that Type 1 of this trope more overtly expresses regret at what he felt he had to do, while the latter might shrug off any regrets.\n\nType 2 is the \"positive\" version, where some unlikely or contrived bit of fortune lands in your lap.\n\n\n\n\"I can live with that.\" \"What the the Big Bad 's getaway jet just ingested a flock of flying monkeys and crashed in flames before we could shoot him down.\"\"I can live with that.\"\n\nCompare Shrug Take, At Least I Admit It, Insult Backfire and I'll Take That as a Compliment.\n• Puella Magi Madoka Magica the Movie: Rebellion: Upon , realizes that her obsession with protecting Madoka has crippled her own emotional health and ended their friendship, because she has knowingly and irreparably broken Madoka's trust in her. However, she doesn't regret her actions, as she has finally saved Madoka— from both the Incubators and herself —and nothing can matter more than that. The last scene depicts dancing in a field, alone and victorious.\n• In Fate/Zero, Kiritsugu isn't too bothered by the fact that he might be evil. As long as it saves lives in the end, he declares himself willing to be the bearer of all the evil in the world if necessary.\n• Martial Law responds to his detractors: \"A lot of people say I'm a uniformed thug, no better than the scum I hunt down ...a fascist cop...a glorified Nazi... a legalized vigilante, handing out his own highly suspect street \"justice\"... someone with a pathological hatred of superheroes, reveling at the chance to beat the hell out of them. That sounds fair. I can live with that.\"\n• In Die Hard: FBI Special Agent Johnson: Figure we take out the terrorists. Lose 20, 25 percent of the hostages, tops. \n\nFBI Agent Johnson: I can live with that.\n• In The Life Aquatic with Steve Zissou: Steve Zissou: I wanted to give you a heads-up on what I thought of the piece... \n\nJane Winslett-Richardson: You read it. What did you think? \n\nSteve: Well, I was a little upset at first. I mean, obviously people are going to think I'm a showboat, and a little bit of a prick. But then I thought... that's me. I said those things, I did those things. I can live with that.\n• In The Replacements (2000): Eddie Martel: I'm still an All-Pro quarterback with two Super Bowl rings. You'll never be anything more than a replacement player. \n\nShane Falco: Yeah. Yeah, I can live with that.\n• In the Star Trek: Deep Space Nine episode \"In the Pale Moonlight\", Sisko says this in his personal log about covering up the truth about a political assassination for the greater good. Sisko's delivery, however, makes it clear that he is actually trying to convince himself that his actions were justified, and it is not at all clear if he succeeds: Sisko: So... I lied. I cheated. I bribed men to cover up the crimes of other men. I am an accessory to murder. But most damning of all I think I can live with it And if I had to do it all over again I would. Garak was right about one thing—a guilty conscience is a small price to pay for the safety of the Alpha Quadrant. So I will learn to live with it... Because I can live with it... I can live with it.\n• In \"Business as Usual\", Sisko informs Quark that the Regent of Palomar, a planetary dictator who was aiming to kill 28 million people to strike back against a general who had betrayed him, was killed because Quark sabotaged a weapons deal with him by engineering a surprise encounter between the Regent and General Nassuc, said general. Quark: I can live with that, too. And I can think of twenty-eight million other people who won't mind either.\n• Dexter episode \"The British Invasion\": Debra Morgan: You're a little weird, Dex. \n\nDexter Morgan: That's not gonna change. I'm gonna be this way forever. \n\nDebra: I can live with that.\n• House\n• \"Forever\": House: If we were all satisfied with what we had, what a beautiful world it would be. We'd all slowly starve to death in our own filth, but at least we'd be happy. Listen, I need your self worth to hang on this job. For kicking ass to be all that lets you rise above miserable. If waking up in the morning is enough, I don't need you. Foreman: I can live with that.\n• \"Lockdown\": Taub: We have a tiny window of opportunity to gain some insight into our colleagues... Okay, what if we just snooped on our boss? \n\nForeman: I think I can live with that.\n• The Bones episode \"The Witch in the Wardrobe\" Dr. Jack Hodgins: Okay, fine. No more compliments. You don't look good today. Your smile is average at best. And it is *not* cool that we finally get to work together again in the field. \n\nAngela Montenegro: ...Okay fine, I can live with that.\n• The One Tree Hill episode \"The Desperate Kingdom of Love\": Haley James: Um... I was just alphabetising our CDs. \n\nNathan Scott: So what? \n\nHaley: So, '\n\nNathan: So you listen to crummy music. I can live with that. Um... I was just alphabetising our CDs.So what?So, ' Natalie Merchant ' after 'NOZ' and 'Wilco' before the 'Wu-Tang Clan'?So you listen to crummy music. I can live with that.\n• The NCIS episode \"Enigma\": Gibbs: (as they're going after Gibbs' CO) You take a shot at him, you answer to me! \n\nFBI Agent Fornell: I can live with that.\n• Heroes episode \"Chapter Two: Lizards\" Takezo Kensei: You can make me the hero she sees in me. \n\nHiro Nakamura: As long as you stop drinking. \n\nTakezo: No promises. \n\nHiro: [in Japanese, to himself] I can live with that.\n• The Buffy the Vampire Slayer episode \"The Initiative\": Buffy Summers: Uh, last night... At the party, you wanted to tell me something? \n\nRiley Finn: Oh, yeah. Very important stuff. I don't remember any of it now. But you would have been fascinated, possibly even moved. Did Willow tell you I like cheese? Buffy: You're a little peculiar. \n\nRiley: (smiles) I can live with that.\n• From Angel:\n• \"Blood Money\": Angel: Okay, so we're both rude. You know what? I can live with that.\n• \"The Thin Dead Line\": Angel: I thought you might want to know. I took care of our cop problem. \n\nDetective Lockley: Crime reports from that precinct. Up until three months ago, there was a murder every two weeks, a rape every two days, a robbery every hour and a half. That's what we just gave back to the people in that community. Angel: I can live with that.\n• The Malcolm in the Middle episode \"Watching the Baby\": Malcolm: Her boyfriend is Aaron Seponevic. Have you ever seen that guy? If he sees you making out with his girlfriend, he's gonna kill you! [snip] \n\nReese: From now on, when I walk by, people are gonna say, \"What happened to that guy's face?\". And someone'll say, \"That's Reese. He made out with Aaron Seponevic's girlfriend.\" And I can live with that.\n• The The West Wing episode \"The Lame Duck Congress\": Leo McGarry: Any downside? \n\nC.J. Cregg: I'll feel stupid. \n\nLeo: I can live with that.\n• The Doc Martin episode \"In Loco\": Pauline Lamb: Don't forget you've got the school thing today. If Louisa Glasson gets it, there's a bit of a party later at the Crab. \n\nDr. Martin Ellingham: What happens if she doesn't? \n\nPauline: No one in Portwenn will talk to you. \n\nMartin: I can live with that.\n• The Third Watch episode \"Alone Again, Naturally\": Davis: Don't tell me about corruption. We're trying to make things right, and if getting the really bad people off the street means I gotta fudge the truth a little bit every once in a while, I can live with that.\n• Doctor Who: \"The Husbands of River Song\" River: God knows where (the Doctor) is right now, but I promise you, he's doing whatever the hell he wants and not giving a damn about me! And I'm just fine with that! When you love the Doctor, it's like loving the stars themselves. You don't expect a sunset to admire you back.\n• In Dragon Age II, this is Snarky!Hawke's response to Meredith if they choose to side with the mages in \"The Last Straw\".\n• In Gears of War 3, when Queen Myrrah tries to claim to Marcus that Humans Are Bastards, this is his response.\n• The line pops up near the end of Marvel vs. Capcom: Infinite, when it seems like Dante has joined up with Ultron-Sigma. Ghost Rider: You've betrayed us. \n\n I can live with that. You've betrayed us.I can live with that. You won't.\n• From the Mighty Max episode \"Norman's Conquest\", as Normal dangles Spike over a cliff: Spike: You can't kill me! If you do, \n\nNorman: (drops him) I can live with that. You can't kill me! If you do, you'll be no better than me! (drops him) I can live with that.\n• The SpongeBob SquarePants episode \"Chocolate with Nuts\": SpongeBob: Don't get me wrong, Patrick. It's great that we helped that guy out but there's no one else in town to sell chocolate bars to. Let's face it Patrick, we're failures. \n\nPatrick: I can live with that.\n• In the Fanboy and Chum Chum episode \"The Janitor Strikes Back\", after the two manage to get permission to chew gum in school from the janitor. Janitor Poopatine: Alright, alright! You can have your gum! And chew it, too. \n\nFanboy & Chum Chum: YAY!!! \n\nJanitor Poopatine: But no taffy! \n\nFanboy: Ah, we can live with that. : Alright, alright! You can have your gum! And chew it, too.: YAY!!!: But no taffy!: Ah, we can live with that.\n• South Park\n• It doesn't actually happen, but in \"Tom's Rhinoplasty\" Mr Garrison plans to undergo a cosmetic nose surgery. (The nose job he picks will make him look like a young David Hasselhoff.) The surgeon warns him about the risks of the operation first. Tom: You could end up a hideous, foul shadow of a creature, living in the sewers and only emerging at night to scavenge for food. \n\n(beat) \n\nGarrison: I can live with that.\n• Along the same lines, the end of \"Mr. Garrison's Fancy New Vagina\" has him realizing that his sex-change operation hasn't really made him a woman and now (due to the events of the episode) can't be reversed. After a little philosophical contemplation, Garrison decides he'll manage. Garrison: You know what? I'm OK. Even though I'm not truly a woman, I think I still like the new me. I'd rather be a woman who can't have periods than a : You know what? I'm OK. Even though I'm not truly a woman, I think I still like the new me. I'd rather be a woman who can't have periods than a fag . [Turns to the crowd.] Hey guys! This girl is staying a woman! Who wants to pound my vag? Girl power!\n• In Homestuck, this is practically Aradia's catchphrase. Even when faced with the inevitable destruction of their universe. i'm 0kay with that \n\ni'm 0kay with a l0t 0f things\n• Girl Genius: Agatha: \"...I'm the evil madgirl with the deathray and the freakish ancestors and the town full of minions and the horde of Jaegers and the homicidal castle full of sycophantic evil geniuses and fun-sized hunter-killer monster clanks and GOODNESS KNOWS WHAT ELSE \u0097- ( : \"...I'm the evil madgirl with the deathray and the freakish ancestors and the town full of minions and the horde of Jaegers and the homicidal castle full of sycophantic evil geniuses and fun-sized hunter-killer monster clanks and GOODNESS KNOWS WHAT ELSE \u0097- ( Beat ) — And you know what? I CAN WORK WITH THAT!\"\n• Cube. Upon reaching the exit: Worth: I have nothing... to live for out there. \n\nLeaven: What is out there? \n\nWorth: Boundless human stupidity. \n\nLeaven: I can live with that.\n• The Mystery Science Theater 3000 worthy Quest of the Delta Knights has this exchange: Tee: Yes, master \n\nBaydool: No. Not \"master\", Tee. You're free now, you're no longer a slave, remember? \n\nTee: My mother taught me; those with whom we have met, those with great wisdom and dignity, we should call \"master\". \n\nBaydool: (shrugs his shoulders) I can live with that.\n• Charmed episode \"Something Wicca This Way Goes\". The sisters change into magical disguises so everyone will think they're dead. New Piper: Cute. I can live with that.\n• Star Trek: Deep Space Nine episode \"Business as Usual\" Quark: I just wanted them to cross paths, so that the deal would fall through. \n\nSisko: It fell through, all right. Hagath and Gaila barely managed to get off the station alive. [snip] I wouldn't count on seeing your former business partners again. Quark: I can live with that.\n• Wings episode \"Roy Crazy\" Roy Biggins: So what you're saying is, she's not interested in me, that I don't mean anything to her. She just wants to get me into bed & use me like some cheap piece of meat? \n\nBrian Hackett: Exactly. \n\nRoy: I can live with that!\n• Scott Pilgrim, when Stephen begs Hollie's gay roommate Joseph to make an album for Sex Bob-omb in volume 4: Stephen: Joseph!!! Can you record our album? Sex Bob-omb needs to record an album! We need to take it to the next level! \n\nJoseph: ...Okay, I'll do it. But only because I find you attractive. \n\nStephen: I can live with that!!! Joseph!!! Can you record our album? Sex Bob-omb needs to record an album! We need to take it to the next level! You saw us play in volume 3, right? We aren't all that sucky, right???...Okay, I'll do it. But only because I find you attractive.I can live with that!!!\n• Kick Buttowski has this exchange after Kick tells the class about his Indiana Jones-esque quest for the Holy Grail of skateboards. Teacher: Your report was obviously fabricated, Mr. Buttowski. But you entertained us all. So you pass. Barely. \n\nKick: I can live with that.\n• Said word-for-word in Young Justice by Sportsmaster, when he learns his entire Roaring Rampage of Revenge to kill Black Manta for murdering his daughter was completely pointless as Artemis faked her death to plant herself as a mole. Sportsmaster: Huh. So you and Aqualad really are playing Manta and The Light for chumps. Hah! I can live with that, Baby-Girl!\n• In The Order of the Stick, when dies, and is guided to the afterlife. She is told she won't be restored to Paladin status, but at least her only friend in the world will be able to visit her.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/ICanLiveWithThat", "media_links": ["/pmwiki/pmwiki.php/Anime/PuellaMagiMadokaMagicaTheMovieRebellion", "/pmwiki/pmwiki.php/LightNovel/FateZero", "/pmwiki/pmwiki.php/ComicBook/MartialLaw", "/pmwiki/pmwiki.php/Film/DieHard", "/pmwiki/pmwiki.php/Film/TheLifeAquaticWithSteveZissou", "/pmwiki/pmwiki.php/Film/TheReplacements2000", "/pmwiki/pmwiki.php/Series/StarTrekDeepSpaceNine", "/pmwiki/pmwiki.php/Series/Dexter", "/pmwiki/pmwiki.php/Series/House", "/pmwiki/pmwiki.php/Series/Bones", "/pmwiki/pmwiki.php/Series/OneTreeHill", "/pmwiki/pmwiki.php/Series/NCIS", "/pmwiki/pmwiki.php/Series/Heroes", "/pmwiki/pmwiki.php/Series/BuffyTheVampireSlayer", "/pmwiki/pmwiki.php/Series/Angel", "/pmwiki/pmwiki.php/Series/MalcolmInTheMiddle", "/pmwiki/pmwiki.php/Series/TheWestWing", "/pmwiki/pmwiki.php/Series/DocMartin", "/pmwiki/pmwiki.php/Series/ThirdWatch", "/pmwiki/pmwiki.php/Series/DoctorWho", "/pmwiki/pmwiki.php/VideoGame/DragonAgeII", "/pmwiki/pmwiki.php/VideoGame/GearsOfWar", "/pmwiki/pmwiki.php/VideoGame/MarvelVsCapcomInfinite", "/pmwiki/pmwiki.php/WesternAnimation/MightyMax", "/pmwiki/pmwiki.php/WesternAnimation/SpongeBobSquarePants", "/pmwiki/pmwiki.php/WesternAnimation/FanboyAndChumChum", "/pmwiki/pmwiki.php/WesternAnimation/SouthPark", "/pmwiki/pmwiki.php/Creator/DavidHasselhoff", "/pmwiki/pmwiki.php/Webcomic/Homestuck", "/pmwiki/pmwiki.php/Webcomic/GirlGenius", "/pmwiki/pmwiki.php/Film/Cube", "/pmwiki/pmwiki.php/Series/MysteryScienceTheater3000", "/pmwiki/pmwiki.php/Film/QuestOfTheDeltaKnights", "/pmwiki/pmwiki.php/Series/Charmed1998", "/pmwiki/pmwiki.php/Series/StarTrekDeepSpaceNine", "/pmwiki/pmwiki.php/Series/Wings", "/pmwiki/pmwiki.php/ComicBook/ScottPilgrim", "/pmwiki/pmwiki.php/WesternAnimation/KickButtowski", "/pmwiki/pmwiki.php/Franchise/IndianaJones", "/pmwiki/pmwiki.php/WesternAnimation/YoungJustice", "/pmwiki/pmwiki.php/Webcomic/TheOrderOfTheStick"], "non_media_links": ["/pmwiki/pmwiki.php/Main/StockPhrase", "/pmwiki/pmwiki.php/Main/AntiHero", "/pmwiki/pmwiki.php/Main/TragicVillain", "/pmwiki/pmwiki.php/Main/MadeOfExplodium", "/pmwiki/pmwiki.php/Main/IDidWhatIHadToDo", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/ShrugTake", "/pmwiki/pmwiki.php/Main/AtLeastIAdmitIt", "/pmwiki/pmwiki.php/Main/InsultBackfire", "/pmwiki/pmwiki.php/Main/IllTakeThatAsACompliment", "/pmwiki/pmwiki.php/Main/TheUnfettered", "/pmwiki/pmwiki.php/Main/ComicBooks", "/pmwiki/pmwiki.php/Main/IfYouKillHimYouWillBeJustLikeHim", "/pmwiki/pmwiki.php/Main/OverlyLongGag", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/NatalieMerchant", "/pmwiki/pmwiki.php/Recap/DoctorWho2015CSTheHusbandsOfRiverSong", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/HumansAreBastards", "/pmwiki/pmwiki.php/Main/FakeDefector", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/ImpliedDeathThreat", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/IfYouKillHimYouWillBeJustLikeHim", "/pmwiki/pmwiki.php/Main/StarWars", "/pmwiki/pmwiki.php/Recap/SouthParkS1E11TomsRhinoplasty", "/pmwiki/pmwiki.php/Recap/SouthParkS9E1MrGarrisonsFancyNewVagina", "/pmwiki/pmwiki.php/Main/NWordPrivileges", "/pmwiki/pmwiki.php/Main/CrossesTheLineTwice", "/pmwiki/pmwiki.php/Main/Webcomics", "/pmwiki/pmwiki.php/Main/TheEeyore", "/pmwiki/pmwiki.php/Main/Beat", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/ComicBooks", "/pmwiki/pmwiki.php/Main/MediumAwareness", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/HolyGrail", "/pmwiki/pmwiki.php/Main/RoaringRampageOfRevenge", "/pmwiki/pmwiki.php/Main/ActuallyPrettyFunny", "/pmwiki/pmwiki.php/Main/Webcomics"]}