{"title": "Dismissed Gender", "content": "Situations where a trope involves a character of a gender different from usual, making the trope either more accepted by the audience or rationalizing why the characters don't react in the usual way. Interestingly, this is useful so fans or writers can rationalize something away that they've been taught is otherwise unfashionable to tolerate without actually changing the underlying premise.\n\nRelated to Always Female / Always Male (except this time it isn't). Reversing the gender of characters in a story to explore how things might be different is in Gender Flip. See also: Double Standard: Abuse, Female on Male, Double Standard: Rape, Female on Male, The Unfair Sex,and Females Are More Innocent.\n\nNot to be confused with Men Are the Expendable Gender or Disposable Woman.\n• The Hard-Drinking Party Girl, who, no matter how gropey and lecherous, never makes girls uncomfortable in compromising situations.\n• The Bifauxnen, who writers can use if they ever need a male character without invoking any of the kneejerk responses shy males would have.\n• Fanservice utilizing the Wholesome Crossdresser. If it's of the male variety, the body of a waifish boy has fewer restricted areas to cover up than a flatchested girl of the same look would have. If of the female variety, they can get away with making dynamically suggestive poses that the artist wouldn't think twice about drawing if she was an actual guy.\n• Both Boys' Love and Yuri Genre elements may be used as fanservice, to include \"nonthreatening\" romance in the series. If the show is made entirely of either one, you'll probably have a \"nonthreatening\" character and a \"predatory\" character.\n• Similarly, fans who writhe at the suspicion of a beloved character having a romantic partner will eagerly accept a gender-reversed (and usually younger) Morality Pet who nonetheless fufills the exact same intended role.\n• Yaoi fandom in particular is infamous for some rather extreme melodrama (specially if it uses Rape as Drama or Romanticized Abuse, or one of the Yaoi Guys is a Love Martyr towards the other) that would be more squicky to the audience if it used women instead.\n• A male Token Mini-Moe is a mild example, since it lets you have a male character without any associated sexuality.\n• An attractive 25 year old woman implausibly fawning over a younger character can be played for nearly identical humor as the reverse, but comes off much less squicky.\n• Non-fanservice nudity is more likely to be male, but fanservice nudity is more likely to be female, since male fanservice is (usually) not as interesting to the audience.\n• A girl openly harassing or sexually exploiting a boy as a Running Gag is seen as less sketchy or demeaning than the inverse. Especially if the girl turns out to be into yaoi— then her perversions can be dismissed as being especially harmless since she wants the action focused with other guys rather than with herself.\n• When writing lovemaking scenes, more detail and description will be put into the heroine's emotional state than the hero's, since unless he has gone through particularly mind altering troubles previously he'll generally be assumed to not have any interesting things to say on the matter. Surprisingly, this is common in both male and female oriented romance tales, because it would be seen as chauvinistic (for girls) or plain unappealing (for guys) for either type of story to care more about the hero during the act. If both parties are of the same gender, however, then getting a look into the \"top\" partner's mind can be excused since they won't be seen as taking spotlight away from the \"bottom\".\n• A Gender Bender plot or an inter-gender \"Freaky Friday\" Flip is commonly used to excuse characters acting outside their \"proper\" gender roles, since they weren't that particular gender in the first place.\n• In Mahou Sensei Negima!, the ten year old Negi is the object of lust of several of his teenage students, a few openly try to seduce him. There would be much more of a stir if the genders were reversed and it was teenage boys crushing on a ten year old girl.\n• The Lyrical Nanoha fandom embraced Erio quickly partly because he's a non-threat to any original female character 'shipping, with the exception of the new character Caro who he's clearly 'paired' with from the get go. Yet, she goes into the men's bath to invite him to bathe with her and their two older female teammates. Now, imagine the ruckus that would have happened if it had been a boy inviting a girl into the men's bath...\n• Demonstrated by the Japanese dubbers in Beast Wars, where Airrazor (originally female) was dubbed as a young man. Season Two came around and found the dubbers scrambling like mad to demonstrate that Airrazor and Tigatron had a firm mentor/prodigy relationship — because in the original, the female Airrazor and Tigatron had fallen in love. And on a kid's show, the gay just wouldn't work.\n• Ultimately they got backed into a corner - there was an unavoidable romance scene right before the two \"died\" , where they confess their feelings. They left it in, which led to a lot of confused letters from young viewers.\n• The Sandra Bullock comedy While You Were Sleeping was originally written with a man pretending to be the fiance of a woman in a coma, but the producers decided to swap the gender roles when it came off as a little too predatory.\n• Bludgeoning Angel Dokuro-chan, a series about a female angel who repeatedly kills a young male high school student in blood-splatteringly gory ways, then brings him back to life each time, only for him to suffer another painful death a few minutes later. It's a comedy.\n• Majin Tantei Nougami Neuro is about as close as a gender reverse of that relationship can get. The male demon is physically abusive towards the girl lead, who does come to treat this as affection. However, he never actually damages her, and their relationship lacks the sexual (and arguably the romantic) undertones in BAD (Dokuro's something of a tease, cute, and a nice companion when she's not brutally slaughtering Sakura). It also helps that Neuro's demonic nature is lampshaded constantly, making it less \"male abuses female\" and more \"demon abuses female\".\n• In Video Games, women in skimpy clothing are often used as rewards, most notably the Metroid series. On the other hand, a man wearing skimpy clothing is regarded as disgusting by most gamers (since the majority of gamers are straight men); one particularly infamous example of this \"reward\" can be found in La-Mulana, in which completing the Hell Temple \"rewards\" the player with the Skimpy Swimsuit and a picture of Lemeza wearing it, followed by Duracuets making fun of the player. It's worth noting that Lemeza himself doesn't seem at all fazed\n• The Lunar series, as of the remakes, features 'bromides' - collectible items that serve little purpose other than offering eye-candy of female characters. Lunar 2: Eternal Blue Complete includes bromides for some male characters as well...including a most disturbing one of Borgan, a fat and ugly male villain.\n• A rather amusing example appears in Xenosaga III, where the player can unlock swimsuit outfits for all of the playable characters. While the girls, Shion and KOS-MOS, look notably attractive and MOMO looks... cute... some of the outfits for the male characters include an old-timey striped bathing suit, a mankini, and a disturbingly revealing snorkeling outfit.\n• Poked at by the developers and some of the artists of Katawa Shoujo: some dakimakura-style drawings were released of some of the female leads, to much applause. The two released for the Nurse and Art Teacher (who were male)...not so much.\n• This was surprisingly averted in the second Akiba's Trip game, where bromides of the characters with their clothes torn off were made for both the girls and the boys in equally as dynamic poses.\n• The summer events of Fate/Grand Order only released playable swimsuit variants for female Servants; male Servants in swimsuits are mostly relegated to the event's Craft Essences instead. It took three years to give three male characters summer skins; the rest were unplayable NPCs.\n• A Brother's Price takes place in a world and a country that has gender values and stereotypes that are largely the opposite of ours. The story has aspects such as men literally being the property of their female relatives until they're fifteen, then their wives once they're married; men who are raped often being made into Sex Slaves thanks to being Defiled Forever; men being subject to Female Gaze and being pawed at and even abducted and raped for going out without protection; much of the value of men being tied up in virginity until marriage and fathering and nurturing children after that; the rape of men by women being seen as horrible but rape of women by men not even called rape; and social conditioning making it difficult for men to say no to a woman. It should be noted, though, that the two viewpoint characters are products of their culture, feeling uncomfortable about some of these aspects but not seeing alternatives, and in the writing it is clear that they are not issues just Gender Flipped to make them acceptable to the audience.\n• In Grant Morrison's Batman, Dick and Damian are attacked by villains with a Circus of Fear schtick; Damian captures the Bearded Lady and starts to use Enhanced Interrogation Techniques. However, Word of God noted that it seems \"ungallant\" even for a Tyke Bomb like him to beat up a woman, so they made her look bigger and more masculine until it seemed acceptable.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/DismissedGender", "media_links": ["/pmwiki/pmwiki.php/Manga/MahouSenseiNegima", "/pmwiki/pmwiki.php/Franchise/LyricalNanoha", "/pmwiki/pmwiki.php/WesternAnimation/BeastWars", "/pmwiki/pmwiki.php/Film/WhileYouWereSleeping", "/pmwiki/pmwiki.php/LightNovel/BludgeoningAngelDokuroChan", "/pmwiki/pmwiki.php/Manga/MajinTanteiNougamiNeuro", "/pmwiki/pmwiki.php/Franchise/Metroid", "/pmwiki/pmwiki.php/VideoGame/LaMulana", "/pmwiki/pmwiki.php/Franchise/Lunar", "/pmwiki/pmwiki.php/VideoGame/LunarEternalBlue", "/pmwiki/pmwiki.php/VideoGame/Xenosaga", "/pmwiki/pmwiki.php/VisualNovel/KatawaShoujo", "/pmwiki/pmwiki.php/VideoGame/AkibasTrip", "/pmwiki/pmwiki.php/VideoGame/FateGrandOrder", "/pmwiki/pmwiki.php/WesternAnimation/SouthPark", "/pmwiki/pmwiki.php/Literature/ABrothersPrice"], "non_media_links": ["/pmwiki/pmwiki.php/Main/DoubleStandard", "/pmwiki/pmwiki.php/Main/DifferentForGirls", "/pmwiki/pmwiki.php/Main/AlwaysFemale", "/pmwiki/pmwiki.php/Main/AlwaysMale", "/pmwiki/pmwiki.php/Main/Dissimile", "/pmwiki/pmwiki.php/Main/GenderFlip", "/pmwiki/pmwiki.php/Main/DoubleStandardAbuseFemaleOnMale", "/pmwiki/pmwiki.php/Main/DoubleStandardRapeFemaleOnMale", "/pmwiki/pmwiki.php/Main/TheUnfairSex", "/pmwiki/pmwiki.php/Main/FemalesAreMoreInnocent", "/pmwiki/pmwiki.php/Main/MenAreTheExpendableGender", "/pmwiki/pmwiki.php/Main/DisposableWoman", "/pmwiki/pmwiki.php/Main/HardDrinkingPartyGirl", "/pmwiki/pmwiki.php/Main/SkinshipGrope", "/pmwiki/pmwiki.php/Main/Bifauxnen", "/pmwiki/pmwiki.php/Main/WholesomeCrossdresser", "/pmwiki/pmwiki.php/Main/DudeLooksLikeALady", "/pmwiki/pmwiki.php/Main/NippleAndDimed", "/pmwiki/pmwiki.php/Main/LadyLooksLikeADude", "/pmwiki/pmwiki.php/Main/BoysLove", "/pmwiki/pmwiki.php/Main/YuriGenre", "/pmwiki/pmwiki.php/Main/Fanservice", "/pmwiki/pmwiki.php/Main/HandsomeLech", "/pmwiki/pmwiki.php/Main/CourtlyLove", "/pmwiki/pmwiki.php/Main/MoralityPet", "/pmwiki/pmwiki.php/Main/TheNotLoveInterest", "/pmwiki/pmwiki.php/Main/BoysLove", "/pmwiki/pmwiki.php/Main/RapeAsDrama", "/pmwiki/pmwiki.php/Main/RomanticizedAbuse", "/pmwiki/pmwiki.php/Main/YaoiGuys", "/pmwiki/pmwiki.php/Main/LoveMartyr", "/pmwiki/pmwiki.php/Main/TokenMiniMoe", "/pmwiki/pmwiki.php/Main/Squick", "/pmwiki/pmwiki.php/Main/Fanservice", "/pmwiki/pmwiki.php/Main/Fanservice", "/pmwiki/pmwiki.php/Main/FemaleGaze", "/pmwiki/pmwiki.php/Main/DoubleStandardRapeFemaleOnMale", "/pmwiki/pmwiki.php/Main/RunningGag", "/pmwiki/pmwiki.php/Main/YaoiFangirl", "/pmwiki/pmwiki.php/Main/DarkAndTroubledPast", "/pmwiki/pmwiki.php/Main/QueerRomance", "/pmwiki/pmwiki.php/Main/GenderBender", "/pmwiki/pmwiki.php/Main/FreakyFridayFlip", "/pmwiki/pmwiki.php/Main/MarshmallowHell", "/pmwiki/pmwiki.php/Main/DieForOurShip", "/pmwiki/pmwiki.php/Main/ShesAManInJapan", "/pmwiki/pmwiki.php/Main/HaveIMentionedIAmHeterosexualToday", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/FanService", "/pmwiki/pmwiki.php/Main/MostGamersAreMale", "/pmwiki/pmwiki.php/Main/BonusLevelOfHell", "/pmwiki/pmwiki.php/Main/WholesomeCrossdresser", "/pmwiki/pmwiki.php/Main/Gonk", "/pmwiki/pmwiki.php/Main/VillainousGlutton", "/pmwiki/pmwiki.php/Main/Fanservice", "/pmwiki/pmwiki.php/Main/BrainBleach", "/pmwiki/pmwiki.php/Main/StereotypeFlip", "/pmwiki/pmwiki.php/Main/SexSlave", "/pmwiki/pmwiki.php/Main/DefiledForever", "/pmwiki/pmwiki.php/Main/FemaleGaze", "/pmwiki/pmwiki.php/Main/EatingTheEyeCandy", "/pmwiki/pmwiki.php/Main/AMatchMadeInStockholm", "/pmwiki/pmwiki.php/Main/MandatoryMotherhood", "/pmwiki/pmwiki.php/Main/RapeIsASpecialKindOfEvil", "/pmwiki/pmwiki.php/Main/GenderFlip", "/pmwiki/pmwiki.php/Comicbook/GrantMorrisonsBatman", "/pmwiki/pmwiki.php/Main/CircusOfFear", "/pmwiki/pmwiki.php/Main/GirlsWithMoustaches", "/pmwiki/pmwiki.php/Main/EnhancedInterrogationTechniques", "/pmwiki/pmwiki.php/Main/WordOfGod", "/pmwiki/pmwiki.php/Main/TykeBomb", "/pmwiki/pmwiki.php/Main/WouldntHitAGirl", "/pmwiki/pmwiki.php/Main/FatBastard", "/pmwiki/pmwiki.php/Main/LadyLooksLikeADude"]}