{"title": "Dizzy Cam", "content": "Shooting a scene by moving around and around the action with a handheld camera, usually combined with Jitter Cam. Called Dizzy Cam because the spinning motion can impart dizziness to the viewer. This technique is used to express the world spinning out of control.\n• Used to the point of causing motion-sickness in Cloverfield.\n• This trick was very popular during action scenes in the Bourne films, most notably the The Bourne Ultimatum.\n• The first two Transformers films. The camera spins around noticeably less in Dark of the Moon.\n• The Hunger Games uses this liberally to obscure the fact that children as young as 12 are killing each other, in order to keep its PG-13 rating. They also use it when people are sitting down and talking, for some reason.\n• Done at the beginning of Run Lola Run after Lola puts down the phone.\n• Used for some scenes in The X-Files episode \"X Cops\", which was a Crossover of sorts with Cops and took the concept of unseen monster from The Blair Witch Project.\n• CSI: NY occasionally has the camera whirling around a character or some characters during pivotal moments or when they're doing some intense analysis. Thankfully rather rarely employed.\n• Law & Order: Special Victims Unit once had an episode where Stabler had been put on antiretroviral therapy after being exposed to HIV-infected blood. Whenever the camera focused on him, it would wobble around, simulating the nausea that he was suffering as a result of the medicine.\n• Kisetsu o Dakishimete, the second game of the Yarudora series, uses this for dramatic effect at the beginning of the sequence. The shot is also part of the game's opening demo .\n• The Autobiography of Jane Eyre: Episodes 1 and 3 employed this trope.\n• In Episode 1, Jane went out and was shooting outside in a park and a rose garden while walking. She also made a shot of crowns of trees from down to up and spinning the camera.\n• In Episode 3, Jane was stranded at a bus stop in the middle of nowhere and lost her mobile phone. She was freaked out and shot several scene while walking and running about, quite desperate. Combined with Jitter Cam.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/DizzyCam", "media_links": ["/pmwiki/pmwiki.php/Film/Cloverfield", "/pmwiki/pmwiki.php/Film/TheBourneSeries", "/pmwiki/pmwiki.php/Film/Transformers", "/pmwiki/pmwiki.php/Film/TheHungerGames", "/pmwiki/pmwiki.php/Film/RunLolaRun", "/pmwiki/pmwiki.php/Series/TheXFiles", "/pmwiki/pmwiki.php/Series/Cops", "/pmwiki/pmwiki.php/Film/TheBlairWitchProject", "/pmwiki/pmwiki.php/Series/CSINY", "/pmwiki/pmwiki.php/Series/LawAndOrderSpecialVictimsUnit", "/pmwiki/pmwiki.php/VisualNovel/KisetsuODakishimete", "/pmwiki/pmwiki.php/VisualNovel/Yarudora"], "non_media_links": ["/pmwiki/pmwiki.php/Main/JitterCam", "/pmwiki/pmwiki.php/Main/OrbitalShot", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/Crossover", "/pmwiki/pmwiki.php/Main/VisualNovel", "https://www.youtube.com/watch?v=rgSLhrFIE_4#t=0m35s", "/pmwiki/pmwiki.php/WebVideo/TheAutobiographyOfJaneEyre", "/pmwiki/pmwiki.php/Main/JitterCam"]}