{"title": "Entendre Failure", "content": "\n• In the That '70s Show episode \"The Velvet Rope\": Jackie: Michael, we can't go. My parents are gonna be out late tonight, and we have to study. \n\nKelso: Study? No, what a gyp! I'm going to the club. \n\nJackie: No! No, no, Michael, you're coming over to my house tonight. And we're gonna \"study\". \n\nKelso: Fine! God, I never get to do anything fun. \n\nHyde: God, you're dumb. \n\nKelso: I guess that's why I gotta go study.\n• A Saturday Night Live skit was built on this premise, as Randy Quaid is trying to explain to Pee-Wee Herman, in euphemisms, that he's thinking about going to a prostitute: Randy: Well... they wear lots of makeup. \n\nPee-Wee: A clown! \n\nRandy: ...no, let's just say you wouldn't want to be seen with one. \n\nPee-Wee: (nods understandingly) A mime!\n• In an early episode of The War at Home, Dave is concerned that Hillary might have lost her virginity, and tries to find out if Larry knows anything about it. Apparently, he doesn't. Dave: Listen, I need to ask you a question. What do you, um... know about your, um... sister's relations? \n\nLarry: You mean like cousins and stuff? \n\nDave: No, no, no... Do you... do you know if your sister is, you know... active? \n\nLarry: Well, she does do pilates and plays tennis sometimes. \n\nDave: Why do I even bother with you?\n• Boy Meets World, in a pregnancy scare episode, had a scene something like this: Shawn: Cory, how would you feel if these two waffles got together and made a little waffle? \n\nCory: I think I know what you're getting at, Shawn. (beat) You'd like seconds. I'll be right back.\n• That Mitchell and Webb Look features a sketch with a new doctor starting work in a Bawdy 1970's Hospital. He is soon fired after it becomes apparent he's incapable of making double entendres. Doctor A: (preparing needle) Now, you might feel a small prick (!) \n\nPatient: Wouldn't be the first (!) \n\nDoctor A: Brace yourself, I'm giving you one in the posterior (!) \n\nPatient: I should be so lucky(!) Is your first time? I hope you know where you're sticking that thing (!) \n\nDoctor A: Don't worry, it isn't hard (!) \n\nPatient: Speak for yourself (!) \n\nDoctor B: (beat) Shall I get my cock out?\n• Happens in The Fresh Prince of Bel-Air: Will: Well yeah, I had big feet. You know what they say about a guy with big feet... \n\nAshley: No, what? \n\n(Uncle Phil clears his throat) \n\nWill: ...th-they be sayin' \"damn he got some big feet.\"\n• In one episode of Hello Cheeky, John gives the joke \"The world's long-distance swimming record is held by Liza Garotti, a very successful callgirl from Venice\". Tim stands around blinking for a while, before saying that he fails to see the humor in that — a switchboard operator being a good swimmer. Barry: ...John didn't say \"a switchboard operator\", he said \"a callgirl\". \n\nTim: It's the same thing, isn't it? ...Isn't it? \n\nJohn: Tim, a callgirl is someone you... call! When you're lonely! \n\nTim: Oh... when I'm lonely, I call mummy. Does that mean she's a callgirl?\n• Angel: A spell has reverted the cast to their teen mentality. Wesley: It's Wesley, thank you. Wyndham-Pryce. (grabs his lapels, puffs up with pride) I am from the Watcher's Academy in southern Hampshire. In fact, I happen to be head boy. \n\nCordelia: Gee, I wonder how you earned that nickname. \n\nWesley: A lot of effort, I don't mind saying.\n• Frequently a point of humor on Raising Hope as most of the family is slightly dimwitted and frequently misinterpret idioms literally. Virginia: Oh, come on, Burt! A new rug? I always hear people bragging about how their carpets match their drapes. Burt: You're right. I want to be one of those people.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/EntendreFailure", "media_links": ["/pmwiki/pmwiki.php/Series/MontyPythonsFlyingCircus", "/pmwiki/pmwiki.php/Series/ThirdRockFromTheSun", "/pmwiki/pmwiki.php/Series/BoardwalkEmpire", "/pmwiki/pmwiki.php/Series/That70sShow", "/pmwiki/pmwiki.php/Series/StargateSG1", "/pmwiki/pmwiki.php/Series/SaturdayNightLive", "/pmwiki/pmwiki.php/Series/AllInTheFamily", "/pmwiki/pmwiki.php/Series/TheWarAtHome", "/pmwiki/pmwiki.php/Series/TwoAndAHalfMen", "/pmwiki/pmwiki.php/Series/BoyMeetsWorld", "/pmwiki/pmwiki.php/Series/ThatMitchellAndWebbLook", "/pmwiki/pmwiki.php/Series/TheFreshPrinceOfBelAir", "/pmwiki/pmwiki.php/Series/TheBigBangTheory", "/pmwiki/pmwiki.php/Series/HelloCheeky", "/pmwiki/pmwiki.php/Series/Angel", "/pmwiki/pmwiki.php/Series/ArrestedDevelopment", "/pmwiki/pmwiki.php/Series/RaisingHope"], "non_media_links": ["https://www.youtube.com/watch?v=jT3_UCm1A5Ieh", "http://en.wikipedia.org/wiki/Nudge_Nudge", "/pmwiki/pmwiki.php/Main/HilarityEnsues", "/pmwiki/pmwiki.php/Main/OverprotectiveDad", "/pmwiki/pmwiki.php/Main/LiteralMinded", "https://www.youtube.com/watch?v=vT2wE0fLdWg", "/pmwiki/pmwiki.php/Main/AwfulBritishSexComedy", "/pmwiki/pmwiki.php/Main/LampshadeHanging"]}