{"title": "First and Foremost", "content": "This is based on opinion. Please don't list it on a work's trope example list.\n\nWhen the original (or at least early) version of a song refuses to be permanently dislodged from the public mind by subsequent covers, even if the covers might be briefly more popular. (The cover belonging to a Dead Horse Genre is often a contributing factor.)\n\nClosely related to First Installment Wins. The opposite of Covered Up, although the \"first and foremost\" version might itself have Covered Up the real original.\n• Thin Lizzy 's version of \"Whiskey in the Jar\" (which was a cover but they came up with the arrangement) is much more popular than the Metallica version in the UK and especially Thin Lizzy's native Ireland. The Metallica version had huge chart success in America, though whether it is more popular there is a matter of debate (outside those countries it probably fills Covered Up).\n• Ugly Kid Joe's version of \"Cat's in the Cradle\" (retitled without the apostrophe) was a huge hit in 1993, but always stood in the shadow of Harry Chapin's 1974 original.\n• Guns N' Roses covers of \"Live and Let Die\" and (moreso) \"Sympathy for the Devil\" are significantly less well-known than the originals.\n• Aerosmith and Michael Jackson covered \"Come Together\", and both versions, especially since the latter's death, still get airplay, but The Beatles' original from Abbey Road is still the most popular.\n• The Beatles' everything, with the exceptions of Joe Cocker's version of \"With a Little Help From My Friends\", (for the R&B/Soul crowd) Earth, Wind & Fire's \"Got To Get You Into My Life\", and possibly Rosanne Cash's take on \"I Don't Want to Spoil the Party\", which was a #1 Country Music hit in 1989. Other than that, nearly all of their songs have been covered many, many times, and all of them have remained Beatles songs.\n• \"Yesterday\" from Help! is statistically one of the most covered songs of all time...but seriously can you name any cover it without consulting The Other Wiki?\n• Also note that the reverse is not true: songs that were covered by Beatles are still generally known as Beatles' songs. Yeah, they were that powerful a band.\n• \"...Sings The Beatles\" A BBC 4 compilation of archive footage of Beatles covers from the BBC live music archive sums it up well. All are well known artists in their own right (Sandie Shaw, Shirley Bassey, Carpenters, Oasis etc.) and most of them released the track they are singing as a studio single/B-side/album track, yet hardly any are more known than the originals nowadays.\n• Many, many, many rock bands have covered Chuck Berry but most of his songs are still primarily associated with him, with the possible exception of Johnny Rivers version of \"Memphis, Tennessee\". The ones made by The Beatles (\"Rock and Roll Music\" and \"Roll Over Beethoven\") are borderline.\n• Alien Ant Farm had a popular cover of \"Smooth Criminal\" from Bad but it still can't push out Michael Jackson's take.\n• Pat Boone, for a while, was notable for taking R&B and rock 'n' roll numbers and singing them with watered-down arrangements in order to make them palatable to pop radio and white audiences. Back then, his covers outsold the originals, but today, they're ridiculed as weak imitations of the real deal while the originals are seen as definitive. Therefore, Boone ended up being a victim of this trope.\n• Madonna's version of \"American Pie\" did nothing to replace Don McLean.\n• Both D'Angelo and Huey Lewis and Gwyneth Paltrow did versions of Smokey Robinson's \"Cruisin'\" that got a lot of airplay for a while. Nowadays, Smokey's back.\n• None of Marilyn Manson's covers had any significant staying power. His \"Tainted Love\" is more popular than the original (by Gloria Jones), but less popular than the Soft Cell cover.\n• The Cure's \"Lovesong\" has been covered by dozens of bands, including some major acts. None of these covers have been remembered or loved like the original, even when some of the covers (specifically 311 and Adele) have been quite successful.\n• Elton John's recording of \"Lucy in the Sky With Diamonds\" sold over a million copies and hit #1 in Billboard while the original version was never even released as a single, yet it's the original artist who people continue to associate with the song. The fact that the song originated on The Beatles' iconic Sgt. Pepper album is probably a factor.\n• Elton John's cover of \"Pinball Wizard\", by The Who, similarly charted higher than the original recording, and even displaced it in radio play for many years before classic rock radio rediscovered the original.\n• Leon Ashley's \"Laura (What's He Got That I Ain't Got)\"; three separate covers were released in the month that his version was at #1, and two more followed in the next decade, but none were as big a hit as his. What makes this all the more impressive is that Leon promoted and distributed his version by himself, while all the other covers were on major labels.\n• Tori Amos' take on \"Smells Like Teen Spirit\" is one of the most well-known covers of all time, but of course, everyone still remembers Nirvana's original from Nevermind. Nirvana is one band that simply can't be Covered Up.\n• Similarly, you can try all you like but you just can't Cover Up Led Zeppelin.\n• The Shadows of Knight covered Them's \"Gloria\" and took it to the top 10 (the original didn't even make the top 40). Now every radio station plays the Them version instead.\n• Apparently, John Mellencamp's \"I Need a Lover\" was initially less popular than the Pat Benatar cover of it. However, classic rock radio kept the original alive while the cover is barely remembered even by people who actually remember that time period.\n• Leonard Cohen's \"Suzanne\" from Songs of Leonard Cohen which has been covered by Neil Diamond, the most commercially successful, and everyone else, but remains his song. \"Hallelujah\" has been less successful; even though most people know who wrote it, very, very few know what it sounded like before John Cale took out a verse and stitched in three from the cutting room floor.\n• And then Watchmen came out. However, Jeff Buckley's version (by way of Cale's arrangement) from Grace remains the best known.\n• No Doubt had a hit in 2003 with their cover of \"It's My Life,\" but nowadays it's more common to hear the original version by Talk Talk on the radio.\n• Nicki French had a #2 hit with \"Total Eclipse of the Heart\" in 1995. However, within a year or two, radio stations were back to playing Bonnie Tyler's original version.\n• Numerous country singers have covered songs by Hank Williams, and while a few of them have become major hits (e.g. Charley Pride's covers of \"You Win Again\" and \"Honky Tonk Blues\" both made it to #1 in 1980), none of them have supplanted the originals in the public consciousness. The only one that comes close is George Thorogood's cover of \"Move It On Over\", which still gets radio play on Classic Rock stations. And possibly Hank Williams, Jr.'s version of \"Mind Your Own Business\", a Massive Multiplayer Crossover with Reba McEntire, Willie Nelson, Tom Petty, and Reverend Ike.\n• Many, many a musical theatre actor has covered the song \"Empty Chairs at Empty Tables\" from Les Misérables, which is popular as a standalone song. Nobody really cares; they're all busy listening to Michael Ball's version, he who first sang it in the original production in London in 1985.\n• Ditto with \"Love Changes Everything\" from Aspects of Love, the little-known Andrew Lloyd Webber musical.\n• Everyone and their mother has covered \"God Bless America.\" Not a one of them has managed to Cover Up Kate Smith, who sang it first and made it famous.\n• Remember the Ataris' cover of Don Henley's \"The Boys Of Summer?\" Well, it never remained more popular than the original for more than a year.\n• In 1990, MC Hammer's cover of the Chi-Lites' \"Have You Seen Her\" became a top 5 hit. Nowadays, the Chi-Lites' version gets all the airplay, especially since 99% of all MC Hammer airplay nowadays are for \"U Can't Touch This.\"\n• Likewise is the case with Vanilla Ice's cover of \"Play That Funky Music,\" which has faded into obscurity behind both Wild Cherry's classic and \"Ice Ice Baby.\" Mostly because Wild Cherry sued and the song was pretty much blacklisted.\n• Several artists have had hits with covers of Tom Waits' \"Downtown Train\" from Rain Dogs, most notably Rod Stewart, who took the song to #3 on the Billboard Hot 100 and #10 in the UK. And yet, it is still the original Waits version that is most identified with the song and played on the radio.\n• Speedy Techno Remakes typically enjoy a brief burst of popularity but almost never Cover Up the original.\n• Likewise, successful club hits tend to get periodic reissues with a bunch of new remixes in the style of the day, but only rarely will such mixes displace the original in the long run.\n• All Saints cover of Red Hot Chili Peppers ' Under The Bridge was a huge hit in the UK at the time of release, but it never topped the original, partly because it was a double A Side with Lady Marmalade which got more airplay, and partly because it attracted so much hatred from people who loved the original.\n• Several Christmas Songs: \"White Christmas\" (Bing Crosby from his album Merry Christmas), \"Rudolph The Red-Nosed Reindeer\" and \"Here Comes Santa Claus\" (Gene Autry), \"The Christmas Song\" (Nat \"King\" Cole), though in most of those cases the artists actually recorded multiple versions of the songs.\n• Blue Swede's 1974 #1 \"Hooked On A Feeling\" is much better known than B.J. Thomas's original. The same cannot be said for their #7 cover of \"Never My Love,\" however, and the Association's #2 hit version is still the version most people think of first, with the Fifth Dimension's version a close second, despite actually charting lower than Blue Swede's at #12, largely due to both being produced by Bones Howe, and Blue Swede are today remembered only for the former.\n• While the McCoys' version of \"Hang On Sloopy\" is the best known, their #7 hit \"Fever\" is not as remembered as the original versions (namely Peggy Lee's) from the 1950s. The \"Hang On Sloopy\" example is actually a subversion, however, as the song was actually first recorded as \"My Girl Sloopy\" by R&B group the Vibrations.\n• Michael Bolton had a top-10 hit in 1991 with \"When a Man Loves a Woman\", which did nothing to displace the Percy Sledge original as the definitive version. His Top-40 charting cover of \"Sittin' On The Dock of the Bay\" also made no one forget the original version by Otis Redding.\n• \"I Will Be\" is a song that destroyed Leona Lewis's career in the US, so it's no surprise that the original by Avril Lavigne is better looked upon.\n• In The '70s, it was popular for Country Music artists to do cover versions of existing pop songs, such as Anthony Armstrong Jones with his rendition of R. B. Greaves' \"Take a Letter Maria\"; Narvel Felts with his version of Dobie Gray's \"Drift Away\"; Susie Allanson with The Crickets' \"Maybe Baby\" and the Bee Gees' \"Words\"; Johnny Carver with Tony Orlando and Dawn's \"Yellow Ribbon\" and Starland Vocal Band's \"Afternoon Delight\"; and so on. The trend showed up sporadically as late as Robin Lee's 1990 take on Alannah Myles' \"Black Velvet\", but at no point did any of the country versions overtake their originals.\n• Alan Jackson has had this happen a few times:\n• His take on Eddie Cochran's \"Summertime Blues\", while mildly popular in country music, still takes a backseat to most of the other renditions of the songs out there.\n• \"Who's Cheatin' Who\" fares a little better, but it still gets second billing to the original Charly McClain version.\n• His cover of Don Williams' \"It Must Be Love\" in 2000 has done very little to displace the original on country music playlists, due in part to the original having already been a staple of \"classic country\" formats at the time.\n• George Jones' 1956 breakthrough hit \"Why Baby Why\" only got to #4, with a cover version by Webb Pierce and Red Sovine eclipsing it on the charts and going to #1, followed by a #9 version by Hank Locklin later in the same year; a later version by Charley Pride also topped the charts in 1983. Even so, the song is still primarily thought of as Jones's.\n• The Dennis Linde song \"What'll You Do About Me\" has had several renditions over the years: McGuffey Lane cut it first, followed by Steve Earle in 1984, John Schneider, Randy Travis, The Forester Sisters, Nitty Gritty Dirt Band, and Doug Supernaw. Earle, The Forester Sisters, and Supernaw all released their versions as singles, with Supernaw's being the highest-peaking on the country charts at #16 in 1995. However, the song seems to be though of mainly as Travis's, even though he never put it out as a single; this is likely due to his version being on his Always & Forever album, one of the most acclaimed country albums of The '80s.\n• Johnny Cash's \"I Still Miss Someone\" has been covered by The Statler Brothers, Martina McBride, Flatt and Scruggs, and Emmylou Harris among others. However, even though Cash's version was never a single, it's still thought of primarily as his song.\n• The Romantics' 1980 single \"What I Like About You\" is one of the most popular Power Pop tunes of all time...but it never made the Top 40 in the United States (although they had two lesser-known Top 40s that made it instead). The version that did? A now-long forgotten cover by singer Michael Morales, which made it to #28 in 1989. If any cover of the song is primarily remembered, it would be 5 Seconds of Summer's.\n• While Cat Stevens' cover of Sam Cooke's \"Another Saturday Night\" bested the original on the Billboard pop chart (#6 to #10 respectively), it's Cooke's version that's far better remembered today.\n• Manfred Mann's Earth Band are best known for their cover of Bruce Springsteen's \"Blinded by the Light\", which has largely eclipsed the Boss's version in the public eye. Their follow-up Springsteen cover \"Spirit in the Night\" was also a minor hit, but their version was quickly forgotten and today, the song is remembered first and foremost as a Springsteen song.\n• DHT's 2004 cover of Roxette's \"Listen to Your Heart\", which was their sole international hit, introduced many younger audiences to the song. By the 2010's, DHT's version had mostly faded from memory, and Roxette's original once again reigned supreme.\n• R&B singer Mario covered famous One-Hit Wonder Biz Markie's \"Just a Friend\" and ended up outperforming it, reaching #4 while the Markie original placed #9. However, the Mario version is almost entirely forgotten today while the original is still very well remembered. It probably has something to do with the Mario cover being very bland compared to the original being a shining example of So Bad, It's Good.\n• In the late '90s, Ace of Base covered Bananarama's \"Cruel Summer\". Said cover has since been mostly forgotten, with the original retaking the throne in most territories.\n• Band Aid's \"Do They Know It's Christmas?\" gets a new all-star recording every few years, and they've all been UK #1 hits, but no amount of star power has ever displaced the original 1984 version. And this goes not only for the song but for the entire genre of all-star charity records: there have been plenty down the years, some of which have been big hits, but the original \"Do They Know It's Christmas?\" is the only one you will ever hear played outside of a retro chart countdown.\n• While Rascal Flatts' version of Tom Cochran's 1992 hit \"Life is a Highway\" is pretty popular, especially due to it appearing on the soundtrack for Cars, you'll be hard-pressed nowadays to find it airing anywhere outside the country radio stations.\n• Pretty much all of The Who's collection of songs reign supreme over any and all covers, but special mention goes to their 1971 hit \"Behind Blue Eyes\" that Limp Bizkit covered in 2003. It was reviled from its initial release (although in fairness, it would have been a decent cover had they not included the autotuned \"L-I-M-P\" chant ad nauseum) and is a good reason why the song is never heard anymore.\n• New Order's original \"Blue Monday\" will never be overshadowed, despite the stint of popularity by Orgy's late '90s cover version. Same goes for \"Bizarre Love Triangle\" in spite of the well-known Softer and Slower Cover by Frente!.\n• No cover comes close to the original version of Kim Wilde's \"Kids in America\". Not The Bloodhound Gang's cover, not The Muffs' version from Clueless, not Len's version from Digimon: The Movie, not the American Juniors version, and not the No Secrets version from Jimmy Neutron: Boy Genius.\n• \"You Keep Me Hanging On\" has been a #1 smash for Kim Wilde, a #2 dance hit for Reba McEntire, and a #6 hit for Vanilla Fudge. All but the former have long since fallen back into the shadow of The Supremes' original version.\n• Peter Schilling's 1983 hit \"Major Tom (Coming Home)\" has been covered by numerous artists over the years, including Mx Px, Shiny Toy Guns, Apoptygma Berzerk, and even William Shatner, but none have attained anywhere near the original version's popularity.\n• Louis Armstrong's 1967 original of \"What a Wonderful World\" is still the most famous rendition despite lots of prominent covers, particularly the Joey Ramone punk rock version that plays on the end credits of Michael Moore's Bowling for Columbine.\n• Disturbed came close to the Top 40 with a cover of Simon & Garfunkel's \"The Sound of Silence\", but the original is still the definitive version.\n• Shannon's 1983 hit \"Let the Music Play\" was briefly overshadowed in the late 2000s by Jordin Sparks' semi-cover \"SOS (Let the Music Play)\", which reached #1 on the Billboard Hot Dance Club Play charts and #31 on the Mainstream Top 40, but most radio stations switched back to Shannon's original within a few months.\n• Martha Wash of The Weather Girls remade said duo's \"It's Raining Men\" with Ru Paul in 1997, then Geri Halliwell of the Spice Girls covered it a couple years afterwards, but neither cover could touch the original, and both have since been forgotten by most people.\n• Gloria Gaynor's \"I Will Survive\" has proven impossible to cover up, despite popular cover versions by Diana Ross, Chantay Savage, CAKE, etc.\n• N-Trance's 1995 Euro-Hip-Hop version of \"Stayin' Alive\" has nothing on The Bee Gees' original. Nor does the Glee cast's version.\n• Boyz II Men is a very popular group with many hits and their 1991 version of \"It's So Hard to Say Goodbye to Yesterday\" is more well-known than G. C. Cameron's original 1975 version from the Cooley High soundtrack. However, the same cannot be said about their 1997 cover of New Edition's 1988 mega-hit \"Can You Stand the Rain\", where it was to the point of many fans not even knowing that it existed. It only got further displaced after it was sung by the cast of The New Edition Story and interest in the original only grew stronger.\n• Neither Chaka Khan's nor 3rd Party's nor Anastacia's covers of \"Love is Alive\" were able to compete with the Gary Wright original, which is more or less the only version receiving airplay nowadays.\n• Cherelle's \"I Didn't Mean to Turn You On\" is a rather strange subversion. While many are torn over if it or the Robert Palmer version is the most popular version (while both are considered light years ahead of Mariah Carey's and DJ Collette's versions), it's unclear who is the true winner: the original 1984 version is rarely heard on the radio and if the 1986 cover is it, then it's considered the least popular of Robert Palmer's hits, particularly regarding his trilogy of \"pretty models band\" videos, as \"Simply Irresistible\" and \"Addicted to Love\" are more likely to receive airplay.\n• Sugarland's 2008 cover of The Dream Academy's 1985 smash hit \"Life in a Northern Town\" is all but forgotten, especially since the duo is now more likely remembered for their 2011 concert that ended with a stage collapse that killed seven people.\n• The Speedy Techno Remake of Duran Duran's \"Ordinary World\" by UK trance act Aurora (not to be confused with the Norwegian singer) was a worldwide hit in the early Noughties and was even featured in the Dance Dance Revolution series. Since then, however, the Duran Duran original has reclaimed its fame.\n• Supergroup Stars on 54 (comprised of solo dance divas Amber, Ultra Nate, and Jocelyn Enriquez) covered Gordon Lightfoot's \"If You Could Read My Mind\" for the 1998 film 54, but their version was quickly forgotten afterwards. The 2002 cover by Marcella Detroit in collaboration with the aforementioned Aurora went nowhere either.\n• The Communards, Jimmy Somerville's band after leaving Bronski Beat, had a sizable hit with their version of \"Don't Leave Me This Way\" in The '80s. Since then, however, Thelma Houston's '70s version has overshadowed it, though both Covered Up the original by Harold Melvin & The Bluenotes.\n• The English Beat's '80s ska cover of \"Tears of a Clown\" has long since fallen back into the shadow of The Miracles' original.\n• Seether's version of \"Careless Whisper\" was a minor hit in the late Noughties, but did nothing to displace George Michael's original version, whose stance was further bolstered by his death in late 2016.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/FirstAndForemost", "media_links": ["/pmwiki/pmwiki.php/Music/ThinLizzy", "/pmwiki/pmwiki.php/Music/Metallica", "/pmwiki/pmwiki.php/Music/HarryChapin", "/pmwiki/pmwiki.php/Music/GunsNRoses", "/pmwiki/pmwiki.php/Music/PaulMcCartney", "/pmwiki/pmwiki.php/Music/TheRollingStones", "/pmwiki/pmwiki.php/Music/Aerosmith", "/pmwiki/pmwiki.php/Music/MichaelJackson", "/pmwiki/pmwiki.php/Music/AbbeyRoad", "/pmwiki/pmwiki.php/Music/TheBeatles", "/pmwiki/pmwiki.php/Music/JoeCocker", "/pmwiki/pmwiki.php/Series/TheWonderYears", "/pmwiki/pmwiki.php/Music/EarthWindAndFire", "/pmwiki/pmwiki.php/Music/Help", "/pmwiki/pmwiki.php/Music/ChuckBerry", "/pmwiki/pmwiki.php/Music/TheBeatles", "/pmwiki/pmwiki.php/Music/EdithPiaf", "/pmwiki/pmwiki.php/Music/AlienAntFarm", "/pmwiki/pmwiki.php/Music/Bad", "/pmwiki/pmwiki.php/Music/MichaelJackson", "/pmwiki/pmwiki.php/Music/Madonna", "/pmwiki/pmwiki.php/Music/DonMcLean", "/pmwiki/pmwiki.php/Music/MarilynManson", "/pmwiki/pmwiki.php/Music/TheCure", "/pmwiki/pmwiki.php/Music/ThreeEleven", "/pmwiki/pmwiki.php/Music/Adele", "/pmwiki/pmwiki.php/Music/EltonJohn", "/pmwiki/pmwiki.php/Music/TheBeatles", "/pmwiki/pmwiki.php/Music/SgtPeppersLonelyHeartsClubBand", "/pmwiki/pmwiki.php/Music/Tommy", "/pmwiki/pmwiki.php/Music/TheWho", "/pmwiki/pmwiki.php/Music/ToriAmos", "/pmwiki/pmwiki.php/Music/Nirvana", "/pmwiki/pmwiki.php/Music/Nevermind", "/pmwiki/pmwiki.php/Music/LedZeppelin", "/pmwiki/pmwiki.php/Music/LeonardCohen", "/pmwiki/pmwiki.php/Music/SongsOfLeonardCohen", "/pmwiki/pmwiki.php/Music/NeilDiamond", "/pmwiki/pmwiki.php/Music/JohnCale", "/pmwiki/pmwiki.php/Film/Watchmen", "/pmwiki/pmwiki.php/Music/JeffBuckley", "/pmwiki/pmwiki.php/Music/Grace", "/pmwiki/pmwiki.php/Music/NoDoubt", "/pmwiki/pmwiki.php/Music/TalkTalk", "/pmwiki/pmwiki.php/Music/HankWilliams", "/pmwiki/pmwiki.php/Music/HankWilliamsJr", "/pmwiki/pmwiki.php/Music/RebaMcEntire", "/pmwiki/pmwiki.php/Music/WillieNelson", "/pmwiki/pmwiki.php/Music/TomPetty", "/pmwiki/pmwiki.php/Theatre/LesMiserables", "/pmwiki/pmwiki.php/Creator/AndrewLloydWebber", "/pmwiki/pmwiki.php/Music/MCHammer", "/pmwiki/pmwiki.php/Music/VanillaIce", "/pmwiki/pmwiki.php/Music/TomWaits", "/pmwiki/pmwiki.php/Music/RainDogs", "/pmwiki/pmwiki.php/Music/AllSaints", "/pmwiki/pmwiki.php/Music/RedHotChiliPeppers", "/pmwiki/pmwiki.php/Music/BingCrosby", "/pmwiki/pmwiki.php/Music/MerryChristmas", "/pmwiki/pmwiki.php/Music/GeneAutry", "/pmwiki/pmwiki.php/Music/MichaelBolton", "/pmwiki/pmwiki.php/Music/LeonaLewis", "/pmwiki/pmwiki.php/Music/AvrilLavigne", "/pmwiki/pmwiki.php/Music/AlanJackson", "/pmwiki/pmwiki.php/Music/DonWilliams", "/pmwiki/pmwiki.php/Music/GeorgeJones", "/pmwiki/pmwiki.php/Music/SteveEarle", "/pmwiki/pmwiki.php/Music/RandyTravis", "/pmwiki/pmwiki.php/Music/JohnnyCash", "/pmwiki/pmwiki.php/Music/TheStatlerBrothers", "/pmwiki/pmwiki.php/Music/MartinaMcBride", "/pmwiki/pmwiki.php/Music/FiveSecondsOfSummer", "/pmwiki/pmwiki.php/Music/SamCooke", "/pmwiki/pmwiki.php/Music/BruceSpringsteen", "/pmwiki/pmwiki.php/Music/Roxette", "/pmwiki/pmwiki.php/Music/AceOfBase", "/pmwiki/pmwiki.php/Music/Bananarama", "/pmwiki/pmwiki.php/Music/RascalFlatts", "/pmwiki/pmwiki.php/WesternAnimation/Cars", "/pmwiki/pmwiki.php/Music/TheWho", "/pmwiki/pmwiki.php/Music/LimpBizkit", "/pmwiki/pmwiki.php/Music/NewOrder", "/pmwiki/pmwiki.php/Music/Orgy", "/pmwiki/pmwiki.php/Music/KimWilde", "/pmwiki/pmwiki.php/Music/TheBloodhoundGang", "/pmwiki/pmwiki.php/Film/Clueless", "/pmwiki/pmwiki.php/Music/Len", "/pmwiki/pmwiki.php/Anime/DigimonTheMovie", "/pmwiki/pmwiki.php/Series/AmericanIdol", "/pmwiki/pmwiki.php/WesternAnimation/JimmyNeutronBoyGenius", "/pmwiki/pmwiki.php/Music/RebaMcEntire", "/pmwiki/pmwiki.php/Music/TheSupremes", "/pmwiki/pmwiki.php/Music/PeterSchilling", "/pmwiki/pmwiki.php/Music/MxPx", "/pmwiki/pmwiki.php/Creator/WilliamShatner", "/pmwiki/pmwiki.php/Music/LouisArmstrong", "/pmwiki/pmwiki.php/Film/BowlingForColumbine", "/pmwiki/pmwiki.php/Music/Disturbed", "/pmwiki/pmwiki.php/Music/SimonAndGarfunkel", "/pmwiki/pmwiki.php/Creator/RuPaul", "/pmwiki/pmwiki.php/Music/SpiceGirls", "/pmwiki/pmwiki.php/Music/GloriaGaynor", "/pmwiki/pmwiki.php/Music/TheSupremes", "/pmwiki/pmwiki.php/Music/Cake", "/pmwiki/pmwiki.php/Music/TheBeeGees", "/pmwiki/pmwiki.php/Series/Glee", "/pmwiki/pmwiki.php/Music/NewEdition", "/pmwiki/pmwiki.php/Series/TheNewEditionStory", "/pmwiki/pmwiki.php/Music/MariahCarey", "/pmwiki/pmwiki.php/Music/Sugarland", "/pmwiki/pmwiki.php/Music/DuranDuran", "/pmwiki/pmwiki.php/Music/Aurora", "/pmwiki/pmwiki.php/VideoGame/DanceDanceRevolution", "/pmwiki/pmwiki.php/Music/GordonLightfoot", "/pmwiki/pmwiki.php/Film/FiftyFour", "/pmwiki/pmwiki.php/Music/Seether", "/pmwiki/pmwiki.php/Music/GeorgeMichael"], "non_media_links": ["/pmwiki/pmwiki.php/Main/DeadHorseGenre", "/pmwiki/pmwiki.php/Main/FirstInstallmentWins", "/pmwiki/pmwiki.php/Main/CoveredUp", "/pmwiki/pmwiki.php/Main/CoveredUp", "/pmwiki/pmwiki.php/Main/CoveredUp", "/pmwiki/pmwiki.php/Main/RealSongThemeTune", "/pmwiki/pmwiki.php/Main/CountryMusic", "/pmwiki/pmwiki.php/Wiki/TheOtherWiki", "/pmwiki/pmwiki.php/Main/CoveredUp", "/pmwiki/pmwiki.php/Main/CoveredUp", "/pmwiki/pmwiki.php/Main/MassiveMultiplayerCrossover", "/pmwiki/pmwiki.php/Main/CoveredUp", "/pmwiki/pmwiki.php/Main/SpeedyTechnoRemake", "/pmwiki/pmwiki.php/Main/ChristmasSongs", "/pmwiki/pmwiki.php/Main/TheSeventies", "/pmwiki/pmwiki.php/Main/CountryMusic", "/pmwiki/pmwiki.php/Main/TheEighties", "/pmwiki/pmwiki.php/Main/PowerPop", "/pmwiki/pmwiki.php/Main/ChartDisplacement", "/pmwiki/pmwiki.php/Main/CoveredUp", "/pmwiki/pmwiki.php/Main/OneHitWonder", "/pmwiki/pmwiki.php/Main/OneHitWonder", "/pmwiki/pmwiki.php/Main/SoBadItsGood", "/pmwiki/pmwiki.php/Main/SofterAndSlowerCover", "/pmwiki/pmwiki.php/Main/CoveredUp", "/pmwiki/pmwiki.php/Main/HipHop", "/pmwiki/pmwiki.php/Main/CoveredUp", "/pmwiki/pmwiki.php/Main/FatalMethodActing", "/pmwiki/pmwiki.php/Main/SpeedyTechnoRemake", "/pmwiki/pmwiki.php/Main/NamesTheSame", "/pmwiki/pmwiki.php/Main/Supergroup", "/pmwiki/pmwiki.php/UsefulNotes/TheEighties", "/pmwiki/pmwiki.php/Main/CoveredUp", "/pmwiki/pmwiki.php/Main/Ska", "/pmwiki/pmwiki.php/Main/DeadArtistsAreBetter"]}