{"title": "Regional Riff", "content": "Sound and music are significant in storytelling to help the viewer grasp the personalities, moods or locales in which the story takes place.\n\nLeitmotifs are usually used to identify a character; Mood Motifs are to help set the tone of the sequence.\n\nHere we're exploring Regional Riffs — and the musical instruments that seem inexorably linked as cues to locations. This is sort of the audio equivalent of the Foreign-Looking Font — a certain musical style is used because it resembles the actual music native to the setting, or because Hollywood has decided it just has the right \"feel.\" Sometimes the composers try to be culturally accurate but don't do their research, employing Scotirish bagpipes or Spexican bands.\n\nCompare Standard Snippet, which is a specific song associated with a certain place, activity or situation. A Regional Riff might simply be suspiciously similar to a Standard Snippet. For other musical location associations, see Jungle Jazz, Waltz on Water, and Snowy Sleigh Bells.\n• The Didgeridoo and the Bull Roarer of \"You're in Australia, mate!\"\n• The sitar, bansuri, and tablas of India\n• The dung (the 5m long monastic trumpets) of Tibet.\n• The Koto, Woodblock, and Shakuhachi of Japan. You're deep into Jidai Geki territory when you hear these played in the miyako-bushi scale.\n• Possibly also The Thing That Goes \"Doink!\".\n• The Oriental Riff [often interchangeable for China and Japan]\n• The riff in question appears, using an electric guitar, in \"Turning Japanese\" by the Vapors, in \"Tokio\" by Caramella Girls, and in many other Asian themed songs. It has become a Discredited Trope, though.\n• The gong, zither, erhu fiddle, and Pekin Opera of China.\n• Throat-singing is pretty much identified with Mongolia and its neighbors like Kazakhstan and Kyrgyzstan. Although it is actually most commonly found in Tuva.\n• Gamelan or brass ensemble played in pentatonic scale is synonymous with Southeast Asia, especially Indonesia.\n• The Female Vocal Of The Middle East\n• Ofra Haza's music fits the bill.\n• Ironically, Ofra Haza is Israeli, not the first place to come to mind when one considers \"generic Middle Eastern music\"\n• Well, she was of Yemeni heritage and her music reflected both Arab and Jewish influence. Her most popular albums are renditions of Yemeni traditional songs.\n• As does the Eastern influence of Sting's \"Desert Rose\". (\"That Guy\", by the way, is Cheb Mami from Algiers.)\n• The Hijaz scale (D Eb F# G...) is overused to represent both Middle Easterners and Jews, regardless of origin. This is likely due to the not only an \"exotic\" sound, but also popularity of songs such as Miserlou and Hava Nagila. In fact, Arabs are more likely to use the Bayati scale (D E/b F G...), but that may be too alien for Western ears.\n• It's also been used for South Asian snake charmers. In fact, pretty much any Asian setting that isn't Far East — and sometimes even then (\"Golden Bangkok\" from Chess).\n• The Azaan (call to prayer) of the Muslim World gets used in a lot of establishing shots. Bonus points if it's at sunrise or sunset.\n• There is also \"The Streets of Cairo\" which is used for a lot of generic Middle East/South Asia settings. According to this article , though there's a chance it could be based on a song far older, the furthest it can be definitively traced back is The Gay '90s, in America of all places.\n• If the scene takes place in a bazaar (or, of all places, the formation of the Tengen Toppa Gunmen in the second Tengen Toppa Gurren Lagann movie), expect to hear the humming \"DoooodoooDooodoooDOOODOO\" flute sound at some point.\n• Harmonious string violins are incredibly overused to represent any desert in the Middle East. This is possibly because of the soundtrack to Lawrence of Arabia and its influence.\n• The shofar of the Holy Land\n• The Lute of the Mediterranean\n• The (often faster) Bouzouki of Greece\n• The European Accordion\n• French music (especially in Gay Paree), Polka music, German music, Northern Italian liscio or most Central Italian folk songs.\n• The people of France have apparently gone to great effort to ensure a generic chorus of \"La Marseillaise\" is playing every time a plane carrying a protagonist is landing in Paris.\n• The German Oompah Band (\"Mit a bang, mit a boom...\")\n• Beethoven actually wrote several short pieces of good-humored mockery of them.\n• Those unfortunate enough to find themselves there in late 1930s would get something very brassy and vaguely Wagnerian.\n• The guitar and castanets of Spain\n• Evidently, the only music in Spain is Andalusian Flamenco. Man of La Mancha is a case in point (though an anachronistic one).\n• The hammered dulcimer or, more likely, the cimbalom of Central and Eastern Europe.\n• The Gay Life, set in Vienna, was likely the only Broadway musical (excluding European imports) to have a cimbalom in the orchestra pit.\n• The Ominous Latin Chanting of the Vatican/other overtly Catholic setting.\n• The yodeler, alphorn and distant cowbells of Switzerland/the Alps.\n• The eerie violin or Ominous Pipe Organ of Überwald.\n• Scandinavia will usually sort it out with small accordions (Sweden), or a Jew's harp and a Hardanger Fiddle (Norway). Unless somebody starts off a (pronounced yoik) (that is the Sami snippet). Finland may also use an accordion.\n• The Male Choir Of Communism\n• \"Ochi Chornye (Dark Eyes),\" which is actually a Gypsy romance.\n• Russian Orthodox choirs are used to represent both Soviet Union and modern Russia due to the church's centuries-old tradition of artful singing. Singing is actually very much a requirement for most Russian clerics).\n• Slavianka's Farewell every time war comes to Russia.\n• Caucasian Lezginka, although more generic \"oriental\" tunes can be used for Caucasian characters and/or settings in media.\n• The Armenian duduk, usually playing a song by Komitas Vardapet (Krung or Lele Yaman are the most common).\n• More stereotypically: Trumpet with a guitar in the background, at pasodoble rhythm which happens to be from Spain, regarded as such in Mexico and not played outside bullfights.\n• Realistically, that trumpet and guitar sound is mariachi style and should be played in a fast 3/4 time. It still gets heavy airplay on Spanish-language stations in the Southwest.\n• The Rainstick of the South American Rainforest\n• The Steel Drums of the Caribbean\n• The Pacific Islands often have what Pauline Kael (reviewing The Blue Lagoon) called \"island-y music\", with a lot of lush strings and French horns. Sometimes there are Jungle Drums in the background reminding you of the indigenous people, friendly or not. Some films use indigenous music or an orchestrated version thereof (this goes all the way back to the 1963 picture Donovan's Reef).\n• The Great Highland Bagpipes of Scotland - virtually always skirling the Standard Snippet Scotland the Brave.\n• The Uilleann Pipes of Ireland\n• Or, if it's in a pub, generic diddly aye fiddle music. On rare, often \"mystical\" or sad occasions, Sean Nós singing. By which I mean Clannad. And/or Enya.\n• The Drums of the Picts\n• The young-English-male chorus of muscular Christianity, singing a hymn over establishing shots of an old-fashioned Boarding School. \"Jerusalem\" and \"To Be a Pilgrim\" are popular choices.\n• The tinkling pianoforte of the Jane Austen adaptation\n• And the Male Voice Choir, keeping a welcome in the hillsides of Wales\n• The entire Ealing Studios picture A Run For Your Money is this trope.\n• Ironically enough the actual national anthem (officially titled \"National Anthem\", more commonly know as \"God Save the [King/Queen]\" depending on the current monarch) is rarely used, since it shares the same tune as the US's \"America\" (better known for its first line, \"My Country, 'Tis of Thee\"), meaning it's likely to be confused.\n• The Bells of Westminster and/or Big Ben, cut any way you like. So iconic it doesn't even need an establishing shot of the Palace of Westminster/St. Stephen's Tower/the Westminster Clock to go with it.\n• In some contemporary works, 60s Merseybeat or 70s Punk Rock will be the official anthem of England. If the director wants to be even more hip, they'll use 90s techno.\n• The first bars of the chorus of \"Rule, Brittania\".\n• The Brass of USA - just about anything composed by John Philip Sousa (except perhaps the Liberty Bell March) or music largely considered patriotic to the United States.\n• Some people consider Bob and Doug Mackenzie's theme from 'SCTV' to be \"Canada's Riff\". The theme is a parody of the boring flute solos associated with Canadian nature programs.\n• Any establishing shot of the White House will, of course, be accompanied by \"Hail to the Chief\". Airforce One frequently gets this treatment as well. A case of Truth in Television as the theme is tradditionally played any time the sitting President makes a Public Appearance (Ironically, it wouldn't be heard much in the White House as the President isn't appearing in public but his place of work or office). The Vice President has a similar theme but the office of Vice President of the United States is the trope maker for Vice-President Who? so don't expect to hear it often.\n• The strings and horns of the West\n• For a modern Trope Codifier of this example, consider \"Hoedown\" by Aaron Copland, from the ballet (yes, ballet) Rodeo (but better known in America as the \"Beef: It's What's For Dinner\" music).\n• The War Drums of Injun Country (Mercifully far less common than it once was.)\n• Injun Country had its own riff too. Today, depending on the mood they want to set for the film, you might be more likely to hear Carlos Nakai /Robert Mirabal-style flute, traditional songs or Native rock by Xit, Redbone, Robbie Robertson or the late John Trudell.\n• The Saxophone of New Orleans.\n• The surf guitar of Los Angeles. Or in some more recent works, West Coast hip-hop or post-grunge rock.\n• The Banjo of the Deep South. Clucking chickens optional.\n• Light jazz music usually tells you you're in San Francisco. Not because the music derives from the area, but because it fits the feel of the city that most filmmakers are shooting for.\n• Also occasionally some '60s folk or pop/rock, especially \"California Dreamin'\", \"Somebody to Love\", and oh yeah, \"San Francisco (Be Sure to Wear Some Flowers in Your Hair)\".\n• The first minute or two of \"Le Jazz Hot\" (especially the bass and trumpet parts) will be instantly recognizable as \"the music that plays in every 1920's dance club and/or speakeasy.\"\n• Instrumental hip-hop is becoming increasingly popular for SF.\n• A warbling clarinet or sax, or something Big Band-sounding, often welcomes you to New York City.\n• Or the Windy City, for that matter. May or may not include more fiddling.\n• That warbling clarinet is often a play on Gershwin's Rhapsody in Blue\n• Irish music in general, especially if you're dealing with Southies, for Boston.\n• The first few bars of \"I'm Shipping Up to Boston\" most famously done by the Dropkick Murphys for the same reasons.\n• The ukulele and steel guitar of Hawaii.\n• The wailing fiddle of Appalachian/Ozark poverty.\n• Occasional jug and washboard added for effect, along with the Jews' Harp — that \"boinging\" instrument. (for the record its name is a mispronunciation of jaw harp)\n• The guitar and/or harmonica of the lonesome prairie.\n• Very time and/or place specifically, you'll frequently hear the music for the \"Charleston\" for 1920's America and specifically for Charleston, South Carolina at pretty much any time period. It's not even the state dance.\n• An Elvis or Sinatra-sounding tune for Las Vegas.\n• Usually performed by The King or Ol' Blue Eyes themselves. Sometimes a filmmaker will get really crazy and play something by Dean Martin instead.\n• If the scene is meant to evoke American Achievement, excpect something similar to Fanfare for the Common Man to play. Espceially if it's Sports or NASA related as it has been heavily used in American Sports broadcasting and sounds like something done whe a bunch of Astronauts march ala The Right Stuff March.\n• The generic drums of Darkest Africa, which may be indistinguishable from the abovementioned \"War Drums of Injun Country.\"\n• Chants or shouts evoking images of the tribal Scary Black Man. The battle chants used by the massed impis in the film Zulu are a good example.\n• Anything that's played in a harmonic minor scale (or double harmonic ) will become instantly associated with Arabic or Egyptian music.\n• Silence, howling winds, deep ambient, or - if you're unlucky - Drone of Dread of Mysterious Antarctica.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/RegionalRiff", "media_links": ["/pmwiki/pmwiki.php/Theatre/Chess", "/pmwiki/pmwiki.php/Anime/TengenToppaGurrenLagann", "/pmwiki/pmwiki.php/Film/LawrenceOfArabia", "/pmwiki/pmwiki.php/Film/TheProducers", "/pmwiki/pmwiki.php/Theatre/ManOfLaMancha", "/pmwiki/pmwiki.php/Film/TheBlueLagoon", "/pmwiki/pmwiki.php/Creator/JaneAusten", "/pmwiki/pmwiki.php/Creator/EalingStudios", "/pmwiki/pmwiki.php/Series/MontyPythonsFlyingCircus", "/pmwiki/pmwiki.php/Theatre/VictorVictoria", "/pmwiki/pmwiki.php/Music/DropkickMurphys", "/pmwiki/pmwiki.php/Music/ElvisPresley", "/pmwiki/pmwiki.php/Music/FrankSinatra", "/pmwiki/pmwiki.php/Film/Zulu", "/pmwiki/pmwiki.php/Music/Osibisa"], "non_media_links": ["/pmwiki/pmwiki.php/WebVideo/Unskippable", "/pmwiki/pmwiki.php/UsefulNotes/Japan", "/pmwiki/pmwiki.php/Main/Leitmotif", "/pmwiki/pmwiki.php/Main/MoodMotif", "/pmwiki/pmwiki.php/Main/ForeignLookingFont", "/pmwiki/pmwiki.php/Main/Scotireland", "/pmwiki/pmwiki.php/Main/Spexico", "/pmwiki/pmwiki.php/Main/StandardSnippet", "/pmwiki/pmwiki.php/Main/SuspiciouslySimilarSong", "/pmwiki/pmwiki.php/Main/StandardSnippet", "/pmwiki/pmwiki.php/Main/JungleJazz", "/pmwiki/pmwiki.php/Main/WaltzOnWater", "/pmwiki/pmwiki.php/Main/SnowySleighBells", "/pmwiki/pmwiki.php/Main/LandDownUnder", "/pmwiki/pmwiki.php/Main/JidaiGeki", "/pmwiki/pmwiki.php/Main/TheThingThatGoesDoink", "http://en.wikipedia.org/wiki/Oriental_riff", "/pmwiki/pmwiki.php/Main/Wutai", "/pmwiki/pmwiki.php/Main/DiscreditedTrope", "/pmwiki/pmwiki.php/Main/OneWomanWail", "http://jguitar.com/scalelisting?scale=Phrygian-Dominant", "/pmwiki/pmwiki.php/Main/FarEast", "https://www.youtube.com/watch?v=oZcZfV3LiuQ", "http://www.shira.net/streets-of-cairo.htm", "/pmwiki/pmwiki.php/Main/TheGayNineties", "https://www.youtube.com/watch?v=2O9lFQxqcTk", "https://www.youtube.com/watch?v=RuxHLzwlDY4", "https://www.youtube.com/watch?v=4HDMLKgoB5s", "/pmwiki/pmwiki.php/Main/GayParee", "/pmwiki/pmwiki.php/Main/TorosYFlamenco", "/pmwiki/pmwiki.php/Main/OminousLatinChanting", "/pmwiki/pmwiki.php/Main/YodelLand", "/pmwiki/pmwiki.php/Main/OminousPipeOrgan", "/pmwiki/pmwiki.php/Main/Uberwald", "https://www.youtube.com/watch?v=kprl0CECykA", "/pmwiki/pmwiki.php/Main/Sami", "https://www.youtube.com/watch?v=TFS316SzGFQ", "https://www.youtube.com/watch?v=Nzu9JkhzHbk", "https://www.youtube.com/watch?v=VGn8Dai9jWo", "https://www.youtube.com/watch?v=jgJhrZn8o-s", "http://en.wikipedia.org/wiki/Lezginka", "http://en.wikipedia.org/wiki/Duduk", "https://www.youtube.com/watch?v=ymYs9T50hH0", "/pmwiki/pmwiki.php/Main/JungleDrums", "/pmwiki/pmwiki.php/Main/EverythingsLouderWithBagpipes", "/pmwiki/pmwiki.php/UsefulNotes/Scotland", "/pmwiki/pmwiki.php/Main/StandardSnippet", "https://www.youtube.com/watch?v=tDRdabkBM28", "http://en.wikipedia.org/wiki/Uilleann_pipes", "/pmwiki/pmwiki.php/UsefulNotes/Ireland", "https://www.youtube.com/watch?v=4ZP-4B7kHqA", "https://www.youtube.com/watch?v=n08JRxVLKLE", "/pmwiki/pmwiki.php/Main/BoardingSchool", "/pmwiki/pmwiki.php/Main/OopNorth", "/pmwiki/pmwiki.php/UsefulNotes/Wales", "/pmwiki/pmwiki.php/Main/PunkRock", "/pmwiki/pmwiki.php/Main/AirforceOne", "/pmwiki/pmwiki.php/Main/VicePresidentWho", "/pmwiki/pmwiki.php/Main/TropeCodifier", "https://www.youtube.com/watch?feature=player_detailpage&v=HnbASemGk0k", "/pmwiki/pmwiki.php/Main/CoveredUp", "/pmwiki/pmwiki.php/Main/InjunCountry", "/pmwiki/pmwiki.php/Main/DiscreditedTrope", "/pmwiki/pmwiki.php/Main/InjunCountry", "https://www.youtube.com/watch?v=19nm5_nAwQg", "https://www.youtube.com/watch?v=XdiJ0Jpphds", "/pmwiki/pmwiki.php/Main/ItsAlwaysMardiGrasinNewOrleans", "/pmwiki/pmwiki.php/UsefulNotes/LosAngeles", "/pmwiki/pmwiki.php/Main/BigBand", "/pmwiki/pmwiki.php/Main/BigApplesauce", "/pmwiki/pmwiki.php/UsefulNotes/Chicago", "/pmwiki/pmwiki.php/Main/Southies", "/pmwiki/pmwiki.php/UsefulNotes/LasVegas", "/pmwiki/pmwiki.php/Main/TheRightStuff", "/pmwiki/pmwiki.php/Main/DarkestAfrica", "/pmwiki/pmwiki.php/Main/InjunCountry", "/pmwiki/pmwiki.php/Main/AfricanChant", "/pmwiki/pmwiki.php/Main/ScaryBlackMan", "https://www.youtube.com/watch?v=ODM1RJe4FvQ&list=PLIa36ETako3MaZaw7-I0qEuflOniBvTWd&index=19", "https://www.youtube.com/watch?v=59ygF8qLehQ&list=PLIa36ETako3MaZaw7-I0qEuflOniBvTWd&index=18", "https://upload.wikimedia.org/wikipedia/commons/6/61/Amoll_harm.mid", "https://upload.wikimedia.org/wikipedia/commons/2/24/Double_harmonic_scale.mid", "/pmwiki/pmwiki.php/Main/Ambient", "/pmwiki/pmwiki.php/Main/DroneOfDread", "/pmwiki/pmwiki.php/Main/MysteriousAntarctica"]}