{"title": "Left Field Description", "content": "In novels, things tend to flow in a way that makes sense according to how the story is meant to work. Important things are described in great detail, while less important things are just glossed over. Any \"jump out at you\" details are usually meant to mean something. If someone is described as having lips like cherry and eyes like chocolate, that person is probably beautiful (within the context of the story, or at least in the perception of the author). Little details bring a story to life, and they are usually given to the parts of the story the author considers important.\n\nSame is true with aspects of a character's everyday life. If someone's daily routine is described in great detail, then it's usually to demonstrate some character quirk (such as being a Creature of Habit, having Super OCD, or having odd interests or behaviors), or show how that character feels at that point in time (if they've just been through something you'd expect to fundamentally affect them but aren't thinking about it, it could suggest a Heroic BSoD).\n\nSome authors either don't understand this, or choose to deliberately subvert it. They may describe every little unimportant thing in tremendous detail, which is known as Purple Prose. Or they may describe the important elements of a story in ways that you wouldn't normally think of, using bizarre metaphors or describing things unconventionally in their attempt to make a detail illustrate something of importance.\n\nConsider the following example:\n\nBrooke shook her head. \"No. Not really,\" she explained, carelessly running her bare foot along the corner of a rug. Her toenails were painted and decorated with glittering flowers.\n\nIn this scene, Max (age 11) is talking to a girl on whom he has a crush about something of great importance, in the girl's house. While they talk, she runs her foot along the rug, and wow, what a beautiful foot. You can tell Brooke is a classy girl with those glittering flowers.\n\nAnyway, there's a description straight out of left field. It does highlight that Brooke is attractive to Max, but not in the way you'd expect.\n\nIf done well, it's punchy and interesting, and allows the reader to see what might be a somewhat tired or over-familiar concept from a refreshing new angle. If done poorly, then it can be clumsy and nonsensical, and may lead to a case of Metaphorgotten.\n\nExamples should contain at least one passage from the book if possible\n• Grey Griffins was the example used above in the article. The series has some strange writing flaws, but only a handful of stuff that really jumps out like this.\n• The Inheritance Cycle is filled with this sort of thing.\n• Movement flickered through it, like the swish of a bird across a clouded moon.\n• Slippers flashing beneath her dress, like mice darting from a hole.\n• The dawnless morning. . . - How can there be morning without dawn?\n• There are a couple of instances in Discworld of items 'flying through the air, like a partridge'.\n• A Series of Unfortunate Events features this now and then. The Lemony Narrator will sprinkle details about someone or something's appearance throughout a scene (possibly meant to imply that the Baudelaires are just noticing them).\n• The sky above the port was the color of television, tuned to a dead channel. - The first line of William Gibson's Neuromancer.\n• Robert J. Sawyer's Wake (2009) features the above quote with a Technology Marches On twist: \u0093The sky above the island was the colour of television, tuned to a dead channel \u0097 which is to say it was a bright, cheery blue.\u0094\n• The sky over the port was the color of a television set tuned to PBS.\n• It was a bright cold day in April, and the clocks were striking thirteen. - George Orwell's 1984 starts off letting you know that something's not right.\n• Neil Gaiman does this particularly well in Anansi Boys: If on seeing Graham Coats you immediately thought of an albino ferret in an expensive suit, you wouldn't be the first.\n• P. G. Wodehouse loves doing this. One character has the look of \"a pterodactyl with a secret sorrow\".\n• In Chuck Palahniuk's Lullaby, the protagonist is a journalist who is always noting details. Her suit is light blue, but it's not a regular robin's-egg blue. It's the blue of a robin's egg you might find and then worry that it won't hatch because it's dead inside.\n• This trope is part of the Signature Style of Douglas Adams. The ships hung in the sky in much the same way that bricks don't.\n• Peter S. Beagle's The Last Unicorn has a lot of these.\n• MC Frontalot's \"You Got Asperger's\" is a musical example where the trope is used very deliberately to try to illustrate the difficulties of Asperger syndrome. The POV character is painfully aware how easily he is distracted by details that are irrelevant to the situation at hand, and he struggles to stay focused enough to have a proper conversation with a girl he likes, rather than fixating on her hair ribbons.\n• Blank, the narrator of Stray Ami describes an unpleasant old lady as smelling like when you bite into a chocolate chip cookie and find it full of raisins.\n• The IF game Max Blaster and Doris de Lightning Against the Parrot Creatures of Venus goes for this sort of description in an Affectionate Parody of old pulp serials Purple Prose tendencies: Making your way through the Venusian jungle is a bit like working security in the front rows of a rock concert mobbed by giant broccoli.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/LeftFieldDescription", "media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/Literature/GreyGriffins", "https://tvtropes.org/pmwiki/pmwiki.php/Literature/InheritanceCycle", "https://tvtropes.org/pmwiki/pmwiki.php/Literature/Discworld", "https://tvtropes.org/pmwiki/pmwiki.php/Literature/ASeriesOfUnfortunateEvents", "https://tvtropes.org/pmwiki/pmwiki.php/Literature/Neuromancer", "https://tvtropes.org/pmwiki/pmwiki.php/Literature/NineteenEightyFour", "https://tvtropes.org/pmwiki/pmwiki.php/Creator/NeilGaiman", "https://tvtropes.org/pmwiki/pmwiki.php/Literature/AnansiBoys", "https://tvtropes.org/pmwiki/pmwiki.php/Creator/PGWodehouse", "https://tvtropes.org/pmwiki/pmwiki.php/Creator/ChuckPalahniuk", "https://tvtropes.org/pmwiki/pmwiki.php/Literature/Lullaby", "https://tvtropes.org/pmwiki/pmwiki.php/Creator/DouglasAdams", "https://tvtropes.org/pmwiki/pmwiki.php/Creator/PeterSBeagle", "https://tvtropes.org/pmwiki/pmwiki.php/Literature/TheLastUnicorn", "https://tvtropes.org/pmwiki/pmwiki.php/Music/MCFrontalot", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/MaxBlasterAndDorisDeLightningAgainstTheParrotCreaturesOfVenus"], "non_media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/Main/LawOfConservationOfDetail", "https://tvtropes.org/pmwiki/pmwiki.php/Main/CreatureOfHabit", "https://tvtropes.org/pmwiki/pmwiki.php/Main/SuperOCD", "https://tvtropes.org/pmwiki/pmwiki.php/Main/AngstWhatAngst", "https://tvtropes.org/pmwiki/pmwiki.php/Main/HeroicBSOD", "https://tvtropes.org/pmwiki/pmwiki.php/Main/TheyPlottedAPerfectlyGoodWaste", "https://tvtropes.org/pmwiki/pmwiki.php/Main/SubvertedTrope", "https://tvtropes.org/pmwiki/pmwiki.php/Main/PurpleProse", "https://tvtropes.org/pmwiki/pmwiki.php/Main/Metaphorgotten", "https://tvtropes.org/pmwiki/pmwiki.php/Main/LemonyNarrator", "https://tvtropes.org/pmwiki/pmwiki.php/Main/TechnologyMarchesOn", "http://www.project-apollo.net/headroom/index.html", "https://tvtropes.org/pmwiki/pmwiki.php/Main/SignatureStyle", "https://tvtropes.org/pmwiki/pmwiki.php/AudioPlay/StrayAmi", "https://tvtropes.org/pmwiki/pmwiki.php/Main/AffectionateParody", "https://tvtropes.org/pmwiki/pmwiki.php/Main/PurpleProse"]}