{"title": "A Spy at the Spa", "content": "The more sinister side of the Chatty Hairdresser. Loose Lips sink ships — and where will you find looser lips than in the midst of centers of socialization and self-indulgence such as beauty parlors, barber shops, nail salons or massage parlors? People assume that the help is being paid for their discretion. But maybe they're only pretending to be a sympathetic ear about that project you're working on at work. Or maybe that fellow customer is just pretending to be waiting for the next empty styling chair as cover for hours of listening. Failing that, trapping some VIP (or their significant other or faithful subordinate) under the hairdryer or at the shampoo basin gives one an excellent opportunity to rifle through their purses or coat pockets...\n\nIn more fantastic settings, out-and-out mind-reading might be involved, making spas particularly useful for psychics who need proximity or touch in order to read minds. For more aggressive intelligence operatives, this may lead to Sauna of Death.\n• In Like Flint. The Fabulous Face beauty spa uses special hairdryers to brainwash their female clients into becoming ardent feminists. It then uses them as spies for the organization.\n• A more mundane instance in one Encyclopedia Brown case, where a customer nabbed an important secret from the owners because they thought she couldn't hear them under the hairdryer. Turned out she was deaf to begin with, and read their lips.\n• The finale to Batman had special guest villainess Zsa Zsa Gabor reading billionaire spa-goers' minds with her special \"Eggplant Jelly Vitamin Scalp Massage\".\n• The Bionic Woman: In \"Brain Wash\", Oscar's secretary Peggy Callahan falls victim to a spa with hidden tape recorders and Truth Serum-laced shampoo. For extra points, the guy running the salon is her fiancé.\n• Burn Notice: In \"Hard Bargain\", Michael poses as a hostage negotiator trying to rescue a kidnapped girl. The leader of the kidnapping ring, Reyes, meets him in a massage parlor, which Michael tells him is smart, because it means Reyes knows Michael isn't wearing a wire (or anything besides a towel, for that matter). After Reyes leaves, Mike asks the masseuse if they paid her for the whole hour.\n• Wonder Woman (1975): The episode \"I Do, I Do\" features a spa with mind-reading massages, which the proprietor uses to gain classified information from .\n• In the Ars Magica adventure \"The Sorcerer's Slave\", Byzantium's famous Baths of Zeuxippus are secretly run by an amoral, ambitious mage who spies on the guests for useful information. He's aided in this by an invisible water spirit who can manipulate emotions and read minds. In addition, the Player Characters are expected to disrobe like every other guest, making it quite difficult to keep hidden weapons or equipment.\n• Vampire: The Masquerade \u0096 Bloodlines: The Lotus Blossom spa and massage parlour is a front for the local Tong gang (and, therefore, for ). Given the peepholes and hidden recording equipment in some of the rooms, it's implied that the Tongs engineer compromising situations to use as Blackmail material.\n• The Witcher 3: Wild Hunt: The bathhouse in Novigrad is run by Sigi Reuven, also known as Sigismund Dijkstra, former head of Redanian intelligence. Information is still his preferred currency to exchange for favors. He uses the bathhouse as a meeting ground for the heads of the big four crime syndicates in Novigrad. Before attending a meeting, clothes and weapons are stowed in cubbies in a separate room. When one crime boss breaks away and attacks the bathhouse, Geralt and the other three are forced to fend off the attack in nothing but towels using the clubs Dijkstra keeps in his personal bathing room.\n• Battle Bunnies: Master Varanasi receives Impossible Thief Connie at a sauna in Azkenderan, where he and his bodyguards are naked, except for towels. Connie at first refers to Varanasi as Azkendaren's \"resident Rajland spy\" before correcting herself with \"trade magnate.\" She is charged with absconding a MacGuffin from a covert Kahn force operating in the city's Forbidden Zone. Notably, the sauna is chosen to preclude weapons, yet Connie can produce a blade as if from Hammerspace. The subtext is clear: if Varanasi tries to alter the deal, Connie can and will subtract him, precautions notwithstanding.\n• One episode of Spy Groove involves the two spies investigating a spa that targets fashion models to Capture and Replicate.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/ASpyAtTheSpa", "media_links": ["/pmwiki/pmwiki.php/Film/InLikeFlint", "/pmwiki/pmwiki.php/Literature/EncyclopediaBrown", "/pmwiki/pmwiki.php/Series/Batman1966", "/pmwiki/pmwiki.php/Series/TheBionicWoman", "/pmwiki/pmwiki.php/Series/BurnNotice", "/pmwiki/pmwiki.php/Series/WonderWoman1975", "/pmwiki/pmwiki.php/TabletopGame/ArsMagica", "/pmwiki/pmwiki.php/VideoGame/VampireTheMasqueradeBloodlines", "/pmwiki/pmwiki.php/VideoGame/TheWitcher3WildHunt", "/pmwiki/pmwiki.php/WesternAnimation/SpyGroove"], "non_media_links": ["/pmwiki/pmwiki.php/Main/ChattyHairdresser", "/pmwiki/pmwiki.php/Main/LooseLips", "/pmwiki/pmwiki.php/Main/Telepathy", "/pmwiki/pmwiki.php/Main/PsychicPowers", "/pmwiki/pmwiki.php/Main/SaunaOfDeath", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/CaughtOnTape", "/pmwiki/pmwiki.php/Main/TruthSerum", "/pmwiki/pmwiki.php/Recap/BurnNoticeS1E9HardBargain", "/pmwiki/pmwiki.php/Main/TabletopGames", "/pmwiki/pmwiki.php/Main/AmbitionIsEvil", "/pmwiki/pmwiki.php/Main/EmotionControl", "/pmwiki/pmwiki.php/Main/Telepathy", "/pmwiki/pmwiki.php/Main/PlayerCharacter", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/TheTriadsAndTheTongs", "/pmwiki/pmwiki.php/Main/ChineseVampire", "/pmwiki/pmwiki.php/Main/CaughtOnTape", "/pmwiki/pmwiki.php/Main/HappyEndingMassage", "/pmwiki/pmwiki.php/Main/Blackmail", "/pmwiki/pmwiki.php/Main/Webcomics", "/pmwiki/pmwiki.php/Main/ImpossibleThief", "/pmwiki/pmwiki.php/Main/MacGuffin", "/pmwiki/pmwiki.php/Main/ForbiddenZone", "/pmwiki/pmwiki.php/Main/Hammerspace", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/CaptureAndReplicate"]}