{"title": "Categorism as a Phobia", "content": "It's usually not very funny when a character reeks of prejudice, bigotry, discrimination and so on against a certain category of people. The phenomenon is called racism when it's against a race or ethnic group, homophobia when it's against homosexuals, and so on... but wait a moment! The word \"homophobia\" has \"phobia\" as part of the word! Let's just roll with that, and portray homophobia as if it was an actual clinical phobia. Hilarity Ensues as the character runs around full of irrational fear of homosexuals, Muslims, Christians, transgender people or whatever category of people.note If you want to get technical, the word \"phobia\" has not always meant \"fear of\", it originally was translated as \"fear or hatred of\".\n\nWhen Played for Drama rather than Played for Laughs, deaths and ruined lives are more likely than hilarity to ensue, and mental problems and bigotry get mixed into something deeply disturbing.\n\nWhile this trope can be used on any category of people, it's always easiest when it's a category where a pretty established word for categorism against it ends in the suffix \"-phobia\": Homophobia against homosexuals, Islamophobia against Muslims, and so on. Sure, these words don't indicate a real phobia any more than the word \"mouse-pad\" indicates a pad made of mice, by mice or for mice: it's a matter of etymology, not a matter of real meaning. Still, the words having \"phobia\" in them open up for some fancy wordplay and may also help preserve the Willing Suspension of Disbelief. This goes both ways: a Noble Bigot or similar who regard homosexuals as lesser people who should be second class citizens could get the defense that he couldn't possibly be homophobic - after all, he's not afraid of gay people. This frequently verges into Suspiciously Specific Denial.\n\nSee also The Mentally Disturbed and Hollywood Personality Disorders. Compare Black and White Insanity and Troubled Sympathetic Bigot. Compare Internalized Categorism and Sex Is Evil, and I Am Horny, where the character has an aversion against himself because of his idea about what it mean to belong to a certain category or have certain desires.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/CategorismAsAPhobia", "media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/ComicBook/BitchyBitch", "https://tvtropes.org/pmwiki/pmwiki.php/ComicBook/ChickTracts", "https://tvtropes.org/pmwiki/pmwiki.php/Film/Borat", "https://tvtropes.org/pmwiki/pmwiki.php/Series/LawAndOrderSpecialVictimsUnit", "https://tvtropes.org/pmwiki/pmwiki.php/Series/DoctorWho", "https://tvtropes.org/pmwiki/pmwiki.php/WesternAnimation/SouthPark"], "non_media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/Main/HilarityEnsues", "https://tvtropes.org/pmwiki/pmwiki.php/Main/PlayedForDrama", "https://tvtropes.org/pmwiki/pmwiki.php/Main/PlayedForLaughs", "https://tvtropes.org/pmwiki/pmwiki.php/Main/WillingSuspensionOfDisbelief", "https://tvtropes.org/pmwiki/pmwiki.php/Main/NobleBigot", "https://tvtropes.org/pmwiki/pmwiki.php/Main/SuspiciouslySpecificDenial", "https://tvtropes.org/pmwiki/pmwiki.php/Main/TheMentallyDisturbed", "https://tvtropes.org/pmwiki/pmwiki.php/Main/HollywoodPersonalityDisorders", "https://tvtropes.org/pmwiki/pmwiki.php/Main/BlackAndWhiteInsanity", "https://tvtropes.org/pmwiki/pmwiki.php/Main/TroubledSympatheticBigot", "https://tvtropes.org/pmwiki/pmwiki.php/Main/InternalizedCategorism", "https://tvtropes.org/pmwiki/pmwiki.php/Main/SexIsEvilAndIAmHorny", "https://tvtropes.org/pmwiki/pmwiki.php/ComicStrip/Pondus", "https://tvtropes.org/pmwiki/pmwiki.php/Main/BrainBleach", "https://tvtropes.org/pmwiki/pmwiki.php/Main/ManufacturingVictims", "https://tvtropes.org/pmwiki/pmwiki.php/Main/HereWeGoAgain", "https://tvtropes.org/pmwiki/pmwiki.php/Main/PlayedForDrama", "https://tvtropes.org/pmwiki/pmwiki.php/Main/UncannyValley", "https://tvtropes.org/pmwiki/pmwiki.php/Main/KillAllHumans", "https://tvtropes.org/pmwiki/pmwiki.php/Main/VillainProtagonist", "https://tvtropes.org/pmwiki/pmwiki.php/Main/ScaryBlackMan", "https://tvtropes.org/pmwiki/pmwiki.php/Main/TheSoulless", "http://en.wikipedia.org/wiki/Gay_panic_defense"]}