{"title": "But That I Would Believe", "content": "Snively: Well, what are you waiting for? We STILL have a job to do! \n\nAmy Rose: I know, but I'm finding it hard to factor in the TRUST into this equation. \n\nSnively: Would it help if I said I was only doing this to get revenge against A.D.A.M. and didn't give a rat's behind about the rest of you? \n\nAmy Rose: ... yeah! THAT you could sell me! Well, what are you waiting for? We STILL have a job to do!I know, but I'm finding it hard to factor in the TRUST into this equation.Would it help if I said I was only doing this to get revenge against A.D.A.M. and didn't give a rat's behind about the rest of you?... yeah! THAT you could sell me!\n\nSuppose Alice, whether reasonably or unreasonably, distrusts Bob, who in turn realizes that convincing Alice to trust him as a person would be an uphill battle if even possible.\n\nBob decides instead to give some explanation that he thinks Alice is more likely to believe, about why he would act \"as if\" he were trustworthy, or at least in a way that wouldn't betray Alice, for whatever scenario such convincing might be needed for.\n\nDespite what one would expect from the concept, these explanations, though they may tend towards selfish motives, are not limited to them. The issue for a lack of trust could be Bob's loyalty to Charlie, for example. Over all, the point is that the explanation would have to be something Bob has reason to expect Alice to be more likely to believe.\n\nContrast Arbitrary Skepticism. Also, Contrast Sarcastic Confession when they directly tell the truth, knowing the other will not believe them.\n\nTruth in Television, especially in some economics-related debates.\n• The page-quote dialogue refers to Archie Comics' Sonic the Hedgehog issue #152, when Snively wanted Amy's help in setting up an electromagentic pulse to stop the nano-robots who would otherwise dominate life on the planet.\n• In this Vexxarr strip, Vexxarr is suspicious of why he'd be given free reign to roam Earth and doesn't buy the mutual benefit/respect for alien life reasons. He does accept that the humans just don't care because they consider him harmless.\n• The song \"Li'l Red Riding Hood\" by Sam The Sham And The Pharaohs. I'm gonna keep my sheep suit on, until I'm sure that you've been shown. That I can be trusted walkin' with you alone. Owooooo! Little Red Riding Hood, I'd like to hold you if I could. But you might think I'm a big bad wolf so I won't. Owooooo!\n• In Predatory Wicked Moon by Lukin a brigand volunteered to join the forces hunting another brigand because that guy stole his mistress. A present official personally acquainted with the lady in question answers that he's vetoed, because she has an attitude of a desert viper and isn't a valid reason for risking one's neck. The brigand is accepted upon confessing that in light of mentioned qualities, he wants to remove danger of vengeance for ditching her.\n• Constantly spoofed in Get Smart. \"Would you believe...\"\n• Subverted in The Princess Bride, where Inigo tries to convince Miracle Max to revive the man in black. After Miracle Max identifies Inigo's first story about the man in black's wife being a cripple and his children starving, Inigo confesses that he needs the man's help to avenge his murdered father. Miracle Max tell him the first story was better.\n• During a tense scene in thetrailer for the fake Minesweeper movie, the instructor tries to get a recruit to admit his real motives for sweeping mines. Drill Sergeant: Why are you really here? \n\nSoldier: I want to make this land safe. \n\nDrill Sergeant: Why are you here, soldier? \n\nSoldier: I'm here because I'm bored!", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/ButThatIWouldBelieve", "media_links": ["/pmwiki/pmwiki.php/ComicBook/ArchieComicsSonicTheHedgehog", "/pmwiki/pmwiki.php/ComicBook/ArchieComicsSonicTheHedgehog", "/pmwiki/pmwiki.php/Webcomic/Vexxarr", "/pmwiki/pmwiki.php/Series/GetSmart", "/pmwiki/pmwiki.php/Film/ThePrincessBride", "/pmwiki/pmwiki.php/VideoGame/Minesweeper"], "non_media_links": ["/pmwiki/pmwiki.php/Main/AliceAndBob", "/pmwiki/pmwiki.php/Main/ArbitrarySkepticism", "/pmwiki/pmwiki.php/Main/SarcasticConfession", "/pmwiki/pmwiki.php/Main/TruthInTelevision", "http://www.vexxarr.com/archive.php?seldate=020205", "/pmwiki/pmwiki.php/Main/SamTheShamAndThePharaohs", "/pmwiki/pmwiki.php/Main/RunningGag", "/pmwiki/pmwiki.php/Main/InflationaryDialogue", "https://youtu.be/LHY8NKj3RKs", "/pmwiki/pmwiki.php/Main/RealTrailerFakeMovie"]}