{"title": "Tech Points", "content": "So you're playing an RPG. You've just leveled up, and you think to yourself, \"Hey! Now I can use the Super Ultra Mega Death Not Actually Useful Sword Spin Attack!\" But when you look at the newly-leveled character's skill set, you find the move is still locked. All right, it seems that you're not at the right level yet. So you fight a battle or two, then a message pops up that you've unlocked a new skill. \"But wait,\" you might think, \"I didn't level up, so how could I have unlocked the skill?\"\n\nWell, my friend, you didn't need Experience Points to unlock that skill, you needed Tech Points. Tech Points are similar to Experience Points, but instead of pushing your character towards the overall boost of a level-up, they contribute only to specialized skills.\n\nIn some cases, you may have to spend the Tech Points to level up a skill, to make it more powerful, cost less Mana, recharge faster, etc.\n• In Battlefield: Bad Company 2 and Battlefield 3, there are standard Experience Points which goes to increasing your level which gives you weapons and specializations all classes can use. Every class and vehicles in general have their own separate Tech Points bar needed to unlock new gadgets, specializations and weapons for to be used for that class of Tech Points.\n• Call of Duty games with the Create-a-Class system do similar: experience points go towards increasing rank and unlocking weapons, perks, and whatnot. The weapons and perks themselves have their own points systems that go towards unlocking more attachments or upgrading a perk to its Pro version (except in Call of Duty: Black Ops, which instead has the player spend CODPoints gained alongside the normal experience points to unlock attachments).\n• The first two BioShock games have ADAM, the sea slug extract Rapture revolves around. Its main use to the player is as currency to buy new plasmids, tonics and health/EVE upgrades.\n• Crysis 2 has separate bars for the main level and the three Nanosuit modes, with their own unlocks.\n• This is a common MMORPG mechanic, with skills arranged in 'trees' and the player allocating points.\n• Billy Vs SNAKEMAN has Jutsu XP, which are primarily used to learn jutsu techniques. BvS also has ZP in the Zombja side area, to learn Z-Skills; and MJXP in the Mahjong minigame to learn new ways to cheat the NPC opponents.\n• In Lost Souls MUD, skill advancement is determined by experience gained with that skill through practice and training.\n• DC Universe Online has both normal XP (which, on level up, gives you alternately a Power or Skill point) and Feat Points, which award a free Skill point every 100 you get. While levels are capped normally, Feats Points are only limited by how many of the (non-repeatable) Feats you can achieve.\n• Ragnarok Online separates experience into 'Base' and 'Job' experience and monsters will give both separately. Job experience governs the skills while base experience governs stats of the character. Also while quests often give base experience virtually none of them give job experience making it a bit harder to acquire.\n• In NetHack, you need both \"skill slots\" (gained through Experience Points) and a certain number of successful uses of the item/spell in question to advance a skill.\n• Chrono Trigger is the Trope Namer. In this case, while characters outside your party would get XP, they wouldn't get Tech Points.\n• Xenosaga has the spend tech points to level up version. In fact, it separates them into Experience, Skill Points (for passive skills), Ether Points (for magic), and Tech Points.\n• XS2 had an annoying variation where you needed both Skill Points AND Class Points to unlock new skills.\n• The Legend of Dragoon has a nested Tech Point system of sorts: Gaining levels unlocks each of the characters' Additions (timed-button-press attack sequences) except the final one, which must be earned by mastering all of the character's previous skills. Meanwhile, extending the duration of Dragoon transformations is linked not to this process, but rather to the amount of Spirit Points generated with each attack (or special equipment, or used items, and so on). Additions are generally split between \"high damage yield\" and \"high SP yield,\" except for characters who flounder with both because their Level 5 Dragoon Magic is so insanely powerful.\n• The X-Men Legends games and Marvel Ultimate Alliance use the 'Distribute points at level-up' variant for skills (Legends also does it for stats). It can be quite intimidating trying to distribute points for characters you haven't used in a long time. Ultimate Alliance also allows you to redistribute skill points at will.\n• MUA doesn't give them out at every level, but has a few that can be accessed without needing to level up (such as mastering someone's training CD mission, or putting Iron Man in your team and activating the console in his lab).\n• Appears in many Final Fantasy games with a job system. Final Fantasy V gave each job a fixed progression of abilities that are learned with AP. Final Fantasy Tactics let the player decide which abilities to learn for each job.\n• Final Fantasy XII has License Points that make more spells and gear usable, which all characters receive from battle (only active characters receive XP).\n• Final Fantasy V has Ability Points (ABP) that unlock skills particular to that job class, including the skill that's already permanently equipped except for a Monk's Kick, for some reason . Once a skill is unlocked, it can be equipped to any job.\n• Final Fantasy VI gives you magic based on which Magicite a character has, but as they also affected stat growth, it was best to level up as little as possible while gaining AP.\n• Final Fantasy VII allows you to \"level up\" your Materia; when a materia gets to max level, it spawns a duplicate so you can share it out around your party. This takes a long damn time, though. Also, a few materia do not level up, and so will never copy themselves.\n• The only ones are Underwater (useless for the most part), Enemy Skill (you get more than you can use at a time anyway), and the Master materias (which, after a ton of Level Grinding, can be obtained in bulk by trading mastered materia of the corresponding type, and those materia do replicate.)\n• Final Fantasy VIII had a minor version; your Guardian Forces gained AP after every battle and would gain new skills for it. If you know what you're doing, this can give you the ability to destroy the game's difficulty curve.\n• Final Fantasy Tactics combines Job Points with a Point Build System; the sequels changed things so that you only earn AP after a battle and the techniques are learned from your equipment when in a certain character class.\n• Final Fantasy X and Final Fantasy XIII use Tech Points in place of Experience Points; they're used for increasing stats in addition to learning new abilities in both games, while your characters don't have true \"levels\" in either.\n• The literal \"tech points\" in XIII function more like Mana for powerful spells (where as regular magic doesn't cost any)\n• Final Fantasy X-2 lets you select a specific ability to gain, each of which has its own Ability Points requirement. You get one point for using any technique (that's not Attack or Item) in battle. Gaining new abilities unlocks more abilities for you to learn as well (for example, a Songstress cannot learn Sleepy Shuffle until she's learned Samba of Silence).\n• Final Fantasy IX deployed perhaps the most complicated twist of any of them. Each character has various passive skills that can only be equipped permanently once mastered via TP accrual. Of course, once learned, they still have to be equipped, using a third set of points that provides a Cap on the number of skills you can use at one time. Dissidia Final Fantasy used a similar system; in IX, you gained new skills by wearing new equipment (providing, of all things, an incentive for Level Grinding), but in D:FF you pick them up naturally via level progression and they cost more \"inventory points\" to deploy when non-mastered.\n• Final Fantasy Tactics Advance uses a similar skill learning system, but instead of using an additional pool of points to equip them, they are tied to a specific grouping of skills (such as Fighter Tech or Black Magic), two of which can be assigned to any character.\n• Granblue Fantasy: Once you've reached the level cap, or 5★ uncap of your characters (or reached Level 20 for a class of the captain), your experience points will count towards the Extended Mastery bar. Filling this up will provide you with Extended Master Points (or Zenith in the Japanese version), which can then be spent on character-specific perks like stat increases to ATK, HP, Def, Critical Hit Rate, Elemental Attack, Dodge, or unique EMP Skills.\n• Appears in the Grandia series, with separate experience for character levels, magic, and skills.\n• Shows up in DS RPG Nostalgia, which had a sphere-grid like system.\n• The two Digital Devil Saga games have Atma Points, which are used to unlock skills.\n• Link points accumulated by your dream eater allies in Kingdom Hearts 3D, which are used to unlock new commands and abilities on their link grids.\n• The World Ends with You has this in that you get 'PP' pin points to level up your pins to get higher attack power, and sometimes they evolve into better more powerful pins.\n• There are three different types of Pin Points, depending on how the tech points were obtained (that is, battling, having the DS closed, or using Mingle/playing Tin Pin) and they do affect how the pins evolve.\n• Using a type of gun in Borderlands (SMG, Shotgun, Pistol etc.) gives you points towards proficiency with that gun type. When you gain a proficiency level, it boosts either reload time, accuracy or power for all guns of that type, as opposed to the generic level which lets you choose new skills.\n• The Elder Scrolls\n• Throughout much of the series, you gain skill points toward increasing your skills by successfully using them. (For example, if you sneak around a lot, your Sneak skill will increase. Cast Destruction class spells and your Destruction skill will increase. Hit things with a sword and your Blade/Long Blade/One-Handed skill will increase. Etc.) After 10 increases of your major/minor skills (set during character creation at the beginning of the game), you will gain a Character Level. This allows you to increase a few of your Attributes (Strength, Intelligence, etc.), with multipliers based on the Attributes which govern the skills you leveled up. (For example, if you increased your Heavy Armor skill 5 times, you'll have a 5x multiplier for the Endurance skill which governs it.) Unfortunately, if you aren't careful to max out your multipliers and level inefficiently, you may end up experiencing Empty Levels (which, in games with extreme Level Scaling like Oblivion, can be deadly).\n• Skyrim makes some radical changes to the series' standard system for the first time. Leveling up by increasing skills remains the same, however, Attributes are removed. Instead, when you level up, you choose to give a 10 point increase to your Health, Magicka, or Fatigue. Further, Skyrim borrows the idea of \"Perks\" from its Bethesda sister series, Fallout. For every level, you may choose one Perk in any of the skill trees which will further increase your proficiency in that skill. The higher your skill score in that skill tree, the more perks you have access to select.\n• In Deadly Sin 2, you gain one Skill Point each time you level up, but you also gain them by using Magic Node Shards and completing quests.\n• Dragon Quest VIII, Dragon Quest IX, and the two Dragon Quest Monsters: Joker games have \"skill points\", which are earned every few levels and can be spent on a variety of skill categories, with skills unlocking at certain thresholds of skill point expenditures.\n• Vampire: The Masquerade \u0096 Bloodlines implements the Point Build System of its tabletop source material by rewarding the player with character points for quests and miscellaneous objectives instead of XP. These points can then be spent to learn or level up the PC's skills and attributes.\n• In Adventure Bar Story, characters gain element points from defeating enemies. Once they reach certain thresholds of points, they learn a new skill. These points and mats (ingredients) are the only reward for defeating enemies. Regular experience points are only earned by eating.\n• Disgaea's skill system works this way, with the possibility of nigh-infinitely leveling up individual skills.\n• Some Super Robot Wars titles (including the Super Robot Wars Original Generation titles that are the only ones to be released outside Japan) have a Pilot Point system where shooting down enemies earns PP that can be spent on skills and improved performance in various terrains.\n• Fire Emblem Heroes: Characters obtain new weapons and learn new skills by spending Skill Points. Each character has their own SP, which is increased by defeating enemies, leveling up, merging with duplicates, or for healers, healing allies.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/TechPoints", "media_links": ["/pmwiki/pmwiki.php/VideoGame/Battlefield", "/pmwiki/pmwiki.php/VideoGame/BattlefieldBadCompany", "/pmwiki/pmwiki.php/VideoGame/Battlefield3", "/pmwiki/pmwiki.php/VideoGame/CallOfDuty", "/pmwiki/pmwiki.php/VideoGame/CallOfDutyBlackOps", "/pmwiki/pmwiki.php/VideoGame/BioShock", "/pmwiki/pmwiki.php/VideoGame/Crysis", "/pmwiki/pmwiki.php/VideoGame/BillyVsSNAKEMAN", "/pmwiki/pmwiki.php/VideoGame/LostSoulsMUD", "/pmwiki/pmwiki.php/VideoGame/DCUniverseOnline", "/pmwiki/pmwiki.php/VideoGame/RagnarokOnline", "/pmwiki/pmwiki.php/VideoGame/NetHack", "/pmwiki/pmwiki.php/VideoGame/ChronoTrigger", "/pmwiki/pmwiki.php/VideoGame/Xenosaga", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfDragoon", "/pmwiki/pmwiki.php/VideoGame/XMenLegends", "/pmwiki/pmwiki.php/VideoGame/MarvelUltimateAlliance", "/pmwiki/pmwiki.php/Franchise/FinalFantasy", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyV", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyTactics", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyIII", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyXII", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyV", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyVI", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyVII", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyVIII", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyTactics", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyX", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyXIII", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyX2", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyIX", "/pmwiki/pmwiki.php/VideoGame/DissidiaFinalFantasy", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyTacticsAdvance", "/pmwiki/pmwiki.php/VideoGame/GranblueFantasy", "/pmwiki/pmwiki.php/VideoGame/Grandia", "/pmwiki/pmwiki.php/VideoGame/Nostalgia", "/pmwiki/pmwiki.php/VideoGame/DigitalDevilSaga", "/pmwiki/pmwiki.php/VideoGame/KingdomHearts3D", "/pmwiki/pmwiki.php/VideoGame/TheWorldEndsWithYou", "/pmwiki/pmwiki.php/VideoGame/Borderlands", "/pmwiki/pmwiki.php/Franchise/TheElderScrolls", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsIVOblivion", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsVSkyrim", "/pmwiki/pmwiki.php/Creator/Bethesda", "/pmwiki/pmwiki.php/VideoGame/Fallout", "/pmwiki/pmwiki.php/VideoGame/DragonQuestVIII", "/pmwiki/pmwiki.php/VideoGame/DragonQuestIX", "/pmwiki/pmwiki.php/VideoGame/DragonQuestMonsters", "/pmwiki/pmwiki.php/VideoGame/VampireTheMasqueradeBloodlines", "/pmwiki/pmwiki.php/TabletopGame/VampireTheMasquerade", "/pmwiki/pmwiki.php/VideoGame/AdventureBarStory", "/pmwiki/pmwiki.php/Franchise/Disgaea", "/pmwiki/pmwiki.php/VideoGame/SuperRobotWars", "/pmwiki/pmwiki.php/VideoGame/SuperRobotWarsOriginalGeneration", "/pmwiki/pmwiki.php/VideoGame/FireEmblemHeroes"], "non_media_links": ["/pmwiki/pmwiki.php/Main/RPG", "/pmwiki/pmwiki.php/Main/AwesomeButImpractical", "/pmwiki/pmwiki.php/Main/ExperiencePoints", "/pmwiki/pmwiki.php/Main/PointBuildSystem", "/pmwiki/pmwiki.php/Main/FirstPersonShooter", "/pmwiki/pmwiki.php/Main/ExperiencePoints", "/pmwiki/pmwiki.php/Main/TechPoints", "/pmwiki/pmwiki.php/Main/TechPoints", "/pmwiki/pmwiki.php/Main/AppliedPhlebotinum", "/pmwiki/pmwiki.php/Main/MMORPG", "/pmwiki/pmwiki.php/Main/Roguelike", "/pmwiki/pmwiki.php/Main/RolePlayingGame", "/pmwiki/pmwiki.php/Main/TropeNamer", "/pmwiki/pmwiki.php/Main/ChargeMeter", "/pmwiki/pmwiki.php/Main/MagikarpPower", "/pmwiki/pmwiki.php/Main/GreenRocks", "/pmwiki/pmwiki.php/Main/PowersAsPrograms", "/pmwiki/pmwiki.php/Main/LevelGrinding", "/pmwiki/pmwiki.php/Main/LevelGrinding", "/pmwiki/pmwiki.php/Main/SummonMagic", "/pmwiki/pmwiki.php/Main/GuideDangIt", "/pmwiki/pmwiki.php/Main/GameBreaker", "/pmwiki/pmwiki.php/Main/PointBuildSystem", "/pmwiki/pmwiki.php/Main/ExperiencePoints", "/pmwiki/pmwiki.php/Main/Mana", "/pmwiki/pmwiki.php/Main/Cap", "/pmwiki/pmwiki.php/Main/LevelGrinding", "/pmwiki/pmwiki.php/Main/CharacterLevel", "/pmwiki/pmwiki.php/Main/EmptyLevels", "/pmwiki/pmwiki.php/Main/LevelScaling", "/pmwiki/pmwiki.php/Main/PointBuildSystem", "/pmwiki/pmwiki.php/Main/TurnBasedStrategy"]}