{"title": "Runaway Hideaway", "content": "A Runaway Hideaway is a place The Runaway character can call home (either temporarily or permanently).\n\nThe form it takes will vary wildly depending on the story's genre, setting, and plot. It can range from an abandoned city to a campsite in the woods, though it doesn't necessarily need to be a desolate or abandoned landscape. Some runaways go to orphanages or the homes of trusted relatives (if they have any). It may even be a brothel or the home of a kind stranger. There are several main subtypes of this trope:\n\nIn Real Life this may not be the smartest course of action, as your guardians would presumably look for you here. However, if the relatives are upstanding, they might be able to help if the runaway is escaping abuse. (See Staying with Friends\n\nThe runaway runs to a local shelter or orphanage. Abused or not, this is usually a better option than Type 2.\n\nType 2 - No place to go\n\nAn especially naïve character may run away from home and into the Big Scary World without having a plan. This type is the most likely to end up in a stranger's house, which can lead to a bad end if said stranger turn out to be a crazy pervert or Serial Killer.\n\nType 3 - Off to the Smoke\n\nThe runaway has heard rumors of a place where runaways of all shapes and sizes can take shelter, and decides this is the place to try their luck. If people are disappearing in the story, they may end up here. Characters may run here just for yuks, to see if the Urban Legend is true.\n\nOne weirdly common place for runaways to end up is the circus, possibly because the circus naturally lends itself to being made up of a Ragtag Bunch of Misfits. If it turns out to be a Circus of Fear, the runaway may be convinced to return home.\n\nType 5 - We can be spared (thank God)!\n\nWhether you're seeking religious freedom in a foreign country or you're the Last of Your Kind, this type is the place where you can live without bloodshed, worry or war! Ironically, these types are prone to getting invaded or involved in war no matter how many barriers they put up...\n\nMake a Runaway Hideaway can help you create your character's new home.\n• Arguably Kaede House in Elfen Lied. Mayu is an abused runaway, Lucy/Nyu is an orphan runaway, Nana is taken there by Mayu after Kurama let her escape. Fits Type 5 for multiple reasons.\n• Yoshitaka's house in He Is My Master. Fits Type 2 because Izumi and her sister ran away without much of a plan.\n• In Innocents Shounen Juujigun, Isabelle takes refuge in , while hiding from her previous home as well as the Children's Crusade.\n• The teenage characters in Runaways first hide out in a partially collapsed hotel (nicknamed \"The Hostel\") and then in one of their parent's old supervillain lairs under the La Brea Tar Pits\n• In The Tale of One Bad Rat there is first the squat in London where Helen stays with several other vagrants, teenagers on the run, and other people are staying, and then the pub Herdwick Arms, where the owners take her in and give her a job.\n• Nightwing discovers a large maze like fort made of tires and other trash that housed runaways where the younger kids are being required to steal to \"pay rent\". The whole place ends up on fire and Dick helps rescue the kids that don't make it out on their own. The boy Dick was looking for that led him to discover the hideaway ends up adopted by a bartender who lives in the same building as him.\n• In Relative Heroes the four Weinberg kids and the youngest's babysister (who is fleeing from a marriage contract with an Olympian that her mom set up for her as an infant) travel across the country in their deceased parents' RV as they try to prevent their remaining family from being split up by social services and eventually are able to take refuge with their grandfather after Superman intervenes.\n• The apple barrel in the MLP:FiM fan fiction Our True Colors.\n• The Smoke in Uglies, for which Type 3 is named.\n• The Sanctuary in The Heir Chronicles fits type 5—includes the barrier too!\n• The abandoned movie theater in The Thief Lord which a small group of street kids have made into their home.\n• Greentree in The Outlaws of Sherwood is a Type 3, much to the pragmatic Robin Hood's dismay.\n• The Shadow Children are looking for a Type 3 or 5 since their very existence is punishable by death. Most of them end up hiding where they can, or joining together in a revolution to overthrow the government that is trying to kill them.\n• Type 2: The Boxcar Children run away with no place in mind and eventually discover their boxcar by chance.\n• In From the Mixed-Up Files of Mrs. Basil E. Frankweiler Claudia drags her brother along to run away to the Metropolitan Museum of Art where they have to hide in the bathrooms from security and dig through the fountains for change.\n• In My Side of the Mountain Sam runs away with detailed plans to live off the land in the Catskill Mountains and constructs his own hideaway in the fire burned out hollow of a large old tree.\n• Huckleberry Finn runs away to the river alongside Jim.\n• Interestingly done for purposes of Character Development in Redeeming Love. Angel runs away from her husband three times: firstly, to a brothel; secondly, to a gold mining town where she finds works as a cook; and thirdly, to the same town where she sets up a ministry to help girls who were sold into prostitution and reintegrate them into society. This is important because it shows how her character has changed over the novel's course: at first, she's so broken she can't function in society, or learn how to be anything but self-destructive. The second time, she manages to be something better than an object for others' gratification, but she still isn't happy or making something of herself. The third and final time, she is able to harness the love shown her by her husband and reach out to others, and in such a way that it remains effective even after she returns home and is finally Happily Married.\n• Type 3: In Charby the Vampirate Leonard's \"pack\" of welves (cursed elves) are all runaways who had to or chose to leave their family's packs that all live in a cabin he found. He is welcoming of new members if he comes across people in need even though they are stuck stealing to survive.\n• Angelica running away from home to her cousin Tommy's house in Rugrats fits type 1.\n• Ty Lee of Avatar: The Last Airbender\n• Ty Lee runs away from her oppressive home life and finds solace in the circus.\n• Jet, who became a Rebel Leader in charge of a La Resitance movement.\n• The Fairly Oddparents:\n• In the special, Channel Chasers, Timmy temporarily runs away from his parents inside of his television where he hops from channel to channel.\n• One episode proper deals with Timmy feeling neglected and deciding to run away with the help of his fairies, who poof him to a carnival to stay at, making this a variant of Type 4. Timmy even mistakes it for a circus at first, which Cosmo says is wrong because \"Circuses have child labor laws\" while carnivals \"barely have to follow the laws of physics.\" Turns out kids using magic to run away is common enough that multiple other fairies made the carnival so the kids would have somewhere to go until they decided to return.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/RunAwayHideAway", "media_links": ["/pmwiki/pmwiki.php/Manga/ElfenLied", "/pmwiki/pmwiki.php/Manga/HeIsMyMaster", "/pmwiki/pmwiki.php/Manga/InnocentsShounenJuujigun", "/pmwiki/pmwiki.php/ComicBook/Runaways", "/pmwiki/pmwiki.php/ComicBook/TheTaleOfOneBadRat", "/pmwiki/pmwiki.php/ComicBook/Nightwing", "/pmwiki/pmwiki.php/ComicBook/RelativeHeroes", "/pmwiki/pmwiki.php/ComicBook/Superman", "/pmwiki/pmwiki.php/WesternAnimation/MyLittlePonyFriendshipIsMagic", "/pmwiki/pmwiki.php/Literature/Uglies", "/pmwiki/pmwiki.php/Literature/TheHeirChronicles", "/pmwiki/pmwiki.php/Literature/TheThiefLord", "/pmwiki/pmwiki.php/Literature/TheOutlawsOfSherwood", "/pmwiki/pmwiki.php/Literature/ShadowChildren", "/pmwiki/pmwiki.php/Literature/TheBoxcarChildren", "/pmwiki/pmwiki.php/Literature/FromTheMixedUpFilesOfMrsBasilEFrankweiler", "/pmwiki/pmwiki.php/Literature/MySideOfTheMountain", "/pmwiki/pmwiki.php/Literature/AdventuresOfHuckleberryFinn", "/pmwiki/pmwiki.php/Literature/RedeemingLove", "/pmwiki/pmwiki.php/Webcomic/CharbyTheVampirate", "/pmwiki/pmwiki.php/WesternAnimation/Rugrats", "/pmwiki/pmwiki.php/WesternAnimation/AvatarTheLastAirbender", "/pmwiki/pmwiki.php/WesternAnimation/TheFairlyOddparents", "/pmwiki/pmwiki.php/WesternAnimation/ChannelChasers"], "non_media_links": ["/pmwiki/pmwiki.php/Main/TheRunaway", "/pmwiki/pmwiki.php/Main/ThisBedOfRoses", "/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/Main/StayingWithFriends", "/pmwiki/pmwiki.php/Main/SerialKiller", "/pmwiki/pmwiki.php/Main/UrbanLegend", "/pmwiki/pmwiki.php/Main/RagtagBunchOfMisfits", "/pmwiki/pmwiki.php/Main/CircusOfFear", "/pmwiki/pmwiki.php/Main/LastOfHisKind", "/pmwiki/pmwiki.php/SoYouWantTo/MakeARunAwayHideAway", "/pmwiki/pmwiki.php/Main/NeedsWikiMagicLove", "/pmwiki/pmwiki.php/Main/Anime", "/pmwiki/pmwiki.php/Main/Manga", "/pmwiki/pmwiki.php/Main/ComicBooks", "/pmwiki/pmwiki.php/Main/FanWorks", "/pmwiki/pmwiki.php/Fanfic/OurTrueColors", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/CharacterDevelopment", "/pmwiki/pmwiki.php/Main/HappilyMarried", "/pmwiki/pmwiki.php/Main/Webcomics", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/RebelLeader", "/pmwiki/pmwiki.php/Main/LaResitance"]}