{"title": "You Make Me Sick", "content": "This is a very popular Stock Phrase when it comes to a character's moral standards. Usually, it's said in a situation where someone is about to do / did something so terrible or so disgusting or just purely immoral that the other characters just can't hold their tongues.\n\nDespite having a clear line when to say it, the themes and seriousness often change depending on how light or dark the story is. If a hero says it to a villain, it's used to show how monstrous the villain is, but a villain can also say it to the hero, particularly if the latter has done something un-heroic. If a villain says it to another villain, then Even Evil Has Standards, and when a Mook says it to the Big Bad, a Heel\u0096Face Turn is a high possibility. Can also be played for laughs, but not very often.\n\nOther variations are \"You sicken me.\", \"You are disgusting.\", and numerous others.\n\nDon't confuse with You Make Me Sic. Compare with Everyone Has Standards, Even Evil Has Standards, This Is Unforgivable!, Moral Event Horizon, You Monster!, as well as I'm Going to Hell for This. See also There Should Be a Law.\n• In Fullmetal Alchemist, Pride gets this from of all people. In this case, he invokes it because Pride does the one thing that the accuser cannot stand: betraying his own beliefs. : Eh, well, if you had just stuck to your convictions and fought, I wouldn't have done anything. But in the same breath that you boasted of your \"Pride as a Homunculus,\" you ran screaming to steal the flesh of one of the humans you look on as inferior to escape your predicament. You are... hideous.\n• In the dub of Yu-Gi-Oh! season four (the anime-only Orichalcos arc), Yami Yugi says this to Dartz after a Kick the Dog moment.\n• Similar words spoken in Angel Cop following accusations of the titular protagonist being brainwashed.\n• President David Palmer says this in \"Back Where I Belong,\" a song from a fan-made musical version of the second season of 24 Sherry Palmer: Back where I belong, isn't that a kick? / I'm the mother of your children, after all.\n• Inverted in the Bleach fanfic series Heirverse with regards to Jac's view of Aizen for his human weakness and sentiment .\n• A Knight's Tale as Inquisitor: This is Arturia's reaction towards Lord Seeker Lucius's \"The Inquisition is nothing!\" speech from canon and has no problem saying this to his face.\n• Commissioner Gordon says this to The Joker in The Dark Knight.\n• Not a word to word example, but Joker says following line to Batman. Joker: You let five people die. Then you let Dent take your place. : You let five people die. Then you let Dent take your place. Even to a guy like me , that's cold.\n• In Police Academy, Mahoney, looking to get tossed out, has the perfect comeback to a training sergeant to this line: \"Thank you sir, I make everybody sick.\"\n• In Isle of Dogs, Chief says this to the pack of dogs regarding their apparent lack of courage. Chief: You all make me sick! ( : You all make me sick! ( pukes to the side ) I've seen cats with more balls than you dogs!\n• Dumbledore, of all people, says this in Harry Potter and the Deathly Hallows as Snape begs him to save Lily Potter from Voldemort . They can die, as long as you have what you want? You disgust me. You do not care, then, about the deaths of her husband and child?\n• Oddly, in Sherlock Holmes' brief Take That! review of Monsieur Lecoq, the 1868 detective novel by Émile Gaboriau: \"That book made me positively ill.\"\n• An interesting case in the Buffy the Vampire Slayer episode \"Who Are You?\", when Buffy and Faith switch bodies. Faith in Buffy's body fights Buffy in Faith's body, repeatedly calling her disgusting and murderous; she's really saying it about herself.\n• A humorous (all the more so for having serious consequences) Orange And Blue Morality example in Star Trek: Deep Space Nine between Quark (a resident Ferengi on the base; they wear Greed Hats) and Brunt (a Ferengi government representative) who hates Quark and accuses him of being a philanthropist. After Brunt exclaims \"you give your employees vacation?\" Quark backpedals, saying they have to pay into a fund for it, but Brunt has heard enough and replies with a scenery-chewing \"You dis...GUST me!\"\n• On an episode of The Odd Couple (1970-1975) Felix puts Oscar on the stand, ostensibly to help him, then turns on him, questions him viciously and then screams \"You make me sick! Get off the stand!\"\n• Monty Python's Flying Circus: The aeroplane flight instructor who is suspended in the air with wires instructs his student to stand on the desk, flap his arms then jump. He plummets to the floor: Instructor: Wrong! Wrong! You're no bloody good! You make me sick! You weed!\n• The chorus of \"U Stink But I (Heart) You\" by Mucky Pup: You make me sick. You really stink, girl. You make me sick... but I love you.\n• \"You Make Me Sick\" by P!nk\n• Older Than Feudalism: This appears in a surviving fragment of Plautus' Frivolaria, translating as \"The man was a bilious attack to me, an ague, a cough, a dropsy.\"\n• At one point of Final Fantasy Tactics, essentially says this to Dycedarg when Dycedarg tells him to kill his brother (Ramza) if he refuses to comply to their demands . still decides to go through with the mission anyways, and all.\n• In The Nostalgia Critic's Casper review, Critic makes a disturbing joke about teenage pregnancies and abortions in the presence of Chaotic Evil Casper. Casper: *Looks wide-eyed and with dropped jaw* Whoa... Critic: Okay, that was slightly disturbing Critic: A little dark but maybe too far... okayokayokay.\n• In the Joueur du Grenier's review of Captain Planet, one guy is seen giving his cousin drugs. Fred wonders aloud why anyone would their pretty, blonde cousin knockout drugs, followed by a few seconds of excruciatingly uncomfortable silence, followed by Fred slowly stating \"You people are sick\".\n• Shows up in Adventure Time. The Ice King makes Gunther stand in the corner. When he lays down, Ice King reminds him that he said stand in the corner. Gunther just shuffles upward until he's leaning against the wall. Ice King tells him that he makes him sick.\n• Also done in song form when Finn has been turned into a giant foot. All of you make me si~ck I'll fix you with my ki~icks!\n• In the episode of The Grim Adventures of Billy & Mandy that introduced General Skarr to the neighbourhood, Billy finds an old weapon of his, and eggs him on to use it on him. Skarr, who's trying to reform and lead a normal life, refuses. Billy's disappointed. \"You...DISGUST me! You ain't ''bad''! You ain't ''nothin'!''\"\n• A memorable quote from The Simpsons, when Patty and Selma are caught smoking on the job by their supervisor, Homer takes the rap and claims both cigarettes are his. Manager: And you sir, are worse than Hitler! *SLAP*\n• In the \"The Fundraiser\" episode of The Boondocks, Riley has started his own candy selling fund raiser, knocking over the one that was already being run by the school. When the principal tells him to stop, Riley produces a bunch of signed forms from the kid's parents saying that they work exclusively for him. The principal is in disbelief and Riley tells him \"What? You better than me? The state put you in charge of these kids, and you turn around and pimp them out to some second-rate candy racket! You disgust me.\"\n• In the penultimate episode of Scooby-Doo! Mystery Incorporated, says this to after he\n• An episode of The Cleveland Show has Rollo beat a carnival basketball game despite it being rigged, and wins a goldfish; after receiving his prize, Rollo tells the operator \"be out of this town tomorrow. Ya make me sick!\"\n• Family Guy has Quagmire accidentally sleep with an underage girl who lied about her age, and is arrested by Joe. Joe tells Quagmire he's disgusting, even though Joe had applauded him for the Facebook photos of the girl\n• Ed, Edd n Eddy had an episode where the Ed's get in a quarrel over a jawbreaker; Rolf breaks them up and tells them they make him sick with their childish fighting, then arranges a contest for the jawbreaker.\n• Dexter's Laboratory: In \"Dexter Detention\", when Dexter goes to detention, the teacher in charge tells all the students there that they make him sick.\n• Daffy Duck applies this to Conrad the Sailor (cartoon of the same name) about his singing but only as a means of giving him a hard time. Daffy: ( ) Pew, is that guy awful. Gosh, it makes me sick. to us ) Pew, is that guy awful. Gosh, it makes me sick.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/YouMakeMeSick", "media_links": ["/pmwiki/pmwiki.php/Manga/FullmetalAlchemist", "/pmwiki/pmwiki.php/Anime/YuGiOh", "/pmwiki/pmwiki.php/Anime/AngelCop", "/pmwiki/pmwiki.php/Series/TwentyFour", "/pmwiki/pmwiki.php/Manga/Bleach", "/pmwiki/pmwiki.php/Film/TheDarkKnight", "/pmwiki/pmwiki.php/Film/PoliceAcademy", "/pmwiki/pmwiki.php/WesternAnimation/IsleOfDogs", "/pmwiki/pmwiki.php/Literature/HarryPotterAndTheDeathlyHallows", "/pmwiki/pmwiki.php/Literature/SherlockHolmes", "/pmwiki/pmwiki.php/Series/BuffyTheVampireSlayer", "/pmwiki/pmwiki.php/Series/StarTrekDeepSpaceNine", "/pmwiki/pmwiki.php/Theatre/TheOddCouple", "/pmwiki/pmwiki.php/Series/MontyPythonsFlyingCircus", "/pmwiki/pmwiki.php/Music/Pink", "/pmwiki/pmwiki.php/Creator/Plautus", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyTactics", "/pmwiki/pmwiki.php/Film/Casper", "/pmwiki/pmwiki.php/WesternAnimation/CaptainPlanet", "/pmwiki/pmwiki.php/WesternAnimation/AdventureTime", "/pmwiki/pmwiki.php/WesternAnimation/TheGrimAdventuresOfBillyAndMandy", "/pmwiki/pmwiki.php/Music/MichaelJackson", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/WesternAnimation/TheBoondocks", "/pmwiki/pmwiki.php/WesternAnimation/ScoobyDooMysteryIncorporated", "/pmwiki/pmwiki.php/WesternAnimation/TheClevelandShow", "/pmwiki/pmwiki.php/WesternAnimation/FamilyGuy", "/pmwiki/pmwiki.php/WesternAnimation/EdEddNEddy", "/pmwiki/pmwiki.php/WesternAnimation/DextersLaboratory", "/pmwiki/pmwiki.php/WesternAnimation/LooneyTunes"], "non_media_links": ["/pmwiki/pmwiki.php/Main/StockPhrase", "/pmwiki/pmwiki.php/Main/Squick", "/pmwiki/pmwiki.php/Main/WhatTheHellHero", "/pmwiki/pmwiki.php/Main/EvenEvilHasStandards", "/pmwiki/pmwiki.php/Main/Mook", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/HeelFaceTurn", "/pmwiki/pmwiki.php/Main/YouMakeMeSic", "/pmwiki/pmwiki.php/Main/EveryoneHasStandards", "/pmwiki/pmwiki.php/Main/EvenEvilHasStandards", "/pmwiki/pmwiki.php/Main/ThisIsUnforgivable", "/pmwiki/pmwiki.php/Main/MoralEventHorizon", "/pmwiki/pmwiki.php/Main/YouMonster", "/pmwiki/pmwiki.php/Main/ImGoingToHellForThis", "/pmwiki/pmwiki.php/Main/ThereShouldBeALaw", "/pmwiki/pmwiki.php/Main/Anime", "/pmwiki/pmwiki.php/Main/Manga", "/pmwiki/pmwiki.php/Main/KickTheDog", "/pmwiki/pmwiki.php/Main/FanWorks", "/pmwiki/pmwiki.php/Fanfic/TwentyFourTheMusical", "/pmwiki/pmwiki.php/Main/Inverted", "/pmwiki/pmwiki.php/Fanfic/Heirverse", "/pmwiki/pmwiki.php/Fanfic/AKnightsTaleAsInquisitor", "/pmwiki/pmwiki.php/Main/RefugeInAudacity", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/EvenEvilHasStandards", "/pmwiki/pmwiki.php/Main/VomitIndiscretionShot", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/BewareTheNiceOnes", "/pmwiki/pmwiki.php/Main/MurderTheHypotenuse", "/pmwiki/pmwiki.php/Main/WhatTheHellHero", "/pmwiki/pmwiki.php/Main/LoveTriangle", "/pmwiki/pmwiki.php/Main/TakeThat", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/OrangeAndBlueMorality", "/pmwiki/pmwiki.php/Main/PlanetOfHats", "/pmwiki/pmwiki.php/Main/FantasticSlurs", "/pmwiki/pmwiki.php/Main/ChewingTheScenery", "/pmwiki/pmwiki.php/Main/Music", "/pmwiki/pmwiki.php/Main/Theatre", "/pmwiki/pmwiki.php/Main/OlderThanFeudalism", "/pmwiki/pmwiki.php/Main/MissingEpisode", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/PunchClockVillain", "/pmwiki/pmwiki.php/Main/WebOriginal", "/pmwiki/pmwiki.php/WebVideo/TheNostalgiaCritic", "/pmwiki/pmwiki.php/Main/ChaoticEvil", "/pmwiki/pmwiki.php/Main/Beat", "/pmwiki/pmwiki.php/WebVideo/JoueurDuGrenier", "https://www.youtube.com/watch?v=pKa9D-UTooI", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/TakingTheHeat", "/pmwiki/pmwiki.php/Main/HypocriticalHumor", "/pmwiki/pmwiki.php/Main/BreakingTheFourthWall"]}