{"title": "Obsolete Mentor", "content": "Basically this is someone who was a master in their field, but they're now behind the times as they haven't been able to keep up with advances in the field. Particularly using newer technologies. This can be done in three ways:\n• They become a mentor to the hero, teaching him ancient and powerful techniques to supplement (or replace) his arsenal.\n• They allow for An Aesop on not getting over-confident or complacent, by dying or getting Put on a Bus when the modern techniques they needed could have saved them.\n• They still remain awesome, despite (or because) of forsaking the advances. Sometimes the old method is supplanted by an apparently-more-powerful new method, but the new method has a terrible curse that leads to its ultimate defeat or rejection.\n\nThis may involve a Declaration of Personal Independence.\n\nThis is, of course, Truth in Television. Professionals in many fields must constantly undergo training to keep up with the state-of-the-art. Could result in or be a result of Surpassed the Teacher. Sub-Trope to Superior Successor. Not to be confused with Anti-Mentor, which involves mentors who might claim to be a master of a field but can't teach the skills for the life of them.\n• Dragon Ball:\n• Master Roshi is a prime example of this. At the first World Martial Arts tournament (the second major storyline), he knew that would happen at the rate Goku was going at. By the first saga of /Z he had become absolutely worthless, while almost everyone else had at least another season or two before that set in. Lampshaded by himself during the Cell arc - seeing how everyone else can at least try to help while he just watches, he muses about the time he was, \"Master Roshi, the strongest man in the world\" He also realizes this in the last world tournament of Dragon Ball and he's filled with pride when he sees all his students have surpassed him, saying he has nothing more to teach them.\n• King Kai also becomes this after the Saiyan Saga, though he's still a good source of information.\n• Kami and Mr. Popo go from \"putting Goku through Training from Hell in preparation for a rematch with the local Satan Expy\" to \"training the Red Shirt Army to maybe hold out a little longer while we wait for Goku to pull a Big Damn Heroes\" to \"that guy we have to keep alive to keep the Dragon Balls functional and his wacky sidekick\" remarkably quickly. Kami briefly regains relevance in the Cell saga... for just long enough to be absorbed by Piccolo, becoming the Nameless Namekian once again.\n• Piccolo to Gohan. By the time Gohan reaches Super Saiyan, he surpasses Piccolo in every possible way and the gap only widens from there. Doesn't stop them from being extremely close and Piccolo going Papa Wolf on anyone who harms Gohan.\n• Played all over the place with Goku and Gohan. In the Cell Saga, he works to make Gohan stronger than him. He succeeds even before Gohan becomes a Super Saiyan 2, surpassing him in every possible way. He even cites this as one of the reasons why he chose to remain dead. This becomes Subverted in the Buu Saga where Goku becomes stronger than Gohan because his son slacked off. It's then Played Straight again after Gohan trains under Old Kai and unlocks all his hidden power. Then it's subverted, again, because Gohan slacks off and Goku gets empower by Super Saiyan God.\n• Dragon Ball Super subverts a couple of these cases, primarily with the Universe Survival Saga. Gohan asks Piccolo to retrain him from the very basics and in doing so manages to not only regain his power level from the Buu Saga, but surpass it (to the point where, when he goes all-out, Goku has to use Super Saiyan Blue Kaioken to match him). Likewise, Master Roshi comes through several times, including teaching Goku the Evil Containment Wave in the Future Trunks Saga, helping Krillin regain his confidence as a fighter, and even teaching Goku a few new tricks. And of course, both Piccolo and Roshi participate in the Tournament of Power.\n• One of the themes in Naruto is that the younger generation will eventually surpass the older one and will also protect the even younger and unborn generations so that they can take things over in the future. A good example is Naruto himself. He's taken the Sage training of his mentor Jiraiya along with the Rasengan created by the Fourth Hokage and enhanced them using a specialized training method involving Shadow Clones, a jutsu we later learn his mother was fond of .\n• In Accel World, Niko was brought into the Brain Burst game by an older boy in her orphanage. However, her avatar Scarlet Rain soon surpassed his, becoming one of the few Level 9 players in the game, while the boy's avatar, Cherry Rook, lingered at a lower level. This, and Cherry Rook's desire to catch up, led to tragedy when he became possessed by the Chrome Disaster, necessitating Niko to remove him from the game entirely via Mercy Kill .\n• Kiritsugu in Fate/Zero is able to overcome some very tough magi and in fact assassinates them for a living. Why? Because, in the words of magi themselves, science goes towards the future and magecraft towards the past, so they shun technology and the advantages they can give.\n• Professor Woodward of Little Witch Academia. She is one of the Nine Olde Witches and a founder of Luna Nova. However, magic is disappearing from the world, and the only way to restore it is to unlock the Grand Triskelion. If magic isn't restored, then it'll eventually disappear and have no more use in the modern world and the future. Given the fact that she's currently a spirit, Woodward can't unlock them herself. As such, she mentored Chariot to unlock the Grand Triskelion in order to restore magic and currently (indirectly) mentors Akko to carry out the task. Unfortunately, it becomes clear that her outdated and high risk methods of teaching and cold negligence is providing evidence that magic is no more of use today. Magic is saved in the end but it is only due to Akko forsaking the old traditions and embracing a new path for magic leaving Woodward somewhat obsolete although the ancient witch doesn't mind.\n• Robin Series: In an odd twist Shen Chi, who helped train Tim in martial arts prior to Tim being fully allowed to take on the role of Robin, is so vastly outclassed as a fighter by Tim the next time they meet because Shen had considered a large portion of his own discipline obsolete and focused only on the fighting aspects of the ancient art his grandfather was the last true master of, ignoring the healing and meditation aspects.\n• In Big Fat Liar, the stunt-coordinator for the movie was one of the first and best in his time, but now he's out of a job. (\"That stunt looked impressive when I first saw it IN 1942, DINOSAUR!\") This actually turns out to be a Chekhov's Skill.\n• Robert Duvall was the mentor in Gone in 60 Seconds (2000). He was still effective in his field, but had to contend with younger, more hi-tech thieves in the crew. One of them showed off his fake fingerprints: the mentor still preferred gloves.\n• Of course, he also had a lot more common sense than the younger thieves, acting as Team Dad for the crew.\n• Jimmy Dugan, Tom Hanks' character in A League of Their Own, is a combination of the Cynical Mentor and a variation on this. In his case, Dugan was rendered obsolete not by time or technology but by injury; he tore up his knee fleeing from a fire which he himself started while roaring drunk .\n• To Crabbe and Goyle from Harry Potter, Draco became this once the pair of them discovered their unique penchant for ruthless torture, and the Malfoy's name became mud with The Dark Lord.\n• This sums up Jameson Arkley's feelings in 99 Corpses, the second book in the Laura Caxton series; once America's premier vampire hunter, Arkley is now an old man who has lost most of the fingers on his right hand and can barely even tie a tie by himself, which leads to him becoming a vampire himself in a desperate attempt to stop the latest threat .\n• In one of the prequel series to Dune, the School of Sword Masters exemplifies dedication to physical skill, spiritual balance, and a code of honor. At the end of a main character's training with them, their school comes under surprise bombardment and invasion by a mercenary force avenging a student they'd rejected on moral grounds, and is rapidly destroyed. Despite the masters (at least mostly) surviving, and vowing to rebuild and correct the mistakes which led to this, they do drop out of the story at that point.\n• Due to having been born in 1900 DCI Nightingale from Rivers of London sometimes falls into this trope when it comes to modern police-work and technology. When it comes to magic though, well this is a man who personally blew up two attacking Tiger Tanks in WWII on his own.\n• Deconstructed on an episode of Scrubs that focused on Dr. Townshend, an older doctor played by Dick Van Dyke. Townshend is beloved by patients, the staff and is Kelso's best friend, but during the course of the episode, it's revealed that Townshend is using outdated forms of treatment, and things almost go very, very badly for a patient when he has J.D. assist him while using one such outdated method that J.D. is unfamiliar with. When Kelso confronts him afterward Townshend was forced to admit he simply couldn't keep up with advances in medicine and was relying on what he knew from the old days, even though these methods were less effective and sometimes carry a higher risk for patients. The episode ends with Kelso having to very reluctantly fire Townshend rather than risk him continuing such practices.\n• An episode of Murphy Brown revolved around Murphy's sadness at seeing her former mentor become this (for example, despite the show being set way into the 90's, said mentor believes telex machines are still used).\n• On Star Trek: The Next Generation, Scotty had been stuck in a transporter loop for over 70 years. Although he initially made a few mistakes due to his unfamiliarity with modern technology, he was later able to help Geordi with their current adventure despite being decades out of date.\n• Of course, Scotty literally wrote the book on all modern-Starfleet engineering, but freely admits to padding his estimates and withholding surplus power to look good. Basically, the reason Scotty is still a master is because modern Starfleet still haven't figured out that by following Scotty's bible, their starships are actually kept from being half as powerful as they should be.\n• His justification for doing so (\"A good engineer is a wee bit cautious, especially on paper.\") is accurate Truth in Television, however. When writing the manuals or design specs, one always wants to err on the side of being cautious with the safety margins to prevent damage to operator or equipment.\n• On 30 Rock, Liz received mentoring by a woman who wrote television in The '70s (played by Carrie Fisher). Her bold, boundary-pushing writing style was too much for the modern, corporate-controlled NBC. Liz ultimately abandoned her after seeing how her life had ended up.\n• Corporal Jones from Dad's Army: Respected as a soldier who served under Lord Kitchener in the Sudan, but now a confused old fool.\n• In The Outer Limits (1995) episode \"Stream of Consciousness\", there's a librarian who couldn't connect to the mind-linked Internet of the future and was looked down on for actually reading books. Of course, when the network went haywire, he was the only one who could help.\n• On Mad Men, Freddy Rumsen is the one who discovers Peggy's talent as a copywriter at Sterling Cooper and is a source of avuncular support, and she's crushed when he gets fired because of his alcoholism (and guilty that she gets promoted as a result). So she's very happy when he arrives at SCDP years later, but by this time, she's no longer a newcomer in need of a mentor, and she has to tell him his ideas are too old-fashioned for the new agency and the changing times. (Don's slipping grasp on the culture and the threat it represents to his work is also increasingly a theme as the show goes on.)\n• The folk song \"John Henry\" is all about the technological obsolescence version of this in the tunnel drilling industry (John Henry was a steel drilling man). Canadian folk-band Stringband updated this to the postal service (where John Henry is a mail-sorting man).\n• Parodied in Dilbert where Bob the Dinosaur gets hired in the Y2k run-up as a COBOL programmer because he says he's told he looks like one.\n• Trauma Center: Under the Knife 2 introduces the Hands of Asclepius, a rival medical institution to Caduceus which used a combination of Derek Stiles' performance data and performance-enhancing drugs to mass-produce surgeons armed with Derek's Healing Touch . After Derek is unable to save protege Adel Tulba during his Heroic BSoD , leaving his operation to someone else, Adel resigns from Caduceus and joins the HOA, becoming one of their unnaturally-empowered super surgeons . As the game proceeds, Caduceus is pushed further and further into the background as the HOA gains prominence; however, it's soon discovered that their progress comes with a terrible price: the performance-enhancing drugs are actually a new strain of the deadly GUILT, and every single one of HOA's super surgeons becomes a half-crazed walking time bomb .\n• Caster in Fate/stay night is far better at magic than Rin... but she hasn't realized that because magical aptitude has fallen since her time, most magi now train in mundane self-defense as well. She is therefore beaten to a pulp when she lets Rin close the distance between them.\n• This is zig-zagged a bit during Fate/hollow ataraxia, however, with the presence of Bazette and her Fragarach. Though Bazette is a very gifted combat mage, Nasu still stated that Caster would cream her in a fight, since while Fragarach is an instant kill attack, it can only be used to counter an opponent's \"trump card\", and Caster is too well-rounded when it comes to spellcasting to make her vulnerable to it.\n• In 8-Bit Theater, Fighter is warned to stop taking his skills for granted to avoid this trope. He deals with this advice in his usual manner .\n• Specifically stated in an early chapter of Girl Genius: when an army of Beetle's clanks are dispatched in a single panel, Klaus gives him a lecture that essentially embodies this trope. Beetle: My—my clanks! \n\nKlaus: Yes, the best self-contained fighting machines on the planet—when they were new. Time marches on, Beetle. You remained behind.\n• According to legend, when Leonardo Da Vinci (as an apprentice) was finally allowed to paint part of one of his master's works (in those days artists would have assistants and apprentices do at least some of the work for them) his master was so impressed by the result he gave up painting on the spot.\n• Sports punditry and analysis. Oftentimes the old guard (usually former players) find themselves less able to assess games in which the \"style\" of play has changed over the years. Alan Hansen, football analyst and former Liverpool player, has been criticised for analysing football as if it's still the same game he played back in the 70s, while Gary Neville, who only retired from playing in 2011, is receiving extensive plaudits for his punditry because his knowledge is that much more up to date.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/ObsoleteMentor", "media_links": ["/pmwiki/pmwiki.php/Manga/DragonBall", "/pmwiki/pmwiki.php/Anime/DragonBallSuper", "/pmwiki/pmwiki.php/Manga/Naruto", "/pmwiki/pmwiki.php/LightNovel/AccelWorld", "/pmwiki/pmwiki.php/LightNovel/FateZero", "/pmwiki/pmwiki.php/Anime/LittleWitchAcademia", "/pmwiki/pmwiki.php/ComicBook/RobinSeries", "/pmwiki/pmwiki.php/Film/BigFatLiar", "/pmwiki/pmwiki.php/Film/GoneInSixtySeconds2000", "/pmwiki/pmwiki.php/Creator/TomHanks", "/pmwiki/pmwiki.php/Film/ALeagueOfTheirOwn", "/pmwiki/pmwiki.php/Literature/HarryPotter", "/pmwiki/pmwiki.php/Literature/LauraCaxton", "/pmwiki/pmwiki.php/Literature/PreludeToDune", "/pmwiki/pmwiki.php/Franchise/Dune", "/pmwiki/pmwiki.php/Literature/RiversOfLondon", "/pmwiki/pmwiki.php/Series/Scrubs", "/pmwiki/pmwiki.php/Creator/DickVanDyke", "/pmwiki/pmwiki.php/Series/MurphyBrown", "/pmwiki/pmwiki.php/Series/StarTrekTheNextGeneration", "/pmwiki/pmwiki.php/Series/ThirtyRock", "/pmwiki/pmwiki.php/Creator/NBC", "/pmwiki/pmwiki.php/Series/DadsArmy", "/pmwiki/pmwiki.php/Series/TheOuterLimits1995", "/pmwiki/pmwiki.php/Series/MadMen", "/pmwiki/pmwiki.php/VideoGame/TraumaCenter", "/pmwiki/pmwiki.php/VisualNovel/FateStayNight", "/pmwiki/pmwiki.php/VisualNovel/FateHollowAtaraxia", "/pmwiki/pmwiki.php/Webcomic/EightBitTheater", "/pmwiki/pmwiki.php/Webcomic/GirlGenius"], "non_media_links": ["/pmwiki/pmwiki.php/Main/LostTechnology", "/pmwiki/pmwiki.php/Main/AnAesop", "/pmwiki/pmwiki.php/Main/PutOnABus", "/pmwiki/pmwiki.php/Main/ScienceIsBad", "/pmwiki/pmwiki.php/Main/DeclarationOfPersonalIndependence", "/pmwiki/pmwiki.php/Main/TruthInTelevision", "/pmwiki/pmwiki.php/Main/SurpassedTheTeacher", "/pmwiki/pmwiki.php/Main/SubTrope", "/pmwiki/pmwiki.php/Main/SuperiorSuccessor", "/pmwiki/pmwiki.php/Main/AntiMentor", "/pmwiki/pmwiki.php/Main/Anime", "/pmwiki/pmwiki.php/Main/Manga", "/pmwiki/pmwiki.php/Main/WeAreTeamCannonFodder", "/pmwiki/pmwiki.php/Main/WorldsStrongestMan", "/pmwiki/pmwiki.php/Main/TrainingFromHell", "/pmwiki/pmwiki.php/Main/Satan", "/pmwiki/pmwiki.php/Main/Expy", "/pmwiki/pmwiki.php/Main/RedShirtArmy", "/pmwiki/pmwiki.php/Main/BigDamnHeroes", "/pmwiki/pmwiki.php/Main/DeathIsCheap", "/pmwiki/pmwiki.php/Main/FusionDance", "/pmwiki/pmwiki.php/Main/PapaWolf", "/pmwiki/pmwiki.php/Main/Subverted", "/pmwiki/pmwiki.php/Main/PlayedStraight", "/pmwiki/pmwiki.php/Main/InstantExpert", "/pmwiki/pmwiki.php/Main/MercyKill", "/pmwiki/pmwiki.php/Main/ComicBooks", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/ChekhovsSkill", "/pmwiki/pmwiki.php/Main/TeamDad", "/pmwiki/pmwiki.php/Main/CynicalMentor", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/Immortality", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/FridgeLogic", "/pmwiki/pmwiki.php/Main/FridgeLogic", "/pmwiki/pmwiki.php/Main/AlternateCharacterInterpretation", "/pmwiki/pmwiki.php/Main/TruthInTelevision", "/pmwiki/pmwiki.php/Main/TheSeventies", "/pmwiki/pmwiki.php/Main/JacobMarleyWarning", "/pmwiki/pmwiki.php/Main/TheBusCameBack", "/pmwiki/pmwiki.php/Main/Music", "/pmwiki/pmwiki.php/Main/NewspaperComics", "/pmwiki/pmwiki.php/ComicStrip/Dilbert", "/pmwiki/pmwiki.php/Main/TheNineties", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/HeroicBSOD", "/pmwiki/pmwiki.php/Main/AxCrazy", "/pmwiki/pmwiki.php/Main/VisualNovel", "/pmwiki/pmwiki.php/Main/KungFuWizard", "/pmwiki/pmwiki.php/Main/ZigZaggedTrope", "/pmwiki/pmwiki.php/Main/CounterAttack", "/pmwiki/pmwiki.php/Main/JackOfAllStats", "/pmwiki/pmwiki.php/Main/Webcomics", "/pmwiki/pmwiki.php/Main/CloudCuckoolander", "http://www.nuklearpower.com/2005/10/15/episode-612-mind-over-matter/", "http://www.girlgeniusonline.com/comic.php?date=20030113", "/pmwiki/pmwiki.php/Main/BoomHeadshot", "/pmwiki/pmwiki.php/Main/CurbStompBattle", "/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/UsefulNotes/AssociationFootball"]}