{"title": "In-Camera Effects", "content": "In-Camera Effects are special effects achieved by manipulating the camera or its parts. The effect exists on the original camera negative or video recording before it is sent to a lab or modified. In-Camera effects include using filters like the Gaussian Girl effect, mattes, or lighting artifacts, like lens flares; Camera Tricks like zooms, pans, Forced Perspective, and dolly shots; time/speed effects like time-lapse, slow- or fast-motion, reverse motion, stop-tricks or speed ramping; or specialty films like infrared or negative image.\n\nA number of in-camera tricks were developed in the early days of film when there was not only the obvious lack of CGI but also a lack of film manipulating technology. Of course, then a number will have been replaced by easier, more technologically advanced means but some also died out because they were only applicable to black and white. Coloured filters, for instance, could be used to block out light from red or green, rendering some objects or makeup hidden to the monochrome camera until the filters were removed, creating a reveal.\n\nMany older techniques still remain. Filters are now used but for shifts to the infrared to create surreal lighting effects. Over- or undercranking (where the film is moved faster or slower through the reels) is still used to produce slow or sped up motion.\n• With older, non-digital cameras, using a black screen or cover so that only part of the film is exposed (and thus the rest can have something else filmed onto it, for instance the image on a TV screen.\n• A dark filter could be used to simulate night-time while shooting in daytime. Unfortunately it does nothing to eliminate shadows caused by sunlight, leading to the slightly hilarious effect of having obvious sun-shadow at night.\n• A filmmaker could create a \"ghost\" by exposing the film to the same scene twice, once with and once without the actor.\n• Matte paintings were often used as backdrops with the focus kept off them. Bipacking was a method where instead footage was shot of just the matte and then was placed in the camera, overlayed on top of the unexposed film. When the camera ran and the film was exposed, the image of the matte would be imprinted on it.\n• Every single effect in Bram Stoker's Dracula (1992), including some quite complicated shots.\n• In 2001: A Space Odyssey, the long shot of astronauts in the lunar excavation used bipacking.\n• Cinematographer Karl Struss made pioneering work with filters. He would have actors' make-up be done in red or green and then put red or green filters to take them out of the picture. The filter could be slowly changed and the make-up would be changed.\n• Dr. Jekyll and Mr. Hyde (1931) had the early stage of the Jekyll to Hyde transformation made entirely on screen with the camera on him, the physical character change being done with the use of filters and decent acting. (He then drops off screen briefly while the finishing touches — a wig and prosthetic fangs — are put in place.)\n• In Ben-Hur (the 1925 one), the lepers' sores were done in red make up and then filtered out for the healing scene.\n• The Tracking Zoom is made by having a camera on a dolly zoom in while the dolly moves away. The subject stays in the same place but the perspective of everything around it changes. You've probably seen it many times, sometimes the human eye can give this effect but for an example, the distorting zoom in on Sheriff Brody's face in Jaws.\n• Traditional matte paintings were used even as recently as the first Terminator movie: the last shot where Sarah drives off into the desert, and A Storm Is Coming.\n• An In-Camera example is the \"He Plays The Violin\" dance in the garden during 1776, seen here , the dolly shot starting at 3:25.\n• A modern, digital camera example came in 28 Days Later. All of the scenes of the infected were shot with the shutter speed of the Canon XL-1 camera set very high, resulting in an unsettling and \"jumpy\" look.\n• A hand-cranked camera was used during part of the shootout in Hot Fuzz, allowing both undercranking and overcranking to be used for added dramatic effect.\n• A version of the filter technique was also used in The Twilight Zone episode \"The Howling Man\" to depict the title character's transformation.\n• The TV Star Trek series would achieve the shaking of the bridge when under attack by simply shaking the camera and getting the crew to wobble about. Later SF productions with a bigger budget, such as the Trek films, replaced the cheesy effect with Practical Effects: sets would be placed on top of a large platform and the camera would be still while the entire set was shaken. That would be counted as Practical Effects.\n• Spoofed in Top Gear (UK) when Jeremy Clarkson attempted to get a 'dramatic soft focus' effect by smearing petroleum jelly on the camera lens. Didn't go well.\n• An in-color version of the filter trick: Zaphod's color-changing sunglasses in the TV version of The Hitchhiker's Guide to the Galaxy were made out of polarizing filters, with another polarizer on the camera lens. When all three were oriented the same way, light passed through freely and the glasses were clear. When the one on the camera was turned, it blocked the light that the glasses let through, turning them black while everything else appeared unchanged.\n• Doctor Who used many of these during the Classic era:\n• The Hartnell, Troughton and first Pertwee title sequences were used with 'howlaround' feedback (pointing a film camera at a monitor of its own output). The initial light patterns were created with a pen light.\n• The TARDIS teleportation is the Stop Trick and a dissolve.\n• \"The Keys of Marinus\" had part of the lens blacked out with a filter and then the footage refilmed, allowing the teleportation effect. A similar effect is used for the shrinking grain in \"Planet of the Giants\". Attentive viewers may notice that before teleporting the TARDIS crew will always move in front of a completely black object.\n• \"The Web Planet\" used copious filters on the lens to create a misty atmosphere (or maybe obscure some of the more obvious screw holes and bits of operator tshirt on the Zarbi).\n• The second Pertwee and first Tom Baker title sequences were generated with slit scan photography, inspired by the travel effect used in 2001: A Space Odyssey. They are also ridiculously beautiful even by modern standards.\n• The second Tom Baker title sequence and those of Davison and Colin Baker (the 'starfield') were generated using similar slit scan techniques and a camera filter that gave light a prismatic, rainbow look.\n• From the new series, when Bill holds a mirror and the camera pans to reveal to her that she's a Mondasian Cyberman.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/InCameraEffects?from=Main.InCamera", "media_links": ["/pmwiki/pmwiki.php/Film/BramStokersDracula", "/pmwiki/pmwiki.php/Film/TwoThousandOneASpaceOdyssey", "/pmwiki/pmwiki.php/Film/DrJekyllAndMrHyde1931", "/pmwiki/pmwiki.php/Film/BenHur", "/pmwiki/pmwiki.php/Film/Jaws", "/pmwiki/pmwiki.php/Film/SeventeenSeventySix", "/pmwiki/pmwiki.php/Film/TwentyEightDaysLater", "/pmwiki/pmwiki.php/Film/HotFuzz", "/pmwiki/pmwiki.php/Series/TheTwilightZone", "/pmwiki/pmwiki.php/Series/StarTrekTheOriginalSeries", "/pmwiki/pmwiki.php/Series/TopGearUK", "/pmwiki/pmwiki.php/Series/TheHitchhikersGuideToTheGalaxy", "/pmwiki/pmwiki.php/Series/DoctorWho", "/pmwiki/pmwiki.php/Film/TwoThousandOneASpaceOdyssey"], "non_media_links": ["/pmwiki/pmwiki.php/Main/GaussianGirl", "/pmwiki/pmwiki.php/Main/CameraTricks", "/pmwiki/pmwiki.php/Main/ForcedPerspective", "/pmwiki/pmwiki.php/Main/Overcrank", "/pmwiki/pmwiki.php/Main/Undercrank", "/pmwiki/pmwiki.php/Main/CrystalClearPicture", "/pmwiki/pmwiki.php/Main/HollywoodDarkness", "/pmwiki/pmwiki.php/Main/MatteShot", "/pmwiki/pmwiki.php/Main/VertigoEffect", "/pmwiki/pmwiki.php/Main/AStormIsComing", "http://www.tcm.com/mediaroom/video/247430/1776-Movie-Clip-He-Plays-the-Violin.html", "/pmwiki/pmwiki.php/Main/StarTrekShake", "/pmwiki/pmwiki.php/Main/PracticalEffects", "/pmwiki/pmwiki.php/Main/PracticalEffects", "/pmwiki/pmwiki.php/Main/CatchPhrase", "/pmwiki/pmwiki.php/Main/StopTrick", "/pmwiki/pmwiki.php/Main/GaussianGirl"]}