{"title": "Squad Controls", "content": "A Video Game Interface Element that allows the player to issue a limited number of predefined orders to their AI teammates. The sine qua non of the squad-based Tactical Shooter genre, it shows up in plenty of other genres as well (particularly in games which make use of Manual Leader, A.I. Party). Sometimes, you'll be able to do this in an Escort Mission, which can make them a lot more bearable.\n• Stay: Your squad is ordered to hold its position—useful if you want to scout out a new location without the whole team running into an ambush. May be called \"Hold\" or \"Stand Ground\".\n• Sic 'Em: Your squad is ordered to attack a particular enemy, go to a location, or interact with an object; \"Attack\" or \"Target\".\n• Heel: Your squad is ordered to follow you. Usually their default action, so this is more of a \"cancel previous orders\" command; \"Follow\" or \"Defensive Stance\".\n• Off You Go, Boy! Your squad is released to do whatever they usually would—another \"cancel\" command; \"Advance\" or \"Aggressive Stance\".\n• Sit/Stand/Lie Down: Some games give you control over your teammates' Crouch and Prone stance, if they don't just copy your current stance.\n• Fetch: Games with objectives can allow the player to tell teammates to perform actions for them instead of having to physically go to the location. Usually more common in Co-Op Multiplayer games with AI bots.\n\nNot included in this trope definition are games where the player can assume direct control over NPC party members in the same manner as they micromanage their own Player Character, which is popular with Western RPGs. Related to Easy Communication.\n• Half-Life 2, when you're accompanied by resistance fighters. The antlions have something similar, but limited to \"heel\" and \"fetch\", in that they are attracted to an item you can throw at targets. But, there is no \"Stay\" order.\n• Day Of Defeat (World War II-themed Half-Life mod) has pre-set communication with one's team—both vocal and Hand Signals supported in player model animations. What made Sturmbot one of the best bots (once you have waypoints) is that these guys understood every command and acted on them with adjustable probability.\n• Oddworld: Abe's Oddysee. The sequel, Abe's Exoddus, expands this with puzzles that require you to mind control fauna and enemies and control their respective squads.\n• Gears of War has your basic Hold and Advance controls.\n• Ace Combat 5: The Unsung War, Ace Combat Zero: The Belkan War, and Ace Combat 6: Fires of Liberation give you control over your wingmen. Seeing how the game is about aerial combat, your options are usually \"Concentrate Fire\", \"Disperse and Engage\", and \"Cover Me\". You can also toggle permission to use special weapons. However, in AC6, the controls were simplified compared to ACZ and this feature seems to have been abandoned completely in later Ace Combat games (where the wingmen are completely AI-controlled).\n• Tom Clancy's H.A.W.X. has a simple system where your wingmen can be set to offensive or defensive mode.\n• On offensive mode, they attack the selected target first then autonomously hunt the map for enemies. If there are no enemies anywhere, they slowly circle at a comfortable altitude until someone to shoot comes onto the map.\n• On defensive, they follow you around and generally stay out of the way until someone tries to get a radar lock on you or an AA gun starts firing in your general direction, at which point they instantly start chasing the offender. Which means that yes, the AI is smart enough to do Wild Weasel tactics with you as the bait.\n• The first Kingdom Hearts game uses the Triangle button to call your allies onto the same target.\n• Rogue Galaxy allows you to set one of four \"Team Commands\" in battle (\"fight separately\", \"pick same target\", \"go all out\", and \"step back\") when you weren't confirming ally suggestions or issuing orders from the combat menu yourself.\n• Freedom Fighters, a 2003 third-person shooter, might have been the Trope Codifier.\n• M1 Tank Platoon. Other tanks in your platoon and certain support units could be ordered to move in specific ways, engage targets left/right, form a specific formation, turn smoke on/off and cease fire/fire at will.\n• The Operation Flashpoint campaign has an AI character give out squad orders, in reaction to enemies and events. Once Armstrong gets promoted to Lieutenant, he gets access to them as he leads his squad. These commands let you order other soldiers to do practically anything, even placing a satchel charge for detonation.\n• Pikmin is built around this trope. The plot follows Captain Olimar (later games include Louie) being stranded on a planet (implied to be Earth itself) trying to achieve his objectives using small aliens in a world filled with all kinds of dangerous creatures and Eldritch Abominations. The main gameplay is about ordering these animal/plant hybrids to attack enemies, get items, build things and even commit suicide.\n• Tales Series games allow you to give each character orders on what to do, but sometimes they'll just do whatever, depending on the game.\n• The Fire Emblem games set in Tellius allow the team leader to give some basic orders to the other playable characters (In case you don't feel like moving them manually) and to the allied yellow units (useful if they have to survive, just send them to a square away from enemies).\n• The Freespace series has a relatively sophisticated example, with Alpha 1 being authorized to send wingmates to attack or protect specific targets or subsystems, attack at will, form up, or return to base. Curiously, transport ships can receive orders to dock with large vessels, though this capability was never used in either game - though it's put to good use in some custom campaigns, such as the rescue mission in Bem Cavalgar.\n• Unreal Tournament doesn't formally have squads, but you can give orders your bots to handle common tasks (e.g. attack, assist you, defend, etc.)\n• Star Wars: Republic Commando has four common commands: \"Secure Area\" (Stay), \"Form Up\" (Heel, i.e. \"follow me closely\"), \"Cancel Maneuver\" (abandon current specialized task, see below, and return to previous order), and \"Search and Destroy\" (self-explanatory). Additionally, there is a number of context sensitive commands triggered by the same button, depending on what you're targeting right now: focus fire on a particular enemy (Sic 'Em), take a specialized defensive position (sniper, grenadier, or anti-armor), man a turret, place a shaped charge on a door, slice a terminal, use a bacta station, place or disarm a landmine, or resuscitate a fallen squad member. Finally, if the Player Character goes down, you have the option either to recall the squad to revive him or to have them carry out current orders and revive him once the coast is clear again.\n• Brütal Legend, lacking the traditional bird's eye view of Strategy Games, uses this to give orders to allied squads during Stage Battles.\n• In Blazing Angels: Squadrons of WWII, you have the ability to make your team do things such as repair your plane or fly ahead to attack the enemies.\n• Mass Effect includes very simple squad controls (hold, advance, and heel) on the Ring Menu: the Q and E keys ordered one of your two squadmates either to move in the direction Shepard is pointing or to attack a selected enemy, possibly with a special ability.\n• Overlord has the commands Sweep (the whole cluster of minions follows your cursor, smashing, killing or looting anything they find along the way), Send (minions charge either straight ahead or towards a selected target, again smashing, killing and looting) and Return. These commands can be used for anything from a single minion to the whole horde.\n• Vega Strike have basic commands for the flightgroup, since there are both hired guns and extra ships one can purchase, carry and launch.\n• City of Heroes has this for the Mastermind class so they can control their pets. The player can set both the stance (aggressive, defensive, passive) and the specific command (follow, attack, go to, stay). Any damage the Mastermind takes is split among the Mastermind and any nearby pets that are in Defensive-Follow (specifically known as \"Body Guard Mode\"). With their full array of minions acting as bodyguards, a Mastermind can act as a surprisingly effective tank, especially if they are able to heal themselves and their minions to keep the effect going. The downside is that AoE attacks end up hitting the minions even harder (as they take normal damage, plus their share of the master's).\n• In Evolva, you can tell the Genohunters to go a certain place, hold, follow you again, pick up an item or attack a certain target.\n• Dungeon Crawl: Any allies you have can be given simple commands with the Talk button, like 'follow me', 'wait here', 'attack target', etc.\n• You can also control what kinds of items your intelligent allies will pick up, like whether you want them to pick up anything they find or just the stuff that you drop (mindless allies like the undead still won't pick up anything).\n• Pigskin features a very simple version of this: by pressing a button during play, one can rotate through a list of \"strategies\" that all AI-controlled teammates will follow (this is the kind of Sports Game where one of the strategies has each teammate attack his nearest opponent).\n• The Mount & Blade games use a system like the one described to allow the player character to control their warband. The player can even give different groups of soldiers different orders — which is handy, as the \"squad\" can range in size from just a few guys up to well over a hundred soldiers.\n• Star Trek Online has this function in ground scenarios, where you can command your away team. Hold position, attack your target, and \"passive mode\", which can all be assigned to the group or to individual officers.\n• The Rogue Squadron sequels, Rogue Leader and Rebel Strike, give you two wingmen controlled with the D-pad. The Up command is always \"form up\" on either side of you; side commands send them off to attack, sometimes with Left and Right providing a choice of targets. Down is \"Flee\" in case you want a Self-Imposed Challenge or to minimize friendly losses for medal requirements, though this is rarely needed because your wingmen can typically handle themselves and most friendly losses come from escort targets, who you obviously cannot order to flee.\n• In Hidden & Dangerous, \"Real Time Commands\" let you direct nearby soldiers to follow you around, stay where they are, move out of your line of fire, etc.\n• The Warriors has you in control of a gang whom you can issue various commands to. You can order them to follow you, stay behind, hide in the darkness, destroy the surroundings, attack all foes, or have your gang watch your back.\n• Dogs and cats in Minecraft can be instructed to sit so that they will not follow you around. Dogs that follow you will additionally attack any mob that you are attacking.\n• In Warframe, player-deployed spectres and syndicate agents can be instructed to hold position or to follow you by pressing the context button in their vicinity.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/SquadControls", "media_links": ["/pmwiki/pmwiki.php/VideoGame/HalfLife2", "/pmwiki/pmwiki.php/VideoGame/DayOfDefeat", "/pmwiki/pmwiki.php/VideoGame/HalfLife", "/pmwiki/pmwiki.php/VideoGame/Oddworld", "/pmwiki/pmwiki.php/VideoGame/GearsOfWar", "/pmwiki/pmwiki.php/VideoGame/AceCombat5TheUnsungWar", "/pmwiki/pmwiki.php/VideoGame/AceCombatZeroTheBelkanWar", "/pmwiki/pmwiki.php/VideoGame/AceCombat6FiresOfLiberation", "/pmwiki/pmwiki.php/VideoGame/AceCombat", "/pmwiki/pmwiki.php/VideoGame/KingdomHearts", "/pmwiki/pmwiki.php/VideoGame/RogueGalaxy", "/pmwiki/pmwiki.php/VideoGame/FreedomFighters", "/pmwiki/pmwiki.php/VideoGame/Odama", "/pmwiki/pmwiki.php/VideoGame/OperationFlashpoint", "/pmwiki/pmwiki.php/VideoGame/Pikmin", "/pmwiki/pmwiki.php/VideoGame/TalesSeries", "/pmwiki/pmwiki.php/VideoGame/FireEmblem", "/pmwiki/pmwiki.php/VideoGame/FireEmblemTellius", "/pmwiki/pmwiki.php/VideoGame/Freespace", "/pmwiki/pmwiki.php/VideoGame/UnrealTournament", "/pmwiki/pmwiki.php/VideoGame/StarWarsRepublicCommando", "/pmwiki/pmwiki.php/VideoGame/BrutalLegend", "/pmwiki/pmwiki.php/VideoGame/BlazingAngels", "/pmwiki/pmwiki.php/Franchise/MassEffect", "/pmwiki/pmwiki.php/VideoGame/Overlord", "/pmwiki/pmwiki.php/VideoGame/VegaStrike", "/pmwiki/pmwiki.php/VideoGame/CityOfHeroes", "/pmwiki/pmwiki.php/VideoGame/Evolva", "/pmwiki/pmwiki.php/VideoGame/DungeonCrawl", "/pmwiki/pmwiki.php/VideoGame/MountAndBlade", "/pmwiki/pmwiki.php/VideoGame/StarTrekOnline", "/pmwiki/pmwiki.php/VideoGame/RogueSquadron", "/pmwiki/pmwiki.php/VideoGame/HiddenAndDangerous", "/pmwiki/pmwiki.php/VideoGame/TheWarriors", "/pmwiki/pmwiki.php/VideoGame/Minecraft", "/pmwiki/pmwiki.php/VideoGame/Warframe"], "non_media_links": ["/pmwiki/pmwiki.php/Main/VideoGameInterfaceElements", "/pmwiki/pmwiki.php/Main/VideoGameAI", "/pmwiki/pmwiki.php/Main/GratuitousLatin", "/pmwiki/pmwiki.php/Main/TacticalShooter", "/pmwiki/pmwiki.php/Main/ManualLeaderAIParty", "/pmwiki/pmwiki.php/Main/EscortMission", "/pmwiki/pmwiki.php/Main/CrouchAndProne", "/pmwiki/pmwiki.php/Main/ItsUpToYou", "/pmwiki/pmwiki.php/Main/CoOpMultiplayer", "/pmwiki/pmwiki.php/Main/ArtificialIntelligence", "/pmwiki/pmwiki.php/TropeCo/TropeCo", "/pmwiki/pmwiki.php/Main/ArtificialStupidity", "/pmwiki/pmwiki.php/Main/FriendlyFireproof", "/pmwiki/pmwiki.php/Main/NPC", "/pmwiki/pmwiki.php/Main/PlayerCharacter", "/pmwiki/pmwiki.php/Main/WesternRPG", "/pmwiki/pmwiki.php/Main/EasyCommunication", "/pmwiki/pmwiki.php/UsefulNotes/WorldWarII", "/pmwiki/pmwiki.php/Main/HandSignals", "/pmwiki/pmwiki.php/Main/Wingman", "/pmwiki/pmwiki.php/Videogame/HAWX", "/pmwiki/pmwiki.php/Main/BerserkButton", "/pmwiki/pmwiki.php/UsefulNotes/WildWeasel", "/pmwiki/pmwiki.php/Main/TropeCodifier", "/pmwiki/pmwiki.php/Main/ArtificialStupidity", "/pmwiki/pmwiki.php/Main/EscortMission", "/pmwiki/pmwiki.php/Main/PlayerCharacter", "/pmwiki/pmwiki.php/Main/SubsystemDamage", "/pmwiki/pmwiki.php/Main/Hyperspace", "/pmwiki/pmwiki.php/Main/GameMod", "/pmwiki/pmwiki.php/Main/PlayerCharacter", "/pmwiki/pmwiki.php/Main/StrategyGame", "/pmwiki/pmwiki.php/Main/RingMenu", "/pmwiki/pmwiki.php/Main/PlayerMooks", "/pmwiki/pmwiki.php/Main/SportsGame", "/pmwiki/pmwiki.php/Main/UnnecessaryRoughness", "/pmwiki/pmwiki.php/Main/Wingman", "/pmwiki/pmwiki.php/Main/SelfImposedChallenge", "/pmwiki/pmwiki.php/Main/EscortMission"]}