{"title": "Cartoonland Time", "content": "If you pay attention in cartoons, you might notice something a little peculiar about everyone's schedule. Projects and undertakings that would realistically take weeks or months are compressed into days - if even that. There is usually no good reason for this whatsoever, since the amount of time that passes is typically stated in dialog, which could have easily been rewritten to reflect a more realistic timescale. It is often invoked by Rule of Funny. Montages operate on a similar time scale.\n\nAlthough it's usually seen in cartoons, it's not limited to them. Occasionally, live-action characters will behave as though they're running on cartoonland time.\n\nIt is often the reason for Instant Home Delivery, and may involve Offscreen Reality Warp.\n• In Cinderella, the king proclaims that a ball will be held that night and that every eligible maiden in the entire kingdom is to attend. Not only would making out the invitations take more than a day alone, and not only is it completely unreasonable to expect anyone to just drop whatever they're doing and rush to the castle (even if they have suitable ballgowns ready), but the kingdom is strongly implied to be France, which isn't exactly tiny.\n• In Apocalypse, the Antichrist outlaws Christianity and instates a one-world government within a week of the Rapture. Basically, No Delays for the Wicked Turned Up to Eleven.\n• In an episode of Boy Meets World, Shawn helps Cory to both go to the dance with Topanga and see a wrestling match by imitating an episode of The Flintstones where Fred shuttled back and forth between two places, always coming up with a quick excuse. He points out that Fred never spent more than a minute at either location, and Cory tried to explain that cartoons use condensed time for storytelling. Shawn: It's the same thing.\n• In an episode of Mad About You, Paul is talked into doing a (moderately big-budget) TV commercial for the city, does preproduction, shoots the footage, does postproduction, gets the commercial on the air, and is horrified by the reaction, all in less than a week.\n• The Ace Attorney series of games is built off this trope: all the trials in the series have a three-day time limit, with no regards to how long a forensic test would actually be in real time.\n• In an episode of The Real Ghostbusters, a couple of ghosts set up a phony ghosthunting business that becomes more popular than the Ghostbusters - in less than a day. Then there's the ability to mix a cake, bake it in the oven, and assemble its layers with frosting in mere seconds to throw into a pursuing antagonist's face.\n• Phineas and Ferb: Everything the titular characters do happens in one day. They build beaches, become one-hit wonders, go into outer space and visit a star, everything. Even Doofenshmirtz schemes seem to be implemented and foiled in a day. But whatever craziness ensues that episode, everything is cleaned up and returned to normal by the end of the day. Of course, it all just adds to the joke.\n• Lampshaded in Just Passing Through; Baljeet: You can build a rollercoaster in a day, but it takes you 12 minutes to pump up a tire?\n• Kim Possible roams the world at will, even to the deep oceans and outer space, battling villains and possibly spending time as their captive but is still back by dinner time, even if she goes from, say, home in the US to Greece, back to the US, and back to Greece again.\n• Futurama, In the episode entitled 'A Clockwork Origin', this trope is made fun of in two construction projects. While the construction of a working spaceship 'took almost two hours', as if that was a particularly long time, the construction of an extremely simple slingshot takes 'almost twelve hours.'\n• The adaptation of The Smurfs comic book story \"King Smurf\" has the installment of King Smurf's kingdom, signified by the construction of his castle, completed in no more than a few hours, whereas it originally took a few days for the castle to be completed.\n• In The Simpsons episode \"Secrets of a Successful Marriage\" after Marge has kicked Homer out of the house for spilling secrets about their sex life, when we next see Homer he has a long scruffy beard, his clothes are tattered and dirty, and has lost a couple pounds which would imply he's been living outside for months, but Marge states he's been out for one day.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/CartoonlandTime", "media_links": ["/pmwiki/pmwiki.php/Disney/Cinderella", "/pmwiki/pmwiki.php/Film/Apocalypse", "/pmwiki/pmwiki.php/Series/BoyMeetsWorld", "/pmwiki/pmwiki.php/WesternAnimation/TheFlintstones", "/pmwiki/pmwiki.php/Series/MadAboutYou", "/pmwiki/pmwiki.php/Franchise/AceAttorney", "/pmwiki/pmwiki.php/WesternAnimation/TheRealGhostbusters", "/pmwiki/pmwiki.php/WesternAnimation/PhineasAndFerb", "/pmwiki/pmwiki.php/WesternAnimation/KimPossible", "/pmwiki/pmwiki.php/WesternAnimation/Futurama", "/pmwiki/pmwiki.php/Franchise/TheSmurfs", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons"], "non_media_links": ["/pmwiki/pmwiki.php/Main/RuleOfFunny", "/pmwiki/pmwiki.php/Main/Montages", "/pmwiki/pmwiki.php/Main/InstantHomeDelivery", "/pmwiki/pmwiki.php/Main/OffscreenRealityWarp", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/NoDelaysForTheWicked", "/pmwiki/pmwiki.php/Main/TurnedUpToEleven", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/BreakingTheFourthWall", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/OneHitWonder", "/pmwiki/pmwiki.php/Main/RuleOfFunny", "/pmwiki/pmwiki.php/Main/TravellingAtTheSpeedOfPlot", "/pmwiki/pmwiki.php/Main/FreeRangeChildren"]}