{"title": "Flash Fiction", "content": "Flash fiction is a term for an extremely short story. The length can vary between one sentence and a couple of pages. Depending on whom you ask, the maximum length can be anywhere from 300 to 1000 words.\n\nThere are several competitions for flash fiction. Often the rules for these contests give specific word counts, like 42 or 69; entrants who miss the mark are disqualified. Other contests give a list of what must be contained in the story, the winner being the one who fits all of those criteria while producing the shortest story. These stories are often only one or two sentences long.\n\nThis is a type of Prose Fiction; more information can be found at \"the other wiki\" . Compare Drabble. A subtrope of Minimalism and Constrained Writing.\n\nHas nothing to do with Fan Fic of The Flash. Or fiction run in Adobe Flash.\n• Aesop's Fables are probably the earliest example of flash fiction.\n• Isaac Asimov was a master of this. He once wrote a story while giving a TV interview\n• Flash is a flash fiction magazine published the University of Chester Press in Chester. It was established in 2008. It accepts submissions for publication by any author on any topic. The editors are Professor Ashley Chantler and Professor Peter Campbell.\n• There Are No Windows In A Cocoon is a collection of very short flash fiction.\n• A (probably fictitious) anecdote claims that Ernest Hemingway once won a bet to write a short story that was only six words long with the following:\n• István Örkény has an entire collection of them, called One Minute Stories. The shortest one is called Blank Page - although it does come with a disclaimer stating that he didn't really have anything to say in it, so he leaves it open for interpretation. Another is merely two words, and an Long Title.\n• Yet another called \"Stamp\" consists of a single stamp with the sentence written along the edge: \"To hell with everything\".\n• Franz Kafka wrote several very short stories; one called Give it up! could be used to represent his entire work.\n• El Dinosaurio (The Dinosaur) by Augusto Monterroso is said to be the shortest story ever: \"Cuando despertó, el dinosaurio todavía estaba allí.\" A close translation is: \"When he/she/it (Spanish doesn't require specification) woke up, the dinosaur was still there.\"\n• Uncle John's Bathroom Reader Presents Flush Fiction is a collection of 87 stories under 1000 words long. Given where the stories are supposed to be read, that's probably the perfect length.\n• El emigrante by Luis Felipe Lomelí is only four words long: \"¿Olvida usted algo?\" \"¡Ojalá!\" (\"Did you forget anything?\" \"I wish!\")\n• Kevin G. Bufton penned the world's shortest horror story in a mere six words.\n• Though not itself an example, Fredric Brown's Knock mentions one: There is a sweet little horror story that is only two sentences long: \"The last man on Earth sat alone in a room. There was a knock at the door.\"\n• Brown later realised he could make it even shorter but just as scary: \"The last man on Earth sat alone in a room. There was a lock on the door.\"\n• Inspired by the \"six word story\" apocryphally attributed to Hemingway, here's a collection of six-word stories by several famous writers, including Neil Gaiman, Orson Scott Card, Joss Whedon, and Alan Moore.\n• An old joke has it that a writing teacher once assigned a story combining themes of religion, royalty, mystery, and sex. A student managed to accomplish all this in just one sentence: \"My God,\" said the Queen, \"who's that touching my leg?\"\n• Most of Hans Von Hozel's works, they are quite short.\n• Grandpa Gray by Cass Hollander is only 68 words long.\n• Bruce Coville's Book of...: Book of Nightmares contains the short story Toll Call, which is exactly fifty words long (excluding the title, author's name and Coville's blurb at the top).", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/FlashFiction", "media_links": ["/pmwiki/pmwiki.php/Franchise/TheFlash", "/pmwiki/pmwiki.php/Literature/AesopsFables", "/pmwiki/pmwiki.php/Creator/IsaacAsimov", "/pmwiki/pmwiki.php/Literature/ThereAreNoWindowsInACocoon", "/pmwiki/pmwiki.php/Creator/ErnestHemingway", "/pmwiki/pmwiki.php/Literature/HemingwaysSixWordStory", "/pmwiki/pmwiki.php/Creator/FranzKafka", "/pmwiki/pmwiki.php/Literature/UncleJohnsBathroomReader", "/pmwiki/pmwiki.php/Creator/FredricBrown", "/pmwiki/pmwiki.php/Literature/HemingwaysSixWordStory", "/pmwiki/pmwiki.php/Creator/NeilGaiman", "/pmwiki/pmwiki.php/Creator/OrsonScottCard", "/pmwiki/pmwiki.php/Creator/JossWhedon", "/pmwiki/pmwiki.php/Creator/AlanMoore", "/pmwiki/pmwiki.php/Creator/HansVonHozel", "/pmwiki/pmwiki.php/Literature/GrandpaGray", "/pmwiki/pmwiki.php/Creator/CassHollander", "/pmwiki/pmwiki.php/Literature/FlyingWithSanta", "/pmwiki/pmwiki.php/Literature/BruceCovillesBookOf"], "non_media_links": ["/pmwiki/pmwiki.php/Main/ProseFiction", "http://en.wikipedia.org/wiki/Flash_fiction", "/pmwiki/pmwiki.php/Main/Drabble", "/pmwiki/pmwiki.php/Main/Minimalism", "/pmwiki/pmwiki.php/Main/ConstrainedWriting", "/pmwiki/pmwiki.php/JustForFun/IThoughtItMeant", "/pmwiki/pmwiki.php/Main/FanFic", "/pmwiki/pmwiki.php/UsefulNotes/AdobeFlash", "/pmwiki/pmwiki.php/Main/BeigeProse", "/pmwiki/pmwiki.php/Main/ExcuseMeWhileIMultitask", "http://www.writingandsnacks.com/storygrenades/", "http://www.snopes.com/language/literary/babyshoes.asp", "/pmwiki/pmwiki.php/Main/ExactlyWhatItSaysOnTheTin", "/pmwiki/pmwiki.php/Main/LongTitle", "https://en.wikisource.org/?curid=114463", "http://www.microhorror.com/microhorror/author/kevin-g-bufton/small-ad/", "http://www.wired.com/wired/archive/14.11/sixwords.html", "/pmwiki/pmwiki.php/Fanfic/LoveAtFirstSight"]}