{"title": "Self-Botched Catchphrase", "content": "It's become a staple of media that characters will have catch phrases. But sometimes, the character himself just can't get it right. It could be a combination of many things, such as they could get distracted mid-quote, or perhaps they're out of practice. Or if it's an origin story for a well-established character, you may expect them to stumble over it the first few times they try to say it.\n\nOften will appear in Hilarious Outtakes, though whether or not it is intentional or just a flubbing of the line attempting to say it right varies, but this trope only deals when it happens In-Universe. In a work where the common tropes tend to get deconstructed, you can expect to see this more than in one where they are played straight. Usually Played for Laughs, though sometimes it could signal a serious Out-of-Character Moment.\n\nNot to be confused with Mangled Catch Phrase for when an impostor is failing at it. Related to Borrowed Catch Phrase, when other characters take a turn at it (though only if they get it wrong). Compare to Subverted Catch Phrase, when a character intentionally changes it up, and Alternate Catchphrase Inflection where they get the words right but not the tone.\n• In The Incredible Hulk, Bruce Banner tries to tell a bunch of thugs trying to intimidate him that they wouldn't like him when he's angry. The effect is a bit lost in translation. Banner: (in Portuguese) Don't make me... hungry. You wouldn't like me when I'm... hungry. (in English) Wait, that's not right.\n• In Looney Tunes: Back in Action, it forms a Brick Joke, with Porky Pig complaining about the studio telling him to fix his stutter in the first few minutes of the movie. At the end, he stutters so much he can't even get his usual \"That's all, folks!\" out, even as the lights go off around him. He ends up just having to grimace and say \"Go home, folks.\"\n• Captain Jack Sparrow really only managed to get his catch phrase out properly once, but that doesn't stop him from trying to utter it at every opportunity in the Pirates of the Caribbean series\n• In Underdog, the titular canine is trying to come up with a catch-phrase but constantly screws them up or makes an awful rhyme, before he settles on the classic \"There's no need to fear, Underdog is here!\"\n• In Discworld, Cut-me-own-Throat Dibbler manages to botch his catch phrase in Night Watch after Vimes travels 33 years into the past and inadvertently teaches it to him.\n• In the Doctor Who episode \"The Almost People\", the Doctor takes this Up to Eleven by managing to botch two of his catch phrases at once. It Makes Sense in Context. I reversed the jelly baby of the neutron flow!\n• In The Legend of Zelda: Breath of the Wild, banana salesmen that turn out to be Yiga footmen will occasionally shout \"For the banana!\" instead of \"For the boss!\" if confronted after Master Kogha has been defeated .\n• FreedomToons: Daily Wire host Ben Shapiro flubs his Catchphrase, \"Facts don't care about your feelings\", after Dr. Mac causes his intelligence to degrade, perverting it into \"Feelings don't care about your facts\".\n• As noted in the quote above, Sarge from Red vs. Blue failed at his own (forced) catch-phrase \"You just got Sarge'd,\" when he prematurely fires his shotgun in the middle of it.\n• Yu-Gi-Oh! The Abridged Series loves to do this to Kaiba's catchphrase. To date, he has said \"Screw the Money, I Have Rules!\" and \"Screw The Rules I Have Green Hair\" due to a flub and a drug-addled flashback respectively.\n• In the Futurama episode \"How Hermes Requisitioned His Groove Back\", Hermes is so shocked from seeing his office trashed on inspection day, he can only mutter \"Sweet...something...of someplace\" instead of his usual Mad Libs Catch Phrase.\n• The Simpsons featured an episode where Springfield Elementary got school uniforms, causing the school to become more obedient. This leads Nelson to flub his own Signature Laugh with \"Haw... huh?\"\n• In one episode of Danny Phantom, when Danny has taken leave of his senses, he transforms with \"I'm going... to become... ghostly!\" Instead of his usually \"I'm going ghost\".\n• At the end of one episode of Buzz Lightyear of Star Command, Buzz tries out a Mangled Catch Phrase uttered by an animatronic likeness of him. After the Collective Groan his crew uttered, he states it doesn't really work.\n• Atom Ant botches his catch phrase \"Up and at 'em, Atom Ant\" in an episode where he's tempted with a picnic. Instead he says \"Up and eat 'em, Picnic Ant!\"\n• Dick Dastardly botches his \"Drat! Drat and double drat!\" in the Dastardly & Muttley episode \"There's No Fool Like A Re-Fuel\" after he gets flattened by a barrel of oil. He says \"Flat! Flat! And triple flat!\"", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/SelfBotchedCatchPhrase", "media_links": ["/pmwiki/pmwiki.php/Film/TheIncredibleHulk", "/pmwiki/pmwiki.php/Film/LooneyTunesBackInAction", "/pmwiki/pmwiki.php/Franchise/PiratesOfTheCaribbean", "/pmwiki/pmwiki.php/Film/Underdog", "/pmwiki/pmwiki.php/Literature/Discworld", "/pmwiki/pmwiki.php/Series/DoctorWho", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaBreathOfTheWild", "/pmwiki/pmwiki.php/WesternAnimation/Futurama", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/WesternAnimation/DannyPhantom", "/pmwiki/pmwiki.php/WesternAnimation/BuzzLightyearOfStarCommand", "/pmwiki/pmwiki.php/WesternAnimation/TheAtomAntShow", "/pmwiki/pmwiki.php/WesternAnimation/DastardlyAndMuttleyInTheirFlyingMachines"], "non_media_links": ["/pmwiki/pmwiki.php/Machinima/RedVsBlue", "/pmwiki/pmwiki.php/Main/PreMortemOneLiner", "/pmwiki/pmwiki.php/Main/HilariousOuttakes", "/pmwiki/pmwiki.php/Main/InUniverse", "/pmwiki/pmwiki.php/Main/DeconstructedTrope", "/pmwiki/pmwiki.php/Main/PlayedForLaughs", "/pmwiki/pmwiki.php/Main/OutOfCharacterMoment", "/pmwiki/pmwiki.php/Main/MangledCatchPhrase", "/pmwiki/pmwiki.php/Main/BorrowedCatchPhrase", "/pmwiki/pmwiki.php/Main/SubvertedCatchPhrase", "/pmwiki/pmwiki.php/Main/AlternateCatchphraseInflection", "/pmwiki/pmwiki.php/Main/YouWouldntLikeMeWhenImAngry", "/pmwiki/pmwiki.php/Main/BrickJoke", "/pmwiki/pmwiki.php/Discworld/NightWatch", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Main/ItMakesSenseInContext", "/pmwiki/pmwiki.php/Main/TrademarkFavoriteFood", "/pmwiki/pmwiki.php/WebAnimation/FreedomToons", "/pmwiki/pmwiki.php/Main/CatchPhrase", "/pmwiki/pmwiki.php/Main/BecameTheirOwnAntithesis", "/pmwiki/pmwiki.php/Machinima/RedVsBlue", "/pmwiki/pmwiki.php/Main/ForcedMeme", "/pmwiki/pmwiki.php/WebVideo/YuGiOhTheAbridgedSeries", "/pmwiki/pmwiki.php/Main/ScrewTheRulesIHaveMoney", "/pmwiki/pmwiki.php/Main/ScrewTheMoneyIHaveRules", "/pmwiki/pmwiki.php/Main/YouGottaHaveBlueHair", "/pmwiki/pmwiki.php/Main/MadLibsCatchPhrase", "/pmwiki/pmwiki.php/Main/SignatureLaugh", "/pmwiki/pmwiki.php/Main/MangledCatchPhrase", "/pmwiki/pmwiki.php/Main/CollectiveGroan"]}