{"title": "Game Level", "content": "An atomic building block and organizational unit of a game's narrative. There is a distinct interruption of play at the end of each level, usually consisting of some manner of splash screen, and often also consisting of some kind of map or menu from which the player can choose what to do next.\n\nLevels are generally self-contained. Aside from major game events, actions in one level do not typically have any effect on other levels. A monster can not pursue the player from one level to the next, and certain classes of item or ability the player has do not carry over either. In particular, time-limited abilities will expire even if the player has time left on the clock. Likewise, the state of everything with a level at its outset is deterministic: the player and other characters will always be in the same location when a level starts, regardless of how long the player took to get to this level and (usually) by what path they approached this level.\n\nLevels were originally a technological necessity, a way to break up a game such that only a small part of it needed to be loaded into memory at any time. As a result, many of the earliest games did not contain this concept, as the games were simple enough that they did not benefit from this sort of organization. These older games were, however, often divided into \"rounds\", effectively the same level played over and over, to make the player feel like he was accomplishing something.\n\nThe technological requirement still applies for many games (it is usually during a break between levels that the game system loads from the disc), but even games which do not require it will often use levels as a convenient way to organize the narrative.\n\nGames which use multiple styles of play will usually only change the style between levels.\n\nLevels are often grouped hierarchically. A sequence of thematically similar levels can be grouped together into a \"world\", or a series of very short set pieces usually called \"scenes\" can occur within a single level, according to the naming conventions of the game. Different sorts of Checkpoint may be located between these various classes of level. The \"world\" organizational unit has become substantially less common these days.\n\nA level itself is generally linear in design: there is precisely one end-state, and a fixed sequence of sub-goals the player must accomplish to reach this end-state. In traditional games, the level is also physically linear, extending in a straight line from the beginning (usually on the left) to the end (usually on the right). Levels may be connected in a number of ways:\n• Linear: The player moves in a strictly ascending order from one level to the next. There may be rare exceptions which allow a player to bypass a level or group of levels.\n• Lattice: At the end of each level, depending either on an explicit player choice or as a result of how they played the previous level, they are sent to one of several following levels. In this model, the levels are organized as a series of steps. The starting step contains one level, the level on which the player starts. At each step, the player needs complete only one of the levels available to them to progress to the next step. If there are multiple levels in the final step, the game will have Multiple Endings. How the player exits a level will generally determine which level they will play on the next step. This design is often seen in tournament-themed games.\n• Network: Each level is a node in a network, connected to some number of other nodes. The player may move between any two levels so long as their path does not cross a level not yet completed. Such games generally begin similarly to linear games, but become more freeform in the middle, allowing the player to complete the mid-game levels in any order they choose, subject to various constraints. Unlike the lattice model, the individual level is treated, at the global view, as a simple barrier: once it is broken, the player can travel to any adjacent node.\n• Freeform: The player may complete levels in whichever order they choose, but must complete all of them before reaching the endgame. (Their choice may still be constrained by the relative difficulty of each level.)\n\nAs a general rule, levels are arranged in increasing difficulty, but this is not a strict rule, and is much less true of network and freeform games than of linear and lattice games. Difficulty and level ordering can be orthagonal constructs, with difficulty constraining where the player can go next, even though the ordering of levels is not actually fixed. Also, these systems can be applied differently at different hierarchies: levels within a world form a network, but the worlds themselves are linear.\n\nTravel between levels may be unidirectional, or the player may be able to revisit past levels. Usually, the player can move to any level he has already visited without having to replay any other levels along the way. Upon revisiting a \"cleared\" area, he will find it reset to the exact state it was in when he first entered it.\n\nShows utilizing Pac-Man Fever will often show video games using the \"linear\" type of level movement, regardless of whether or not the game actually has this kind of progression—or levels at all.\n• Gorf is an early example of a game that presented genuinely different levels to the player, rather than simply repeating the same level over and over with increasing difficulty. Other early examples include Galaga, Scramble, Pole Position, Astro Blaster, and Ms. Pac-Man.\n• Super Mario Bros. introduced the organizational unit of the \"world\". Super Mario Bros. 3 was the first of the franchise to introduce a world map, where the player went between levels to traverse the network of levels. Levels often reflect different styles of play: some levels auto-scroll, some are underwater, others underground.\n• Metroid plays down the separation between levels by allowing the player to visit them in any order and as often as she likes, but each level is self-contained, and only accessible via an elevator ride (which also serves as a Checkpoint).\n• Spy games tend to have radically different styles of play between levels: Golgo 13: Top Secret Episode had several different types of level, Spy Hunter had both driving- and boating- type levels, and many of the recent James Bond games alternate between First or Third Person Shooter and Driving.\n• Adventure Games tend to use levels (often called \"Chapters\" or \"Days\") as an organizational unit, and may or may not have specific effects from the previous level carry over. Unlike most other genres, the ordering of levels is most often linear, while events within a level tend to be far less linear. Before the emergence of DVD-ROM, these chapter breaks tended to be where disc changes were required.\n• Part of the popularity of Mega Man was its freeform level design which let the Robot Masters be fought in any order; it was the one of the first Platformers — and one of the first video games overall — to have it. To be more precise, the first several stages of each game were freeform, then they switched to a linear structure for the few leading to the final boss.\n• SoulCalibur II has a Network style arrangment for it's Weapon Master story mode.\n• SoulCalibur III has a strongly segregated lattice-style level design in its story mode, but it isn't ever explicitly shown to the player. Lattice transitions are made based on rather opaque decisions made during the story mode itself.\n• Most of the Darius games explicitly display the level lattice and lets the player decide based on that. The lattice is cross-connected, unlike the one in SoulCalibur III, and generally leads to a broad selection of final levels (except in Darius Twin).\n• Shadow the Hedgehog provides a broad, cross-connected level lattice and keeps track of which paths through the lattice the player has ever taken on a winning playthrough. Lattice paths are taken based on whether the Hero, Neutral, or Dark mission was accomplished.\n• Wing Commander included a level lattice based on the success or failure of the campaign in each star system.\n• Eternal Darkness has a linear level progression, but as most of the actual levels are in reality just biographical stories in a book, any magick spells the various characters learned in their own chapters are automatically learned by anybody else who picks up the book later.\n• Star Fox 64 used the Lattice system. Most levels had two paths depending on whether you complete a certain objective or not. If you complete it, you can chose both paths, if you fail, you're restricted to the easier path. The ending is decided by whether you enter Venom by the hard or easy path, with the easy path leading to the bad ending.\n• Star Fox Command also has a Lattice system and no less than nine different endings, although you're restricted to one path on the first time through.\n• Prior to the Wham Level, Portal follows the Linear system, with 19 self-contained test chambers of incremental difficulty.\n• Some parts of Portal 2 also follow this system.\n• OutRun used a seamless lattice system. At the end of each stage the road would fork, the direction chosen would determine the next level. This spread of road would then lead to multiple endings.\n• In general, forking right would give an easier level and forking left would give a harder level.\n• Parts of Castlevania III: Dracula's Curse used a lattice style level layout, some parts of which would simply add a level into an otherwise linear path (such as the clocktower), while others changed the overall length of gameplay with certains paths being shorter routes to and through Castle Dracula than others.\n• The Zone-Act format of most Sonic the Hedgehog games is linear, but Knuckles Chaotix threw an exception to this rule: five zones, five acts per zone, and the order in which you play the acts is selected randomly (For example, you start off with a random choice from five different Act 1s, then after you complete a particular zone's Act 1, then it gives you a random choice between that zone's Act 2 and the other Act 1s... and so on, until all 25 acts have been completed).\n• The original Crash Bandicoot (1996) organized its levels linearly, but the first sequel introduced the Freeform Warp Room system: After beating the intro level, the player was given five levels to beat in any order they chose to, after which they moved on to a boss and another set of five levels, wash, rinse and repeat.\n• DDR Extreme 2's Dance Master mode is a particularly elaborate version of the network structure. There's well over 100 levels in there.\n• Dungeon Siege was revolutionary in the way it averted this trope. You could, if you so desired, run all the way from the very beginning of the game to the very end, without ever stopping for any sort of loading screen or menu, essentially making the entire (several hours long) game into one huge level. This was done by loading the next \"area\" into memory just before the entrance to that area came into view. Of course, there's still a general sense of \"levels\" as it is quite clear when you've entered a new \"area\" which undoubtedly would contain new monsters and challenges (like when going from a green meadow into an underground crypt, or any other similar transition).\n• Soul Reaver did the single, seamlessly loading game world thing two years before Dungeon Siege was released.\n• At least the PS1 Spyro games used a freeform mechanic, where multiple levels were accessible from the hub in no particular order-you could even do the boss levels first in some hubs in the first game. Also in the first game, to get to the next hub you had to fulfill a requirement-dragons rescued, gems found, etc.-which, if you work hard enough, you could sometimes have complete as soon as you entered a new hub, letting you skip all of its levels.\n• The original Ape Escape was both linear and somewhat freeform. You unlocked levels linearly, but after unlocking all of them, you had to capture all the monkeys you missed the first time around before fighting the final boss. In this second playthrough, you can visit the levels in any order.\n• The original Kingdom Hearts I uses the node system with the Gummi Ship stages in between worlds. The worlds were the nodes and could be explored freely, while the Gummi Ship stages were divided into linear levels that could be accessed depending on the world where you begin the level. It is averted later (but still near the beginning) in the game when you obtain the warp Gummi that allows you bypass Gummi Ship stages as long as you have been to the destination world before.\n• Similar to Sonic the Hedgehog, each of the levels in Bug! were split into four scenes (three normal stages played in order and a \"finale\", aka boss).\n• The sequel Bug Too! had levels that consisted of different scenes that had to be completed before fighting the level boss, but you could choose the order of scenes to play although you could not backtrack an entire level once it was complete.\n• Fire Emblem games are always divided into \"chapters\" that are generally linear, although some games feature lattice-based \"sidequests\" or network-based \"paralogues.\" In addition, the Fire Emblem Elibe games have a few branching lattice-based chapters as well, each consisting of two different possible maps (in Blazing Blade) or sequences of maps (in Binding Blade) depending on how the player had played up to that point. The Sacred Stones and Awakening conceal their chapters' linearity by arranging them in a network, but it is still necessary to complete the chapters in order.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/GameLevel", "media_links": ["/pmwiki/pmwiki.php/VideoGame/Gorf", "/pmwiki/pmwiki.php/VideoGame/Galaga", "/pmwiki/pmwiki.php/VideoGame/Scramble", "/pmwiki/pmwiki.php/VideoGame/PolePosition", "/pmwiki/pmwiki.php/VideoGame/PacMan", "/pmwiki/pmwiki.php/VideoGame/SuperMarioBros", "/pmwiki/pmwiki.php/VideoGame/SuperMarioBros3", "/pmwiki/pmwiki.php/VideoGame/Metroid", "/pmwiki/pmwiki.php/VideoGame/MegaMan1", "/pmwiki/pmwiki.php/VideoGame/SoulCalibur", "/pmwiki/pmwiki.php/VideoGame/SoulCalibur", "/pmwiki/pmwiki.php/VideoGame/Darius", "/pmwiki/pmwiki.php/VideoGame/ShadowTheHedgehog", "/pmwiki/pmwiki.php/VideoGame/WingCommander", "/pmwiki/pmwiki.php/VideoGame/EternalDarkness", "/pmwiki/pmwiki.php/VideoGame/StarFox64", "/pmwiki/pmwiki.php/VideoGame/StarFoxCommand", "/pmwiki/pmwiki.php/VideoGame/Portal", "/pmwiki/pmwiki.php/VideoGame/Portal2", "/pmwiki/pmwiki.php/VideoGame/OutRun", "/pmwiki/pmwiki.php/VideoGame/CastlevaniaIIIDraculasCurse", "/pmwiki/pmwiki.php/VideoGame/SonicTheHedgehog", "/pmwiki/pmwiki.php/VideoGame/KnucklesChaotix", "/pmwiki/pmwiki.php/VideoGame/DanceDanceRevolution", "/pmwiki/pmwiki.php/VideoGame/DungeonSiege", "/pmwiki/pmwiki.php/VideoGame/LegacyOfKain", "/pmwiki/pmwiki.php/Franchise/SpyroTheDragon", "/pmwiki/pmwiki.php/VideoGame/ApeEscape", "/pmwiki/pmwiki.php/VideoGame/KingdomHeartsI", "/pmwiki/pmwiki.php/VideoGame/SonicTheHedgehog", "/pmwiki/pmwiki.php/VideoGame/Bug", "/pmwiki/pmwiki.php/VideoGame/FireEmblem", "/pmwiki/pmwiki.php/VideoGame/FireEmblemElibe", "/pmwiki/pmwiki.php/VideoGame/FireEmblemTheSacredStones", "/pmwiki/pmwiki.php/VideoGame/FireEmblemAwakening"], "non_media_links": ["/pmwiki/pmwiki.php/Main/GameplayRoulette", "/pmwiki/pmwiki.php/Main/CheckPoint", "/pmwiki/pmwiki.php/Main/WhenAllElseFailsGoRight", "/pmwiki/pmwiki.php/Main/WarpZone", "/pmwiki/pmwiki.php/Main/MultipleEndings", "/pmwiki/pmwiki.php/Main/BreatherLevel", "/pmwiki/pmwiki.php/Main/SchizophrenicDifficulty", "/pmwiki/pmwiki.php/Main/BeefGate", "/pmwiki/pmwiki.php/Main/NoSidepathsNoExplorationNoFreedom", "/pmwiki/pmwiki.php/Main/Backtracking", "/pmwiki/pmwiki.php/Main/PacManFever", "/pmwiki/pmwiki.php/Main/CheckPoint", "/pmwiki/pmwiki.php/Main/AdventureGame", "/pmwiki/pmwiki.php/Main/Platformer", "/pmwiki/pmwiki.php/Main/WhamEpisode", "/pmwiki/pmwiki.php/Videogame/CrashBandicoot1996", "/pmwiki/pmwiki.php/Videogame/CrashBandicoot2CortexStrikesBack"]}