{"title": "Mental Handicap, Moral Deficiency", "content": "The intellectual counterpoint to the Evil Cripple and the inversion of Evil Genius, this character's morals are as repugnant as his mentality is limited. He might be diagnosed with a real life condition (however inaccurately) in-story, or it might be left deliberately vague, but either way, his intellectual impairment and immorality go hand in hand.\n\nThere can be a number of reasons for this combination. Perhaps the character is so severely limited in his ability to understand what is and is not acceptable that he simply does not know any better. This can go double if he is surrounded by equally or even more malicious abled people who enable or encourage his behaviour. Perhaps he is angry at a world that ostracizes or rejects him because of his disability and lashes out because of this. Perhaps his evil and his handicap, at least in theory, have nothing to do with one another; you don't have to be a genius to be dangerous, and evil people come in all forms. Or perhaps the writer is simply \"othering\" people with nonstandard intellectual gifts; needless to say this trope, like Evil Cripple, can be terribly ableist depending on how it's employed.\n\nThe trope can, and often does, overlap with Dumb Muscle, especially if the handicapped character is being manipulated or used by a relative, friend, or associate who does the actual planning. If this is the case, there's a decent chance that the smarter character in the Brains and Brawn duo is physically disabled in some way; writers enjoy pairing this character with the Evil Cripple. It can also easily overlap with Psychopathic Manchild, though the two should not be conflated with one another — Psychopathic Manchild is about a character who is emotionally stunted, while this trope concerns villainous characters with intellectual disabilities. It's not unusual for a character like this to also be portrayed as suffering some form of mental illness, and thus overlap with The Mentally Disturbed, Axe-Crazy, and Insane Equals Violent. However, it's very important to remember that mental disability and mental illness are two different things.\n\nCompare Insane Equals Violent, Evil Cripple, Depraved Dwarf, Evil Albino, and Disability as an Excuse for Jerkassery. Contrast Evil Genius and Dumb Is Good. This should go without saying, but No Real Life Examples, Please!.\n• Aquaman: For a brief moment in the early 2000s, longtime Aquaman nemesis and child murderer Black Manta was retconned into having a crippling case of autism. This resulted in the previously articulate and verbose Manta being reduced to a murderous drone who could only repeat the words \"swim swim!\" while trying to kill Aquaman. The writers actually went so far as to suggest that Manta's evil was a product of his autism, and that cured of it and his mental handicap, he might prove good. Aquaman proceeded to magically cure Manta, and was swiftly betrayed by the villain who revealed he'd always been evil—but the fact Aquaman thought it would work demonstrates that the King of the Seas apparently believes autism makes you a psychopath.\n• Arkham Asylum: Living Hell has Humpty Dumpty. A big, cheerful, affable man, Humphrey doesn't intend to be evil. Unfortunately, he is afflicted with a compulsion to fix anything that he perceives as broken, and decided that he learns best by taking things apart and then putting them back together, which resulted in him a destroying a train, an elevator, a clock tower, and eventually a vast swath of Gotham City's skyline before finally accidentally killing his abusive grandmother by trying to take her apart and put her back together.\n• Batman: Arkham inmate Amygdala is a gigantic man with the intellectual capacity of a five year old and tremendous brute strength, as well as a horrific temper. He's often manipulated into acting as muscle for other members of Batman's rogues gallery.\n• Superman:\n• Bizarro was originally written as simply having an inverted sense of morality, and despite their broken speech patterns, the Bizarros of the Silver Age were often capable of feats that would require substantial intellect. In the modern era, however, Bizarro is more often than not written as a mentally disabled Superman, meaning well, but lacking the intellectual capability to follow through.\n• Non, General Zod's giant, mute henchman, was intellectually disabled by way of a lobotomy forced on him by Krypton's ruling council when he dared to voice his support for Jor-El's theories about Krypton exploding.\n• In Wanted, there is Fuckwit, the \"Down Syndrome clone\" of the local Superman expy.\n• Friday the 13th: The scripts for the early films present a young Jason Voorhees as a physically disfigured and mentally handicapped boy suffering from encephalitis. As an adult Jason, masking his condition with first a pillowcase and then a hockey mask, goes on to become a prolific serial killer and mass murderer.\n• The Hills Have Eyes (1977): Mercury, The Clan's lookout is portrayed as the mentally stunted \"pet\" of the family, speaking in a slow, thick voice, struggling with language, and generally being accepted as a source of amusement to his older, more competent, and more vicious brothers, Pluto (who courtesy of his actor's real life Hypohidrotic ectodermal dysplasia is physically handicapped) and Mars (the only one of Papa Jupiter's sons who isn't disabled in some fashion).\n• Hot Fuzz: Lurch is a hulking behemoth but also a simpleton unable to vocalize anything other than a high-pitched affirmative \"Yarp\", and still he willingly works for the villains without any remorse.\n• Mad Max: Beyond Thunderdome has an antivillainous version in Master-Blaster a tag-team duo comprising the smart but dwarfed, Master and the hulking giant, Blaster, who suffers from Down's Syndrome and cannot survive Bartertown's ruthless society without Master's guidance. Blaster acts as Master's enforcer, enabling the two to rule Bartertown as tyrants, until Auntie Entity and Max spike their wheel.\n• Mad Max: Fury Road: Rictus Erectus, youngest son of Immortan Joe, is a towering seven foot giant with severe mental deficiencies that render him about intellectually equal to a prepubescent boy. He's also physically disabled, requiring an oxygen tank in order to breath, though this does not stop him from being an unstoppable fighter. As is often the with this trope, he's contrasted with his ill but mentally adept father, and especially his eldest brother, Corpus Colossus, who is highly intelligent but dwarfed due to brittle bone disease.\n• Superman II: During the sentencing scene at the beginning of the film, Non, Zod's mute, giant henchman is described as being as evil and violent as he is intellectually impaired. This is borne out by the rest of the film, where Non is little more than a thug for Zod, doing whatever the General tells him to with the same blank expression on his face.\n• The Texas Chainsaw Massacre and its sequels, spinoffs, and remakes have always portrayed iconic slasher Leatherface as intellectually disabled and submissive to his far more overtly malicious family members. He's mute save for his ability to make animal noises, communicates only by means of whichever mask he is wearing, and on at least one occasion is flat out described by another family member as \"simple\".\n• The Elenium: Adus is a physically disfigured and almost nonverbal killing machine, who suffers from berserk rages and enjoys killing and raping anyone he encounters. Despite the best efforts of his employer, Martel, Adus is barely literate, incapable of looking after his own hygiene, and utterly useless for any tasks that don't involve murder or immediate and straightforward violence. Alternately described as \"frighteningly stupid,\" \"barely human,\" and a \"walking battleaxe\", Adus is pretty clearly disabled in some fashion, even if the characters, living in a medieval Europe analogue, lack the language to describe him as such.\n• Criminal Minds:\n• Joe (no last name) from Season 3's \"Damaged\" was a mentally disabled killer who murdered the parents of one of his friends in a rage when the father struck him. Years after the murders he is arrested by the BAU when the carnival he works at returns to town.\n• Lucas Turner of Season 4 finale \"To Hell and Back\" suffered from both autism and \"mild mental retardation\" and was entirely under the thumb of his ruthless older brother Mason whom he'd accidentally crippled when they were younger. Kidnapping homeless men and women for the quadriplegic Mason, Lucas killed them with a hammer, then fed their bodies to the family's pigs while Mason watched.\n• Benjamin \"Cy\" Bradstone of Season 7's \"Proof\" was a severely intellectually disabled man who was also a psychopath and sexual sadist. Having been rejected by his sister-in-law after molesting her when they were teenagers, he stalks, disfigures, blinds, and murders women who remind him of her. He later graduates to not only blinding his victims, but taking away their senses of touch, taste, etc, with sulfuric acid, culminating in an assault on his niece that leaves her permanently mutilated.\n• Daredevil: In the comics Melvin \"Gladiator\" Potter was a mentally ill man who suffered from the delusional belief that he was a Roman gladiator and the Kingpin was his Emperor. In the show, Melvin was instead presented as mentally disabled, admitting to requiring help from his friend Betsy in order to tell right from wrong and living in fear of Kingpin, who had threatened to harm Betsy if Melvin didn't work for him. When Matt defeats Melvin in a fight and offers to save Betsy from Kingpin, Melvin, depicted as an Idiot Savant when it comes to weapons and armor design, quickly switches sides and begins designing costumes for Matt.\n• Justified: Wade Messer, drug-dealer, drug addict, petty thief, and accessory to murder is described by Raylan as \"a board certified imbecile\" and his behaviour over the course of the show backs this up. His occasional confederate, erstwhile employer, and eventual murderer, alligator poacher and drug-runner Dewey Crowe, is in a similar boat, being scarcely literate, barely articulate, and unable to tell a good idea from a bad one even if it's explained to him at length. His cousin, Dilly Crowe, is even more impaired, and his brothers, Daryl Jr and Danny regard him as such an impediment to the family smuggling business that they eventually kill him.\n• Debilitas in Haunting Ground seems to act like a dog with the mind of a toddler, and he only really wants to play with the pretty dolly. The problem is Fiona is the \"pretty dolly\" and he'll crush her to death with his hug if he gets his hands on her. You later find out he's a failed experiment, being a homunculus created from a dog's placenta, and that he can be spared and even redeemed if you make the right choices .\n• In The Order of the Stick, The Brute Thog is a simpleminded Blood Knight who takes childlike glee in taking a battleaxe to everyone in his path. Unfortunately, this makes him useful Dumb Muscle for the Card Carrying Villains of the Linear Guild. Fortunately, it means that his murderous rampages can be reined in with fudge ripple ice cream.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/MentalHandicapMoralDeficiency", "media_links": ["/pmwiki/pmwiki.php/ComicBook/Aquaman", "/pmwiki/pmwiki.php/ComicBook/ArkhamAsylumLivingHell", "/pmwiki/pmwiki.php/ComicBook/Batman", "/pmwiki/pmwiki.php/ComicBook/Superman", "/pmwiki/pmwiki.php/ComicBook/Wanted", "/pmwiki/pmwiki.php/Franchise/FridayThe13th", "/pmwiki/pmwiki.php/Film/TheHillsHaveEyes1977", "/pmwiki/pmwiki.php/Film/HotFuzz", "/pmwiki/pmwiki.php/Film/MadMaxBeyondThunderdome", "/pmwiki/pmwiki.php/Film/MadMaxFuryRoad", "/pmwiki/pmwiki.php/Film/SupermanII", "/pmwiki/pmwiki.php/Franchise/TheTexasChainsawMassacre", "/pmwiki/pmwiki.php/Literature/TheElenium", "/pmwiki/pmwiki.php/Series/CriminalMinds", "/pmwiki/pmwiki.php/Series/Daredevil", "/pmwiki/pmwiki.php/Series/Justified", "/pmwiki/pmwiki.php/VideoGame/HauntingGround", "/pmwiki/pmwiki.php/Webcomic/TheOrderOfTheStick"], "non_media_links": ["/pmwiki/pmwiki.php/Main/EvilCripple", "/pmwiki/pmwiki.php/Main/EvilGenius", "/pmwiki/pmwiki.php/Main/HollywoodAutism", "/pmwiki/pmwiki.php/Main/AmbiguousDisorder", "/pmwiki/pmwiki.php/Main/EvilCripple", "/pmwiki/pmwiki.php/Main/DumbMuscle", "/pmwiki/pmwiki.php/Main/BrainsAndBrawn", "/pmwiki/pmwiki.php/Main/EvilCripple", "/pmwiki/pmwiki.php/Main/PsychopathicManchild", "/pmwiki/pmwiki.php/Main/PsychopathicManchild", "/pmwiki/pmwiki.php/Main/TheMentallyDisturbed", "/pmwiki/pmwiki.php/Main/AxeCrazy", "/pmwiki/pmwiki.php/Main/InsaneEqualsViolent", "/pmwiki/pmwiki.php/Main/InsaneEqualsViolent", "/pmwiki/pmwiki.php/Main/EvilCripple", "/pmwiki/pmwiki.php/Main/DepravedDwarf", "/pmwiki/pmwiki.php/Main/EvilAlbino", "/pmwiki/pmwiki.php/Main/DisabilityAsAnExcuseForJerkassery", "/pmwiki/pmwiki.php/Main/EvilGenius", "/pmwiki/pmwiki.php/Main/DumbIsGood", "/pmwiki/pmwiki.php/Administrivia/NoRealLifeExamplesPlease", "/pmwiki/pmwiki.php/SelfDemonstrating/Bizarro", "/pmwiki/pmwiki.php/Main/BadIsGoodAndGoodIsBad", "/pmwiki/pmwiki.php/Main/HeroWithAnFInGood", "/pmwiki/pmwiki.php/Main/TheBrute", "/pmwiki/pmwiki.php/Main/CannibalClan", "/pmwiki/pmwiki.php/Main/EvilCripple", "/pmwiki/pmwiki.php/Main/Antivillain", "/pmwiki/pmwiki.php/Main/EvilGenius", "/pmwiki/pmwiki.php/Main/DepravedDwarf", "/pmwiki/pmwiki.php/Main/HandicappedBadass", "/pmwiki/pmwiki.php/Main/DarkLordOnLifeSupport", "/pmwiki/pmwiki.php/Main/DepravedDwarf", "/pmwiki/pmwiki.php/Main/SilentAntagonist", "/pmwiki/pmwiki.php/Main/TheBrute", "/pmwiki/pmwiki.php/Main/DumbMuscle", "/pmwiki/pmwiki.php/Main/TheBrute", "/pmwiki/pmwiki.php/Main/MagnificentBastard", "/pmwiki/pmwiki.php/Main/EvilCripple", "/pmwiki/pmwiki.php/Main/DropTheHammer", "/pmwiki/pmwiki.php/Main/IdiotSavant", "/pmwiki/pmwiki.php/Main/ObliviouslyEvil", "/pmwiki/pmwiki.php/Main/HeelFaceTurn", "/pmwiki/pmwiki.php/Main/TheBrute", "/pmwiki/pmwiki.php/Main/BloodKnight", "/pmwiki/pmwiki.php/Main/AnAxeToGrind", "/pmwiki/pmwiki.php/Main/DumbMuscle", "/pmwiki/pmwiki.php/Main/CardCarryingVillain", "/pmwiki/pmwiki.php/Main/AllLowercaseLetters"]}