{"title": "Rock Me, Amadeus!", "content": "Where an artist takes a Standard Snippet or other piece of classical music and incorporates it into their song. Could be small snippet of the piece or much longer. Might result in Crowning Music of Awesome when done properly.\n\nSpeculatively, the motivations for classical sampling are:\n• A way of highlighting the qualities of classical and pop music by contrasting them.\n• Simply as a useful gimmick to make a song stand out.\n\nA Sub-Trope of Sampling that normally gets around pesky legal issues by virtue of most classical music falling into the public domain. Named after the song by Falco, which, contrary to the title, does not use this trope.\n\nNot to be confused with Rock Me, Asmodeus!. Nor with Wolfgang Amadeus Mozart, although his music is likely to show up. Genre Mashup occurs when multiple genres, not just melodies, are combined. See also Public Domain Soundtrack. Compare Classical Music Is Cool, and contrast Classical Music Is Boring.\n• Accept has several of these:\n• \"Sodom & Gomorrah\" has an excerpt from the \"Sabre Dance\" from \"Gayane\" by Aram Khachaturian.\n• \"Metal Heart\" has an excerpt of Tchaikovsky's \"Marche Slave\" in the intro and one of Ludwig van Beethoven's \"Für Elise\" in the guitar solo.\n• The standalone guitar solo from the live album Staying a Life has an excerpt of \"In the Hall of the Mountain King\" by Edvard Grieg.\n• The live version of \"Balls to the Wall\" from the same album has an introductory section based on the \"fate\" leitmotif from Carmen by Georges Bizet.\n• They also did an arrangement of the Trio section of Pomp and Circumstance March No. 1 by Edward Elgar (a.k.a. \"Land of Hope and Glory\"), titled simply \"Pomp and Circumstance\".\n• \"In the Hall of the Mountain King\" from Edvard Grieg's incidental music to Peer Gynt is a popular choice:\n• Also in Savatage's \"Prelude to Madness\" and the track that immediately follows, \"In The Hall of the Mountain King\".\n• Worked into \"Hall of the Mountain King\" by Rainbow.\n• And \"Hall of the Mountain King\" by The Who.\n• Listen carefully to the Blue Öyster Cult's \"Burnin' for You\" and Grieg is in there too, briefly.\n• Rick Wakeman uses the melody near the end of \"Journey to the Centre of the Earth\".\n• Egg's début album includes it in \"Symphony No. 2\".\n• Ska P's main riff for \"Simpático Holgazán\" is taken from it.\n• Strangely enough, \"Rock Me Amadeus\" by Falco contains merely a snippet from Beethoven's 5th at the very end.\n• Falco's \"Vienna Calling\" begins with a few bars of The Blue Danube by Strauss.\n• Christian Petzold's Minuet in G (often erroneously attribed to Johann Sebastian Bach) in the Toys' \"A Lover's Concerto\".\n• Muzio Clementi's Sonatina No. 5 in G Major in the Mindbenders' \"A Groovy Kind of Love\".\n• Beethoven's Pathétique Sonata:\n• A movement from is used in Billy Joel's \"This Night\".\n• And the theme from Roughnecks: Starship Trooper Chronicles.\n• Jethro Tull's \"By Kind Permission Of\" also includes the same section.\n• Johann Sebastian Bach's \"Jesu, Joy of Man's Desiring\":\n• \"She Don't Care About Time\" by The Byrds has a guitar solo based on it.\n• Briefly quoted in a bass fill on The Kinks' \"Wicked Annabella\".\n• A sample of the \"Flower Duet\" from Léo Delibes opera Lakmé occurs in in David Usher's \"Black Black Heart\".\n• A full adaption of Also Sprach Zarathustra by Richard Strauss in Deodato's funky song of the same name.\n• \"Play with Me\" by Extreme features riffs from various classical pieces including Mozart's Rondo alla turca and Vivaldi's The Four Seasons.\n• Jazz pianists, especially from around the bebop era, tend to have a couple of classical measures in their improvs. As an earlier example, Fats Waller was apparently a fan of \"In The Hall Of The Mountain King\", as he occasionally mixed pieces of the melody into his tunes, most notably in \"Viper's Drag\".\n• The guitar solo in Spinal Tap's Heavy Duty is the Boccherini minuet. According to the DVD commentary, that was actually the finale to a very intricate and inventive ten-minute solo, but Marty cut it down for time, and made Nigel look like a hack. To make matters worse, the short version made it onto the soundtrack, and is the only one most people have ever heard.\n• The Enigma album The Screen Behind The Mirror samples \"O Fortuna\" to such an extent that you could say it's \"O Fortuna\" with samples of ambient 1990's electronica.\n• Special mention goes to Andrew Lloyd Webber, who has a doggedly negative reputation for copying Puccini. The similarities are real but not as slavish as commonly reported e.g. commonalities in the central theme from Puccini's La fanciulla del West and ALW's \"Music of the Night\". It is interesting that a little bit of copying followed by denial caused an uproar whereas other artists copy big chunks of classical music wholesale with apparent acceptability. It doesn't help that ALW's work tends to repeat.\n• Antonín Dvořák's Symphony No. 9:\n• Forms the basis of Blind Guardian's \"By the Gates of Moria\".\n• Also the Rhapsody of Fire song \"The Wizard's Last Rhymes\".\n• And quoted in the bridge of the cover of \"America\" by The Nice.\n• Used at the start of Pinkfong's rendition of \"Baby Shark\".\n• Indie darkwave/new wave band Thou Shalt Not borrows from the From The New World symphony as well, for their single unsurprisingly titled \"New World\".\n• The Killers had \"Mr Brightside\" turn into \"Ode To Joy\".\n• Bright Eyes' \"Road to Joy\" incorporates an interpolated version of \"Ode to Joy,\" with fittingly twisted lyrics that subverts the classical piece's triumphant and hopeful tone.\n• Bach's Toccata and Fugue in D minor:\n• \"Plug-in Baby\" by Muse starts with the opening.\n• The basis for the Gyruss theme song. To be exact, it's a direct adaptation of the arrangement performed by Sky, which predates the game by three years (although some parts are left out, since it was made for an early-mid 1980s arcade game).\n• \"Bach onto This \" could even count as a Homage.\n• A Touhou music arrange for Kanako Yasaka's theme, Suwa Foughten Field, begins with the opening.\n• The intro of \"Bad Apple!\" from Lotus Land Story is based on the Fugue part.\n• Eurobeat Brony's \"Discord\" uses the Fugue for its intro.\n• \"Fly Me to the Moon\", popularised by Frank Sinatra, can be heard almost note-for-note near the beginning of the fugue.\n• It's sampled throughout \"Twenty First Century Boy\" by Sigue Sigue Sputnik.\n• The subject of the fugue appears briefly in \"The Greatest Show On Earth\" by Nightwish.\n• The first bars of Bach's Prelude & Fugue No. 2 are done as an appropriately trite intro on harpsichord on The Kinks' \"Session Man\".\n• Chuck Berry's \"Roll Over Beethoven\" begins with the famous \"Da-Da-Da-DUN!\" opening from Beethoven's Symphony No. 5 and has been covered by everybody from ELO to The Beatles. The Electric Light Orchestra version deserves special mention, for taking the song and building an entire suite around it - based on the Fifth Symphony, of course.\n• In the 1980s, ELO's former conductor Louis Clark worked with British Royal Philharmonic Orchestra on a series of albums .\n• Speaking of ELO, Jeff Lynne and Bev Bevan's previous band the Move had their first hit with 1966's \"Night of Fear,\" derived partly from Tchaikovsky's 1812 Overture. The origins of ELO's classical leanings can be found here.\n• Adagio in G Minor by Remo Giazotto (often misattributed to Tomaso Albinoni):\n• \"Albinoni vs. Star Wars\" by Sigue Sigue Sputnik opens with a quotation.\n• \"Cold is Being\" by the band Renaissance is essentially Adagio in G Minor set to lyrics.\n• \"Albinoni\" by Rollerball (Above & Beyond). Tiesto also did a remix titled \"Athena\", on Parade of the Athletes.\n• Renaissance is pretty much built on this trope, actually.\n• Sting's \"Russians\" uses the melody from Sergei Prokofiev's \"Romance\", part of his Lieutenant Kije Suite.\n• Overused by Emerson, Lake & Palmer, who did at least one classical-to-rock full conversion on every album, like, for instance Pictures at an Exhibition. As did Keith Emerson's previous band the Nice (later reformed for nostalgic reunion concerts). This was also a staple of Sky, the soft-rock group whose members included John Williams (the guitarist, not the movie composer).\n• William Orbits album Pieces In A Modern Style is Exactly What It Says on the Tin. However, the most widely recognized track from the album, Barbers \"Adagio For Strings\" was a remix by Ferry Corsten from the famous Samuel Barber piece, misleading people into thinking the whole album was dance music.\n• Tiesto and Armin Van Buuren have also done remixes. Some DJs have also sampled or remixed from other remixes.\n• Bomani D'Mite Armah's \"Read a Book\" turns Beethoven's 5th Symphony into a Lil' Jon-style rap song. It's a parody advising its target audience to take up good habits such as reading books and drinking water instead of beer.\n• Johann Pachelbel's Canon in D has inspired a great many songs with its chord progression. Jerry C even played the entire tune rock & roll style .\n• The opening of Vitamin C's \"Graduation (Friends Forever)\" directly quotes the piece, although a step lower in pitch.\n• Pet Shop Boys, \"All Over The World\" opens with a synthesised Standard Snippet of a Tchaikovsky piece.\n• Nas' \"I Can\" uses the beginning of Beethoven's Für Elise.\n• David Usher's 2001 Canadian hit Black Black Heart samples The Flower Duet (Sous le dôme épais) from Léo Delibes' opera Lakmé, as a hook.\n• Classical composers liked quoting too:\n• Tchaikovsky famously copied the \"Marseillaise\" and the then-Russian national anthem for the 1812 Overture and a number of Italian songs for the Capriccio Italien.\n• Beethoven took 'Rule, Britannia' and 'God Save the King' for his Wellington's Victory (Op. 91) along with the French 'Malbrough s'en va-t en guerre' (identical to 'For He's a Jolly Good Fellow'), reputedly Napoleon's favourite tune.\n• Brahms' \"Academic Festival Overture\" is made up of quotations from traditional collegiate songs such as \"Gaudeamus Igitur.\"\n• Aaron Copland made an art form out of reworking and rephrasing American folk tunes, the best known of which is his use of the Shaker hymn \"Simple Gifts\" in Appalachian Spring.\n• Japanese Symphonic Power Metal/Neo-Classical Metal Band Galneryus incorporates several bits of Tchaikovsky's Violin Concerto in D Opus 35 in their song, \"Angel Of Salvation\". The first part of the intro is literally the same, note for note, played by a complete symphonic orchestra, and at several other points in the song, they draw so heavily on the Violin Concerto that \"Angel Of Salvation\" has been referred to as \"basically an original arrangement of Tchaikovsky's Violin Concerto in D\".\n• Evanescence's Lacrymosa samples the opening of the \"Lacrimosa\" from Wolfgang Amadeus Mozart's \"Requiem\" throughout the whole song.\n• Hollenthon does this all the time. Lords of Bedlam samples the Romeo and Juliet tune to great effect.\n• Apotheosis has done O Fortuna but it only really becomes Crowning Music of Awesome in the Excalibur remix .\n• Chumbawumba's \"Tubthumping\" includes the \"Prince of Denmark's March\" at the end.\n• Sweetbox's \"Everything's Gonna Be Alright\" is based around the Air from Johann Sebastian Bach's Orchestral Suite No.3.\n• Walter Murphy and the Big Apple Band's \"A Fifth of Beethoven\" quotes Beethoven's Symphony No. 5 in C minor. It was most famously used in the film Saturday Night Fever. Also in the film was David Shire's funky reworking of Mussorgsky's Night on Bald Mountain, which was called Night on Disco Mountain.\n• Following Murphy's hit a group called The Philarmonics gave similar treatment to Für Elise. \"For Elise\" peaked at #100 on Billboard's Hot 100.\n• Trans-Siberian Orchestra's Requiem samples the famous intro to Beethoven's 5th. \"Requiem\" is part of a rock opera titled Beethoven's Last Night. It also includes snippets of Mozart and \"Flight of the Bumblebee\" by Nikolai Rimsky-Korsakov.\n• Indeed, pretty much the entirety of the TSO's output that isn't Christmas stuff is this. Beethoven's Last Night contains at least the \"Moonlight Sonata\", the \"Pathetique\", \"Für Elise\" and the 5th (and a lot more Beethoven, of course), Mozart's overture to The Marriage of Figaro, and Rimsky-Korsakov's \"Flight of the Bumblebee\". Nightcastle contains an actual \"Hall of the Mountain King\", Verdi's Requiem, Orff's Carmina Burana, and a cover of the \"Nutrocker\" (which of course is itself B. Bumble and the Stingers' cover of Tchaikovsky's The Nutcracker).\n• Some of their Christmas music is this as well. Excluding original tracks and arrangements based on traditional Christmas carols, \"Christmas Canon\" is based on Pachabel's Canon in D, \"Mad Russian's Christmas\" is based on the Nutcracker Suite, and \"Wish Liszt (Toy Shop Madness)\" is based on Liszt's Hungarian Dances.\n• Savatage has also dipped into this trope. Their song \"Hall of the Mountain King\" didn't actually sample any of Edvard Grieg's \"Hall of the Mountain King\", but their \"Prelude to Madness\", an extended intro to \"Hall...\", did.\n• Eric Carmen's self-pitying hit \"All By Myself\" is based on the main theme from the slow movement of Sergei Rachmaninoff's Second Piano Concerto. Another one of his hits, \"Never Gonna Fall in Love Again\", is based on the main melody of the third movement of Rachmaninoff's Second Symphony.\n• Malice Mizer made incredibly liberal use of this, to the point where you didn't even to know about classical to spot it. The main source seemed to be guitarist and bandleader Mana, because his new project, Moi Dix Mois, does the same thing.\n• Finnish Thrash Metal band Stone open their album No Anaesthesia! with a metal rendition of Jean Sibelius' Finlandia.\n• The Brian Setzer Orchestra album Wolfgang's Big Night Out contains swing versions of several recognizable classical works. Notably, \"Plead the Fifth\" has the oveture to Beethoven's 5th Symphony, \"For Lisa\" quotes Für Elise, the title track quotes Mozart's Eine Kleine Nachtmusik, \"One More Night With You\" references Grieg's \"Hall of the Mountain King\" and \"Some River In Europe\" samples Strauss' Blue Danube. In their first Christmas album, they also did their version of The Nutcracker Suite, which was based on an arrangement originally performed in the '40s by Les Brown and his Band of Renown.\n• Nile's \"Ramses, Bringer of War\" is based on \"Mars, Bringer of War\" from Gustav Holst's The Planets.\n• \"End of the Century\" from Dance Dance Revolution 3rd Mix samples Beethoven's Ninth Symphony.\n• \"Speed Over Beethoven\" from DDR Extreme samples Ludwig van Beethoven's Für Elise. \"Can't You Feel My Love\" by the same artist (although not featured in DDR) samples the third movement of the Moonlight Sonata.\n• \"Beethoven Virus\" from Pump It Up samples Beethoven's Sonata Pathétique (Piano Sonata No. 8 in C minor, Op. 13). \"Canon D\", is of course, Pachelbel's Canon. In fact, at least 70% of BanYa's catalog for the series is this. To name a few: \"Sorceress Elise\" to Beethoven's Für Elise, \"Turkey March\" to Mozart's Rondo Alla Turca, and \"Winter\" to Vivaldi's L'inverno.\n• \"V\" and \"V2\" from beatmania IIDX samples Concerto No. 4 in F minor, Op. 8, RV 297, L'inverno (Winter) from Vivaldi's The Four Seasons.\n• \"Kakumei\" from beatmania IIDX 7th Style and DDRMAX2 is a dance remix of Chopin's Etude #12, also known as the Revolutionary Etude. (Hence the name, which is Japanese for \"revolution\".)\n• About a third of the soundtrack of Dance Dance Revolution: Mario Mix consists of remixes of classical music.\n• Instrumental track \"Fuck You\" by Satan has a part of Mozart's Eine Kleine Nachtmusik in it.\n• The Ranma ½ opening theme song \"Zettai! Part 2\" uses the intro to Mozart's Eine Kleine Nachtmusik to open and end the song.\n• The intro for Eine Kleine Nachtmusik is also used in the Psychonauts soundtrack, from the level where Raz helps Sasha Nein defeat the censors.\n• The 2112 Overture by Rush includes a snippet of the 1812 Overture by Pyotr Ilyich Tchaikovsky. Get it?\n• The outro of Necrophagist's \"Only Ash Remains\" is part of Sergei Prokofiev's Romeo and Juliet suite.\n• Live versions of \"Heartbreaker\" by Led Zeppelin often include a snippet of Bach's Bourrée in E minor.\n• The Vintersorg song \"For Kung Och Fosterland\", from the album Till Fjalls, features the signature melody from Grieg's \"Hall of the Mountain King\" from Peer Gynt. He is thanked in the credits.\n• Thicke's \"When I get you alone\" has Beethoven's Fifth as the main riff.\n• \"Earth, the Circle Part 1\" by Manfred Mann's Earth Band includes some melodic phrases from both the left-hand and right-hand parts of \"Jimbo's Lullaby\" (from Children's Corner) by Claude Debussy, the right-hand part becoming a vocal melody with lyrics.\n• Megadeth's \"Symphony Of Destruction\" has a piece of the Offertorium (\"Domine Jesu Christe\") from Mozart's Requiem at the start. Also \"Last Rites\", based on Johann Sebastian Bach's Toccata and Fugue in D minor (BWV 565).\n• \"Repent Walpurgis\" by Procol Harum contains an excerpt of Johann Sebastian Bach's Prelude No. 1 in C major (BWV 846).\n• Procol Harum's greatest hit was \"A Whiter Shade of Pale\", based on the Air from Bach's Orchestral Suite No.3.\n• Rhapsody of Fire's 10 minute epic \"The Wizard's Last Rhymes\" borrows heavily from the 4th movement of Dvorak's New World Symphony. On their album From Chaos To Eternity, the songs \"Tempesta di Fuoco\" and \"Heroes of the Waterfalls' Kingdom\" both borrow from Beethoven's Piano Sonata #1 in F Minor.\n• German punk band Die Toten Hosen have an album called Ein Kleines Bisschen Horrorshow — \"A Little bit of Horrorshow\" — which has quite a few bits and pieces of Beethoven's Ninth in it. The songs reference A Clockwork Orange a lot, so this makes sense when you think about it. The first song is even called \"Here Comes Alex\".\n• Sol Bloom's 1893 song \"The Streets of Cairo, or The Poor Little Country Maid\" is popular as a comically stereotypical Standard Snippet for vaguely Middle Eastern settings, so there's no surprise it's been referenced quite a lot.\n• It pops up, drastically slowed down and made to sound menacing, as the main riff of Funkadelic's \"You Scared the Lovin' Outta Me\".\n• David Bromberg's \"Sharon\" has the instrumental introduction (which was Sampled Up by the The Beastie Boys for \"Johnny Ryall\" from Paul's Boutique) include a violin solo which begins by quoting \"The Streets of Cairo\".\n• Patrick Cowley's \"Menergy\" has a synth solo that also begins with the snippet before veering into another place entirely.\n• It is quoted in Frank Zappa's The Grand Wazoo.\n• It's reused in Can's \"Hoolah Hoolah\" from \"Rite Time\".\n• Perhaps not surprisingly, it's also interpolated into \"Istanbul (Not Constantinople)\" by The Four Lads/They Might Be Giants.\n• Pam Tillis' \"Cleopatra, Queen of Denial\" uses it as one half of a guitar duet.\n• Kesha's \"Take It Off\" uses \"The Streets of Cairo\" for its entire chorus. \"There's a place downtown where the freaks all come around \n\nIt's a hole in the wall it's a dirty free for all\"\n• \"God Diva\" from the Japanese Duo Ali Project samples the \"Queen of the Night\" aria from The Magic Flute by Wolfgang Amadeus Mozart.\n• A sample from Tchaikovsky's Nutcracker Suite is used as the \"Game Start\" tune for the Japan-only NES game Devil World. A longer sample would be used in the Devil World level on Art Style: PICTOBITS in a short, but awesome remix .\n• As almost every fan knows, \"Dance of the Sugarplum Fairy\" from Pyotr Ilyich Tchaikovsky's The Nutcracker appears in the licensed NES version of Tetris. The Game Boy version uses the Russian folk song \"Korobeiniki\" instead.\n• Wendy Carlos' album Switched-On Bach is a Cover Album with compositions by Johann Sebastian Bach played on a Moog synthesizer. Her follow-up album \"The Well-Tempered Synthesizer\" adds Montiverdi, Scarlatti, and Handel to more Bach. Her soundtrack of A Clockwork Orange does the same with music by Ludwig van Beethoven and Henry Purcell and her one contribution to the soundtrack of The Shining is \"Dies Irae\" from Hector Berlioz' \"Symphonie Fantastique\" in a similar eerie electronical arrangement.\n• Frank Zappa's guitar solo in \"Status Back Baby\" from Absolutely Free is Igor Stravinsky's \"Petrushka\". On the same album he also quotes from Igor Stravinsky's The Rite of Spring and The Firebird, along with \"Jupiter, Bringer Of Jollity\" from Gustav Holst's The Planets. His album Francesco Zappa is a complete Cover Album with music by the 18th century composer Francesco Zappa, yet played on a Synclavier computer.\n• Zappa also inverted it by working in \"Louie Louie\" in orchestral piece \"Welcome To The United States\" from The Yellow Shark, a collaboration with a huge classical orchestra.\n• The Beatles start \"All You Need Is Love\" with the first few bars of the \"Marseillaise\". In the cacophony towards the end, you can also hear a saxophone playing the first line from Glenn Miller's \"In the Mood\", and Bach's Two Part Invention No.8 in F Major, and \"Greensleeves\".\n• The chorus of ABBA's \"Lay All Your Love On Me\" is based on Modest Mussorgsky's Night on Bald Mountain.\n• Pink Martini often quotes classical music and popular melodies. Their song \"The Gardens of Sampson and Beasley\" manages to quote Delibes' \"Flower Duet\" and \"Oh My Darling Clementine\" in quick succession.\n• \"When I Get You Alone\" by Robin Thicke features a heavy sample of Beethovens Symphony number 5.\n• The Beatles' \"Because\" from Abbey Road is based off Ludwig van Beethoven's Moonlight Sonata; John asked Yoko to play the chords of \"Sonata\" backwards while writing it, but it still sounds like the original.\n• Emilie Autumn, being a classically trained violinist and harpsichordist, provides a few examples:\n• \"Juliet\" has the chorus of \"Greensleeves\" around the end. It's at 4:47 in this video.\n• \"Save You\" ends with a few bars of Pachelbel's Canon.\n• Her cover of Cyndi Lauper's \"Girls Just Wanna Have Fun\" interpolates Fucik's \"Entrance of the Gladiators\", better known as the Standard Snippet for circus music, played on the cello.\n• P.D.Q. Bach usually produces pieces which are nothing but quotations from classical music ... and popular music, and jazz music, and nursery tunes, and ... and ... and...\n• \"Tell\" from In the Groove 2 is a techno remix of Rossini's William Tell Overture. \"Vorsprung Durch Techno\" and \"Summer in Belize\" are based on the Spring and Summer movements, respectively, of Vivaldi's Four Seasons.\n• Sound Horizon's \"Yoiyami no Uta\" includes snippets of classical pieces in rapid succession: Beethoven's \"Ode to Joy\", Chopin's \"Fantaisie-Impromptu\", and Mussorgsky's Pictures at an Exhibition.\n• As the title implies, electronica group Lamb's song \"Górecki\" is built around a sample from Górecki's Third Symphony.\n• Deborah Sasson's \"Carmen (Danger in Her Eyes)\" uses a snippet of \"Habanera\" from George Bizet's Carmen.\n• \"Dido\" (no relation to the singer) by Aria is based on \"Dido's Lament\" from the opera Dido & Aeneas.\n• Brazilian band Ultraje a Rigor has \"Eu Gosto de Mulher\" , whose solo incorporates \"Sabre Dance \" (a Standard Snippet on Looney Tunes and Tom and Jerry, among others)\n• Several examples from Symphony X:\n• \"Divine Wings of Tragedy\" samples both Bach's Mass in B Minor and Gustav Holst's \"Mars, Bringer of War\" from the Planets Suite.\n• Interspersed within the album V-The New Mythology Suite are excerpts of both Verdi's and Mozart's Requiems, Bach's Concerto for Harpsichord in D minor (BWV 1052) and the cantata Ich habe meine Zuversicht (BWV 188), and Béla Bartók's Concerto for Orchestra.\n• Candlemass's \"Marche Funebre\" is an arrangement of Fryderyk Chopin's Funeral March.\n• As well, the solo riff for \"Waterwitch\" is extremely reminiscent \"Dance of the Sugar Plum Fairy\".\n• The song that Roger composes in RENT is a rock version of \"Musetta's Waltz\" from La Bohème, the opera that the musical is based on.\n• Laserdance's \"Voyage of Discovery\" is a spacesynth version of Tchaikovsky's \"Romeo and Juliet\".\n• Greg Lake's seasonal hit \"I Believed In Father Christmas\" uses the Troika sleigh-ride theme from Prokofiev's Lieutenant Kije.\n• KMFDM's \"Liebeslied\" samples Karl Orff's \"O Fortuna.\" Unfortunately for them, \"O Fortuna\" is not in the public domain and they were forced to re-edit the song to remove the sample (although it's still used when they play it live).\n• Love Sculpture had a 1968 UK hit with their rocked-up version of the Sabre Dance from Gayane by Aram Khachaturian (who was still alive at the time, though there seems to be no public record of his reaction).\n• \"Strange Skies\" by The Cruxshadows, the B-side of the single \"Valkyrie\", quotes Wagner's \"Ride of the Valkyries\". Ironically, \"Valkyrie\" itself is not an example of this trope.\n• Another comic version appears in the album, \"Spike Jones is Murdering the Classics!\"\n• Rudebrat's \"Amadeus (Mozart Dubstep Remix )\" is Exactly What It Says on the Tin.\n• Rednex's \"Wild and Free\" is built on the melody of Offenbach's \"Infernal Galop\" from Orpheus in the Underworld. Most people know it best as \"The Cancan Song.\"\n• Deep Purple's \"Under the Gun\" features the first four measures of \"Pomp and Circumstance\" as a bridge.\n• Tim Minchin: during one of the epic solos in Dark Side, he sneaks in a bit of Beethoven's Für Elise.\n• A trademark of The Piano Guys, who combine classical motifs with the contemporary. Their version of \"Mission Impossible\" with Lindsey Stirling features a bit of Mozart's Piano Sonata No. 16 (performed in 5/4 time in a minor key), \"Beethoven's Five Secrets\" mixes elements of Beethoven's Symphony 5 into One Republic's \"Secrets\", and \"Kung Fu Piano: Cello Ascends\" combines Chopin's Prelude Opus 28 with \"Oogway Ascends\" from Kung Fu Panda.\n• Cytus has an entire chapter dedicated to modern arranges of classical songs.\n• Fitting the subject of the song, Sakanaction's \"Bach no Senritsu o Yoru ni Kiita Sei Desu\" (\"Because Of Listening To Bach Melodies At Night\") includes a short Bach snippet played on the piano.\n• Contemporary Christian music veteran David Meece recorded several songs that used classical songs as part of the basis or used snippets as an introduction; such as \"This Time\" (which used Fryderyk Chopin's \"Revolutionary Etude\" in C Minor for the introduction, bridge and ending), \"You Can Go \" (using Johann Sebastian Bach Bach's]] \"Invention 13 in A Minor\" in the same manner as \"This Time\") and \"Falling Down\" (based on a Mozart sonata). In Meece's case, it owed somewhat due to his classical training at the Peabody Conservatory of Music.\n• Inverted by Bill Bailey, who jokes that classical composers sneaked motifs from Cockney music into their works.\n• Machine Messiah by Yes quotes the toccata of Widor's Symphony For Organ no. 5.\n• Former Styx frontman Dennis DeYoung includes part of Ravel's \"Bolero\" when he performs the song \"Lady\" live. It fits perfectly.\n• Synthpop pioneer Jean Jacques Perrey did this a lot. For instance, \"The Elephant Never Forgets\" is Beethoven's \"Turkish Dance\", and \"18th Century Puppet\" quotes the slow movement of Mozart's Eine Kleine Nachtmuzik.\n• \"Septette for the Dead Princess\" , the Final Boss theme from Touhou 6: The Embodiment of Scarlet Devil, was based on the third movement of Beethoven's Pathetique.\n• The first few bars of \"Bear\" by The Antlers are taken almost exactly from \"Twelve Variation on 'Ah vous dirai-je, Maman'\" by Mozart (aka, \"Twinkle Twinkle Little Star\").\n• Sigh's \"Requiem - Nostalgia\" ends with a Standard Snippet of Fryderyk Chopin's Minute Waltz (overlaid with hundreds of samples of giggling babies). Similarly, \"Hangman's Hymn\" quotes liberally from Wolfgang Amadeus Mozart's Requiem in D Minor.\n• Dead Kennedys' \"Chemical Warfare\" contains an excerpt of \"Sobre las Olas\" by Mexican composer Juventino Rosas in its bridge.\n• Bathory's \"Hammerheart\" (the song, not the album) is based on a melody from Gustav Holst's The Planets (specifically, \"Jupiter, the Bringer of Jollity\").\n• Another case of Für Elise usage comes from the Filipino band The Youth. The song? \"Basura\" (Garbage), which is a song that reminds people to properly throw their trash.\n• K-pop group VIXX use part of Beethoven's \"Moonlight Sonata\" in their track Fantasy.\n• Robbie Williams samples Prokofiev's Montagues and Capulets in Party Like a Russian.\n• Italian death metal band Fleshgod Apocalypse uses part of Mozart's Symphony No. 40 as the main theme to their track \"The Violation\".\n• 2Cellos frequently have classical music introductions and interludes in their versions of modern rock songs, such as having the William Tell Overture segue into Iron Maiden's \"The Trooper\" and Vivaldi's \"Cello Sonata #5\" become AC/DC's \"Thunderstruck\" .\n• Japanese alt-rock band BIGMAMA have a trilogy of EP's (appropriately titled Roclassick) specifically devoted to doing this, totaling fourteen songs so far.\n• Vivaldi's \"Spring\" from The Four Seasons (\"Hashire Eros\")\n• Beethoven's Symphony no. 5 (\"Niji o Tabeta Iris\"), Für Elise (\"Therese no Tameiki\"), and Symphony no. 9 (\"No. 9\")\n• Dvořák's Symphony no. 9 (Symphony from the New World) (\"Koukyoukyoku 'Shinsekai'\")\n• Grieg's \"In The Hall of the Mountain King\" (\"Perfect Gray\")\n• Elgar's Pomp and Circumstance (\"bambino bambina\"), invoking some irony by sampling a piece known for western graduation ceremonies in a song about how Growing Up Sucks", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/RockMeAmadeus", "media_links": ["/pmwiki/pmwiki.php/Music/Falco", "/pmwiki/pmwiki.php/Music/WolfgangAmadeusMozart", "/pmwiki/pmwiki.php/Music/Accept", "/pmwiki/pmwiki.php/Music/AramKhachaturian", "/pmwiki/pmwiki.php/Music/PyotrIlyichTchaikovsky", "/pmwiki/pmwiki.php/Music/LudwigVanBeethoven", "/pmwiki/pmwiki.php/Music/EdwardElgar", "/pmwiki/pmwiki.php/Theatre/PeerGynt", "/pmwiki/pmwiki.php/Music/Helloween", "/pmwiki/pmwiki.php/Music/Savatage", "/pmwiki/pmwiki.php/Music/Rainbow", "/pmwiki/pmwiki.php/Music/TheWho", "/pmwiki/pmwiki.php/Music/Zedd", "/pmwiki/pmwiki.php/Music/BlueOysterCult", "/pmwiki/pmwiki.php/Music/RickWakeman", "/pmwiki/pmwiki.php/Music/Egg", "/pmwiki/pmwiki.php/Music/SkaP", "/pmwiki/pmwiki.php/Music/LudwigVanBeethoven", "/pmwiki/pmwiki.php/Music/Rainbow", "/pmwiki/pmwiki.php/Music/Falco", "/pmwiki/pmwiki.php/Music/JohannSebastianBach", "/pmwiki/pmwiki.php/Music/BillyJoel", "/pmwiki/pmwiki.php/Music/Renaissance", "/pmwiki/pmwiki.php/Music/JethroTull", "/pmwiki/pmwiki.php/Music/JohannSebastianBach", "/pmwiki/pmwiki.php/Music/TheBeachBoys", "/pmwiki/pmwiki.php/Music/TheByrds", "/pmwiki/pmwiki.php/Music/TheKinks", "/pmwiki/pmwiki.php/Music/Extreme", "/pmwiki/pmwiki.php/Music/WolfgangAmadeusMozart", "/pmwiki/pmwiki.php/Film/ThisIsSpinalTap", "/pmwiki/pmwiki.php/Music/AntoninDvorak", "/pmwiki/pmwiki.php/Music/BlindGuardian", "/pmwiki/pmwiki.php/Music/RhapsodyOfFire", "/pmwiki/pmwiki.php/Music/TheNice", "/pmwiki/pmwiki.php/Music/TheKillers", "/pmwiki/pmwiki.php/Music/BrightEyes", "/pmwiki/pmwiki.php/Music/JohannSebastianBach", "/pmwiki/pmwiki.php/Music/ToccataAndFugueInDMinor", "/pmwiki/pmwiki.php/Music/Muse", "/pmwiki/pmwiki.php/VideoGame/Gyruss", "/pmwiki/pmwiki.php/VideoGame/Touhou", "/pmwiki/pmwiki.php/Music/FrankSinatra", "/pmwiki/pmwiki.php/Music/SigueSigueSputnik", "/pmwiki/pmwiki.php/Music/Nightwish", "/pmwiki/pmwiki.php/Music/TheKinks", "/pmwiki/pmwiki.php/Music/ElectricLightOrchestra", "/pmwiki/pmwiki.php/Music/TheMove", "/pmwiki/pmwiki.php/Music/Tiesto", "/pmwiki/pmwiki.php/Music/EmersonLakeAndPalmer", "/pmwiki/pmwiki.php/Music/PicturesAtAnExhibition", "/pmwiki/pmwiki.php/Music/Tiesto", "/pmwiki/pmwiki.php/Music/ArminVanBuuren", "/pmwiki/pmwiki.php/Music/PachelbelsCanon", "/pmwiki/pmwiki.php/Music/PetShopBoys", "/pmwiki/pmwiki.php/Music/Evanescence", "/pmwiki/pmwiki.php/Music/WolfgangAmadeusMozart", "/pmwiki/pmwiki.php/Music/Chumbawumba", "/pmwiki/pmwiki.php/Music/JohannSebastianBach", "/pmwiki/pmwiki.php/Film/SaturdayNightFever", "/pmwiki/pmwiki.php/Music/NightOnBaldMountain", "/pmwiki/pmwiki.php/Music/TransSiberianOrchestra", "/pmwiki/pmwiki.php/Music/BeethovensLastNight", "/pmwiki/pmwiki.php/Theatre/TheNutcracker", "/pmwiki/pmwiki.php/Music/EricCarmen", "/pmwiki/pmwiki.php/Music/SergeiRachmaninoff", "/pmwiki/pmwiki.php/Music/BrianSetzer", "/pmwiki/pmwiki.php/Music/Nile", "/pmwiki/pmwiki.php/Music/GustavHolst", "/pmwiki/pmwiki.php/VideoGame/DanceDanceRevolution", "/pmwiki/pmwiki.php/Music/LudwigVanBeethoven", "/pmwiki/pmwiki.php/VideoGame/PumpItUp", "/pmwiki/pmwiki.php/VideoGame/Beatmania", "/pmwiki/pmwiki.php/VideoGame/Beatmania", "/pmwiki/pmwiki.php/VideoGame/DanceDanceRevolution", "/pmwiki/pmwiki.php/Music/Satan", "/pmwiki/pmwiki.php/Anime/RanmaOneHalf", "/pmwiki/pmwiki.php/VideoGame/Psychonauts", "/pmwiki/pmwiki.php/Music/Rush", "/pmwiki/pmwiki.php/Music/PyotrIlyichTchaikovsky", "/pmwiki/pmwiki.php/Music/LedZeppelin", "/pmwiki/pmwiki.php/Theatre/PeerGynt", "/pmwiki/pmwiki.php/Music/ClaudeDebussy", "/pmwiki/pmwiki.php/Music/Megadeth", "/pmwiki/pmwiki.php/Music/JohannSebastianBach", "/pmwiki/pmwiki.php/Music/ProcolHarum", "/pmwiki/pmwiki.php/Music/JohannSebastianBach", "/pmwiki/pmwiki.php/Music/ProcolHarum", "/pmwiki/pmwiki.php/Music/RhapsodyOfFire", "/pmwiki/pmwiki.php/Music/DieTotenHosen", "/pmwiki/pmwiki.php/Music/GeorgeClinton", "/pmwiki/pmwiki.php/Music/TheBeastieBoys", "/pmwiki/pmwiki.php/Music/PaulsBoutique", "/pmwiki/pmwiki.php/Music/FrankZappa", "/pmwiki/pmwiki.php/Music/TheGrandWazoo", "/pmwiki/pmwiki.php/Music/Can", "/pmwiki/pmwiki.php/Music/TheyMightBeGiants", "/pmwiki/pmwiki.php/Music/Kesha", "/pmwiki/pmwiki.php/Music/AliProject", "/pmwiki/pmwiki.php/Music/PyotrIlyichTchaikovsky", "/pmwiki/pmwiki.php/Theatre/TheNutcracker", "/pmwiki/pmwiki.php/VideoGame/Tetris", "/pmwiki/pmwiki.php/Music/WendyCarlos", "/pmwiki/pmwiki.php/Music/SwitchedOnBach", "/pmwiki/pmwiki.php/Music/JohannSebastianBach", "/pmwiki/pmwiki.php/Film/AClockworkOrange", "/pmwiki/pmwiki.php/Music/LudwigVanBeethoven", "/pmwiki/pmwiki.php/Music/HenryPurcell", "/pmwiki/pmwiki.php/Film/TheShining", "/pmwiki/pmwiki.php/Music/FrankZappa", "/pmwiki/pmwiki.php/Music/AbsolutelyFree", "/pmwiki/pmwiki.php/Music/IgorStravinsky", "/pmwiki/pmwiki.php/Music/IgorStravinsky", "/pmwiki/pmwiki.php/Theatre/TheRiteOfSpring", "/pmwiki/pmwiki.php/Theatre/TheFirebird", "/pmwiki/pmwiki.php/Music/GustavHolst", "/pmwiki/pmwiki.php/Music/FrancescoZappa", "/pmwiki/pmwiki.php/Music/TheYellowShark", "/pmwiki/pmwiki.php/Music/TheBeatles", "/pmwiki/pmwiki.php/Music/ABBA", "/pmwiki/pmwiki.php/Music/ModestMussorgsky", "/pmwiki/pmwiki.php/Music/NightOnBaldMountain", "/pmwiki/pmwiki.php/Music/PinkMartini", "/pmwiki/pmwiki.php/Music/TheBeatles", "/pmwiki/pmwiki.php/Music/AbbeyRoad", "/pmwiki/pmwiki.php/Music/LudwigVanBeethoven", "/pmwiki/pmwiki.php/Music/EmilieAutumn", "/pmwiki/pmwiki.php/Music/PachelbelsCanon", "/pmwiki/pmwiki.php/Music/CyndiLauper", "/pmwiki/pmwiki.php/Music/PDQBach", "/pmwiki/pmwiki.php/VideoGame/InTheGroove", "/pmwiki/pmwiki.php/Music/SoundHorizon", "/pmwiki/pmwiki.php/Music/PicturesAtAnExhibition", "/pmwiki/pmwiki.php/Theatre/Carmen", "/pmwiki/pmwiki.php/WesternAnimation/LooneyTunes", "/pmwiki/pmwiki.php/WesternAnimation/TomAndJerry", "/pmwiki/pmwiki.php/Music/SymphonyX", "/pmwiki/pmwiki.php/Music/GustavHolst", "/pmwiki/pmwiki.php/Music/BelaBartok", "/pmwiki/pmwiki.php/Music/Candlemass", "/pmwiki/pmwiki.php/Music/FryderykChopin", "/pmwiki/pmwiki.php/Theatre/Rent", "/pmwiki/pmwiki.php/Theatre/LaBoheme", "/pmwiki/pmwiki.php/Music/SpikeJones", "/pmwiki/pmwiki.php/Theatre/Amadeus", "/pmwiki/pmwiki.php/Music/TheCancanSong", "/pmwiki/pmwiki.php/Music/DeepPurple", "/pmwiki/pmwiki.php/Music/TimMinchin", "/pmwiki/pmwiki.php/Music/ThePianoGuys", "/pmwiki/pmwiki.php/Music/LindseyStirling", "/pmwiki/pmwiki.php/WesternAnimation/KungFuPanda", "/pmwiki/pmwiki.php/VideoGame/Cytus", "/pmwiki/pmwiki.php/Music/Sakanaction", "/pmwiki/pmwiki.php/Music/FryderykChopin", "/pmwiki/pmwiki.php/Music/JohannSebastianBach", "/pmwiki/pmwiki.php/Creator/BillBailey", "/pmwiki/pmwiki.php/Music/Yes", "/pmwiki/pmwiki.php/Music/Styx", "/pmwiki/pmwiki.php/Music/JeanJacquesPerrey", "/pmwiki/pmwiki.php/Music/LudwigvanBeethoven", "/pmwiki/pmwiki.php/VideoGame/Touhou", "/pmwiki/pmwiki.php/Music/Hospice", "/pmwiki/pmwiki.php/Music/TheAntlers", "/pmwiki/pmwiki.php/Music/Sigh", "/pmwiki/pmwiki.php/Music/FryderykChopin", "/pmwiki/pmwiki.php/Music/WolfgangAmadeusMozart", "/pmwiki/pmwiki.php/Music/DeadKennedys", "/pmwiki/pmwiki.php/Music/Bathory", "/pmwiki/pmwiki.php/Music/GustavHolst", "/pmwiki/pmwiki.php/Music/VIXX", "/pmwiki/pmwiki.php/Music/RobbieWilliams", "/pmwiki/pmwiki.php/Music/FleshgodApocalypse", "/pmwiki/pmwiki.php/Music/BIGMAMA", "/pmwiki/pmwiki.php/Music/Moonspell", "/pmwiki/pmwiki.php/Music/Sabaton", "/pmwiki/pmwiki.php/Music/JohannSebastianBach", "/pmwiki/pmwiki.php/Music/DreamTheater", "/pmwiki/pmwiki.php/Music/PyotrIlyichTchaikovsky", "/pmwiki/pmwiki.php/Theatre/PeerGynt"], "non_media_links": ["/pmwiki/pmwiki.php/Main/StandardSnippet", "/pmwiki/pmwiki.php/Main/SubTrope", "/pmwiki/pmwiki.php/Main/Sampling", "/pmwiki/pmwiki.php/Main/ThisIndexIsNotAnExample", "/pmwiki/pmwiki.php/Main/RockMeAsmodeus", "/pmwiki/pmwiki.php/Main/GenreMashup", "/pmwiki/pmwiki.php/Main/PublicDomainSoundtrack", "/pmwiki/pmwiki.php/Main/ClassicalMusicIsCool", "/pmwiki/pmwiki.php/Main/ClassicalMusicIsBoring", "/pmwiki/pmwiki.php/Main/Leitmotif", "/pmwiki/pmwiki.php/Pinball/Gorgar", "/pmwiki/pmwiki.php/Main/TitleDrop", "https://www.youtube.com/watch?v=rQu6_Iv_-H0", "/pmwiki/pmwiki.php/Main/StandardSnippet", "https://www.youtube.com/watch?v=l9OFZ9Mh7GA", "/pmwiki/pmwiki.php/Main/Homage", "https://www.youtube.com/watch?v=Nfvo-xyq_zQ", "http://en.wikipedia.org/wiki/Hooked_on_Classics", "/pmwiki/pmwiki.php/Main/ExactlyWhatItSaysOnTheTin", "/pmwiki/pmwiki.php/Main/PachelbelsCanonProgression", "https://www.youtube.com/watch?v=by8oyJztzwo", "/pmwiki/pmwiki.php/Main/StandardSnippet", "https://www.youtube.com/watch?v=dgun4FjrRV8", "https://www.youtube.com/watch?v=b8h58aLOfSo", "https://www.youtube.com/watch?v=6A8xOez_CLw", "https://www.youtube.com/watch?v=kaEjVu7d_QY", "/pmwiki/pmwiki.php/Main/StandardSnippet", "/pmwiki/pmwiki.php/Main/SampledUp", "/pmwiki/pmwiki.php/Main/IstanbulNotConstantinople", "https://www.youtube.com/watch?v=8XrgIyztOIw", "/pmwiki/pmwiki.php/UsefulNotes/GameBoy", "/pmwiki/pmwiki.php/Main/CoverAlbum", "/pmwiki/pmwiki.php/Main/CoverAlbum", "https://www.youtube.com/watch?v=O4HknxMtFdw", "/pmwiki/pmwiki.php/Main/StandardSnippet", "https://www.youtube.com/watch?v=kLdYSGYJzw0", "https://www.youtube.com/watch?v=yu35Or5OqKQ", "https://www.youtube.com/watch?v=gqg3l3r_DRI", "/pmwiki/pmwiki.php/Main/StandardSnippet", "/pmwiki/pmwiki.php/Main/Dubstep", "https://www.youtube.com/watch?v=9PQXddD3uYU", "/pmwiki/pmwiki.php/Main/ExactlyWhatItSaysOnTheTin", "https://www.youtube.com/watch?v=qDsfou6UfjU", "/pmwiki/pmwiki.php/Main/UncommonTime", "https://www.youtube.com/watch?v=mJ_fkw5j-t0", "https://www.youtube.com/watch?v=NCaH-qqTWpk", "/pmwiki/pmwiki.php/Main/GodIsLoveSongs", "https://www.youtube.com/watch?v=cDUMcEeNUr4", "https://www.youtube.com/watch?v=2gdcFFBKjGs", "https://www.youtube.com/watch?v=Isc7rCK7QW4", "/pmwiki/pmwiki.php/Main/MinskyPickup", "/pmwiki/pmwiki.php/Main/Synthpop", "https://www.youtube.com/watch?v=aJQ5HsXlPTo", "/pmwiki/pmwiki.php/Main/FinalBoss", "https://www.youtube.com/watch?v=lJpSqC86vaw", "/pmwiki/pmwiki.php/Main/StandardSnippet", "/pmwiki/pmwiki.php/Main/MindScrew", "/pmwiki/pmwiki.php/Main/KoreanPopMusic", "https://www.youtube.com/watch?v=eVH1Y15omgE", "https://www.youtube.com/watch?v=uT3SBzmDxGk", "/pmwiki/pmwiki.php/Main/ExactlyWhatItSaysOnTheTin", "/pmwiki/pmwiki.php/Main/GrowingUpSucks"]}