{"title": "I Need No Ladders", "content": "This is it. The Hero is storming through the Big Bad's secret base, avoiding all detection by guards. He finally reaches the room where the big bad is when he notices some stairs in the room's entrance. What will he do? Seamlessly jump over it in a dramatic pose, of course! They don't care that they were meant to be stepped on. Apparently stepladders are for dummies.\n\nThis is often featured in action films, specially when the Hero is in a hot chase, or has a limited time to enter/exit the place, or even just for dramatic effect. Sometimes it works, others, well... they end up as Narm.\n• Akagami no Shirayukihime: Zen and Obi both tend to jump over railings rather than use the stairs if they feel the stairs are inconveniently placed to where they want to go since they prefer the shortest route at all times. Even Mitsuhide does it on occasion, though generally he only does so during emergencies when using the shortest route is necessary.\n• In Soul Eater, Maka does this when storming through the Kishin's \"tomb\".\n• In Memento Vivere, a Final Fantasy X fanfiction, Auron defies gravity during the battle on\n• In Erik the Viking, the title character, needing to borrow his girlfriend's invisibility cloak, scales the wall to her quarters using a pair of knives. Her first question upon his entering is why he didn't just use the stairs that were right next to the wall he climbed.\n• Arimnaes Happy Fun Time Power Hour: Busting through the wooden wall of a building to escape the approaching guards? Yup.\n• In Star Force RP, Blade was once seen using a series of jumps to get to a Wave Road instead of a Wave Station.\n• Another instance occurred with Nova who used jet boots to fly onto a Wave Road after he inadvertently caused Dark Giga to shoot a Wave Station by messing up his aim. Nice Job Breaking It, Hero!.\n• In Dave Duncan's book The Reaver Road when Omar goes to rescue the woman to be sacrificed.\n• Henry Griffin does this in Unnatural History. The other two of the trio get into it too, although Jasper is less than pleased.\n• Wonder Woman: In \"The Girl With a Gift for Disaster\", Wonder Woman foils an ambush by Neil, played by none other than Dick Butkus(!). He runs away up a two part staircase. Rather than outrun him up the stairs, she jumps over the entire staircase from the first floor to the second. Even Dick Butkus knows he's beat at that point.\n• God Hand is a definite example in that Gene never climbs ladders: He simply jumps up and lands at the top of the ladder.\n• In Final Fantasy Crystal Chronicles: The Crystal Bearers, Layle will walk up to ladders, poles, and other climbable things, and then use his gravity powers to vault himself straight to the top (or bottom). Makes one wonder why he even bothers.\n• The ladder climbing animation in Mega Man was slightly bugged, resulting in a glitch where Mega Man simply falls up very quickly under certain conditions, and is one of the ways to save time in speed runs.\n• While you technically can and do use ladders, very often in the Assassin's Creed series simply running up the wall next to a ladder is faster than climbing it.\n• In Adventure Ponies!, Applejack and Pinkie Pie are the only ponies who need to climb ladders in order to reach higher elevation, since unlike the other ponies, they can't teleport or fly.\n• In The Matrix: Path of Neo you can either go up the slow way, or just jump up half the ladder or double-jump and skip the whole thing. That or take a fourth option Wall Run and Wall Jump past it.\n• In Yu-Gi-Oh! The Abridged Series, one of the Moonites swoops down upon Yugi and Kaiba \"like a ninja.\" Mario Bros noises are then added to the scene of him jumping up the side of a building. Kaiba: Couldn't he have just used the stairs like a normal person?\n• In the mid-season finale of the forth season of The Venture Bros., is about to charge into a the lab of an evil (non sanctioned) scientist. He uses a rope arrow, despite being told that there is a ladder next to him, because, well, \"where's the fun in that?\".", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/INeedNoLadders", "media_links": ["/pmwiki/pmwiki.php/Manga/AkagamiNoShirayukihime", "/pmwiki/pmwiki.php/Manga/SoulEater", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyX", "/pmwiki/pmwiki.php/Film/ErikTheViking", "/pmwiki/pmwiki.php/Creator/DaveDuncan", "/pmwiki/pmwiki.php/Series/UnnaturalHistory", "/pmwiki/pmwiki.php/Series/WonderWoman1975", "/pmwiki/pmwiki.php/VideoGame/GodHand", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyCrystalChroniclesTheCrystalBearers", "/pmwiki/pmwiki.php/VideoGame/MegaMan1", "/pmwiki/pmwiki.php/Franchise/AssassinsCreed", "/pmwiki/pmwiki.php/VideoGame/AdventurePonies", "/pmwiki/pmwiki.php/VideoGame/TheMatrixPathOfNeo", "/pmwiki/pmwiki.php/WesternAnimation/TheVentureBrothers"], "non_media_links": ["/pmwiki/pmwiki.php/Main/TheHero", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/TimedMission", "/pmwiki/pmwiki.php/Main/Narm", "/pmwiki/pmwiki.php/Main/Anime", "/pmwiki/pmwiki.php/Main/Manga", "/pmwiki/pmwiki.php/Main/LeParkour", "/pmwiki/pmwiki.php/Main/SealedEvilInACan", "/pmwiki/pmwiki.php/Main/FanFic", "/pmwiki/pmwiki.php/Fanfic/MementoVivere", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/ForumRolePlays", "/pmwiki/pmwiki.php/Roleplay/ArimnaesHappyFunTimePowerHour", "/pmwiki/pmwiki.php/Roleplay/StarForceRP", "/pmwiki/pmwiki.php/Main/NiceJobBreakingItHero", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/GeekPhysiques", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/TeleportersAndTransporters", "/pmwiki/pmwiki.php/Main/VideoGameFlight", "/pmwiki/pmwiki.php/Main/TakeAThirdOption", "/pmwiki/pmwiki.php/Main/WallRun", "/pmwiki/pmwiki.php/Main/WallJump", "/pmwiki/pmwiki.php/Main/WebOriginal", "/pmwiki/pmwiki.php/WebVideo/YuGiOhTheAbridgedSeries", "/pmwiki/pmwiki.php/Main/LampshadeHanging", "/pmwiki/pmwiki.php/Main/WesternAnimation"]}