{"title": "Flowery Insults", "content": "\"Dionys, thou art a coward. Sooth doth thou send others before thee and refrain from the strife thyself. Thou strikest women yet shirk to strike a man, lest thy pustulent skin be cut by a blade fairer than thy own. Sooth, thou art a coward, Mc Canoc. Dionys, thou art a braggart. Braggart thou art for naught, for in every contest thou art defeated. Fighter of weaklings and braggarts like thyself, whensoever a true knight face thee, thou runs away. Yet, in sooth, from this cowardly retreat dost thou make brag. Mc Canoc, thou art a braggart. Dionys, thou art smelly. Thy breath stinks of the rotten ejacula of horses, which, sooth, thou dost love as thy morning drink. Thy body reeks with the stench of fear, and the manure of the asparagus-eating goats is better than the smell from thy mustache. Mc Canoc, thou art a stinker. Dionys, thou art ugly. The orcs doth not run forward to fight, but away from thy countenance. Sooth, in the history of the ill-favored, thy name is held in high esteem. Thy whore mother screamed at first sight of thee as the replicator burst open of its own accord in horror. The ill-fortuned persons that were forced to care for thee had to put a pork chop around thy neck to get the dog to play with thee. Further sooth, when it did, it mistook thy ass for thy face and preferred it to lick. Mc Canoc, thou art ugly. Dionys, though art stupid. Thrice you have attacked us, and thrice have we thrown thee back, though we are but, forsooth, a fraction of thy number. Thou art unlettered and hath never read of the term \"defeat in detail\", for assuredly, but those few letters would require all day and the use of both of your pustulent forefingers. But the veriest simpleton canst understand thy tactics are those of a schoolyard bully held back until his tutors at last release him as a man full grown yet unable to manage fingerpainting. The very fact that thou canst breathe must be by the arts of some homunculi or hob, smarter than thou, who doth sit upon thy shoulder and whisper \"Breathe in, breathe out\" else surely thou wouldst cease in this vital activity for lack of thought. Canst thou walk and chew bubble gum at the same time it is asked and I cry \"Nay\" for I have found you, face down, the bubblegum before you upon the ground as proof. Mc Canoc, thou art stupid. And that is how a professional insults someone! Now, go away, or I'll start in on Arabic, you miserable mound of gelatinous pus!\"", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/FloweryInsults?from=Main.FloweryInsult", "media_links": ["/pmwiki/pmwiki.php/Literature/CouncilWars"], "non_media_links": ["/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/TheReasonYouSuckSpeech"]}