{"title": "The Mean Brit", "content": "We can blame Simon Cowell for this. After his success on American Idol, just about every American Reality Show has seen fit to cast a British guy as the snarky, ultra-critical judge.\n\nThe Mean Brit will bluntly tell mothers their kid sucks and make two-year-olds cry if their talent isn't good enough for him. The flip side of this is that if he does compliment you, it means you must be really good, and he's usually willing to stake his reputation on anyone who measures up. The other good quality some of them possess is that those who fall short of his standards but need help (or previously impressed him but have lost their way) can expect constructive criticism rather than just barbs. In the worst case, they come across as a bully with a media platform and a fortune picking on people who can't fight back.\n\nExpect him to appear on any show that has an American Title. Call it subtle (or not-so-subtle) nationalism, but note that these people are seen as nasty at home too. Another possible explanation is that several of these reality shows originated in Britain, such as American Idol (from Pop Idol), Dancing with the Stars (from Strictly Come Dancing), and America's Got Talent, which was based on an unaired British pilot which would eventually become Britain's Got Talent.\n\nCompare and Contrast Evil Brit, Violent Glaswegian and Fighting Irish (as well as The Irish Mob and Irish Explosives Expert).\n• As mentioned, Cowell on American Idol and Britain's Got Talent. He's known for his \"No...I won't send you home\" approach, his cases of hitting his fellow judges' klaxons in Britain's Got Talent and his put-downs, usually to Hopeless Auditionees. Granted, he's generally simply telling the truth but does so in such a blunt way that it could only be taken as offensive. His curt demeanor is sometimes exaggerated into being a straight Jerkass outside the shows he appears in, but the interesting thing for being the Trope Codifier is that he often falls into a Cruel to Be Kind approach (he thinks it's a waste of both his time and that of the underqualified contestants he judges to entertain their false hopes), and will praise those who do have the chops. Some American Idol viewers took to saying \"Paula will give you a pass if you're nice, Randy will give you a pass if you're black, but Simon will only give you a pass if you can actually sing.\"\n• Piers Morgan, also known as Piers Moron, on America's Got Talent.\n• For extra fun, Piers Morgan and Simon Cowell are judges on Britain's Got Talent and often seem to compete to see who can be the cruelest to the contestants (though Piers will often deliberately go against what Simon said, and praise an act Simon hated, presumably to irritate him, since plenty of these acts really are awful). Admittedly he's far less nasty on Britain's Got Talent than its American counterpart, but he's still capable of some mean put-downs.\n• In his previous incarnation as a tabloid newspaper editor, Morgan was once punched out cold - in front of his mistress - by Jeremy Clarkson, who objected to an article alleging he was being unfaithful to his wife. A Mean Brit punched by an Even Meaner Brit.\n• Alex Jones once tried to start a petition to get Piers Morgan deported. Brits immediately fired back with one campaigning to keep him in America, declaring \"He's your problem now\".\n• Australian Idol's answer to Simon Cowell was Ian \"Dicko\" Dickson.\n• Germany has Dieter Bohlen, who manages to cause the majority of all complaints filed with the broadcasting commission.\n• Len Goodman on Dancing with the Stars isn't really mean, but he is much more demanding and less likely to hand out fuzzy, feel-good comments like \"I loved your energy!\" or \"You are a smoldering sex goddess!\" than either Carrie Ann or Bruno, and more likely to base his comments on the actual dance. Like Simon, if Len says it was good, it was very good, and his criticisms virtually always relate to something the dancer needs to work on. On the other hand, if a performance was genuinely bad he won't pull his punches, as during the second season when he told Master P essentially, \"You don't care, you aren't trying, you don't belong here, it's time for you to go home,\" in the third week.\n• Whereas on the British equivalent Strictly Come Dancing, his judging style is relatively lenient compared to Craig who, in an aversion of this trope, is Australian.\n• Toby Young on Top Chef. He started out as this trope in trumps, his comments about the contestants' food being incredibly snarky and including comparisons to WMDs and cat food. He admitted in his blog on Bravo that he had no idea what the show was about when he accepted the job and assumed that what the producers were hiring him for was to be the Mean Brit. Once he realized that he was expected to actually critique the food, not just criticize it, he got a bit better. But not enough better to get the producers to keep him on for another season, though.\n• \"Nasty\" Nigel Lythgoe (who is bringing his show to the UK) held the title before Simon Cowell.\n• Red Symons, the main judge on the Red Faces segment (a segment similar in format to The Gong Show) of Hey Hey It's Saturday.\n• Red Symons was born in England, true, but has lived in Australia since he was 9, speaks with an Australian accent, and considers himself Australian.\n• Gordon Ramsay acts this way in his shows Hell's Kitchen and Kitchen Nightmares, although it is arguable that the show's producers gave him directions to do so. At times his temper becomes too much to handle, pushing buttons and driving some contestants to lose control and lash back at him. On the other hand, any aspiring chef who makes it through his tutelage must have truly worked hard and honed their skills, and when praise and enthusiasm are deserved, Ramsay will give it.\n• Ramsay's saving grace is that he keeps his temper relative to his expectations: screw-ups by culinary professionals — restaurateurs, chefs, waiters, etc.(who frankly should know better) — will get the full brunt of his wrath; non-professionals and beginners (like those who appear on The F Word or MasterChef) are treated much more patiently; and the man is downright cuddly when he's teaching children how to cook on MasterChef Junior.\n• He'll also - after an initial collective dressing-down - give calm and fairly sympathetic advice to chefs or middle-managers who have been placed in impossible situations by the people they work for, such as being hopelessly under-trained or given inadequate time and materials.\n• Ramsay's shows inspired a cloned copy on a rival network. Restaurant: Impossible is a carbon copy presented by Robert Irvine, a British chef/entrepreneur who manages to be ten times more intimidating and meaner than Ramsey - without overly raising his voice or swearing once.\n• Absolutely all the dragons on the UK version of Dragon's Den. Especially Peter Jones, Duncan Bannatyne, and Deborah Meaden.\n• Jimmy Carr on Distraction. Some of his insults are just about as X-rated as his stand-up show.\n• Video game critic Ben \"Yahtzee\" Croshaw, of Zero Punctuation fame, to the point of being a borderline misanthrope\n• Yahtzee's fellow (former) The Escapist contributor Jim Sterling, of Jimquisition.\n• TotalBiscuit went so far as to incorporate the trope into his screen name.\n• While eschewing the middle-to-upper class tones and furious screaming of most other British game reviewers, Guru Larry and Wez opt instead for low-brow jabs and dark chuckles delivered in an exaggerated version of Larry's Midlands accent. While generally lighter in tone, Bundy nonetheless is every bit as scathing and unrelenting as his counterparts.\n• I Hate Everything is pretty much Exactly What It Says on the Tin, being quick to tear into any topic that strikes him.\n\nNot surprisingly, the 'Simon Cowell Effect' has left a mark on the Web, with many of the most popular critics - especially for video games - falling into this category.\n• If you've ever watched Varney & Co. on the Fox Business Channel, Stuart Varney is this in spades.\n• This trend is brought up by John Cheese in a Cracked article , though instead of nationalism, he compares it to American viewers being in a sadomasochistic relationship with Britain.\n• John Lydon (aka Johnny Rotten of The Sex Pistols) sometimes falls in this trope too. He can be extremely assertive and confrontational at times, even when the host tries to be nice to him. He has also venomously criticized politicians and musicians he personally vilifies.\n• Margaret Thatcher famously belittled everything that stood on the left side of the political spectrum; she wasn't keen on unions either. During her final years, she became increasingly hostile towards initiatives of the European Union and even towards her own cabinet.\n• Stuart Ashen, who reviews various pieces of tat that cross his path, including the POP Station. Imagine Yahtzee, but with half the speed and half the spite, yet all the snark.\n• Jeremy Clarkson and James May can come across as this too at times. The former in particular was infamous enough for it that it got him airbrushed out of the history of Robot Wars, which goes to show that even this trope has standards.\n• Historical evidence suggests that there were copious examples of these in the English royal court in past centuries. In this case, it was often a deconstruction; some of them literally lost their heads as an indirect result.\n• Roger Waters of Pink Floyd can come across this way with his Deadpan Snarker personality in interviews.\n• The Anthropomorphic Personification of England in Axis Powers Hetalia is cynical, bad-tempered, and has a sharp tongue, but he does occasionally show a softer side.\n• Joseph Joestar, from JoJo's Bizarre Adventure, was a punk in his youth who got into fights and loved to mock his opponents...and the protagonist of the second story arc.\n• Simon Cowell as himself in the rap battle scene in Scary Movie 3.\n• Lewis, the former SAS guy turned merc from Rambo IV.\n• The Other Kind of Roommate gives us Terry Sheridan, a sophisticated art director both from Essex and - at first glance - a lighter version of this trope. The second Alex says he doesn't know the zodiac, though, those tea-drinking claws come out.\n• Begley in Neurotically Yours is British. He's also very mean, but so is pretty much everyone else.\n• That Mitchell and Webb Look:\n• David Mitchell's \"incredibly posh and aristocratic\" character. He takes a number of different jobs like waiter, clothes store clerk, or vicar. He always gets contrasted to \"that friendly Australian girl\" who used to work in his place. Waiter: I saw you in here last week. I saw you drinking your soup. I saw you blowing and slurping and dunking your bread. We were watching you on the monitors in the kitchen, and we all thought you were a dick! Store Clerk: I've seen you in here before. I've seen you slouching around the place in your slip-on shoes and your motorcycle jacket, looking like a mechanic who's won the pools. I've seen your tin earring and your black marketeer swagger. We've all seen you, and we all thought you were a turd! Vicar: I saw you in here last week. I saw you reading the notices and talking about your views. and eating other peoples' biscuits. We were watching you from the vestry, and we all thought you were a bitch!\n• Robert Webb gets a turn as the Mean Brit in the \"Hole in the Ring\" sketch, parodying Anne Robinson. The problem is that he's not very good at it - his insults degenerate into calling people \"gay\" and flipping off the audience.\n• The Psych episode \"American Duos\" parodies American Idol, with Tim Curry playing the Simon Cowell role.\n• Spike in Buffy the Vampire Slayer. Heck, even when he's still mean to Angel.\n• The Black Mirror episode \"Fifteen Million Credits\" features a talent show judge named Hope, who is pretty much Simon Cowell if he lived in a dystopian society.\n• Mass Effect 2 gives us Zaeed Massani: Bounty Hunter, Sociopathic Hero and borderline Psycho for Hire: Zaeed: \"Walk it off, Commander. A little poison never hurt anyone.\"\n• Shaun Hastings throughout the Assassin's Creed franchise, especially towards Desmond in II.\n• In Black Flag, another character even scolds him with \"Be nice, you limey!\"\n• Saints Row allows this in regards to voice options for Boss.\n• Jin Kisaragi of BlazBlue fame was born in England and has precisely two modes: Deadpan Snarker Straw Nihilist Jerkass Mean Brit and Cackling Rapey Incestuous Ax-Crazy Yandere Evil Brit. He does get better though. Ragna and Jin's future version Hakumen also qualify as this.\n• Mike Jeavons' British Bastard is a parody of this trope, acting as the Evil Counterpart to the in-universe Mike's Quintessential British Gentleman character.\n• The Courier in Couriers Mind Rise Of New Vegas is one, being a cynical, easily annoyed Jerk with a Heart of Gold. However, unless you pay attention to his British English vocabulary, it's not immediately obvious since his Real Life voice actor is a Chinese immigrant to Britain.\n• The Simpsons got Simon Cowell to play a parody of himself as a staff member at an exclusive preschool in which Marge was trying to enroll Maggie. At the end of the episode, Simon's snark finally pushes Homer to violence...and he proceeds to criticize Homer's beating. \"Simon\": You call that a punch? I felt it, but it was like, \"so what?\" (punched) Ooh, again with the nose. I have a chin, you know. (knocked out)\n• He also criticises the show's credits and makes special note of how unoriginal his own appearance is.\n• There's also a Simpsons short where he plays as a really hopeless contestant. An interesting role reversal, to be sure.\n• Then Simon plays as himself in another episode, in which Moe Syzlak winds up as an American Idol judge after becoming a Jerkass. Simon convinces Moe that being the Mean Brit is a lonely life — which is just a ploy to make Moe look weak and eliminate him as a potential threat for Simon's job.\n• The Kim Possible episode \"Rappin' Drakken\" features a rap battle on \"American Starmaker\". Kim realizes that something is seriously wrong when the Simon Cowell expy (under the influence of Drakken's mind-control shampoo) acts much too nice.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/TheMeanBrit?from=Main.MeanBrit", "media_links": ["/pmwiki/pmwiki.php/Series/AmericanIdol", "/pmwiki/pmwiki.php/Creator/JimmyCarr", "/pmwiki/pmwiki.php/Creator/SimonCowell", "/pmwiki/pmwiki.php/Series/AmericanIdol", "/pmwiki/pmwiki.php/Series/DancingWithTheStars", "/pmwiki/pmwiki.php/Series/StrictlyComeDancing", "/pmwiki/pmwiki.php/Series/AmericasGotTalent", "/pmwiki/pmwiki.php/Series/BritainsGotTalent", "/pmwiki/pmwiki.php/Series/AmericanIdol", "/pmwiki/pmwiki.php/Series/BritainsGotTalent", "/pmwiki/pmwiki.php/Series/AmericasGotTalent", "/pmwiki/pmwiki.php/Series/TopGearUK", "/pmwiki/pmwiki.php/Series/DancingWithTheStars", "/pmwiki/pmwiki.php/Series/StrictlyComeDancing", "/pmwiki/pmwiki.php/Series/TopChef", "/pmwiki/pmwiki.php/Series/TheGongShow", "/pmwiki/pmwiki.php/Series/HeyHeyItsSaturday", "/pmwiki/pmwiki.php/Creator/GordonRamsay", "/pmwiki/pmwiki.php/Series/HellsKitchen", "/pmwiki/pmwiki.php/Series/KitchenNightmares", "/pmwiki/pmwiki.php/Series/TheFWord", "/pmwiki/pmwiki.php/Series/MasterChef", "/pmwiki/pmwiki.php/Series/MasterChef", "/pmwiki/pmwiki.php/Series/RestaurantImpossible", "/pmwiki/pmwiki.php/Series/DragonsDen", "/pmwiki/pmwiki.php/Series/TheWeakestLink", "/pmwiki/pmwiki.php/Creator/JimmyCarr", "/pmwiki/pmwiki.php/Series/Distraction", "/pmwiki/pmwiki.php/Series/EstateOfPanic", "/pmwiki/pmwiki.php/Creator/BenCroshaw", "/pmwiki/pmwiki.php/Website/TheEscapist", "/pmwiki/pmwiki.php/Creator/TheCynicalBrit", "/pmwiki/pmwiki.php/Creator/JonathanRoss", "/pmwiki/pmwiki.php/Website/Cracked", "/pmwiki/pmwiki.php/Creator/ChristopherHitchens", "/pmwiki/pmwiki.php/Music/JohnLydon", "/pmwiki/pmwiki.php/Music/SexPistols", "/pmwiki/pmwiki.php/Creator/StuartAshen", "/pmwiki/pmwiki.php/Series/TopGearUK", "/pmwiki/pmwiki.php/Series/RobotWars", "/pmwiki/pmwiki.php/Music/RogerWaters", "/pmwiki/pmwiki.php/Music/PinkFloyd", "/pmwiki/pmwiki.php/Manga/AxisPowersHetalia", "/pmwiki/pmwiki.php/Manga/JoJosBizarreAdventure", "/pmwiki/pmwiki.php/Film/ScaryMovie3", "/pmwiki/pmwiki.php/Film/RamboIV", "/pmwiki/pmwiki.php/Literature/TheOtherKindofRoommate", "/pmwiki/pmwiki.php/Series/NeuroticallyYours", "/pmwiki/pmwiki.php/Series/ThatMitchellAndWebbLook", "/pmwiki/pmwiki.php/Series/Psych", "/pmwiki/pmwiki.php/Creator/TimCurry", "/pmwiki/pmwiki.php/Series/BuffyTheVampireSlayer", "/pmwiki/pmwiki.php/Series/Smash", "/pmwiki/pmwiki.php/Series/BlackMirror", "/pmwiki/pmwiki.php/VideoGame/MassEffect2", "/pmwiki/pmwiki.php/Franchise/AssassinsCreed", "/pmwiki/pmwiki.php/VideoGame/AssassinsCreedII", "/pmwiki/pmwiki.php/VideoGame/SaintsRow", "/pmwiki/pmwiki.php/VideoGame/BlazBlue", "/pmwiki/pmwiki.php/VideoGame/FalloutNewVegas", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/Series/AmericanIdol", "/pmwiki/pmwiki.php/WesternAnimation/KimPossible"], "non_media_links": ["/pmwiki/pmwiki.php/Main/Catchphrase", "/pmwiki/pmwiki.php/Main/RealityShow", "/pmwiki/pmwiki.php/Main/DeadpanSnarker", "/pmwiki/pmwiki.php/Main/CausticCritic", "/pmwiki/pmwiki.php/Main/CompassionateCritic", "/pmwiki/pmwiki.php/Main/AmericanTitle", "/pmwiki/pmwiki.php/Main/EvilBrit", "/pmwiki/pmwiki.php/Main/ViolentGlaswegian", "/pmwiki/pmwiki.php/Main/FightingIrish", "/pmwiki/pmwiki.php/Main/TheIrishMob", "/pmwiki/pmwiki.php/Main/IrishExplosivesExpert", "/pmwiki/pmwiki.php/Main/RealityTV", "/pmwiki/pmwiki.php/Main/HopelessAuditionees", "/pmwiki/pmwiki.php/Main/Jerkass", "/pmwiki/pmwiki.php/Main/TropeCodifier", "/pmwiki/pmwiki.php/Main/CruelToBeKind", "/pmwiki/pmwiki.php/Magazine/PrivateEye", "/pmwiki/pmwiki.php/Main/ShoddyKnockoffProduct", "/pmwiki/pmwiki.php/Main/GameShow", "/pmwiki/pmwiki.php/Main/WebVideo", "/pmwiki/pmwiki.php/WebAnimation/ZeroPunctuation", "/pmwiki/pmwiki.php/Main/HatesEveryoneEqually", "/pmwiki/pmwiki.php/WebVideo/Jimquisition", "/pmwiki/pmwiki.php/WebVideo/GuruLarryAndWez", "/pmwiki/pmwiki.php/WebVideo/IHateEverything", "/pmwiki/pmwiki.php/Main/ExactlyWhatItSaysOnTheTin", "http://www.cracked.com/article_18886_5-ways-television-went-crazy-since-i-quit-watching-in-2003.html", "/pmwiki/pmwiki.php/UsefulNotes/MargaretThatcher", "/pmwiki/pmwiki.php/Main/PopStation", "/pmwiki/pmwiki.php/Main/DecadentCourt", "/pmwiki/pmwiki.php/Main/DeconstructedTrope", "/pmwiki/pmwiki.php/Main/DeadpanSnarker", "/pmwiki/pmwiki.php/Main/Anime", "/pmwiki/pmwiki.php/Main/Manga", "/pmwiki/pmwiki.php/Main/AnthropomorphicPersonification", "/pmwiki/pmwiki.php/Main/GoodIsNotNice", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/BountyHunter", "/pmwiki/pmwiki.php/Main/SociopathicHero", "/pmwiki/pmwiki.php/Main/PsychoForHire", "/pmwiki/pmwiki.php/Main/DeadpanSnarker", "/pmwiki/pmwiki.php/Main/StrawNihilist", "/pmwiki/pmwiki.php/Main/Jerkass", "/pmwiki/pmwiki.php/Main/FromBadToWorse", "/pmwiki/pmwiki.php/Main/LaughingMad", "/pmwiki/pmwiki.php/Main/DoesThisRemindYouOfAnything", "/pmwiki/pmwiki.php/Main/IncestSubtext", "/pmwiki/pmwiki.php/Main/AxCrazy", "/pmwiki/pmwiki.php/Main/Yandere", "/pmwiki/pmwiki.php/Main/EvilBrit", "/pmwiki/pmwiki.php/Main/WebOriginal", "/pmwiki/pmwiki.php/WebVideo/MikeJ", "/pmwiki/pmwiki.php/Main/EvilCounterpart", "/pmwiki/pmwiki.php/Main/QuintessentialBritishGentleman", "/pmwiki/pmwiki.php/WebVideo/CouriersMindRiseOfNewVegas", "/pmwiki/pmwiki.php/Main/JerkWithAHeartOfGold", "/pmwiki/pmwiki.php/UsefulNotes/BritishEnglish", "/pmwiki/pmwiki.php/Main/WhatTheHellIsThatAccent", "/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/CreditsGag", "/pmwiki/pmwiki.php/Main/LampshadeHanging", "/pmwiki/pmwiki.php/Main/Jerkass", "/pmwiki/pmwiki.php/Main/LonelyAtTheTop", "/pmwiki/pmwiki.php/Main/NotHimself"]}