{"title": "Anger Born of Worry", "content": "\n• HERZ: In chapter 10, Asuka was so worried she was about to explode, but she tried to keep her emotions under control. Asuka was obviously upset but was trying admirably to keep her turbulent emotions under control. Her first impulse was to run off and thrash wildly in an effort to find her husband. She didn't notice the blood beginning to drip through the patch covering her left eye. She took a deep breath.\n• Last Child of Krypton: When she is furious because he has risked his life and he has been about to die several times to save her: Asuka:\"Why? You flew into that thing, what, to come after me? You could have died. Why would you do that? How could you be so stupid?\"\n• Scar Tissue: In chapter 8 Asuka gets angry with Shinji because he has reopened his wounds after yelling at their friends when they ganged up on her. Terror, she was paralyzed in fear, her worn out brain darkened in utter fear; fear of herself, of what she was capable of. In her state of restless hysteria, the abused subconscious of the redhead activated it's most primitive defense mechanism. She attacked. \n\n\"You Idiot!!\" \n\nRitsuko seemed to shut up with that. As a matter of fact, the entire room had gone deadly quiet when exposed to her rage, even Shinji, who seemed to have been dying to seconds before, straightened up and gulped. \n\n\"What the hell were you thinking, huh?! Do you realize how injured you are?!! And who told you I need to be protected? I could've handled those three asses myself!! Even if...! Even if it was... nice of... you...\"\n• In the Soul Eater fic , Maka's reaction to Crona finally returning to Death City after running away and going back to Medusa is to hug him tight, make sure he's okay, and then Maka-Chop him. Crona: (holding his head) Ow, why did you do that? Maka: That's for making me worry about you!\n• In the The Familiar of Zero fanfiction,The Steep Path Ahead, Louise really gets angry with Saito when he's done something that could severely hurt him without her, most evident after he went on to deal with a Zombie Apocalypse while she was unconscious and came back covered in blood. Louise: \"He could have died. Do you know what it means? When you're dead, you're in Founder Brimir's arms forever. There's no coming back. You can't just turn back time. A dead person is dead forever, so I am angry. I am angry and I am hurt that he could not wait for me to wake up, and I don't care if he succeeded now, because if tomorrow he does the same and he fails, then I'll be the one left to pick up the pieces of his scattered corpse to sew them back together, and then I'll have to present it to his family saying that he died bravely, but they would rather have their son back.\"\n• In Thousand Shinji, when Asuka nearly blows herself up to take down Sandalphon, Shinji got incredibly mad at her. Shinji: (angrily) What the fuck were you thinking? \n\nAsuka: (dazedly) I I did what I had to do, just like how you blew yourself up to take out Shamshel. \n\nShinji: It\u0092s called the \u0091Shinji Suicide Special\u0092 for a reason. \n\nAsuka: (grinning) Well they can call it the \u0091Soryu Suicide Special\u0092 now.\n• With This Ring: Zatara isn't too impressed by Paul's association with John Constantine, mainly because he knows what happens to people who work with John or owe him favors. When he learns that Paul had John give him magical tattoos that will help him develop a soul he freaks out and rushes to the cave to make sure that Paul isn't about to suffer some horrible fate in the near future.\n• Becomes something of a Brick Joke when Paul merges with the Ophidian and Zatara assumes that he's been possessed by a demon because of the tattoos. Paulphidian then scanned his soul and discovered that his main desire at the time involved strangling Constantine with his bare hands.\n• In Peggy Sue fic Warp, Victoria Dallon gets to meet again her boyfriend Dean who had died in battle against a monster in the original timeline. Framing the original events as a nightmare, she berates him for charging ahead and getting himself killed. \"It's just... I had a dream Leviathan attacked here and you died.\" \n\n\"I'm here,\" he said. \n\nI ignored him. \"Because of course you went charging into a fight against an Endbringer. Of course you couldn't help yourself, or have the common sense to stick to the sidelines. Of course you had to go and\u0097and get yourself crushed. You dumbass.\" \n\nIt wasn't fair of me to blame him for his own death. Leviathan moved so fast there weren't sidelines to stick to. Still, I'd often thought of the ways things could have gone differently; he could have sought shelter with his family, or stayed paired with someone who could move him from danger, or done anything but try to face off against Leviathan. \n\nBut he wouldn't have had it any other way, and I wouldn't have had him any other way. \n\nDidn't mean he wasn't a dumbass.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/AngerBornofWorry", "media_links": ["/pmwiki/pmwiki.php/Franchise/Superman", "/pmwiki/pmwiki.php/Franchise/Superman", "/pmwiki/pmwiki.php/ComicBook/Supergirl", "/pmwiki/pmwiki.php/Series/StarTrekTheOriginalSeries", "/pmwiki/pmwiki.php/Franchise/HarryPotter", "/pmwiki/pmwiki.php/Manga/SoulEater", "/pmwiki/pmwiki.php/Series/NCIS", "/pmwiki/pmwiki.php/Literature/AlexRider", "/pmwiki/pmwiki.php/LightNovel/TheFamiliarOfZero", "/pmwiki/pmwiki.php/ComicBook/Hellblazer", "/pmwiki/pmwiki.php/VideoGame/DragonAgeInquisition", "/pmwiki/pmwiki.php/Anime/FullmetalAlchemist", "/pmwiki/pmwiki.php/WesternAnimation/MyLittlePonyFriendshipIsMagic", "/pmwiki/pmwiki.php/WesternAnimation/MyLittlePonyEquestriaGirls", "/pmwiki/pmwiki.php/Literature/Ward"], "non_media_links": ["http://www.fimfiction.net/story/73406/rainbow-in-the-dark", "/pmwiki/pmwiki.php/FanFic/RainbowInTheDark", "/pmwiki/pmwiki.php/Fanfic/ACrownOfStars", "/pmwiki/pmwiki.php/Fanfic/TheChildOfLove", "/pmwiki/pmwiki.php/Main/ShrinkingViolet", "/pmwiki/pmwiki.php/Main/JerkWithAHeartOfGold", "/pmwiki/pmwiki.php/Fanfic/TheDragonThatWillPierceTheHeavens", "/pmwiki/pmwiki.php/Fanfic/DoubleAgentVader", "/pmwiki/pmwiki.php/Fanfic/HERZ", "/pmwiki/pmwiki.php/Fanfic/HigherLearning", "/pmwiki/pmwiki.php/Main/HeroicBSOD", "/pmwiki/pmwiki.php/Main/SorkinRelationshipMoment", "/pmwiki/pmwiki.php/Fanfic/LastChildOfKrypton", "/pmwiki/pmwiki.php/Fanfic/ScarTissue", "/pmwiki/pmwiki.php/Fanfic/TheSecondTry", "/pmwiki/pmwiki.php/Fanfic/SupermanOf2499TheGreatConfrontation", "/pmwiki/pmwiki.php/Main/WeaksauceWeakness", "/pmwiki/pmwiki.php/Fanfic/SOE2LoneHeirOfKrypton", "/pmwiki/pmwiki.php/Fanfic/WhiteDevilOfTheMoon", "/pmwiki/pmwiki.php/Fanfic/ChristianHumberReloaded", "/pmwiki/pmwiki.php/FanFic/Insontis", "/pmwiki/pmwiki.php/FanFic/KyonBigDamnHero", "/pmwiki/pmwiki.php/Main/Yakuza", "/pmwiki/pmwiki.php/Main/PowerNullifier", "/pmwiki/pmwiki.php/Fanfic/EarthAndSky", "/pmwiki/pmwiki.php/FanFic/BrokenFacades", "/pmwiki/pmwiki.php/Main/CastFromLifeSpan", "http://www.fanfiction.net/s/9139830/1/Hit-and-Hug", "/pmwiki/pmwiki.php/Recap/MyLittlePonyFriendshipIsMagicS2E19PuttingYourHoofDown", "/pmwiki/pmwiki.php/Main/TookALevelInJerkass", "/pmwiki/pmwiki.php/Main/ShrinkingViolet", "/pmwiki/pmwiki.php/FanFic/AGrowingAffection", "/pmwiki/pmwiki.php/FanFic/Heroes", "/pmwiki/pmwiki.php/Main/RaiseHimRightThisTime", "https://www.fanfiction.net/s/9440756/1/Alive", "/pmwiki/pmwiki.php/FanFic/ASnowflakeInSpring", "/pmwiki/pmwiki.php/Main/AngstComa", "https://www.fanfiction.net/s/8935062/1/Shards-To-A-Whole", "/pmwiki/pmwiki.php/Main/ItMakesSenseInContext", "/pmwiki/pmwiki.php/Main/LoveInterest", "/pmwiki/pmwiki.php/Main/FieryRedhead", "/pmwiki/pmwiki.php/Main/Polyamory", "/pmwiki/pmwiki.php/Main/HeroicBSOD", "/pmwiki/pmwiki.php/Fanfic/CursesPsychonauts", "/pmwiki/pmwiki.php/Main/AdultFear", "/pmwiki/pmwiki.php/FanFic/KitsuneNoKenFistOfTheFox", "/pmwiki/pmwiki.php/Main/TortureTechnician", "https://www.fanfiction.net/s/3518814/1/Hell-is-Other-People", "/pmwiki/pmwiki.php/Fanfic/TheSteepPathAhead", "/pmwiki/pmwiki.php/Main/ZombieApocalypse", "/pmwiki/pmwiki.php/Fanfic/ThousandShinji", "/pmwiki/pmwiki.php/Fanfic/OnceMoreWithFeeling", "/pmwiki/pmwiki.php/Fanfic/CodeGeassThePreparedRebellion", "/pmwiki/pmwiki.php/FanFic/WithThisRing", "/pmwiki/pmwiki.php/Main/MagiciansAreWizards", "/pmwiki/pmwiki.php/Main/DoomMagnet", "/pmwiki/pmwiki.php/Main/BrickJoke", "/pmwiki/pmwiki.php/Main/EldritchAbomination", "/pmwiki/pmwiki.php/FanFic/SugarPlums", "/pmwiki/pmwiki.php/Main/NotAfraidToDie", "/pmwiki/pmwiki.php/Main/MartyrWithoutACause", "/pmwiki/pmwiki.php/Fanfic/TwiceUponAnAge", "/pmwiki/pmwiki.php/Main/BigBrotherInstinct", "https://m.fanfiction.net/s/9184514/4/", "/pmwiki/pmwiki.php/Fanfic/PokemonResetBloodlines", "/pmwiki/pmwiki.php/Main/HauntedHouse", "/pmwiki/pmwiki.php/Fanfic/EscapeFromTheMoon", "/pmwiki/pmwiki.php/Fanfic/YouCanOnlyUseYourOwn", "/pmwiki/pmwiki.php/Fanfic/MyHuntsmanAcademia", "/pmwiki/pmwiki.php/Main/PurelyAestheticGlasses", "/pmwiki/pmwiki.php/Fanfic/MyMasterEd", "/pmwiki/pmwiki.php/Fanfic/CrimsonAndEmerald", "/pmwiki/pmwiki.php/FanFic/TheFlashSentryChronicles", "/pmwiki/pmwiki.php/Fanfic/ThePiecesLieWhereTheyFell", "/pmwiki/pmwiki.php/Fanfic/AGameComesToEquestria", "/pmwiki/pmwiki.php/Main/PeggySue", "/pmwiki/pmwiki.php/Fanfic/Warp"]}