{"title": "Spanish Prisoner", "content": "A Con Man identifies a potential mark—someone with wealth and naivete. The con man convinces the mark that he serves a dethroned princess who is being held prisoner in, say, Spain. If the mark can come up with just a few hundred dollars, then a guard can be bribed and the princess can flee to the US (where the mark lives) in eternal gratitude.\n\nThe mark can easily part with a few hundred, and so, though he is wary, he falls far enough for the con man's smooth line. A week goes by. Two. The mark has come to understand that he's been tricked, but before that last spark of hope can die, the con man reappears with a letter from Her Highness. She is free and in France. Now she needs a few thousand dollars for her final passage by sea, and the mark gladly shells it out.\n\nNext, the princess might need money to bail out her mother and father, the ex-monarchs; then, she'll need to buy off a Spanish spy who has discovered her escape. The mark keeps paying for as long as the con artists can keep him fooled. The con man shows the mark photographs of the beautiful princess (who is really Dotty from the Nighthawk Diner in a ten-cent tiara). More players are brought in to act out additional roles, each earning part of the take.\n\nFinally, the mark can be brushed off. One way to do this is for the princess to arrive, at last, on the mark's doorstep. The con man is there, too, but then the Spanish spy shows up and murders the con man. (It's an act, of course; the con man usually has a \"cackle bladder\" full of fake blood in his mouth, and he usually makes sure to get some of it on the mark's clothes as he falls.) The mark is terrified, and the princess runs to his side, kisses him tenderly, and tells him that she must go into exile or she will endanger his life as well as her own. And so, the mark never sees the princess again, and the con man, princess, and Spanish spy agent all split the take. In this way the Mark never realizes he was conned and doesn't go to the police. There are real-life examples of marks who discovered the con only when they were approached by the police and asked to testify.\n\nThat's the classic Spanish Prisoner. Today's updates are called Russian Bride and Save This Hooker.\n\nIt's one of The Oldest Tricks in the Book.\n\nA variant frequently encountered on the Internet these days is the \"419 Scam\" (named after the relevant section of the Nigerian banking code, where some of these scams originate), in which the \"prisoner\" is replaced by a relative of some recently deceased Third World dictator, who asks the potential mark to help him smuggle and/or launder stolen UN aid money. Or get bank boxes out of a third country. Or steal the ill-gotten windfall profit of an over-invoiced oil contract. If you're reading this, you've probably received spam about it yourself. The total amount of over-invoiced oil on all of these supposed \"lucrative\" contracts probably exceeds the output of Saudi Arabia for ten years. While the two tropes are similar, in works the Spanish Prisoner scam is much more likely to drive the whole plot, while 419 scams are often used as a bit of characterization or as a joke.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/SpanishPrisoner", "media_links": ["/pmwiki/pmwiki.php/Creator/MichaelCaine", "/pmwiki/pmwiki.php/Film/DirtyRottenScoundrels", "/pmwiki/pmwiki.php/Creator/SteveMartin", "/pmwiki/pmwiki.php/Creator/DavidMamet", "/pmwiki/pmwiki.php/Film/TheSpanishPrisoner", "/pmwiki/pmwiki.php/Film/RoadToZanzibar", "/pmwiki/pmwiki.php/Literature/GentlemanBastard", "/pmwiki/pmwiki.php/Creator/NeilGaiman", "/pmwiki/pmwiki.php/Literature/AmericanGods", "/pmwiki/pmwiki.php/Series/InspectorMorse", "/pmwiki/pmwiki.php/Series/Leverage", "/pmwiki/pmwiki.php/Series/ThatMitchellAndWebbLook", "/pmwiki/pmwiki.php/Series/Hustle", "/pmwiki/pmwiki.php/Series/BurnNotice", "/pmwiki/pmwiki.php/Series/Community", "/pmwiki/pmwiki.php/Series/SneakyPete"], "non_media_links": ["/pmwiki/pmwiki.php/Main/ConMan", "/pmwiki/pmwiki.php/Main/TheOldestTricksInTheBook", "/pmwiki/pmwiki.php/Main/FourOneNineScam", "/pmwiki/pmwiki.php/Main/LaResistance", "/pmwiki/pmwiki.php/Main/KansasCityShuffle", "/pmwiki/pmwiki.php/Main/VagabondBuddies", "/pmwiki/pmwiki.php/Main/KansasCityShuffle", "/pmwiki/pmwiki.php/Main/SubvertedTrope"]}