{"title": "Rush Boss", "content": "Boss Battles in video games tend towards two extremes. One type is the boss that takes a very long time to beat, but poses little offensive threat; a boss that is a Stone Wall, in effect. This is the Marathon Boss. Then you have these — bosses that hit hard but die fast. However, these bosses are not necessarily easy, just as Marathon Bosses are not always difficult. These bosses can be Sequential Bosses, though this trait usually applies to individual forms in that case.\n\nIn game design, these models may be favoured for being more exciting than Marathon Boss-style wars of attrition, though if they die too quickly, players may be able to bypass whatever gimmick or strategy they were supposed to use simply by using an Attack! Attack! Attack! strategy. In addition, their attacks are usually difficult to dodge, since, obviously, dodging attacks would negate their offensive power.\n\nNote that this is not merely a boss that goes down very quickly — that usually falls under Breather Boss or Anticlimax Boss. They must be able to take you down very quickly as well. Fragile Speedster-type bosses that frequently dodge attacks do not count either, since in that case it's as if they have high defense anyway. See \"Get Back Here!\" Boss for that. Some Rush Boss may be compared to Time-Limit Boss as well, particularly in cases where the time limit is short before the boss ends the player.\n\nNot to be confused with Boss Rush. For a boss that literally rushes at you, see Bullfight Boss.\n• Most of the Brothers in Turgor, in contrast to the giant Predators, who are Marathon Bosses. Whaler in particular; he turns into more and more of a Glass Cannon as the fight progresses, to the point where you can kill him in one hit if enough time has elapsed. In addition, his vulnerability wheels never fall off, making him the only boss that is actually capable of dying in a single hit.\n• The Bone Demon in MARDEK. It has the lowest HP of all the chapter 3 Bonus Bosses, but has very powerful attacks.\n• Jubei Yagyu in Onimusha: Dawn of Dreams can unleash several quick and damaging sword slashes in a row, which is quite bad for your health. However, with a good defense timing, you can pull an easy Issen counterattack and finish her off in two or three attacks.\n• Both final bosses of Alpha Protocol. One uses a series of deadly miniguns but has horrible damage resistance, while the other uses a rocket launcher but can be defeated in a single punch (although getting close enough to do so can be a problem).\n• Ridley in the 2D Metroid games, due to being one of the few (if not the only) bosses who is always vulnerable to attack. However, you usually fight him in a cramped space, and his attacks are both hard to dodge and powerful.\n• For Alundra, the US localization team specifically noted that they tweaked a few bosses to have more attack power and less HP than in the original Japanese version, because they felt some of the Boss Battles were more tedious than challenging.\n• In the flash game LARRY and the GNOMES, the Purple Monster boss has the least health of all the bosses; however, its attacks reduce a lot of health with a single hit, it attacks very rapidly, and its charge can kill you quickly if you don't dodge it.\n• Bushido Blade: The game's intent of realistic combat (i.e: no lifebars) effectively means that any battle can end in just one clean strike against your opponent.\n• In contrast to the series's love of the inverse, most boss fights in Final Fantasy V are of this trope. Odin in particular stands out, being that the party has to defeat him in one minute or they will lose. The first legal and decent release of the game outside of Japan was on a portable system, which was suited well to this trope, luckily.\n• The duel with Luca Blight in Suikoden II. Thanks to the prior Sequential Boss fight, he only has a sliver of health left, but he's still strong enough to kill you in two attacks.\n• Many of the DPS Race raid bosses in World of Warcraft have enrage timers that are notably shorter than bosses who are more of a battle of survival (typically 5 or 6 minutes, compared to standard 9-10 minute enrage timers), and the greatest danger is most often killing them before the timer expires and they start one-shotting the raiders.\n• Hearthstone: Heroes of Warcraft:\n• There are several cards that will replace your hero with a whole new hero that has low Hit Points but can dish out massive damage just as quick. Killing Majordomo Executus will replace your hero with Ragnaros the Firelord, capable of dealing 8 damage to a random enemy for his hero spell... but only has 8 HP. Playing the Jaraxxus card replaces your hero with the aforementioned EREDAR LORD OF THE BURNING LEGION!! who has 15 HP, but possesses a 3/8 Weapon and his heroic ability lets you summon a 6/6 creature for 2 mana every turn.\n• The final confrontation with the Lich King of the Knights of the Frozen Throne adventure is traditionally a long fight with different phases. Due to the relatively low quality of his early game minions, though, some strategies aim to play as aggressively as possible and defeat him before he reaches turn 7 and initiates his second phase.\n• From the Dungeon Run, there is Azari, one of the final bosses. Unlike the other final bosses, Azari doesn't use anything that grants him additional armor or helps him regain health, and also runs a lot of Demons which do damage to himself. However, his free Hero Power destroys the top two cards of the player's deck every turn, erasing their options and putting them to fatigue very quickly. The recommended tactic is to play as aggressively as possible to defeat Azari before the inevitable fatigue damage gets you.\n• Odin is a common Rush Boss in the Final Fantasy series as a whole, since he will generally give you a short amount of time to kill him before he uses Zantetsuken (which is either an attack that is almost impossible to survive or a Non-Standard Game Over). At the same time, he tends to have less HP than bosses of equivalent difficulty.\n• Most of the key bosses in Diablo II are marathon bosses (including all the Act Bosses except possibly Andarial, who's a bit of a half-way house), but the mid-act boss in Act 2, The Summoner, is a classic Rush Boss. He's extremely fragile, going down in two or three hits, but depending on your build he can easily One-Hit Kill you, at least on Normal difficulty. He also has fantastic range (well over your character's sight range), meaning new players often die to him before they even see him.\n• Elec Man and Ice Man in Mega Man. Both of them can destroy Mega Man in three hits, but Mega Man can destroy them in 3 hits if he uses the correct weapon.\n• In Final Fantasy Tactics, most Lucavi, especially Velius, can be killed relatively quickly, but can, on the other hand, very quickly obliterate you as well. In fact, the few Lucavi that don't possess powerful attacks instead have attacks that delay or slow down the pace of battle to give them an advantage: Cuchrain, for example, is frightening due to his unknown HP and never-before-seen attacks that can put the entire party to sleep, and he hits hard when he hits (including an ability that can petrify multiple characters), but he also goes down in two rounds of sustained attack. If you can rush him down, he's easy, but if he rushes you down, he'll take his time to make it hurt.\n• In The Legend of Zelda: The Wind Waker, the battle between Link and Cyclos lasts only 30 seconds, but that time is decisive. If you fail to quickly shoot three arrows to Cyclos, he will use his cyclone to take you away to a random part of the Great Sea, forcing you to look for him again for a rematch. And if you aim for 100% Completion, then you will also need to take a picto shot to the opponent before defeating him, otherwise you will never have another chance.\n• The Demon Wall in Final Fantasy IV, being an Advancing Wall of Doom in boss form, is naturally one of these.\n• In Dissidia Final Fantasy, many of the Golden Manikins are set up like this: They have so little HP (sometimes only one) that even a level 1 character can kill them in a single blow. However, their bravery/attack is often high enough that they can kill a level 99 character in a single blow, and are usually programmed to be aggressive, evasive, and use their best attacks.\n• Professor Hangar, the boss of Titania in the original Star Fox, has very light armor, but his attacks are tricky to dodge. Typically, one of you will be dead within 30 seconds.\n• Abmneshi The Prophecy has a secret True Final Boss, Avatar, which has only a fraction of the preceding boss's HP but nonetheless dwarfs it in sheer difficulty.\n• Bosses in the Izuna games tend to hit very hard, especially with their special attacks. But you're just as dangerous to them as long as you use items and talismans well instead of just hacking away.\n• The Bonus Boss of The World Ends with You, Panthera Cantus, can be defeated in as quickly as 35 seconds. However, he is also the single most damaging enemy in the entire game; even at level 100 and with severely-boosted HP, he can still wipe the floor with both of your characters.\n• Vanitas Remnant, one of the Bonus Bosses in Kingdom Hearts: Birth by Sleep, only has one health bar, but hits extremely hard and attacks so frequently that even getting a hit in is a challenge. Oh, and if you heal yourself, it heals itself. Completely. You can cry now.\n• The Killer Rabbit of Dragon's Crown. It has low health for a boss, but it's fast, hard to hit, deals very heavy damage and stuns with its moves, and also gains a move that deals your Max Health in damage when it Turns Red.\n• Raivolt in Grid Warrior. It doesn't have that much health, but it's fast, can stun you then charge at you, and its attacks deal armor-piercing damage. Its Desperation Attack can be a One-Hit Kill if you don't avoid the laser which stuns you, then it lands on you to finish you off.\n• In Hellsinker, the boss of Segment 2 Lead, the Scarlet Queen, has a hidden form if you defeat her with high enough Stella. The good news: it's only 15 seconds long. The bad news: It spits out very fast and dense patterns that will probably cost you a life (offsetting the 1-Up you'll get for killing it) unless you bomb through it.\n• Pathfinder and Dungeons & Dragons before 4th edition were all about this trope for most boss battles. The climactic fight in a dungeon would often be able to lay down enough damage to break a party in a few rounds and may have incredibly powerful debuffs or One-Hit KO powers. Players would immediately realize the situation had crossed the Godzilla Threshold and pour forth all of their most potent, limited-use items. Additionally, the boss would be targeted by every one of the Standard Status Effects since there was no Useless Useful Spell. It didn't help that the game rules naturally favor Rocket-Tag Gameplay. Fourth Edition Dungeons & Dragons goes for Marathon Boss more often.\n• Master level enemies in Dark Heresy, Black Crusade, Rogue Trader, Deathwatch, and Only War cause gameplay to turn to Rocket Tag. Enemies at those levels can turn player characters into a fine red mist in no time flat.\n• The Four Kings in Dark Souls I are best fought by doing as much damage as quickly as possible because you start fighting one, but a new one enters the arena every minute until you've done enough damage to them together, making it harder to fight the ones that are already there without dying. In practice, they're either a Rush Boss or a very difficult Wolfpack Boss. They're often considered the hardest boss in the game simply because this is so different from the rest of the game, which encourages you to fight slowly and methodically. Most other bosses in games also take only a few minutes at most to kill, with the difficulty coming from them being able to kill you even quicker.\n• A similar gimmick is attempted by the earlier Pinwheel boss, who can create infinite replicas of himself. While each illusion folds in one hit, his aproach to combat means that you'll get pinned down by an endless barrage of fireballs if you don't take him out fast him. The problem? it's really easy to take him out fast enough, thanks to his abysmal healthpool, meaning that he never even gets to that point.\n• In The Evil Within, most bosses can tear you in half if they get too close (sometimes literally), but surprisingly can't take too much damage themselves, turning encounters into panic-filled rocket tag.\n• Richter in Castlevania: Symphony of the Night dies in relatively few hits compared to most of the game's bosses. He also moves fast and hits hard, including one attack that fills the entire screen. Of course, killing him only leads to the bad ending, since the real intended objective is to lift the curse cast by Shaft\n• Desann, the final boss of Jedi Knight II: Jedi Outcast, is a Lightning Bruiser who can kill you in a couple hits and can use supercharged force powers which are impossible to resist. However, he can also be killed with about 3 solid hits from the strong saber style. A straight duel with him (without using the Force energy beam in the center of the room to beat him) usually ends in less than half a minute, one way or the other.\n• In No More Heroes, the final ranked fight, . They're the last boss of the game , but they have the lowest health of any conventional boss in the game. Of course, given that they Flash Step like it's not even a thing, hit like a tank, and can even counter your wrestling moves with their own , they'll make you work for every sliver of damage you get on them.\n• In Freedom Planet:\n• The final fight with Lord Brevon, once you've destroyed his starfighter and combat mech. His knife (which comes out with little warning) will take out a massive chunk of your HP, he leads the player with his laser pistol to make dodging that much harder, he moves fast enough to keep Lilac on her toes, and he can even counter some of your attacks, but it doesn't take that many hits to put him down if you can survive his onslaught.\n• Spade is like this too. He is small, very fast, spends a lot of time in the air, can perform mid-air dashes to dodge any aerial attacks you might throw at him, and reacts instantly to things you do. He's also very good at positioning himself so his razor-sharp playing cards he throws hit you. Spade takes the fewest amount of hits of any boss in the game, but he is very hard to actually hit.\n• Rapid-Fire Magician, one of the AI opponents in Yu Gi Oh Ultimate Masters, must be challenged under the conditions where both players begin with 2000 LP (as opposed to the standard 8000). Under this condition, it can be defeated easily if you land a couple of direct attacks, but this opponent is also designed to take advantage of the situation and runs a burn deck which can deplete your own Life Points in a couple of turns. It can boil down to a Luck-Based Mission to not get defeated in the blink of an eye.\n• Classic bump-attack games in the Ys series (namely, I, II, and IV) due to the way it works bosses and even simple enemies can rip you a new one just as fast as you can them. Take for instance, the very first foe you see in I, which will kill you in seconds flat if you don't know what you're doing. Later games switch to a more traditional Action RPG style of combat, so they don't count as much, with even Ys 7 boasting some borderline Marathon Bosses.\n• Sigma from Mega Man X3 is a brutally difficult and overwhelming fight, but once you have your timing down, you can defeat both of his phases with only three shots by fully charging the upgraded X Buster.\n• One minigame in Shmups Skill Test has you destroying a boss named Larilari. You either kill it in about a second with sufficiently fast Button Mashing, get crushed just as quickly from not firing fast enough or as a penalty for shooting before the core turns red, or ram into it.\n• Bowser and his fakes from Super Mario Bros., if Mario isn't powered-up. All it takes to defeat them is to run under or leap over them once and touch the ax at the end of the bridge. On the other hand, if Mario touches them or any of their hammers without a power-up, it's back to the beginning of the level.\n• The Brigand 8-Pounder is a Weald boss in Darkest Dungeon that requires the player to deal damage to both it and its matchman that it spawns, or else it will deal heavy amounts of damage that can easily knock almost every party member to near Death's Door at full health (it has a chance to misfire, but that's not something you'd want to bet on).\n• Dark Knight Alternis Dim in Bravely Default. Once he gets below a certain percentage of HP, the fight basically becomes a race to finish him off quickly before his Minus Strike's One-Hit Kill capacity gets out of hand.\n• Final bosses fought as Super Sonic in Sonic the Hedgehog games tend to fall under this category, as Sonic begins with the 50 Rings needed to transform into Super Sonic but loses one Ring per second. Because Super Sonic is even faster than regular Sonic and is invincible against almost all of these bosses, they are designed to waste time in order to make Super Sonic lose his Rings and turn back into his normal state, upon which he is typically killed instantly due to being in outer space or in some inhospitable alternate dimension. Hence, Super Sonic battles either end quickly, or the bosses end Super Sonic quickly. This is even more pronounced with True Area 53 and Phantom King, both of whom can pull Rings away from Super Sonic causing him to deplete them even faster. Nearly every case has Rings floating around for Super Sonic to pick up, but they're not abundant enough to make up for the lost Rings.\n• The boss battle against the Snatcher at the end of Chapter 3 in A Hat in Time. His attacks are all very difficult to dodge, fast, and ruthless, but he only takes five hits once vulnerable - a minuscule amount compared to the rest of the bosses.\n• In chapter 6 of The Legend of Heroes: Trails in the Sky SC, the party faces the robot doppelgangers of Joshua. And like Joshua himself, their speed is high, their health average, bordering on low, and they hit hard. They have every move Joshua does, meaning they'll do everything to delay your turns, strike quickly, and they'll use their S-Craft to do heavy damage to the entire party. If you don't go all out with your own Crafts, odds are enough of the Joshua bots will stick around long enough to wipe out your team.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/RushBoss", "media_links": ["/pmwiki/pmwiki.php/VideoGame/Turgor", "/pmwiki/pmwiki.php/VideoGame/OnimushaDawnOfDreams", "/pmwiki/pmwiki.php/VideoGame/AlphaProtocol", "/pmwiki/pmwiki.php/VideoGame/Metroid", "/pmwiki/pmwiki.php/VideoGame/Alundra", "/pmwiki/pmwiki.php/VideoGame/LARRYAndTheGNOMES", "/pmwiki/pmwiki.php/VideoGame/BushidoBlade", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyV", "/pmwiki/pmwiki.php/VideoGame/SuikodenII", "/pmwiki/pmwiki.php/VideoGame/WorldOfWarcraft", "/pmwiki/pmwiki.php/VideoGame/HearthstoneHeroesOfWarcraft", "/pmwiki/pmwiki.php/Franchise/FinalFantasy", "/pmwiki/pmwiki.php/VideoGame/DiabloII", "/pmwiki/pmwiki.php/VideoGame/MegaMan1", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyTactics", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaTheWindWaker", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyIV", "/pmwiki/pmwiki.php/VideoGame/DissidiaFinalFantasy", "/pmwiki/pmwiki.php/VideoGame/StarFox", "/pmwiki/pmwiki.php/VideoGame/AbmneshiTheProphecy", "/pmwiki/pmwiki.php/VideoGame/Izuna", "/pmwiki/pmwiki.php/VideoGame/TheWorldEndsWithYou", "/pmwiki/pmwiki.php/VideoGame/KingdomHeartsBirthBySleep", "/pmwiki/pmwiki.php/VideoGame/DragonsCrown", "/pmwiki/pmwiki.php/VideoGame/GridWarrior", "/pmwiki/pmwiki.php/VideoGame/Hellsinker", "/pmwiki/pmwiki.php/TabletopGame/Pathfinder", "/pmwiki/pmwiki.php/TabletopGame/DungeonsAndDragons", "/pmwiki/pmwiki.php/TabletopGame/DungeonsAndDragons", "/pmwiki/pmwiki.php/TabletopGame/DarkHeresy", "/pmwiki/pmwiki.php/TabletopGame/BlackCrusade", "/pmwiki/pmwiki.php/TabletopGame/RogueTrader", "/pmwiki/pmwiki.php/TabletopGame/Deathwatch", "/pmwiki/pmwiki.php/TabletopGame/OnlyWar", "/pmwiki/pmwiki.php/VideoGame/DarkSoulsI", "/pmwiki/pmwiki.php/VideoGame/TheEvilWithin", "/pmwiki/pmwiki.php/VideoGame/CastlevaniaSymphonyOfTheNight", "/pmwiki/pmwiki.php/VideoGame/JediKnightIIJediOutcast", "/pmwiki/pmwiki.php/VideoGame/NoMoreHeroes", "/pmwiki/pmwiki.php/VideoGame/FreedomPlanet", "/pmwiki/pmwiki.php/VideoGame/Ys", "/pmwiki/pmwiki.php/VideoGame/MegaManX3", "/pmwiki/pmwiki.php/VideoGame/ShmupsSkillTest", "/pmwiki/pmwiki.php/VideoGame/SuperMarioBros", "/pmwiki/pmwiki.php/VideoGame/DarkestDungeon", "/pmwiki/pmwiki.php/VideoGame/BravelyDefault", "/pmwiki/pmwiki.php/VideoGame/SonicTheHedgehog", "/pmwiki/pmwiki.php/VideoGame/SonicAdvanceSeries", "/pmwiki/pmwiki.php/VideoGame/SonicMania", "/pmwiki/pmwiki.php/VideoGame/AHatInTime", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfHeroesTrailsInTheSky"], "non_media_links": ["/pmwiki/pmwiki.php/Main/BossBattle", "/pmwiki/pmwiki.php/Main/StoneWall", "/pmwiki/pmwiki.php/Main/MarathonBoss", "/pmwiki/pmwiki.php/Main/GlassCannon", "/pmwiki/pmwiki.php/Main/BreatherBoss", "/pmwiki/pmwiki.php/Main/MarathonBoss", "/pmwiki/pmwiki.php/Main/SequentialBoss", "/pmwiki/pmwiki.php/Main/MarathonBoss", "/pmwiki/pmwiki.php/Main/AttackAttackAttack", "/pmwiki/pmwiki.php/Main/BreatherBoss", "/pmwiki/pmwiki.php/Main/AnticlimaxBoss", "/pmwiki/pmwiki.php/Main/FragileSpeedster", "/pmwiki/pmwiki.php/Main/GetBackHereBoss", "/pmwiki/pmwiki.php/Main/RushBoss", "/pmwiki/pmwiki.php/Main/TimeLimitBoss", "/pmwiki/pmwiki.php/Main/RocketTagGameplay", "/pmwiki/pmwiki.php/Main/BossRush", "/pmwiki/pmwiki.php/Main/BullfightBoss", "/pmwiki/pmwiki.php/Main/MarathonBoss", "/pmwiki/pmwiki.php/Main/GlassCannon", "/pmwiki/pmwiki.php/Videogame/MARDEK", "/pmwiki/pmwiki.php/Main/BonusBoss", "/pmwiki/pmwiki.php/Main/BossBattle", "/pmwiki/pmwiki.php/Main/WebGames", "/pmwiki/pmwiki.php/Main/LifeMeter", "/pmwiki/pmwiki.php/Main/OneHitKill", "/pmwiki/pmwiki.php/Main/FanTranslation", "/pmwiki/pmwiki.php/Main/PortingDisaster", "/pmwiki/pmwiki.php/UsefulNotes/GameBoyAdvance", "/pmwiki/pmwiki.php/Main/DuelBoss", "/pmwiki/pmwiki.php/Main/SequentialBoss", "/pmwiki/pmwiki.php/Main/SequentialBoss", "/pmwiki/pmwiki.php/Main/RushBoss", "/pmwiki/pmwiki.php/Main/NonStandardGameOver", "/pmwiki/pmwiki.php/Main/OneHitKill", "/pmwiki/pmwiki.php/Main/ElementalRockPaperScissors", "/pmwiki/pmwiki.php/Main/HundredPercentCompletion", "/pmwiki/pmwiki.php/Main/PermanentlyMissableContent", "/pmwiki/pmwiki.php/Main/AdvancingWallOfDoom", "/pmwiki/pmwiki.php/Main/OneHitPointWonder", "/pmwiki/pmwiki.php/Main/TrueFinalBoss", "/pmwiki/pmwiki.php/Main/AttackAttackAttack", "/pmwiki/pmwiki.php/Main/BonusBoss", "/pmwiki/pmwiki.php/Main/BonusBoss", "/pmwiki/pmwiki.php/Main/KillerRabbit", "/pmwiki/pmwiki.php/Main/OneHitKill", "/pmwiki/pmwiki.php/Main/TurnsRed", "/pmwiki/pmwiki.php/Main/DesperationAttack", "/pmwiki/pmwiki.php/Main/OneHitKill", "/pmwiki/pmwiki.php/Main/DynamicDifficulty", "/pmwiki/pmwiki.php/Main/OneUp", "/pmwiki/pmwiki.php/Main/BossBattle", "/pmwiki/pmwiki.php/Main/OneHitKO", "/pmwiki/pmwiki.php/Main/GodzillaThreshold", "/pmwiki/pmwiki.php/Main/StandardStatusEffects", "/pmwiki/pmwiki.php/Main/UselessUsefulSpell", "/pmwiki/pmwiki.php/Main/RocketTagGameplay", "/pmwiki/pmwiki.php/Main/MarathonBoss", "/pmwiki/pmwiki.php/Main/RocketTag", "/pmwiki/pmwiki.php/Main/UnstableEquilibrium", "/pmwiki/pmwiki.php/Main/RushBoss", "/pmwiki/pmwiki.php/Main/WolfpackBoss", "/pmwiki/pmwiki.php/Main/LongRangeFighter", "/pmwiki/pmwiki.php/Main/BreatherBoss", "/pmwiki/pmwiki.php/Main/OneHitKill", "/pmwiki/pmwiki.php/Main/PuzzleBoss", "/pmwiki/pmwiki.php/Main/LightningBruiser", "/pmwiki/pmwiki.php/Main/TrueFinalBoss", "/pmwiki/pmwiki.php/Main/FlashStep", "/pmwiki/pmwiki.php/Main/EvilOverlord", "/pmwiki/pmwiki.php/Main/SequentialBoss", "/pmwiki/pmwiki.php/Main/ThatOneAttack", "/pmwiki/pmwiki.php/Main/SuperSpeed", "/pmwiki/pmwiki.php/Main/FightLikeACardPlayer", "/pmwiki/pmwiki.php/Main/YuGiOh", "/pmwiki/pmwiki.php/Main/HitPoints", "/pmwiki/pmwiki.php/Main/LuckBasedMission", "/pmwiki/pmwiki.php/Main/CollisionDamage", "/pmwiki/pmwiki.php/Main/ActionRPG", "/pmwiki/pmwiki.php/Main/ButtonMashing", "/pmwiki/pmwiki.php/Main/WhatAnIdiot", "/pmwiki/pmwiki.php/Main/AstralFinale", "/pmwiki/pmwiki.php/Main/AmazingTechnicolorBattlefield", "/pmwiki/pmwiki.php/Main/LimitBreak"]}