{"title": "Armored But Frail", "content": "A character or enemy in a video game who has a high defensive stat or ability would be expected to have at least a decently-sized pool of HP to go with it, but this isn't always the case. Some characters instead have a dangerously low pool of health, and use their high defense to balance it out, much like how a Fragile Speedster would use their superior evasive skills for the same effect. Common tactics against such an opponent include wearing them down with lots of quick-but-weak attacks since they'll often do the same amount of Scratch Damage as a single hard-hitting attack, utilizing some kind of Anti-Armor technique or Armor-Piercing Attack, or a Fixed Damage Attack which disregards the defenses.\n\nWhen taken to the logical extreme they're a One-Hit-Point Wonder underneath their armor. When their defensive ability is granting them more HP, it's Body Armor as Hit Points. In certain genres, this frequently comes from a Single-Use Shield.\n\nCompare with Metal Slime, which may too be low in raw health, but very well armored to impair easy kills for their significant reward.\n• Champions\n• A Player Character or Non-Player Character can be created with very high defenses against certain attacks such as PD (Physical Defense), ED (Energy Defense) and Damage Reduction, but with very low Body (the Champions version of Hit Points). It takes a tremendously powerful attack to get through their defense, but when it does, the target will go down quickly.\n• An object can be created of very strong materials which gives it a high Defense, but also have a low Body. Any attack against it must overcome its Defense, but any damage that gets through reduces the Body. Thus, such an object is immune to low damage attacks but vulnerable to high damage attacks.\n• Dungeons & Dragons. When she first appears in 1st Edition Advanced D&D products, the drow deity Lolth has an Armor Class of -10 (which is incredibly hard to hit even for a deity), but only has 66 Hit Points, which is very low for a deity. Almost all deities of that period had at least 100 Hit Points, and some had up to 400 Hit Points.\n• Warhammer 40K: Space Marine Dreadnoughts are huge armored sarcophagi on legs outfitted with heavy weaponry, each containing a Space Marine too critically wounded to survive outside of a Healing Vat. If anything manages to get past the armor, the Marine inside can't do anything to defend himself (sometimes they're missing entire limbs), and so in the fluff they're considered just short of Too Awesome to Use, instead sleeping for centuries between battles so their experience can benefit the Chapter.\n• Assassin's Creed II: Ezio's health depends entirely on what armour he's wearing. If you don't equip any armour on him, his health will be stuck on the same base level regardless of what point in the game you're in. As a result, you can be an absolute tank with an armour on and go down in two hits without it.\n• The Binding of Isaac has Soul Hearts and other similar hearts that act as temporary HP, and there are various items and characters that revolve around a play-style of shielding your low or even outright non-existent pool of normal health with a plethora of Soul Hearts.\n• In the first Borderlands game, have very powerful shields that can take almost every attack like a champ... Unless you're using a Shock-elemented weapon/attack to quickly wear down their shields and expose their laughably low hit points. After that, a few hits will kill them instantly, even if your attacks don't land a Critical Hit on their small heads. In fact, there are ways to bypass the shields, such as Mordecai's Trespasser ability.\n• The Iron Golem from Castlevania: Dawn of Sorrow has a mere 50 HP, but its defense is so absurdly high that any and all attacks against it deal a whopping 1 point of Scratch Damage, making lots of rapid-fire attacks the optimal strategy against it.\n• The Sea Maggot from Darkest Dungeon has enough Protection to cause attacks against to be reduced to a fourth of their damage but even the toughest variant just barely scrapes double digits in hit points.\n• Metal Slimes from the Dragon Quest series, on top of being absurdly fast and running almost instantly, are only capable of taking 1 point of damage from attacks, but their HP is always somewhere in the single digits. Their stronger iterations can only be taken down by a Critical Hit due to subverting this trope with HP in the dozens or hundreds.\n• Heroes of the Storm:\n• Fenix has the lowest maximum health of all Ranged Assassins in the game. However, his trait grants him a permanent shield that takes damage before his health and rapidly regenerates while out of combat. Combined, he actually has the highest total health for a Ranged Assassin, but a large chunk of it can't be recovered in the middle of a fight.\n• Garrosh's trait grants him armor based on his missing health, reducing incoming damage by a percentage. This makes him resilient to poke damage and quite hard to finish when he's nearly dead, but makes him totally defenseless if he takes a large hit early on. He also has the lowest health of all main tanks.\n• In the Paper Mario series this is part of the Game-Breaker \"Danger Mario\" build, which involves lowering Mario's maximum hit points to 5 in exchange for higher stats in other areas, then equipping him only with items which increase his attack and defence while at 5 HP or less.\n• In Plants vs. Zombies, several zombie variants use armors and shields to tank damage, but are only as tough as a basic zombie without them. The Magnet-Shroom is useful because it can take away the armors, making the zombies much weaker. Fume-Shroom's fumes and the Pult plants can also bypass shields wielded by the Screendoor Zombie or the Ladder Zombie, so they can kill them without needing to destroy the shields.\n• Pokémon\n• Shuckle is an extreme example, with the highest Defense and Special Defense of any Pokemon (230 for both) protecting a mere 20 base HP.\n• Shedinja is a (literal) One-Hit-Point Wonder, whose Wonder Guard ability prevents any damage from an attack type that it isn't weak to. However, Wonder Guard also does not protect it from Damage Over Time like poison and burns, from damage inflicted by weather or entry hazards, or from Pokémon with abilities like Mold Breaker (which makes the user's attacks bypass other abilities).\n• Stakataka has a very high base defense of 211, the fourth highest in the game in fact, and not counting Megas, it's only behind Shuckle. Its special defense is quite good too at 101. However, its HP is a mediocre base 61.\n• Other examples include Dusknoir (HP 45, Def 135, SpDef 135), Wishiwashi (HP 45, Def 130, SpDef 135, takes massive stat penalties while at 25% HP or less), Cloyster (HP 50, Def 180, SpDef 45), Mega Sableye (HP 50, Def 125, SpDef 115, reflects Status Ailments back at the attacker), Mega Mawile (HP 50, Def 125, SpDef 95), Deoxys Defence Forme (HP 50, Def 160, SpDef 160), Carbink and Diancie (both HP 50, Def 150, SpDef 150), Toxapex (HP 50, Def 152, SpDef 142), Bastiodon (HP 60, Def 168, SpDef 138), Probopass (HP 60, Def 145, SpDef 150), Aegislash Shield Forme (HP 60, Def 150, SpDef 150), Aggron (HP 70, Def 180, SpDef 60), Mega Aggron (HP 70, Def 230, SpDef 80), Steelix (HP 75, Def 200, SpDef 65), Mega Steelix (HP 75, Def 230, SpDef 95), the Regi trio (HP 80, and either 100/200 or 150/150 defences).\n• Then there's Eviolite, a held item for not-fully-evolved Pokémon (most of which have relatively low hp) which causes them to take 33% less damage from attacks. Or the Fur Coat ability possessed by Furfrou and Alolan Persian, which halves damage from physical attacks.\n• In Shining Force II, you can recruit a character named Kiwi. Kiwi has by far the worst HP growth in the game, but his defense is so high that very few enemies will ever do more than a single point of damage to him. However, he has no defense against magic or Fixed Damage Attacks, meaning his usefulness decreases by the end game, when these types of attacks are very common.\n• Sonic in most Sonic the Hedgehog games is a One-Hit-Point Wonder who uses rings and occasionally shields as a damage buffer. If he's caught without rings, he's a dead hedgehog, but as long as he can catch at least one of the rings that fly out of him upon damage, he's effectively invincible.\n• In Soul Knight, the Paladin starts off with exactly 1 HP (which can be boosted to 2 as he levels up). This is mitigated by his extremely high armor of 8 and his Energy Shield.\n• The titular Spyro the Dragon is a One-Hit-Point Wonder, but his partner Sparx will take the hit for him if he's damaged. Sparx can take 3 hits before disappearing, leaving Spyro alone unless he can find butterflies for Sparx to eat.\n• StarCraft:\n• Zerg Larva have the highest armor value of all units in the game outside of custom maps (along with their sibling, the egg) but have a mere 25 Hit Points. Also, this armor provides relatively less protection from attacks that emphasize quality over quantity. Notably, Siege Tanks and Reavers can kill them in one hit and can even make short work of eggs (200 HP).\n• Archons are Protoss heavy-assault Energy Beings with a tremendously powerful Deflector Shield (more than twice as strong as a human Siege Tank) and an absolute pittance in Hit Points (one quarter those of a puny zergling). This lets them recover easily between fights, but makes them tremendously vulnerable to EMPs, which strip the shields in an instant.\n• Protoss Immortals in StarCraft II were the first game's Dragoons, retrofitted with special plasma shields that reduce all damage to 10 or less as long as they have shields. While this lets them counter hard-hitting units like siege tanks (and weak to Zerg Rush, which relies on lots of weak attacks) and they aren't nearly as vulnerable as Archons without shields, their actual hull isn't well armored against scratch damage. Immortals invert this trope completely in Legacy Of The Void where they lose the hardened shields in exchange for a 3-second barrier that simply absorbs 100 damage and has no armor bonuses at all.\n• The Terran Thor and Protoss Colossus are an inversion: They're well protected with hit points, and have powerful weaponry, but have minimal armor values. This means that even hits from Scratch Damage will be absorbed with almost full effect, making them vulnerable to swarming unless supported. The Colossus is even more vulnerable thanks to being tall enough for anti-air weapons to makes huge dents in their hit points. They have less emphasis on survival and more on damage throughput and decent mobility at the expense of high resource costs.\n• Warframe:\n• Corpus units tend to heavily rely on their Deflector Shields to survive punishment. It's fairly easy to mod for gas damage to bypass it completely and quickly mow down their meager health. This is particularly noticeable in sortie missions where their shield capacity is greatly increased: they won't take that much longer to kill because they'll choke on poison gas regardless.\n• In a similar vein, Hildryn is a Warframe that relies on her shields for protection and to power her abilities. As a result, her shield pool is enormous compared to other Warframes, but her health is pitifully low by comparison. This forces her to micromanage her shields and constantly replenish them by stealing it from her opponents.\n• Several The Legend of Zelda enemies have some kind of (often completely invincible) armor that can be removed with the right item (usually a grappling hook or its analogue), exposing or stunning them so they can be taken out with a single sword slash.\n• Mad Pierrot from Cowboy Bebop is a highly powerful assassin equipped with a personal force field that deflects bullets and other high-speed projectiles, rendering him invincible for most of his fight against Spike. He's also a Psychopathic Manchild with no pain tolerance, so a single throwing knife (moving slow enough to not be stopped by the shield - it only stops things moving above a certain speed) to the leg is enough to cause a complete mental breakdown and take him out of the fight.\n• The titular Radd from Kid Radd, being a platform game character who's mechanics followed him out into the comic's setting, has a measly 4 points of health. However, anything, from a light poke from a character with Collision Damage to a nuclear bomb, only does a single point of damage, and his Mercy Invincibility prevents enemies from chaining together attacks against him.\n• A Certain Magical Index: Accelerator is the world's strongest esper, with his control over direction allowing him to wrap himself in an automatic reflection field that renders him immune to conventional attack. However, due to growing up protected even from things like muscle tearing and ultraviolet light, his body is scrawny and underdeveloped - if anyone finds a way around his defences (such as Touma's Anti-Magic right fist) he goes down like a chump.\n• In Stephen King's The Dark Tower, Roland tells a story of a heavily armored giant named Lord Perth who wants to conquer the world. Just as his journey starts a boy strikes him in the knee with a rock, knocking him over and killing him. Roland's friends compare it to David and Goliath.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/ArmoredButFrail", "media_links": ["/pmwiki/pmwiki.php/TabletopGame/Champions", "/pmwiki/pmwiki.php/TabletopGame/Champions", "/pmwiki/pmwiki.php/TabletopGame/DungeonsAndDragons", "/pmwiki/pmwiki.php/TabletopGame/Warhammer40K", "/pmwiki/pmwiki.php/VideoGame/AssassinsCreedII", "/pmwiki/pmwiki.php/VideoGame/TheBindingOfIsaac", "/pmwiki/pmwiki.php/VideoGame/Borderlands", "/pmwiki/pmwiki.php/VideoGame/CastlevaniaChroniclesOfSorrow", "/pmwiki/pmwiki.php/VideoGame/DarkestDungeon", "/pmwiki/pmwiki.php/VideoGame/DragonQuest", "/pmwiki/pmwiki.php/VideoGame/HeroesOfTheStorm", "/pmwiki/pmwiki.php/VideoGame/PaperMario", "/pmwiki/pmwiki.php/VideoGame/PlantsVsZombies", "/pmwiki/pmwiki.php/Franchise/Pokemon", "/pmwiki/pmwiki.php/VideoGame/ShiningForceII", "/pmwiki/pmwiki.php/VideoGame/SonicTheHedgehog", "/pmwiki/pmwiki.php/VideoGame/SoulKnight", "/pmwiki/pmwiki.php/VideoGame/SpyroTheDragon", "/pmwiki/pmwiki.php/VideoGame/StarCraft", "/pmwiki/pmwiki.php/VideoGame/StarCraftII", "/pmwiki/pmwiki.php/VideoGame/LegacyOfTheVoid", "/pmwiki/pmwiki.php/VideoGame/Warframe", "/pmwiki/pmwiki.php/Franchise/TheLegendOfZelda", "/pmwiki/pmwiki.php/Anime/CowboyBebop", "/pmwiki/pmwiki.php/Webcomic/KidRadd", "/pmwiki/pmwiki.php/LightNovel/ACertainMagicalIndex", "/pmwiki/pmwiki.php/Literature/TheDarkTower"], "non_media_links": ["/pmwiki/pmwiki.php/Main/FragileSpeedster", "/pmwiki/pmwiki.php/Main/DeathOfAThousandCuts", "/pmwiki/pmwiki.php/Main/ScratchDamage", "/pmwiki/pmwiki.php/Main/AntiArmor", "/pmwiki/pmwiki.php/Main/ArmorPiercingAttack", "/pmwiki/pmwiki.php/Main/FixedDamageAttack", "/pmwiki/pmwiki.php/Main/OneHitPointWonder", "/pmwiki/pmwiki.php/Main/BodyArmorAsHitPoints", "/pmwiki/pmwiki.php/Main/SingleUseShield", "/pmwiki/pmwiki.php/Main/MetalSlime", "/pmwiki/pmwiki.php/Main/PlayerCharacter", "/pmwiki/pmwiki.php/Main/NonPlayerCharacter", "/pmwiki/pmwiki.php/Main/HitPoints", "/pmwiki/pmwiki.php/Main/HitPoints", "/pmwiki/pmwiki.php/Main/HitPoints", "/pmwiki/pmwiki.php/Main/HitPoints", "/pmwiki/pmwiki.php/Main/SpaceMarine", "/pmwiki/pmwiki.php/Main/HealingVat", "/pmwiki/pmwiki.php/Main/TooAwesomeToUse", "/pmwiki/pmwiki.php/Main/ArmorAsHitPoints", "/pmwiki/pmwiki.php/Main/EliteMook", "/pmwiki/pmwiki.php/Main/ShockAndAwe", "/pmwiki/pmwiki.php/Main/CriticalHit", "/pmwiki/pmwiki.php/Main/BoomHeadShot", "/pmwiki/pmwiki.php/Main/FriendlySniper", "/pmwiki/pmwiki.php/Main/ArmorPiercingAttack", "/pmwiki/pmwiki.php/Main/ScratchDamage", "/pmwiki/pmwiki.php/Main/CriticalHit", "/pmwiki/pmwiki.php/Main/WhyWontYouDie", "/pmwiki/pmwiki.php/Main/GameBreaker", "/pmwiki/pmwiki.php/Main/MaximumHPReduction", "/pmwiki/pmwiki.php/Main/CriticalStatusBuff", "/pmwiki/pmwiki.php/Main/OneHitPointWonder", "/pmwiki/pmwiki.php/Main/DamageOverTime", "/pmwiki/pmwiki.php/Main/UniversalPoison", "/pmwiki/pmwiki.php/Main/ManOnFire", "/pmwiki/pmwiki.php/Main/WeatherManipulation", "/pmwiki/pmwiki.php/Main/Caltrops", "/pmwiki/pmwiki.php/Main/AntiMagic", "/pmwiki/pmwiki.php/Main/StatusAilment", "/pmwiki/pmwiki.php/Main/FixedDamageAttack", "/pmwiki/pmwiki.php/Main/OneHitPointWonder", "/pmwiki/pmwiki.php/Main/OneHitPointWonder", "/pmwiki/pmwiki.php/Main/OneHitPointWonder", "/pmwiki/pmwiki.php/Main/HitPoints", "/pmwiki/pmwiki.php/Main/EnergyBeings", "/pmwiki/pmwiki.php/Main/DeflectorShields", "/pmwiki/pmwiki.php/Main/EMP", "/pmwiki/pmwiki.php/Main/ZergRush", "/pmwiki/pmwiki.php/Main/InvertedTrope", "/pmwiki/pmwiki.php/Main/ScratchDamage", "/pmwiki/pmwiki.php/Main/DeflectorShields", "/pmwiki/pmwiki.php/Main/PsychopathicManchild", "/pmwiki/pmwiki.php/Main/CollisionDamage", "/pmwiki/pmwiki.php/Main/MercyInvincibility", "/pmwiki/pmwiki.php/Main/WorldsStrongestMan", "/pmwiki/pmwiki.php/Main/AttackReflector", "/pmwiki/pmwiki.php/Main/AntiMagic"]}