{"title": "Port Town", "content": "Usually coupled with an island and much larger than the First Town, this is usually just where the characters are going to Get on the Boat to the next continent. Otherwise expect a fishing village and a beach, perhaps with a floating fish monster that's preventing ships from sailing. If the boat doesn't leave fast enough to get wrecked at sea, the Port Town suffers this fate instead.\n\nOften the Port Town will only let you Get on the Boat after doing a quest, usually as a way to assure the game you're ready to move ahead to an area where you might not be able to backtrack to. If the Port Town is host to an unsavory or criminal subdistrict filled with smugglers, privateers and pirates, this is the Not-So-Safe Harbor.\n\nTruth in Television, of course, but so ubiquitous that trying to list non-video game examples would be futile.\n• The eponymous Port Town from F-Zero, servicing as a port for space travel on Earth.\n• Vermilion City, Olivine City, Lilycove and Slateport Cities (the latter even has \"port\" in its name), Gateon Port, and Canalave and Snowpoint Cities from the Pokémon series. Castelia City is a mix between this and Hub City. And, of course, each island in Alola has a port, since the player can't use Surf to travel between them (except for Mantine Surf).\n• In the Dragon Quest series:\n• Littlehaven (admittedly, not much of a \"town\", but the first place you take a boat to a new continent) and Lodestar Harbour in Dragon Quest V.\n• Fishbel (which is also the First Town) in Dragon Quest VII.\n• Toto in Earthbound is a small fishing village/port town attached to Summers, which is a beach side resort. You can take the boat from there to Scaraba, a town with a less favorable pier-to-town ratio, but still one that clearly relies on incoming water transport.\n• Izoold and Palmacosta in Tales of Symphonia.\n• Venezia in Tales of Phantasia is where the protagonists can get a boat to Alvanista, which is also a port town.\n• Capua Nor and its sister town Capua Torim in Tales of Vesperia, along with Nordopolica to a lesser extent..\n• Kalay and Tolbi in Golden Sun.\n• Those two are just inland cities that own ports. For REAL port towns, check Lalivero, Alhafra, and Champa.\n• And in Dark Dawn, there's Belinsk, Port Rago, Champa again, and Tonfon.\n• Final Fantasy:\n• A few in Final Fantasy VIII; you can dock the garden at Fisherman's Horizon, and the Ragnarok at the airport in Esthar. Balamb and Dollet are more traditional Port Towns, but you cannot pilot boats to and from there and in the case of Dollet, the town is entirely optional once you finish your mission there. You can rent cars from both locations, however.\n• Lindblum in Final Fantasy IX, and it's also an airship port town.\n• Selbina and Mhaura in Final Fantasy XI. Selbina only goes to Mhaura, but Mhaura swaps trips between Selbina and Aht Urhgan.\n• Lut Gholein in Diablo II. The character can only Get on the Boat after the city is safe and the Sultan allows the ship to depart.\n• Port Sarim, Rellekka and Catherby in Runescape. Port Phasmatys also, although it's a combination of Port Town and Ghost Town.\n• Mactan Base, Cadiz Base and Planet Toledo from Freelancer are like staging areas within missions.\n• Saraband in Shining Force III, the whole town is actually a boat.\n• Port Zala and (to a lesser extent) Kolton from Infinite Undiscovery.\n• About eight different towns in World of Warcraft, including one of the Alliance capital cities (Stormwind). The port area of the island Darnassus is treated as a separate zone, but since it's built around a teleporter that takes you straight into the city the division is somewhat arbitrary.\n• Talos Island, Independence Port and Striga Island in City of Heroes. Port Oakes in City of Villains.\n• The port of Badon in Fire Emblem: Blazing Sword (the first one released in the US and Europe).\n• The final level of Stunt Race FX is Harbor City, a track by the water, which the player can fall into if they're not careful.\n• Every town the player visits in Skies of Arcadia is a port town, since the only way to travel through the overworld is via an airship.\n• Rogue's Landing in Sonic & All-Stars Racing Transformed, combined with Levels Take Flight and Floating Continent.\n• Rogueport, which is also the Hub Level of Paper Mario: The Thousand-Year Door.\n• Rhappala in Breath of Fire III. You don't get a boat on your first visit, though .\n• Talewok in Aidyn Chronicles: The First Mage.\n• Beloveno from Albion is the largest settlement in the entire game. The large port takes up 25% of the map. The rest is a maze of buildings. If you didn't use the map for instant travel in the first town, you will use it here.\n• One in each Guild Wars campaign: Lion's Arch in Prophecies, Kaineng Center in Factions, and Kamadan in Nightfall. If you purchase more than one campaign, you can travel between them using these cities.\n• Jolly Roger's Lagoon from Banjo-Tooie is definitely this.\n• Spillar's Harbor in Banjo-Kazooie: Grunty's Revenge is also this.\n• The Elder Scrolls:\n• Morrowind: Vvardenfell being an island turns almost every coastal city into one of these. However, due to the Blight quarantine, only Seyda Neen remains in operation with traffic from the mainland.\n• Oblivion has Anvil as the main seaport, although the Imperial City has a river-based dock as well. You don't really travel anywhere from them in the unmodded version, although a few mods have you start the game by getting off a boat in Anvil.\n• Skyrim has Solitude and Windhelm as well (Dawnstar was one according to previous lore, but by its appearance has been retconned or for unexplained reasons degenerated to a port village).\n• In Ragnarok Online, there's Izlude, Alberta and Hugel. Izlude and Hugel have your normal seaports as well as airship ports.\n• All towns in Quest for Glory V; seeing as this installment of the series is based in a Fantasy Counterpart to Greece, this is justified as all towns are close to water and have to live off of fishing.\n• Kirkwall in Dragon Age II is one of these, though it's also the Adventure Town since the entire plot of the game is focused on the city and the area around it.\n• South Cape from Illusion of Gaia. The hometown of the Kid Hero, it's where the game first starts. Ironically, you end up going north and travelling by land when you leave, instead of taking a boat.\n• Queynos and Freeport in Everquest. They also count as First Town for human characters.\n• The place where the title character works as a barmaid in the song \"Brandy (You're a Fine Girl)\" by The Looking Glass. (\"There's a port/On a western bay/And it serves/A hundred ships a day\")\n• Many coastal towns in Avernum 3. Unfortunately, the quarantine on the continent of Valorim has shut most of them down, and only a few actually allow transport anywhere.\n• Noob has Forpitas, which is near an island called Piratas. For bonus points, it also happens to be near an Under the Sea location according to the novels.\n• Kingsport is Cthulhu Saves the World is where Cthulhu can hitch a boat to Alhazred, after curing the illness that plagues the town.\n• Delfino Plaza in Super Mario Sunshine which is quite a tourist spot given the game's setting.\n• Marwin and Dagron in Manifest, though you never take a boat out of Dagron, mostly because the Thymetian army is making heavy use of it.\n• Sentinel Descendants In Time has Eska, one of the four realms that Beni can explore Tomb 35.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/PortTown", "media_links": ["/pmwiki/pmwiki.php/VideoGame/FinalFantasyVI", "/pmwiki/pmwiki.php/Music/RunningWild", "/pmwiki/pmwiki.php/VideoGame/FZero", "/pmwiki/pmwiki.php/Franchise/PiratesOfTheCaribbean", "/pmwiki/pmwiki.php/VideoGame/PokemonRedAndBlue", "/pmwiki/pmwiki.php/VideoGame/PokemonGoldAndSilver", "/pmwiki/pmwiki.php/VideoGame/PokemonRubyAndSapphire", "/pmwiki/pmwiki.php/VideoGame/PokemonXDGaleOfDarkness", "/pmwiki/pmwiki.php/VideoGame/PokemonDiamondAndPearl", "/pmwiki/pmwiki.php/Franchise/Pokemon", "/pmwiki/pmwiki.php/VideoGame/PokemonBlackAndWhite", "/pmwiki/pmwiki.php/VideoGame/PokemonSunAndMoon", "/pmwiki/pmwiki.php/VideoGame/PokemonUltraSunAndUltraMoon", "/pmwiki/pmwiki.php/VideoGame/DragonQuest", "/pmwiki/pmwiki.php/VideoGame/DragonQuestII", "/pmwiki/pmwiki.php/VideoGame/DragonQuestIII", "/pmwiki/pmwiki.php/VideoGame/DragonQuestIV", "/pmwiki/pmwiki.php/VideoGame/DragonQuestV", "/pmwiki/pmwiki.php/VideoGame/DragonQuestVI", "/pmwiki/pmwiki.php/VideoGame/DragonQuestVII", "/pmwiki/pmwiki.php/VideoGame/DragonQuestVIII", "/pmwiki/pmwiki.php/VideoGame/DragonQuestIX", "/pmwiki/pmwiki.php/VideoGame/TalesOfSymphonia", "/pmwiki/pmwiki.php/VideoGame/TalesOfPhantasia", "/pmwiki/pmwiki.php/VideoGame/TalesOfVesperia", "/pmwiki/pmwiki.php/VideoGame/GoldenSun", "/pmwiki/pmwiki.php/VideoGame/GoldenSunDarkDawn", "/pmwiki/pmwiki.php/Franchise/FinalFantasy", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyI", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyVI", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyVII", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyVIII", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyIX", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyX", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyXI", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyXII", "/pmwiki/pmwiki.php/VideoGame/DiabloII", "/pmwiki/pmwiki.php/VideoGame/Runescape", "/pmwiki/pmwiki.php/VideoGame/LunarTheSilverStar", "/pmwiki/pmwiki.php/VideoGame/Freelancer", "/pmwiki/pmwiki.php/VideoGame/NeverwinterNights2", "/pmwiki/pmwiki.php/VideoGame/GrandiaII", "/pmwiki/pmwiki.php/VideoGame/ShiningForceIII", "/pmwiki/pmwiki.php/VideoGame/InfiniteUndiscovery", "/pmwiki/pmwiki.php/VideoGame/WorldOfWarcraft", "/pmwiki/pmwiki.php/VideoGame/CityOfHeroes", "/pmwiki/pmwiki.php/VideoGame/ValkyrieProfile2Silmeria", "/pmwiki/pmwiki.php/VideoGame/FireEmblemElibe", "/pmwiki/pmwiki.php/VideoGame/StuntRaceFX", "/pmwiki/pmwiki.php/VideoGame/SkiesOfArcadia", "/pmwiki/pmwiki.php/VideoGame/SkiesOfArcadia", "/pmwiki/pmwiki.php/VideoGame/SegaSuperstars", "/pmwiki/pmwiki.php/VideoGame/FableII", "/pmwiki/pmwiki.php/VideoGame/PaperMarioTheThousandYearDoor", "/pmwiki/pmwiki.php/VideoGame/MarioAndLuigiDreamTeam", "/pmwiki/pmwiki.php/VideoGame/Quest64", "/pmwiki/pmwiki.php/VideoGame/BreathOfFireIII", "/pmwiki/pmwiki.php/VideoGame/Albion", "/pmwiki/pmwiki.php/VideoGame/GuildWars", "/pmwiki/pmwiki.php/VideoGame/BanjoTooie", "/pmwiki/pmwiki.php/VideoGame/BanjoKazooieGruntysRevenge", "/pmwiki/pmwiki.php/Franchise/TheElderScrolls", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsIIIMorrowind", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsIVOblivion", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsVSkyrim", "/pmwiki/pmwiki.php/VideoGame/WizardsAndWarriors", "/pmwiki/pmwiki.php/VideoGame/RagnarokOnline", "/pmwiki/pmwiki.php/VideoGame/QuestForGloryV", "/pmwiki/pmwiki.php/VideoGame/DragonAgeII", "/pmwiki/pmwiki.php/VideoGame/IllusionOfGaia", "/pmwiki/pmwiki.php/VideoGame/Everquest", "/pmwiki/pmwiki.php/VideoGame/Avernum", "/pmwiki/pmwiki.php/Franchise/Noob", "/pmwiki/pmwiki.php/VideoGame/FantasyLife", "/pmwiki/pmwiki.php/VideoGame/CthulhuSavesTheWorld", "/pmwiki/pmwiki.php/VideoGame/SuperMarioSunshine", "/pmwiki/pmwiki.php/VideoGame/Manifest", "/pmwiki/pmwiki.php/VideoGame/SentinelDescendantsInTime"], "non_media_links": ["/pmwiki/pmwiki.php/Main/FirstTown", "/pmwiki/pmwiki.php/Main/GetOnTheBoat", "/pmwiki/pmwiki.php/Main/GiantSpaceFleaFromNowhere", "/pmwiki/pmwiki.php/Main/GetOnTheBoat", "/pmwiki/pmwiki.php/Main/FetchQuest", "/pmwiki/pmwiki.php/Main/BrokenBridge", "/pmwiki/pmwiki.php/Main/NotSoSafeHarbor", "/pmwiki/pmwiki.php/Main/TruthInTelevision", "/pmwiki/pmwiki.php/Main/TropeNamer", "/pmwiki/pmwiki.php/Main/HubCity", "/pmwiki/pmwiki.php/Main/FirstTown", "/pmwiki/pmwiki.php/Videogame/Earthbound", "/pmwiki/pmwiki.php/Main/GlobalAirship", "/pmwiki/pmwiki.php/Main/TheEmpire", "/pmwiki/pmwiki.php/Main/GetOnTheBoat", "/pmwiki/pmwiki.php/Main/GhostTown", "/pmwiki/pmwiki.php/Main/LevelsTakeFlight", "/pmwiki/pmwiki.php/Main/FloatingContinent", "/pmwiki/pmwiki.php/Main/HubLevel", "/pmwiki/pmwiki.php/Main/FirstTown", "/pmwiki/pmwiki.php/JustForFun/FantasyCounterpart", "/pmwiki/pmwiki.php/Main/AdventureTown", "http://www.terraearth.com/wp-terraearth/wp-content/uploads/2010/09/South-Cape.png", "/pmwiki/pmwiki.php/Main/KidHero", "/pmwiki/pmwiki.php/Main/FirstTown", "/pmwiki/pmwiki.php/Main/UnderTheSea"]}