{"title": "The Tape Knew You Would Say That", "content": "\n• The Danger Mouse episode \"Duckula Meets Frankenstoat\" features a taped transmission from Colonel K: Colonel K: Ah, there you are DM. I'm sending this recorded message... \n\nDM: Recorded message? \n\nColonel K: Don't interrupt, DM. I had to send this recorded message as normal communications aren't available.\n• In \"Where There's A Well, There's A Way,\" DM and Penfold follow the directions of a scroll en route to the Mystic Inkwell of Merlin: DM: (reading) \"Into the caverns and down the stairs \n\nMust go the ones who would make it theirs...\" \n\nPenfold: \"Theirs\"? \"Their\" what? What's it talking about? \n\nDM: Just a minute, Penfold...(reading) \"The wish I mean, of course, that's what. \n\nForgotten already, you stupid clot?\"\n• In the Superfriends episode \"The Androids\", Dr. Rebos pulls this off (with no explanation given) while the Superfriends are listening to a tape recording he sent them. Dr. Rebos: You have disregarded my warning and so I had to sabotage your Venus probe. \n\nBatman: Do you suppose he knows about the upcoming manned launch to Mars? \n\nDr. Rebos: Your upcoming manned launch to Mars is next [snip] unless you call a complete halt to your space program forever. \n\nSuperman: Of all the dirty, lowdown... \n\nDr. Rebos: This is not dirty and lowdown!\n• Played with in Adventure Time. Jake: But Dad, Finn's already figured that out. He's a good kid with a kind heart. \n\nJoshua: Remember, Jake, this is a pre-recorded holo-message. I can't hear you if you're talking to me right now. \n\n(and then moments later...) \n\nJoshua: Ya gotta call Finn a whiny baby. \n\nJake: But— \n\nJoshua: Butts are for pooping!\n• When Phineas and Ferb's mother decides to take a French audio course: (A spaceship has just landed behind her.) The spaceship is right behind you. \n\n(The title characters start boarding) Your children are climbing in the spaceship now. \n\n(It takes off) Oh, for the love of- would you turn around?\n• An episode of Jimmy Two-Shoes does this gag with a message Sammy prerecorded in a tree. Sammy: On the 5th of Lucapril, all Miseryvillians go into hibernation. Why, you may ask? (beat, clears throat) WHY, YOU MAY ASK?\n• The Simpsons\n• Inverted on the episode \"Marge Be Not Proud\" with the Try-N-Save security chief Don Brodka (Lawrence Tierney) holding a conversation with what he — but not the audience — knew all along was a recording. Tierney didn't get it at all.\n• In one episode Principal Skinner makes a PA announcement requesting a student volunteer, Lisa raises her hand. Skinner pauses and says, \"Can I assume the only hand raised is Lisa Simpson's?\" then pauses again, then says, \"Thank you Lisa\".\n• In the episode \"Gone Maggie Gone,\" Lisa has to decipher an ancient Catholic prophecy about a jewel that will bring world peace. She eventually realizes the final clue is an anagram that can be rearranged to say \"Regally, the rock gem is Lisa,\" which obviously excites her. When the nuns show up, however, they act exasperated and rearrange the letters to spell out \"It's really , Sherlock.\" Lisa Lampshades the fact that that message only works because she got it wrong the first time, but sure enough it's right.\n• Subverted in \"El Viaje Misterioso de Nuestro Homer:\" Homer meets his spirit guide, and later remembers his words. Spirit Guide in Homer's head: I'm just your memory. I can't give you any new information.\n• The Great Big Book of Everything in YooHoo & Friends does this sometimes, containing sarcastic replies to questions the animals look up. How would I know? I'm just a book, not the cloud master or something!\n• In Gravity Falls, while the group try to escape The Monster of the Week in a very slow sky tram. Recording: Welcome to Trambience, the world's slowest treetop tram ride. Enjoy the sights at 0.1 miles per hour. Dipper: Ugh, can't this thing go any faster? Recording: No it can't. This is Trambience.\n• Inversion: In The Beatles cartoon \"Don't Bother Me,\" two spies are tailing the band to steal their book of new songs (probably Decca executives). The boys are waiting on a train to take them from Rome to Barcelona, so the two spies stage an emergency hiding behind a structure beam: Spy: (over megaphone) There will be a slight delay in departure and arrival of all-a de trains. Somebody-a steal de tracks. \n\nPaul: Isn't that awful? \n\nSpy: (over megaphone) It's-a not-a too good!\n• From the Final Space episode \"The Lost Spy,\" as Gary receives a transmission from Little Cato: Little Cato: I'm going as far away as I can, and please...don't come after me. Gary: We're going after him. Little Cato: I knew you'd say that, so I recorded a second message to say: for REAL, do not come after me! Gary: ...We're going after him.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/TheTapeKnewYouWouldSayThat", "media_links": ["/pmwiki/pmwiki.php/Franchise/ScoobyDoo", "/pmwiki/pmwiki.php/WesternAnimation/ScoobyDooMysteryIncorporated", "/pmwiki/pmwiki.php/WesternAnimation/FamilyGuy", "/pmwiki/pmwiki.php/WesternAnimation/Futurama", "/pmwiki/pmwiki.php/WesternAnimation/TheBoondocks", "/pmwiki/pmwiki.php/WesternAnimation/LiloAndStitchTheSeries", "/pmwiki/pmwiki.php/WesternAnimation/BatmanTheAnimatedSeries", "/pmwiki/pmwiki.php/WesternAnimation/LooneyTunes", "/pmwiki/pmwiki.php/WesternAnimation/TheImpatientPatient", "/pmwiki/pmwiki.php/WesternAnimation/ILoveToSinga", "/pmwiki/pmwiki.php/WesternAnimation/CinderellaMeetsFella", "/pmwiki/pmwiki.php/Creator/TexAvery", "/pmwiki/pmwiki.php/WesternAnimation/CountMeOut", "/pmwiki/pmwiki.php/WesternAnimation/GoGoAmigo", "/pmwiki/pmwiki.php/WesternAnimation/Dilbert", "/pmwiki/pmwiki.php/WesternAnimation/Stanley", "/pmwiki/pmwiki.php/WesternAnimation/TheZetaProject", "/pmwiki/pmwiki.php/WesternAnimation/DangerMouse", "/pmwiki/pmwiki.php/WesternAnimation/SpaceGhostCoastToCoast", "/pmwiki/pmwiki.php/WesternAnimation/TheVentureBrothers", "/pmwiki/pmwiki.php/WesternAnimation/Superfriends", "/pmwiki/pmwiki.php/WesternAnimation/RegularShow", "/pmwiki/pmwiki.php/WesternAnimation/MightyMax", "/pmwiki/pmwiki.php/WesternAnimation/DanVs", "/pmwiki/pmwiki.php/WesternAnimation/TheNewAdventuresOfWinnieThePooh", "/pmwiki/pmwiki.php/WesternAnimation/SpongebobSquarepants", "/pmwiki/pmwiki.php/WesternAnimation/AdventureTime", "/pmwiki/pmwiki.php/WesternAnimation/Archer", "/pmwiki/pmwiki.php/WesternAnimation/PhineasAndFerb", "/pmwiki/pmwiki.php/WesternAnimation/Popeye", "/pmwiki/pmwiki.php/WesternAnimation/JimmyTwoShoes", "/pmwiki/pmwiki.php/WesternAnimation/Chowder", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/WesternAnimation/Detentionaire", "/pmwiki/pmwiki.php/WesternAnimation/Birdz", "/pmwiki/pmwiki.php/WesternAnimation/YoohooAndFriends", "/pmwiki/pmwiki.php/WesternAnimation/MyLittlePonyTales", "/pmwiki/pmwiki.php/WesternAnimation/TinyToonAdventures", "/pmwiki/pmwiki.php/WesternAnimation/GravityFalls", "/pmwiki/pmwiki.php/WesternAnimation/LittleAudrey", "/pmwiki/pmwiki.php/WesternAnimation/StevenUniverse", "/pmwiki/pmwiki.php/WesternAnimation/TheBeatles", "/pmwiki/pmwiki.php/WesternAnimation/Motorcity", "/pmwiki/pmwiki.php/WesternAnimation/FinalSpace"], "non_media_links": ["/pmwiki/pmwiki.php/Main/ParrotExposition", "/pmwiki/pmwiki.php/Main/DeathTrap", "/pmwiki/pmwiki.php/Main/ImplausibleDeniability", "/pmwiki/pmwiki.php/Main/CoincidentalBroadcast", "/pmwiki/pmwiki.php/Main/IronicEcho", "/pmwiki/pmwiki.php/Main/ClockKing", "/pmwiki/pmwiki.php/Main/ClockKing", "/pmwiki/pmwiki.php/Main/ClockKing", "/pmwiki/pmwiki.php/Main/ClockKing", "/pmwiki/pmwiki.php/Main/StockPhrases", "/pmwiki/pmwiki.php/Main/RaceAgainstTheClock", "/pmwiki/pmwiki.php/Main/YouHaveNoChanceToSurvive", "/pmwiki/pmwiki.php/Main/GratuitousFrench", "/pmwiki/pmwiki.php/Main/RunningGag", "/pmwiki/pmwiki.php/Main/TheSmartGuy", "/pmwiki/pmwiki.php/Main/Conscription", "/pmwiki/pmwiki.php/Main/MakesJustAsMuchSenseInContext", "/pmwiki/pmwiki.php/Main/TheMessiah", "/pmwiki/pmwiki.php/Main/Lampshades", "/pmwiki/pmwiki.php/Main/GratuitousSpanish", "/pmwiki/pmwiki.php/Main/GreatBigBookOfEverything", "/pmwiki/pmwiki.php/Main/MonsterOfTheWeek", "/pmwiki/pmwiki.php/Main/Seers"]}