{"title": "Ode to Food", "content": "\"Cookie, cookie, cookie. Me love all kinds of cookies. Me ate up five whole cookies, then six, seven, eight, nine, ten. Cookie, cookie, cookie. Hey, everybody, looky! Me ate up all the cookies, now me want to eat again.\"\n\nWe all like at least some foods. We like to taste them, smell them, and to a lesser extent, look at them. But some characters like their food so much, they sing about it, and that's this trope.\n\nThis is generally to show that the person really loves that particular food (maybe it's even their Trademark Favorite Food) or food in general, sometimes to the point of obsession. They may also be a Large Ham, but that's not a necessity. It could also be because they're really hungry for whatever reason. If the singer is singing while cooking (which can overlap with Job Song if they're a professional chef, waiter, waitress, food seller, etc), it could be a song about the joys of cooking.\n\nOften Played for Laughs because Food Songs Are Funny, but when Played for Drama, it might be sung by a villain who wants to eat the protagonist or similar.\n• The song \"Candy\" by Judy Pancoast is about how many children love candy a lot and wish they could have it all the time.\n• Jambalaya (On The Bayou) is about the singer heading down to his girlfriend Yvonne for dinner filled with the titular dish, plus crawfish pie and file gumbo on the bayou.\n• Songdrops:\n• The song \"Bananas\" consists of only the word \"bananas\" over and over.\n• \"Tacos\" consists of only the title said once.\n• \"Spider Suite\" by The Duke of Uke and his Novelty Orchestra has undertones of drug addiction or similar afflictions, but on the surface, the lyrics use the imagery of a spider about to eat a fly. What wicked little twist of fate placed you here upon my plate? Here where no one hears your cries?\n• The blues song \"They're Red Hot\" by Robert Johnson is either about a hot tamales salesgirl or a prostitute.\n• The Visayan song \"Turagsoy\" is about a man who catches a fish from a river, cooking it into a spicy stew, eating it with his friends and savoring the spiciness of it.\n• \"Weird Al\" Yankovic has done enough of these to fill an album:\n• \"I Love Rocky Road\" (parody of \"I Love Rock 'n' Roll\") about the ice cream flavor.\n• \"My Bologna\" (parody of \"My Sharona\") about the meat.\n• \"Addicted to Spuds\" (parody of \"Addicted to Love\") about potatoes.\n• \"Spam\" (parody of \"Stand\") about the brand of meat.\n• \"The White Stuff\" (parody of \"You Got It (The Right Stuff)\") about Oreos.\n• \"Great Green Gobs of Greasy Grimy Gopher Guts\" is a song presenting a gross-out version of this trope.\n• Parry Gripp has plenty, with most being Exactly What It Says on the Tin:\n• \"This Is The Best Burrito I've Ever Eaten\" is, well, about how awesome the burrito is.\n• \"Yum Yum Breakfast Burrito\" is another song about the joys of burritos.\n• \"I Love Bread\", is about how the singer loves bread.\n• \"Spiral Cut Hot Dogs\" praises spiral-cut hot dogs, and goes so far as to teach the audience how to make them.\n• \"I Like Vegetables\", a rap about how good vegetables are.\n• \"Pound Cake\" claims the cake will \"pound you in the face with flavor\".\n• \"All The Nachos You Can Eat\", about, well, \"All the nachos you can eat\" and how awesome they are.\n• \"Chicken Nugget Dreamland\" discusses the eponymous dreamland, where there's \"infinite flavors of infinite sauce\" and where one can \"get a million-piece box\".\n• \"Do You Like Waffles?\", in which the singer proclaims their love for waffles, pancakes, and french-toast.\n• Tsukiuta - You's special single, \"Hee! Hee! Foo! Foo!\", is about his favorite food, curry. The B-side, \"Layla, you become splendor\" uses melting into curry as a metaphor for love (the word used for \"splendor\" is pronounced like \"curry\"). \"Layla\" might also be a hidden reference to You's partner, Yoru - \"Layla\" means \"night\", the same as \"Yoru\".\n• Done pretty often in the opera by Engelbert Humperdinck based on Hansel and Gretel, considering the protagonists are poor and almost constantly hungry. Special mention goes to Hansel and Gretel's long and lyrical praise of the gingerbread house (What odor delicious! O say, do I dream?).\n• Into the Woods: \"Hello Little Girl\" is a song sung by the Wolf to Little Red Riding Hood. In it, he tries to manipulate her into going off her path and getting distracted before safely and efficiently reaching her grandmother's house. At the same time, he makes comments to himself about how excited he is to eat both of them. Then something fresh on the palate Think of that scrumptious carnality To describe what you feel When you're talking to your meal\n• The song \"Food, Glorious Food\" in Oliver!. The boys in the workhouse sing it to complain about the gruel they're being fed while fantasizing about the food they'd like to be eating instead. It praises delectable dishes like hot sausage and mustard, cold jelly and custard, pease pudding and a great big steak.\n• The very catchy song \"Sugar\" from tick, tick... BOOM! is preceded by lines that make it sound like protagonist Jon is picking up a prostitute, and opens on some rather suggestive and deliberately vague lines. Halfway through the song it's revealed that he's in a convenience store buying Twinkies, and singing about how he loves to eat sugary foods. Jon [singing]: She can be white, she can be brown She's always easy, Goin' down, goin' down She don't care, what I look like, Or how I dress She never says, \"No\", Always says, \"Yes\"\n• You're a Good Man, Charlie Brown: After having a dramatic monologue over the lack of dinner, Snoopy jumps into an entire theatrical song, \"Suppertime\", once Charlie Brown gives him his food.\n• \"A Little Priest\" from Sweeney Todd puts a rather nasty twist on the whole idea.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/OdeToFood", "media_links": ["/pmwiki/pmwiki.php/Series/SesameStreet", "/pmwiki/pmwiki.php/Manga/JoJosBizarreAdventure", "/pmwiki/pmwiki.php/Manga/JoJosBizarreAdventureSteelBallRun", "/pmwiki/pmwiki.php/Manga/JoJosBizarreAdventureJoJolion", "/pmwiki/pmwiki.php/Anime/OnePiece", "/pmwiki/pmwiki.php/WesternAnimation/AsterixAndCleopatra", "/pmwiki/pmwiki.php/Literature/TheButterBattleBook", "/pmwiki/pmwiki.php/WesternAnimation/IceAge2TheMeltdown", "/pmwiki/pmwiki.php/Literature/JamesAndTheGiantPeach", "/pmwiki/pmwiki.php/WesternAnimation/TheJungleBook", "/pmwiki/pmwiki.php/WesternAnimation/TheLandBeforeTime", "/pmwiki/pmwiki.php/Disney/TheLittleMermaid", "/pmwiki/pmwiki.php/Disney/WinnieThePooh", "/pmwiki/pmwiki.php/Film/Hop", "/pmwiki/pmwiki.php/Literature/AlicesAdventuresInWonderland", "/pmwiki/pmwiki.php/Literature/Frances", "/pmwiki/pmwiki.php/Literature/WombatStew", "/pmwiki/pmwiki.php/Series/BabylonFive", "/pmwiki/pmwiki.php/Series/LazyTown", "/pmwiki/pmwiki.php/Series/MontyPythonsFlyingCircus", "/pmwiki/pmwiki.php/Series/RedDwarf", "/pmwiki/pmwiki.php/Series/SesameStreet", "/pmwiki/pmwiki.php/Music/JudyPancoast", "/pmwiki/pmwiki.php/Music/Songdrops", "/pmwiki/pmwiki.php/Music/WeirdAlYankovic", "/pmwiki/pmwiki.php/Music/ParryGripp", "/pmwiki/pmwiki.php/Music/Tsukiuta", "/pmwiki/pmwiki.php/Literature/HanselAndGretel", "/pmwiki/pmwiki.php/Theatre/IntoTheWoods", "/pmwiki/pmwiki.php/Theatre/Oliver", "/pmwiki/pmwiki.php/Theatre/TickTickBoom", "/pmwiki/pmwiki.php/Theatre/YoureAGoodManCharlieBrown", "/pmwiki/pmwiki.php/Theatre/SweeneyTodd", "/pmwiki/pmwiki.php/VideoGame/MoshiMonsters", "/pmwiki/pmwiki.php/Music/RoomieOfficial", "/pmwiki/pmwiki.php/WesternAnimation/Animaniacs", "/pmwiki/pmwiki.php/WesternAnimation/Arthur", "/pmwiki/pmwiki.php/WesternAnimation/FamilyGuy", "/pmwiki/pmwiki.php/WesternAnimation/TheGrimAdventuresOfBillyAndMandy", "/pmwiki/pmwiki.php/WesternAnimation/KiddVideo", "/pmwiki/pmwiki.php/WesternAnimation/MyLittlePonyFriendshipIsMagic", "/pmwiki/pmwiki.php/WesternAnimation/PhineasAndFerb", "/pmwiki/pmwiki.php/WesternAnimation/PinkyAndTheBrain", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/Theatre/WestSideStory", "/pmwiki/pmwiki.php/Animation/Smeshariki", "/pmwiki/pmwiki.php/WesternAnimation/SpongebobSquarepants", "/pmwiki/pmwiki.php/WesternAnimation/StarVsTheForcesOfEvil", "/pmwiki/pmwiki.php/WesternAnimation/TeenTitansGo"], "non_media_links": ["/pmwiki/pmwiki.php/Main/TrademarkFavoriteFood", "/pmwiki/pmwiki.php/Main/BigEater", "/pmwiki/pmwiki.php/Main/ObsessedWithFood", "/pmwiki/pmwiki.php/Main/LargeHam", "/pmwiki/pmwiki.php/Main/JobSong", "/pmwiki/pmwiki.php/Main/PlayedForLaughs", "/pmwiki/pmwiki.php/Main/FoodSongsAreFunny", "/pmwiki/pmwiki.php/Main/PlayedForDrama", "/pmwiki/pmwiki.php/Main/VillainSong", "/pmwiki/pmwiki.php/ComicStrip/Popeye", "/pmwiki/pmwiki.php/Main/AnimatedAdaptation", "/pmwiki/pmwiki.php/Main/BlackComedy", "/pmwiki/pmwiki.php/Main/RunningGag", "/pmwiki/pmwiki.php/Main/DisneyAcidSequence", "/pmwiki/pmwiki.php/Main/LevelAte", "/pmwiki/pmwiki.php/Main/EasterBunny", "/pmwiki/pmwiki.php/Main/RadishCure", "/pmwiki/pmwiki.php/Main/DarkReprise", "/pmwiki/pmwiki.php/Main/IDoNotLikeGreenEggsAndHam", "/pmwiki/pmwiki.php/UsefulNotes/Philippines", "/pmwiki/pmwiki.php/Main/ExactlyWhatItSaysOnTheTin", "/pmwiki/pmwiki.php/Main/IntercourseWithYou", "/pmwiki/pmwiki.php/Main/ImAHumanitarian", "/pmwiki/pmwiki.php/Main/AmbiguousGender", "https://www.youtube.com/watch?v=Wr-z--VV6P0", "/pmwiki/pmwiki.php/Main/Mondegreen", "https://www.youtube.com/watch?v=VioIUfiBl3s", "/pmwiki/pmwiki.php/WebAnimation/Eddsworld", "/pmwiki/pmwiki.php/WebAnimation/HomestarRunner", "/pmwiki/pmwiki.php/WebAnimation/StrongBadEmail", "/pmwiki/pmwiki.php/Recap/StrongBadEmailE98StupidStuff", "/pmwiki/pmwiki.php/Main/Disneyesque", "/pmwiki/pmwiki.php/Main/AnthropomorphicFood", "/pmwiki/pmwiki.php/Main/NoodleIncident", "/pmwiki/pmwiki.php/Main/IDoNotLikeGreenEggsAndHam", "https://en.wikipedia.org/wiki/Burns_supper"]}