{"title": "Video-Game Lives", "content": "Video Game Lives are basically how many tries a player has before a Game Over. They aren't as common these days, but were prevalent in the days of Nintendo Hard games, and are Older Than the NES.\n• Taking enough damage (if the player has a Life Meter).\n• Taking any damage (if the player is a One-Hit-Point Wonder).\n• Failing a critical objective, such as a time limit or score requirement.\n\nThis is based on carnival games, where you you got a certain number of tries before you had to pay to play again. This was then carried over to Pinball games, and continued in arcade games. When games were released on home consoles, the need for lives was largely removed (with the exception of games where the goal is to get the highest score and not to beat the game), but they were initially kept in as The Artifact and the punishment for running out of lives was changed from entering a new coin to starting the game over. Eventually a continue system also became more widespread so players didn't have to start from the beginning of the game when their lives ran out.\n\nIn time, the importance of lives diminished, which could first be seen clearly in PC first-person shooters, which started to utilize a save and load system. In the 2000s, many flash games removed the lives system altogether so they could increase the difficulty in their games without being as frustrating. In the late 2000s, this spread to commercially released games too. Despite this, many modern games still use the lives system.\n\nWhen playing a game with high-stakes lives for the first time, a question looms as the player's lives start to dwindle: is the game displaying the spare lives the player has, or is their current life in the same pool? Finding that there is a \"life zero\" for the first time can be quite a relief.\n\nSometimes, a Plotline Death can lead to Gameplay and Story Segregation if it isn't explained why the extra lives didn't kick in at that point.\n\ncheat codes and cheat devices are often a way to gain more lives (from several to infinite).\n\nModern video games generally do not have lives counters. They instead use a \"one-and-done\" health bar system (that can sometimes be increased), with infinite retries (it's the way that aspect is done that varies among games). Sometimes the lives counter is replaced with a deaths counter, to show how many tries it took to beat the game.\n• Justified Extra Lives: where they explain in the story why you have more than one chance\n• Meaningless Lives: when the lives are almost inconsequential to completion\n\nNot to be confused with Video Games Live, concerts in which classical musicians play video game music as directed by Tommy Tallarico.\n\nSince this is a widespread trope, examples need to be explained in detail.\n• In The Adventures of Lomax, you have a limited amount of lives. Should you run out of them, you have 3 continues available that will bring you to the beginning of a level with 3 additional lives.\n• Aladdin (Virgin Games) and The Lion King treated extra lives differently from continues (known as \"wishes\" in the former game).\n• Aliens: Infestation plays with this by giving each Marine have their own face, name, and dialogue. Anyone Can Die, but you can rescue Marines knocked unconcious by aliens be finding the hives where they were taken. (The first time, that is. The second time they're mortally wounded...well...) As well, you'll often come across other Marines in hidden locations that you can recruit into your fireteam (though they'll only accept if you're down a man or two.)\n• Alien vs. Predator on the Jaguar played with this in the Alien scenario. As an Alien you have the chance to stun an enemy and place an egg inside them. If you do this and are later killed, the egg will hatch and the player will control the offspring. You are even limited to the standard number of lives: only three eggs can be implanted at any time.\n• Armed Police Batrider: You decide on a team of 3 different characters, each character representing one life. When your current character is destroyed, you take control of the next character.\n• Astro Blaster gives you three or five starting ships, but run out of fuel or crash into the mothership during the docking sequence and it's instant game over.\n• Battle City and its sequels start you with 3 lives, but you'll get instant game over if the enemies manage to destroy the base.\n• In Bloodstained: Curse of the Moon, you start with one playable character but can recruit more over the course of the game. If you die with more than one character in your party, rather than losing a life you instead lose access to that character. You don't lose a life until you lose your last character, at which point everyone comes back. You can earn 1-ups at various points.\n• Bug: The number of lives that Bug starts out per continue is 3. He can get extra lives by getting enough medal collectibles in the bonus levels (10 collected = 1 life), and a One Ups are generally found in hard to reach areas. Bug needs all of them. Getting 100 crystals (the regular collectible) didn't give an extra life, however, it could allow him to enter an end-of-level bonus level for the chance to get an extra continue.\n• Carrie's Order Up! uses a \"miss\" system similar to Game & Watch; it's three strikes and you're out, but you can erase a miss by collecting enough coins. You can't, however, earn more lives than the cap of three.\n• Columns III had an odd version, especially since it's a Puzzle Game. You could collect Mystic Hourglasses which turn back time when shattered, allowing you to challenge the enemy you were fighting again.\n• Conker's Bad Fur Day actually goes out of its way to give a full explanation on how the protagonist, Conker, manages to get away with dying only to come back to life. The in game explanation (obviously used to parody this trope) is shown in the form of a cutscene that plays the first time you die, and explains that \"Greg the Grim Reaper\", who controls death, must give squirrels multiple chances at their lives. They even give an explanation for 1-UPS, stating that they act as \"tokens\" that Greg trades for extra chances.\n• Contra on the NES give you 3 lives, unless you enter the Konami Code and gain 30.\n• Crash Bandicoot uses them. Most games in the series tend to hand them out at hilariously generous rates, however, so you might as well have an infinite amount. But as the manual for one game says, \"we give you all those lives for a reason\".\n• Dance Dance Revolution: The Challenge/Oni mode is a rare Rhythm Game example: you start with four lives, and every time you get a Good, Boo, Almost in US versions Miss, or NG, you lose one life, and losing all of your lives will, of course, trigger a Game Over. (And unlike other modes, in which you can keep playing if the other player is still alive, the game stops completely on your side if you die, showing \"Game Over\" on your side of the screen.) If you're lucky, the song you're on may give you a life back once completed. The Extra Stage system in Dance Dance Revolution SuperNOVA onwards, also uses lives, and One More Extra Stages give you a mere one life.\n• Dariusburst Another Chronicle gives you three lives per credit by default. Additional players can join on the same credit, but they will take away from that stock, so a team hoping to complete the game on one credit needs to be careful; more players means each player has less chances to screw up. Alternatively, players can pay a surcharge to play Infinite mode, which grants all four players infinite lives, but invalidates all scores.\n• Dino Crisis has Resuscitation Packs that revive you and send you into the previous room if you die, which may as be your number of lives. The sequel uses them as well.\n• DTET has lives, unusually for a Falling Blocks Tetris clone.. In most modes, you start with multiple lives, and every time you top out you will, instead of getting a Game Over, use up a life and the playing field will be emptied out.\n• The video game adaptations of Dragon: The Bruce Lee Story is a rare example of a fighting game using lives. In the single player campaign, the player is given three lives, losing one whenever they lose a round. If the player runs out of lives, they are forced to face off against \"The Phantom\". Losing against the Phantom ends the game, while defeating him allows you to continue the game (but good luck pulling that off!).\n• The End Is Nigh features lives in the cartridge levels, where you either have none at all, nine, or an infinite amount. The main levels, on the other hand, provide infinite lives. .. until you reach the Future levels, where every tumor you collected in the Past levels counts as a life.\n• Every Extend makes a single life trivial: you start with a large stock of lives (usually 12), and your only attack consists of you exploding your current life to destroy other enemies. Because of this, the games offer generous amounts of eextends.\n• Fable I has \"Resurrection Phials\" as in-game items, which are automatically expended to restore part of the Hero's life if he dies; he can carry up to nine at a time. Thanks to Gameplay and Story Segregation, they can be bought from and sold to any number of merchants, yet nobody else ever seems to use them.\n• Friday the 13th: Each character has but one life. Lose one, you switch to another character. Lose them all, and you get to see the infamous \"You and your friends are dead\" Game Over screen.\n• Futurama: The video game adaptation actually explains the presence of lives; the Professor builds a \"reanimator\" that resurrects you when you die.\n• Galaga plays with the underlying concept of lives. Each life represents a ship in your fleet. If your ship is captured by a Tractor Beam, the enemy takes control of your ship and you move on to your next ship (life). If you destroy the controlling enemy, you can retrieve the ship and regain it. But instead of increasing your lives by one, it instead lets you control both of them at the same time, doubling your firepower. Be careful with tractor beams on your last life however, as a capture on that last life results in a Non-Standard Game Over.\n• GoldenEye (1997): The \"You Only Live Twice\" multiplayer mode is Exactly What It Says on the Tin: you get two lives. Lose them both and you're out.\n• Gradius III uses lives in the normal manner, but they can be prematurely consumed to increase one's firepower. The weapon selector lets the player equip a special item. When they use it, they lose four lives, but receive four Attack Drones in return.\n• Grand Theft Auto (Classic) and Grand Theft Auto 2 used lives, the total expiration of which led to a Game Over. These would be the only games in the series to use lives: starting with Grand Theft Auto III, players would simply respawn after dying while free-roaming, or start back at a checkpoint during missions.\n• In the online multiplayer of Grand Theft Auto V, players share a pool of lives during jobs. When one player dies, the party's \"Team Lives\" are depleted: if someone dies when there are no more Team Lives, the job will fail and the party will need to start over at the last checkpoint.\n• Illusion of Gaia explained the presence of revival after death - the main character is psychic, and the former run is presumed to be a dream giving him a glimpse into the future.\n• Impossible Mission: Getting killed knocks off a certain amount of time. If you run out, the world goes kaboom. Game Over.\n• Island Wars 2's Invasion Mode uses palm trees as your lives. While your cannons are invincible and cannot be damaged, the enemies will try to attack the palm trees on the island your cannons are on, and it's Game Over if you lose all of them. And on the hardest difficulty, you only have one palm tree.\n• I Wanna Be the Guy averts this in one of its few merciful concessions. It's nightmarish with infinite lives, imagine it with limited lives.\n• The Last Story is an unusual example of an RPG using lives. Party members start each battle with five lives, when their HP hits zero, they lose a life and stay down for a few moments before getting back up with full HP. If a character loses all five lives, they're out for the duration of the encounter (or in the case of the protagonist, Game Over). This seems shockingly generous until you realize characters are rather fragile in this game and a single tactical cock-up will see your entire party losing a life each in short order.\n• Makai Toshi Saga (The Final Fantasy Legend, in North America) is another rare example of an RPG using lives. Each party member has three hearts. If they run out of HP, they can be revived at a House of Life, but doing so requires a heart in addition to a fee. If a party member has no hearts when they die, they cannot be revived (unless you purchase another heart for them, which are prohibitively expensive) and will have to be \"retired\" at a guild outpost to make room for a new party member.\n• Mighty No. 9 gives you 3 by default, however you can increase this number to 9 for Normal mode in the options menu.\n• Meteos features this as well, though you have to manually set having more than one Annihaliation.\n• Monster Hunter. Three defeats and you're out. Simple enough in single player, as it amounts to being allowed two depletions of the Life Meter. This gets more complicated in multiplayer hunts, in which the entire party shares those three lives; it is possible for a party to fail the quest even if one or more players doesn't faint at all, as well as for a quest to fail because one person took all three defeats.\n• Paper Mario: The Thousand-Year Door:\n• In a few sections, Bowser plays through a facsimile of the original Super Mario Bros.. Before each attempt, a screen like the one above is shown, only replacing Mario with Bowser, and the three with an infinity symbol.\n• While Super Paper Mario doesn't have extra lives, Luigi does mention them at one point.\n• Payday The Heist and its sequel use hostages as an ad-hoc lives system. If a crew member is downed during a police assault and secured before they can be revived, the other players can initiate a hostage exchange between assaults to have the arrested crew member returned to action. This means that the number of lives available for a heist is never fixed, it depends on the number of zip ties the crew has, the number of civilians they can take, and their ability to stop the police rescuing them prematurely.\n• Police 911 gives you one hundred more extra lives above your starting three if you reach the top rank of Comissioner - but since the process of losing a life and restarting takes about 15 seconds of your rarely more than 2 minute timer (the game ends instantly if the timer runs out) this is solely a Bragging Rights Reward. And if you die on your way to Commissioner rank, you lose every promotion and have to start over.\n• In Purple, running out of lives will force you to either continuing without your Scoring Points or losing progress and getting your score on a highscore table.\n• RayStorm (part of the RAY Series) makes this a Justified Trope: your extra lives come in the form of the other R-Gray craft in your squadron. When one is destroyed, the next one takes its place.\n• Rock Band is another rare rhythm example; if you fail in a band, someone else can bring you back, but if you fail three times, you're done for good (and so is your band unless the song is ending).\n• Satans Hollow used extra lives in the classic sense, showing them as replacement ships in the corner of the screen. Enemies will try to grab and fly away with them.\n• Scott Pilgrim:\n• The graphic novels and the movie play with it inasmuch as Scott actually manages to pick up an extra life in real life. And use it.\n• Silent Scope used both lives and time in early games - if you get shot, stabbed, orshoot a hostage, you'd lose one of multiple lives (and gain some back by viewing bikini-clad women in the scope), but the game instantly ends when time runs out. Later games meld time and lives into a life-meter which constantly ticks down - get shot and you'll lose time.\n• In Sonic Mania Plus, lives operate the same as in other games of the series in Mania mode. In Encore mode, the rules are changed: instead of having lives, players build up a party of up to five characters (Sonic, Tails, Knuckles, Mighty, and Ray) with two characters active at a time (one controlled by the player, the other by AI or another player). When the controlled character dies, the partner character takes over while the next character in the party becomes the partner character. If there are no more spare characters when the player dies, it's Game Over.\n• Space Invaders, but it's instant Game Over if those aliens reach the bottom.\n• Spyro the Dragon used lives in the first few game, but the later entries after Insomniac left the series, and Insomniac's own Ratchet & Clank, dropped lives in favor of just having you restart at checkpoints when you die.\n• In Star Citizen, a player character can \"die\" a finite but non-specific number of times before being Killed Off for Real. How many \"deaths\" you get before \"permadeath\" depends on how you went down and how quickly your unconscious body got hauled to a medical facility. The closer you get to permadeath, the more scars and/or artificial replacement bits you'll have.\n• Star Fox Adventures has an item called the BaFomDad, which works like an optional extra life: die with at least one in your inventory, and it'll ask you if you want to use one; if you do, you come back to life right where you stood. There's only one to collect in Krystal's part of the game, and it doesn't carry over to Fox's part. Fox himself can only carry one until he gets a BaFomDad Holder, which lets him carry ten. The game has many more, but if you have ten already, you can't pick them up; they stay there until you try with nine or fewer.\n• Strong Bad's Cool Game for Attractive People normally doesn't have lives (because you can't die), but in 8-Bit Is Enough\", the Homestar Runner'' world and video games merge. Strong Bad winds up in the world of the Stinkoman game as one of Stinkoman's extra lives. Since Strong Bad needs to get up into the proper game world, he has to try to engineer Stinkoman's death.\n• Super Meat Boy gives this a Lampshade Hanging, where the Hell level is littered with the many, many Meat Boys that have perished brutally in your control.\n• Super Smash Bros. has stock rules which give players a limited number of lives, the depletion of which eliminates a player from the match. Brawl also has a unique take on this in its single-player campaign \"Subspace Emissary\": in most stages, players form a party using the characters they unlock. When one character dies, the next character in the party takes their place, and so on until the last character dies. There is also a unique item in \"Subspace Emissary\" that replenishes lives, so that if the last character in the player's party dies, the first character returns. In Team Battles, if a player loses all their lives, they can \"share\" one from their teammate to continue.\n• Super Time Force starts players with thirty lives. When their current character dies, players can rewind time and deploy another character. If, with this new character, plans can prevent the death of previous characters, they can collect that character and gain their abilities.\n• Another Platform Hell game, Syobon Action, has a lives counter that starts at three ala Super Mario Bros., but instead of giving the player a Game Over when it hits zero, it just keeps dropping into negative numbers.\n• A variation of this mechanic occurs in the original Teenage Mutant Ninja Turtles game on NES. In that game, you have the four different ninja turtles; rather than providing an arbitrary number of lives, a turtle will be captured when his health bar is exhausted, and the player has to face an additional challenge to rescue him.\n• Total Overdose had up to 9 'Rewinds', which would back the action up to 5 seconds before death, giving the player opportunity to other choices, if possible. Running out of Rewinds resulted in Final Death, but one could always use a Rewind to exit the mission and return to Sandbox mode, cutting their losses.\n• Typhoon Thompson had two sets of lives - the first is the number of hovercrafts you have which last for the entire game, and the second is the character's lives which get added at the start of each level. Enemies can either destroy the hovercraft or the character, but the seventh enemy can destroy both at once.\n• V2000: The player character is a drone pilot (supposedly) working alongside many others, and lives are the interdimensional exploration ships they fly. Since there's no danger to pilots but a shortage of crazy world-hopping UAVs, extra lives represent being trusted with more resources. This falls apart the moment the player gets an extra life by finding trophies, but it was a good try.\n• In Warframe, you begin each mission with 4 revives you can use (together with bonus Experience Points penalty) when you run out of Hit Points and your allies fail to revive you. Use them all up and you're reduced to spectating your surviving allies or suffering mission failure if you're alone.\n• Warning Forever gives you a choice between different kinds of lives. You can either have standard lives, or a timer which loses large chunks of time if you get killed.\n• Yoshi's Story has a special variation. Instead of lives, the player has 8 different Yoshis to play as (which differ in color and favorite fruit). There are two ways of increasing the count: finding two secret Yoshis and finding white Shy Guys, which can rescue a lost Yoshi.\n• You Only Live Once, being a Deconstruction Game, parodies it rather savagely. As the name suggests, it's a platform game where you only have one life. If you try to \"continue\" when the nerdy protagonist dies, the game just shows his kidnapped girlfriend calling an ambulance, then the paramedics declaring him a lost cause, his death getting reported on the evening news, the Big Bad being arrested for manslaughter because of the death-trap-laden castle (or a random Mook arrested for murder), and finally a memorial built on the stage where he died. And on top of all that, you can never play the game again, unless you find and delete the appropriate file.\n• Zelda II: The Adventure of Link is the only game in its series to use lives. (Though in a way, bottled fairies in later games could be considered extra lives, since in most games you will automatically use up a bottled fairy when you die.)\n• Futurama: One of the show's \"Anthology of Interest\" episodes featured them in a world that was more like video games. During an invasion, Fry gets killed but comes right back because he still had an extra life. Unfortunately, General Pac-Man was not so lucky .\n• Knightmare:\n• After explaining how the life force meter works, Treguard would give the team a warning along the lines of \"this is no game for a player with numerous lives, and when this one is done, your adventure is over.\"\n• The French and Spanish versions had no life force meter, but had a 4-player team that could play as long as there were one knight and one advisor left (which means three lives).\n• Drawn Together has Xandir, who has the usual \"extra lives\" being a videogame character. Though this depends on Rule of Funny because there have been episodes where he has been Killed Off for Real (and then They Killed Kenny Again him back to life, just like the rest of the cast).\n• In one episodes, Xandir is driven to suicide because he does not accept his homosexual orientation. He stabs himself fatally, disappears, respawns, kills himself again, and so on for hours.\n• Kamen Rider Ex-Aid uses this as its Central Theme, comparing humans that only live once to game characters that have endless lives and continues.\n• Our hero Emu Hojo is a doctor by trade and thoroughly commits himself to saving every life he can. Even the villains', if need be.\n• Kuroto Dan, one of the Big Bads, repeatedly cheats death using game powers throughout the series. Early on, he uses a Survival Horror zombie game to give himself undead powers so that Death Is a Slap on the Wrist. Later on, he's lost this but is able to give himself 99 \"continues\", which lets him \"respawn\" shortly after his body is destroyed; the first time it happens it's Played for Laughs , since it looks like he's Killed Off for Real again only for a Super Mario Bros. -style warp pipe to pop out of the ground and him to return. It actually serves an important plot purpose late in the series: Kiriya Kujo creates a vaccine for the Gemdeus virus by repeatedly infecting Kuroto with it until he develops an immunity; it takes all but four of Kuroto's lives, but the vaccine becomes the 11th-Hour Superpower that helps save the day and defeat the Big Bad\n• Another Big Bad, Parado, is one of the respawning game characters and thinks nothing of killing humans because while he knows they only have one life, he really doesn't get what death is like. When faced with the possibility of Final Death himself, he's terrified. Emu eventually gives him a Near-Death Experience that helps him understand the value of life and prompts a Heel\u0096Face Turn.\n• In Jumanji: Welcome to the Jungle, the characters who get sucked into the video game get three lives each that are marked on their left wrists. Every time they die, they respawn and one of the marks on their wrist disappears.\n• Naturally occurs in the Cool Kids Table game Here We Gooooo! Dying repeatedly will lose you whatever power-up is active, and once you're out you start losing coins.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/VideogameLives", "media_links": ["/pmwiki/pmwiki.php/VideoGame/SuperMarioBros1", "/pmwiki/pmwiki.php/VideoGame/TheAdventuresOfLomax", "/pmwiki/pmwiki.php/VideoGame/AladdinVirginGames", "/pmwiki/pmwiki.php/VideoGame/TheLionKing", "/pmwiki/pmwiki.php/VideoGame/AliensInfestation", "/pmwiki/pmwiki.php/VideoGame/ArmedPoliceBatrider", "/pmwiki/pmwiki.php/VideoGame/AstroBlaster", "/pmwiki/pmwiki.php/VideoGame/BattleCity", "/pmwiki/pmwiki.php/VideoGame/BloodstainedCurseOfTheMoon", "/pmwiki/pmwiki.php/VideoGame/Bug", "/pmwiki/pmwiki.php/VideoGame/CarriesOrderUp", "/pmwiki/pmwiki.php/VideoGame/Columns", "/pmwiki/pmwiki.php/VideoGame/ConkersBadFurDay", "/pmwiki/pmwiki.php/VideoGame/Contra", "/pmwiki/pmwiki.php/VideoGame/CrashBandicoot", "/pmwiki/pmwiki.php/VideoGame/DanceDanceRevolution", "/pmwiki/pmwiki.php/VideoGame/Darius", "/pmwiki/pmwiki.php/VideoGame/DinoCrisis", "/pmwiki/pmwiki.php/VideoGame/DTET", "/pmwiki/pmwiki.php/VideoGame/Tetris", "/pmwiki/pmwiki.php/Film/DragonTheBruceLeeStory", "/pmwiki/pmwiki.php/VideoGame/TheEndIsNigh", "/pmwiki/pmwiki.php/VideoGame/EveryExtend", "/pmwiki/pmwiki.php/VideoGame/FableI", "/pmwiki/pmwiki.php/VideoGame/FridayThe13th", "/pmwiki/pmwiki.php/VideoGame/Futurama", "/pmwiki/pmwiki.php/VideoGame/Galaga", "/pmwiki/pmwiki.php/VideoGame/GoldenEye1997", "/pmwiki/pmwiki.php/VideoGame/Gradius", "/pmwiki/pmwiki.php/VideoGame/GrandTheftAutoClassic", "/pmwiki/pmwiki.php/VideoGame/GrandTheftAuto2", "/pmwiki/pmwiki.php/VideoGame/GrandTheftAutoIII", "/pmwiki/pmwiki.php/VideoGame/GrandTheftAutoV", "/pmwiki/pmwiki.php/VideoGame/IllusionOfGaia", "/pmwiki/pmwiki.php/VideoGame/ImpossibleMission", "/pmwiki/pmwiki.php/VideoGame/IslandWars", "/pmwiki/pmwiki.php/VideoGame/IWannaBeTheGuy", "/pmwiki/pmwiki.php/VideoGame/TheLastStory", "/pmwiki/pmwiki.php/VideoGame/MakaiToshiSaga", "/pmwiki/pmwiki.php/VideoGame/FinalFantasy", "/pmwiki/pmwiki.php/VideoGame/MightyNo9", "/pmwiki/pmwiki.php/VideoGame/Meteos", "/pmwiki/pmwiki.php/VideoGame/MonsterHunter", "/pmwiki/pmwiki.php/VideoGame/PaperMarioTheThousandYearDoor", "/pmwiki/pmwiki.php/VideoGame/SuperMarioBros", "/pmwiki/pmwiki.php/VideoGame/SuperPaperMario", "/pmwiki/pmwiki.php/VideoGame/PaydayTheHeist", "/pmwiki/pmwiki.php/VideoGame/Payday2", "/pmwiki/pmwiki.php/VideoGame/Police911", "/pmwiki/pmwiki.php/VideoGame/Purple", "/pmwiki/pmwiki.php/VideoGame/RaySeries", "/pmwiki/pmwiki.php/VideoGame/RockBand", "/pmwiki/pmwiki.php/VideoGame/SatansHollow", "/pmwiki/pmwiki.php/VideoGame/ScottPilgrim", "/pmwiki/pmwiki.php/ComicBook/ScottPilgrim", "/pmwiki/pmwiki.php/Film/ScottPilgrimVsTheWorld", "/pmwiki/pmwiki.php/VideoGame/SilentScope", "/pmwiki/pmwiki.php/VideoGame/SonicMania", "/pmwiki/pmwiki.php/VideoGame/SpaceInvaders", "/pmwiki/pmwiki.php/VideoGame/SpyroTheDragon", "/pmwiki/pmwiki.php/VideoGame/RatchetAndClank", "/pmwiki/pmwiki.php/VideoGame/StarCitizen", "/pmwiki/pmwiki.php/VideoGame/StarFoxAdventures", "/pmwiki/pmwiki.php/VideoGame/StrongBadsCoolGameForAttractivePeople", "/pmwiki/pmwiki.php/VideoGame/MeatBoy", "/pmwiki/pmwiki.php/VideoGame/SuperSmashBros", "/pmwiki/pmwiki.php/VideoGame/SuperSmashBrosBrawl", "/pmwiki/pmwiki.php/VideoGame/SuperTimeForce", "/pmwiki/pmwiki.php/VideoGame/SyobonAction", "/pmwiki/pmwiki.php/VideoGame/SuperMarioBros", "/pmwiki/pmwiki.php/VideoGame/TeenageMutantNinjaTurtles", "/pmwiki/pmwiki.php/VideoGame/TotalOverdose", "/pmwiki/pmwiki.php/VideoGame/TyphoonThompson", "/pmwiki/pmwiki.php/VideoGame/V2000", "/pmwiki/pmwiki.php/VideoGame/Warframe", "/pmwiki/pmwiki.php/VideoGame/WarningForever", "/pmwiki/pmwiki.php/VideoGame/YoshisStory", "/pmwiki/pmwiki.php/VideoGame/YouOnlyLiveOnce", "/pmwiki/pmwiki.php/VideoGame/ZeldaIITheAdventureOfLink", "/pmwiki/pmwiki.php/WesternAnimation/Futurama", "/pmwiki/pmwiki.php/Series/Knightmare", "/pmwiki/pmwiki.php/WesternAnimation/DrawnTogether", "/pmwiki/pmwiki.php/Series/KamenRiderExAid", "/pmwiki/pmwiki.php/Franchise/SuperMarioBros", "/pmwiki/pmwiki.php/Film/JumanjiWelcomeToTheJungle"], "non_media_links": ["/pmwiki/pmwiki.php/Main/TryNotToDie", "/pmwiki/pmwiki.php/Main/GameOver", "/pmwiki/pmwiki.php/Main/NintendoHard", "/pmwiki/pmwiki.php/Main/OlderThanTheNES", "/pmwiki/pmwiki.php/Main/LifeMeter", "/pmwiki/pmwiki.php/Main/OneHitPointWonder", "/pmwiki/pmwiki.php/Main/TimedMission", "/pmwiki/pmwiki.php/Main/BottomlessPit", "/pmwiki/pmwiki.php/Main/Pinball", "/pmwiki/pmwiki.php/Main/TheArtifact", "/pmwiki/pmwiki.php/Main/PlotlineDeath", "/pmwiki/pmwiki.php/Main/GameplayAndStorySegregation", "/pmwiki/pmwiki.php/Main/SuperTrope", "/pmwiki/pmwiki.php/Main/OneUp", "/pmwiki/pmwiki.php/Main/InfiniteOneUps", "/pmwiki/pmwiki.php/Main/JustifiedExtraLives", "/pmwiki/pmwiki.php/Main/MeaninglessLives", "/pmwiki/pmwiki.php/Main/AnyoneCanDie", "/pmwiki/pmwiki.php/Main/Squick", "/pmwiki/pmwiki.php/Main/OneUp", "/pmwiki/pmwiki.php/Main/NintendoHard", "/pmwiki/pmwiki.php/Main/LawOf100", "/pmwiki/pmwiki.php/UsefulNotes/GameAndWatch", "/pmwiki/pmwiki.php/Main/LawOf100", "/pmwiki/pmwiki.php/Main/PuzzleGame", "/pmwiki/pmwiki.php/UsefulNotes/NES", "/pmwiki/pmwiki.php/Main/KonamiCode", "/pmwiki/pmwiki.php/Main/NintendoHard", "/pmwiki/pmwiki.php/Main/NintendoHard", "/pmwiki/pmwiki.php/Main/RhythmGame", "/pmwiki/pmwiki.php/Main/GameOver", "/pmwiki/pmwiki.php/Main/OneHitPointWonder", "/pmwiki/pmwiki.php/Main/EasyModeMockery", "/pmwiki/pmwiki.php/Main/FallingBlocks", "/pmwiki/pmwiki.php/Main/GameOver", "/pmwiki/pmwiki.php/Main/SNKBoss", "/pmwiki/pmwiki.php/Main/EveryTenThousandPoints", "/pmwiki/pmwiki.php/Main/TitleDrop", "/pmwiki/pmwiki.php/Main/GameplayAndStorySegregation", "/pmwiki/pmwiki.php/Main/FinalDeath", "/pmwiki/pmwiki.php/Main/HaveANiceDeath", "/pmwiki/pmwiki.php/Main/GameOver", "/pmwiki/pmwiki.php/Main/TractorBeam", "/pmwiki/pmwiki.php/Main/NonStandardGameOver", "/pmwiki/pmwiki.php/Main/ExactlyWhatItSaysOnTheTin", "/pmwiki/pmwiki.php/Main/GameOver", "/pmwiki/pmwiki.php/Main/AttackDrone", "/pmwiki/pmwiki.php/Main/GameOver", "/pmwiki/pmwiki.php/Main/EarthShatteringKaboom", "/pmwiki/pmwiki.php/Main/GameOver", "/pmwiki/pmwiki.php/Main/CooperativeMultiplayer", "/pmwiki/pmwiki.php/Main/GameOver", "/pmwiki/pmwiki.php/Main/OneHitPointWonder", "/pmwiki/pmwiki.php/Main/RPG", "/pmwiki/pmwiki.php/Main/GameOver", "/pmwiki/pmwiki.php/Main/NintendoHard", "/pmwiki/pmwiki.php/Main/FinalDeath", "/pmwiki/pmwiki.php/Main/ContinuingIsPainful", "/pmwiki/pmwiki.php/Main/CallAHitPointASmeerp", "/pmwiki/pmwiki.php/Main/LifeMeter", "/pmwiki/pmwiki.php/Main/BraggingRightsReward", "/pmwiki/pmwiki.php/Main/ScoringPoints", "/pmwiki/pmwiki.php/Main/JustifiedTrope", "/pmwiki/pmwiki.php/Main/DeathsHourglass", "/pmwiki/pmwiki.php/Main/HostageSpiritLink", "/pmwiki/pmwiki.php/Main/MaleGaze", "/pmwiki/pmwiki.php/Main/GameOver", "/pmwiki/pmwiki.php/Main/KilledOffForReal", "/pmwiki/pmwiki.php/WebAnimation/HomestarRunner", "/pmwiki/pmwiki.php/Main/LampshadeHanging", "/pmwiki/pmwiki.php/Main/PlatformHell", "/pmwiki/pmwiki.php/Main/GameOver", "/pmwiki/pmwiki.php/Main/CycleOfHurting", "/pmwiki/pmwiki.php/Main/FinalDeath", "/pmwiki/pmwiki.php/Main/ExperiencePoints", "/pmwiki/pmwiki.php/Main/HitPoints", "/pmwiki/pmwiki.php/Main/TimedMission", "/pmwiki/pmwiki.php/Main/DeconstructionGame", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/Mook", "http://youtu.be/tpeXTgwh7F4", "/pmwiki/pmwiki.php/Main/HitPoints", "/pmwiki/pmwiki.php/Main/GameOver", "/pmwiki/pmwiki.php/Main/OneHitPointWonder", "/pmwiki/pmwiki.php/Main/RuleOfFunny", "/pmwiki/pmwiki.php/Main/KilledOffForReal", "/pmwiki/pmwiki.php/Main/TheyKilledKennyAgain", "/pmwiki/pmwiki.php/Main/CentralTheme", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/SurvivalHorror", "/pmwiki/pmwiki.php/Main/DeathIsASlapOnTheWrist", "/pmwiki/pmwiki.php/Main/PlayedForLaughs", "/pmwiki/pmwiki.php/Main/KilledOffForReal", "/pmwiki/pmwiki.php/Main/EleventhHourSuperpower", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/FinalDeath", "/pmwiki/pmwiki.php/Main/NearDeathExperience", "/pmwiki/pmwiki.php/Main/HeelFaceTurn", "/pmwiki/pmwiki.php/Podcast/CoolKidsTable"]}