{"title": "House Music", "content": "House Music started in Chicago in The '80s (but received little exposure outside Chicago until the late Eighties/Nineties) when DJs started looping the breaks (a part of the song where the beat is the emphasis) of Disco songs over and over, because they found that the crowd reacted to those specific parts the best.\n\nAfter a while early house musicians started recording their own songs where the break was the foundation and used electronic instruments/sequencers to create new melodies based on the rhythm. When drum machines came out it allowed for even more freedom in beat making. Early Chicago house has a definite gospel influence, vocal samples could range from choirs and divas to a preacher-esque person yelling about the tenets of house music . This paved the way for the freeform vocal samples (people yelling, rapping, singing, generally doing whatever as long as it's with the beat) to dominate later house tracks. Other influences were Italo Disco (disco that got progressively more electronic and stayed strong in Europe after its fade in the U.S.A.) and New Wave. As technology improved experimentation within the medium grew. Experimenting with the Roland TB-303 (a synthesizer/sequencer) resulted in acid house, which basically started the rave movement as we know it .\n\nFrom there, many sub-genres of house music have come up, and it is arguably the most famous example of electronic dance music around.\n• Boléro Effect: Common with many songs, with simplistic drum parts turning into lush, deep songs by the end.\n• The sub-genre of Progressive House features the Boléro Effect itself as one of its core features.\n• Common Time: With very few exceptions, House is always in 4/4, with a kick drum that basically goes \"Unce, Unce, Unce, Unce\" and so on..\n• Coolest Club Ever: Pretty much any Post-1980s scene in a nightclub (or rave) is going to be playing House music, as it is the most quintessential form of Electronic Dance Music.\n• Dance Sensation: A lot of early house music tunes referred (in the title or the lyrics) to \"jacking\".\n• Epic Riff: Pretty much any piano house tune from the early rave days.\n• Gratuitous Disco Sequence: Groups like Daft Punk, Full Intention, The Freemasons and Joey Negro have used this trope in mind to revitalize both the house and disco genres in the mid-'90s.\n• Have a Gay Old Time: \"Jackin'\" used to refer to a dance style that emerged from 80's Chicago house parties and not its modern interpretation. Although one has to wonder if artists like Jackmaster Dick (who had a track entitled \"Jack The Dick\") were doing this intentionally and this euphemism is Older Than We Think.\n• Lyrical Tic: House music will often contain certain Catchphrases depending on the time period and city it was made in. 1980's Chicago house uses the term \"jackin\" along, and no that doesn't mean what you might think\n• Non-Appearing Title: Of course the opposite to Title-Only Chorus, also happens frequently. Makes it rough on Trainspotters.\n• Rock Me, Amadeus!: An early example would be Apotheosis O Fortuna\n• Sampling\n• Sampled Up: Much of today's house mixes are based on older obscure disco records. Black Box, Cevin Fisher and Marky Mark and the Funky Bunch popularizing Loleatta Holloway's vocals on Love Sensation are a good example.\n• Stupid Statement Dance Mix: From the early \"Jack had a groove\" sample, to numerous rap samples, to other public domain recordings. House music has gone to town with these.\n• Techno: Has quite a lot of cross over with both this and progressive.\n• Title-Only Chorus: Very often house music will contain minimal lyrics, sometimes only one or two words, which will be the title of the song.\n• C&C Music Factory: Had a hit with \"Gonna Make You Sweat (Everybody Dance Now)\".\n• Deee-Lite: Best known for \"Groove Is In The Heart\".\n• Funky Green Dogs: Had a hit with \"Fired Up\" (1996)\n• Reel 2 Real: Had a hit with \"I Like To Move It\".", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/HouseMusic?from=Main.AcidHouse", "media_links": ["/pmwiki/pmwiki.php/Creator/MarkWahlberg", "/pmwiki/pmwiki.php/Music/DaftPunk", "/pmwiki/pmwiki.php/Music/Homework", "/pmwiki/pmwiki.php/Music/Discovery", "/pmwiki/pmwiki.php/Music/Deadmau5", "/pmwiki/pmwiki.php/Music/FatboySlim", "/pmwiki/pmwiki.php/Music/DavidGuetta", "/pmwiki/pmwiki.php/Music/Kaskade", "/pmwiki/pmwiki.php/Music/KnifeParty", "/pmwiki/pmwiki.php/Music/PrimalScream", "/pmwiki/pmwiki.php/Music/Screamadelica", "/pmwiki/pmwiki.php/Music/StGermain", "/pmwiki/pmwiki.php/Music/Tourist", "/pmwiki/pmwiki.php/Music/Stromae", "/pmwiki/pmwiki.php/Music/SwedishHouseMafia", "/pmwiki/pmwiki.php/Music/Tiesto"], "non_media_links": ["/pmwiki/pmwiki.php/Main/Disco", "/pmwiki/pmwiki.php/Main/ItaloDisco", "/pmwiki/pmwiki.php/Main/SynthPop", "/pmwiki/pmwiki.php/Main/ElectronicMusic", "/pmwiki/pmwiki.php/Main/Soul", "/pmwiki/pmwiki.php/Main/Funk", "/pmwiki/pmwiki.php/Main/NewWaveMusic", "/pmwiki/pmwiki.php/Main/PostPunk", "/pmwiki/pmwiki.php/Main/HipHop", "/pmwiki/pmwiki.php/Main/TheEighties", "/pmwiki/pmwiki.php/Main/Disco", "http://youtu.be/ts8iBs3tpmw?t=1m28s", "/pmwiki/pmwiki.php/Main/ItaloDisco", "/pmwiki/pmwiki.php/Main/NewWaveMusic", "http://en.wikipedia.org/wiki/Second_Summer_of_Love", "/pmwiki/pmwiki.php/Main/BoleroEffect", "/pmwiki/pmwiki.php/Main/BoleroEffect", "/pmwiki/pmwiki.php/Main/CommonTime", "/pmwiki/pmwiki.php/Main/CoolestClubEver", "/pmwiki/pmwiki.php/Main/TheEighties", "/pmwiki/pmwiki.php/Main/DaysOfTheWeekSong", "/pmwiki/pmwiki.php/Main/DanceSensation", "/pmwiki/pmwiki.php/Main/EpicRiff", "/pmwiki/pmwiki.php/Main/GratuitousDiscoSequence", "/pmwiki/pmwiki.php/Main/TheNineties", "/pmwiki/pmwiki.php/Main/HaveAGayOldTime", "/pmwiki/pmwiki.php/Main/ADateWithRosiePalms", "http://www.discogs.com/artist/Jackmaster+Dick", "/pmwiki/pmwiki.php/Main/OlderThanTheyThink", "/pmwiki/pmwiki.php/Main/HeartbeatSoundtrack", "https://www.youtube.com/watch?v=PafMXVV-QKI", "/pmwiki/pmwiki.php/Main/LyricalTic", "/pmwiki/pmwiki.php/Main/CatchPhrase", "/pmwiki/pmwiki.php/Main/TotallyRadical", "/pmwiki/pmwiki.php/Main/ADateWithRosiePalms", "/pmwiki/pmwiki.php/Main/NonAppearingTitle", "/pmwiki/pmwiki.php/Main/TitleOnlyChorus", "/pmwiki/pmwiki.php/Main/RockMeAmadeus", "/pmwiki/pmwiki.php/Main/Sampling", "/pmwiki/pmwiki.php/Main/SampledUp", "/pmwiki/pmwiki.php/Main/StupidStatementDanceMix", "/pmwiki/pmwiki.php/Main/Techno", "/pmwiki/pmwiki.php/Main/TitleOnlyChorus", "/pmwiki/pmwiki.php/Main/TropeMaker", "/pmwiki/pmwiki.php/Main/ElectroHouse", "/pmwiki/pmwiki.php/Main/Dubstep"]}