{"title": "It's Cuban", "content": "In American media, Cuban cigars, which were banned in the United States after Fidel Castro seized Cuba in 1959 (an embargo that was only lifted in 2016), have generally been considered items that cannot be acquired without the right connections and/or money. Therefore for a character to offer or have a Cuban cigar is usually used as shorthand for having one or both. Because of the reasons why Cuban cigars had that status in the first place, there is usually also a sense of nefariousness added to whoever has or offers the cigars in question.\n\nSometimes a case of Creator Provincialism and/or Eagleland Osmosis, when a character boasts about their cigars coming from Cuba in works set outside the U.S., where there are no trade embargoes against Cuba to restrict their availability in the first place.\n\nThe current political situation is not quite a Trope Breaker just yet, but it does greatly diminish the significance of a character possessing Cuban cigars, since they're no longer considered contraband in the US, and all that's needed to get them is a passport. Do note, though, that while restrictions against importation have been relaxed to the point that quantities can be purchased from outside the US and legally brought into the country, the cigars are for personal use only and are not legal to resell. They still cannot be bought wholesale from Cuba and resold by retailers in the U.S., so until such a time that the trade embargo is fully lifted, calling your local tobacconist to ask for Cuban cigars will only get you an annoyed tobacconist.\n\nSee also Good Smoking, Evil Smoking and Made in Country X.\n• In the megacrossover event Underworld Unleashed, the Joker sold his soul to Neron for a box of cigars. When mocked by Circe for selling his soul at such a low price, he defended himself by invoking this trope.\n• Black Hawk Down has captured arms dealer Osman Ali Atto being interrogated by Army Intelligence to learn where insurrectionist warlord Muhammad Adid is hiding. Atto calmly smokes a cigar which he mentions is a genuine Cuban, given to him by Castro's emissaries for keeping the renegade factions supplied with weapons.\n• Subverted in The Punisher (2004). Saint tries to placate the Toro brothers, a pair of Cuban drug lords, by offering them some Cubanos from his walk-in. As they take their leave, one of them indignantly notes that the cigars were actually Honduran.\n• CSI: In \"Forever\", the CSI team find tobacco shreds in a horse's mouth. Identifying the tobacco as coming from a Cuban cigar, they start looking for a suspect who might have access to (illegal) Cuban cigars. This leads them to a former concierge from a top-end hotel.\n• In How I Met Your Mother when Ted gets upset by Barney smoking a cigar in his car, Barney mentions that it is a cuban cigar and that people pay to make their cars smell like them.\n• Played for laughs several times in Seinfeld. In one instance, Kramer gets a box of Cuban cigars from George's fiance's father, which he accidentally uses to burn down her father's cabin. Another time, Kramer hatches a scheme to bring in Cuban refugees to roll Cuban cigars for him in America, but they turn out to be Dominicans and thus inferior cigar rollers.\n• Averted in Person of Interest when The Dragon lights up an expensive Gurkha cigar.\n• Subverted in an episode of Hogan's Heroes when Klink tries to butter up the visiting General Burkhalter by offering a tray of delicacies from across German-occupied Europe. Burkhalter takes one of Klink's cigars, sniffs it, and sours in disgust. Klink apologizes and says it's a German cigar, and Burkhalter muses that they should've invaded Cuba.\n• In KGB, which is set in the notoriously destitute Soviet Union, a character's possession of Cuban cigars is one of many clues that he's corrupt. This in spite of how the U.S.S.R. was a close ally of Cuba and never imposed any trade embargo against them; Cuban cigars were the kind of luxury a Soviet bigwig would be most likely to possess.\n• In King of the Hill one episode had Hank being offered a Cuban cigar. Being the strict rule-follower he is, he breaks it in half and says \"you might not have known but this is Cuban, I'll just destroy it for you.\"\n• Parodied in Futurama with Zuban cigars. Likely from the planet Zuban 5, mentioned in another episode.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/ItsCuban", "media_links": ["/pmwiki/pmwiki.php/ComicBook/UnderworldUnleashed", "/pmwiki/pmwiki.php/Film/BlackHawkDown", "/pmwiki/pmwiki.php/Film/ThePunisher2004", "/pmwiki/pmwiki.php/Series/CSI", "/pmwiki/pmwiki.php/Series/HowIMetYourMother", "/pmwiki/pmwiki.php/Series/Seinfeld", "/pmwiki/pmwiki.php/Series/PersonOfInterest", "/pmwiki/pmwiki.php/Series/HogansHeroes", "/pmwiki/pmwiki.php/VideoGame/KGB", "/pmwiki/pmwiki.php/VideoGame/MetalGearSolid3SnakeEater", "/pmwiki/pmwiki.php/WesternAnimation/KingOfTheHill", "/pmwiki/pmwiki.php/WesternAnimation/Futurama"], "non_media_links": ["/pmwiki/pmwiki.php/Main/JustForPun", "/pmwiki/pmwiki.php/Main/CreatorProvincialism", "/pmwiki/pmwiki.php/Main/EaglelandOsmosis", "/pmwiki/pmwiki.php/Main/TropeBreaker", "/pmwiki/pmwiki.php/Main/GoodSmokingEvilSmoking", "/pmwiki/pmwiki.php/Main/MadeInCountryX", "/pmwiki/pmwiki.php/Main/SoldHisSoulForADonut", "/pmwiki/pmwiki.php/Main/TheDragon"]}