{"title": "Only 0.2% Different", "content": "Here's normal human DNA, and here's the DNA of the monsters we're fighting. My God! it's only 0.2% different! Despite the fact that the monsters have unexplainable powers, and look, act, and think almost nothing like us, there's no real difference between us and them! Really makes you think who the real monsters are, doesn't it? A subtrope/sister trope of What Measure Is a Non-Human?.\n\nThere are a few problems with this:\n• Humans aren't their DNA, so even if the DNA is very similar to that of some other being, it doesn't always tell a lot about what that being is actually like. Among humans with very similar DNA types, the variation is huge, and humans are not even a genetically diverse species compared with the norm among animals. Even twins with identical DNA can turn out very different if some environmental input in the womb or after birth changes one of them, like an accident or brain trauma.\n• The seemingly small difference in percentage could still be referring to a huge number of genes of varying importance (or even all of them, as in theory 0.2% could mean every gene is different by 0.2%, making its resulting peptide very different chemically).\n• Between the gene and the human there are millions of complex connections, causal chains, and effects that make even one small difference in genes potentially magnify at larger levels (as in some genetic disorders).\n• The most often used examples, humans and chimpanzees, are astonishingly different in many respects despite the DNA similarity, making it a little awkward.\n\nIn Real Life, it is true that we share some portion of our genome with many other species. Hell, humans have specific genes that are pretty much the exact same as plants. According to most scientific theories, this is because all organisms are descended from the same progenitor organism species, which also used DNA, the global genetic code. Some experts theorize that the first species may have used RNA, which was later used to code for DNA. The genes that were present in that original organism are still around, since they generally serve very important purposes in controlling different aspects of development, but those aspects that they control have been changed and co-opted into other pathways over time. So genes that function to pattern flower growth in some plants (determining which parts of a bud turn into petals, stamens, etc) are necessary for directing heart development in humans.\n\nFurther, DNA codes for chemicals, specifically proteins. Given that, and given that there are only so many ways to, say, break down a fat molecule into energy, it's hardly surprising that two wildly different animals, such as a mosquito and an elephant, would have large quantities of DNA (or rather, code for various chemicals needed for life) in common.\n\nKeep in mind that when people who know something about genetics talk about differences or similarities within the same species, they may be ignoring the large percentage of genetic material they would by definition already have in common by being the same species.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/OnlyPointTwoPercentDifferent", "media_links": ["/pmwiki/pmwiki.php/Anime/NeonGenesisEvangelion", "/pmwiki/pmwiki.php/Anime/ArmitageIII", "/pmwiki/pmwiki.php/LightNovel/CrestOfTheStars", "/pmwiki/pmwiki.php/Anime/SuperDimensionFortressMacross", "/pmwiki/pmwiki.php/Anime/Robotech", "/pmwiki/pmwiki.php/Anime/Macross", "/pmwiki/pmwiki.php/Anime/CowboyBebop", "/pmwiki/pmwiki.php/LightNovel/CatPlanetCuties", "/pmwiki/pmwiki.php/ComicBook/UltimateSpiderMan", "/pmwiki/pmwiki.php/Film/Doom", "/pmwiki/pmwiki.php/Film/MissionToMars", "/pmwiki/pmwiki.php/Franchise/StarWars", "/pmwiki/pmwiki.php/Film/AttackOfTheClones", "/pmwiki/pmwiki.php/Film/Prometheus", "/pmwiki/pmwiki.php/Series/TheEvent", "/pmwiki/pmwiki.php/Series/House", "/pmwiki/pmwiki.php/ComicBook/XMen", "/pmwiki/pmwiki.php/ComicBook/Magneto", "/pmwiki/pmwiki.php/VideoGame/MassEffect2", "/pmwiki/pmwiki.php/VideoGame/MassEffect1", "/pmwiki/pmwiki.php/VideoGame/MassEffect3", "/pmwiki/pmwiki.php/VideoGame/MetalGearSolid4GunsOfThePatriots", "/pmwiki/pmwiki.php/VideoGame/MegaManBattleNetwork"], "non_media_links": ["/pmwiki/pmwiki.php/WebVideo/MinuteEarth", "/pmwiki/pmwiki.php/Main/ArtisticLicenseBiology", "/pmwiki/pmwiki.php/Main/HumansAreTheRealMonsters", "/pmwiki/pmwiki.php/Main/WhatMeasureIsANonHuman", "/pmwiki/pmwiki.php/Main/NatureVersusNurture", "/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/Main/EldritchAbomination", "/pmwiki/pmwiki.php/Main/MindScrew", "/pmwiki/pmwiki.php/Main/HardLight", "/pmwiki/pmwiki.php/Main/HardLight", "/pmwiki/pmwiki.php/Main/UnusualEars", "/pmwiki/pmwiki.php/Main/Precursors", "/pmwiki/pmwiki.php/Main/AnimalWrongsGroup", "/pmwiki/pmwiki.php/Main/HonorBeforeReason", "/pmwiki/pmwiki.php/Main/ArtisticLicenseBiology", "/pmwiki/pmwiki.php/Main/Inverted", "/pmwiki/pmwiki.php/Main/CloningBlues", "/pmwiki/pmwiki.php/Main/Lampshaded", "/pmwiki/pmwiki.php/Main/ClonesArePeopleToo", "http://www.imdb.com/title/tt0128419/", "/pmwiki/pmwiki.php/Main/InsectoidAliens", "/pmwiki/pmwiki.php/Main/Precursors", "/pmwiki/pmwiki.php/Main/InsectoidAliens", "/pmwiki/pmwiki.php/Main/Retcon", "/pmwiki/pmwiki.php/Main/PlayingWithSyringes"]}