{"title": "Sock It to Them", "content": "When a character uses a sock with a heavy object inside it as an improvised flail. The most commonly used items in fiction are coins (preferably rolled), bars of soap, and pool balls. With coins, the most commonly used are nickels and quarters. Five dollars worth of nickels has the same mass as three baseballs, so it's easy to imagine the damage one of these weapons can do if swung fast enough.\n• A sock full of coins is used as a murder weapon in Detective Conan. And in another, it's a sock full of aquarium rocks.\n• In Death Wish, Paul Kersey attacks a mugger with a sock filled with quarters. Fortunately the mugger is implied to be a frightened amateur without a gun and is easily driven off.\n• The infamous \"blanket party\" scene from Full Metal Jacket, where everyone wraps a bar of soap in a towel, and participates in a run-by pummeling of Private Leonard \"Gomer Pyle\" Lawrence after he screws up one too many times, resulting in consequences for everybody. Also marks the start of Leonard's slide into madness.\n• The Grifters has a discussion on the pain and damage that can be inflicted with a sack filled with oranges.\n• Mallrats: \"Phase one: First you take a run at La Fours with a sock full of quarters. I'd do it, but I pulled my back out humping your mom last night. Nootch. Okay, you clock him on his headpiece and knock his ass out cold. That's when phase two kicks in. I attack the structure Wolvie-Berzerk style, and knock out the fuckin' pin and bickety bam, the motherfucker is rubble. Hence, no game show.\" \n\n\n\nUltimately, the would-be assaulter slips, accidentally tosses the sock full of quarters in the air, and crashes, the sock of quarters landing neatly in the confused target's hands.\n• Heavenly Creatures ends with a murder committed with a brick in a nylon stocking.\n• Scum had an infamous scene where Carlin (Ray Winstone) assaults Richards (the lackey of Banks, the \"daddy\" of the Borstal) with two snooker balls in a sock.\n• The Dilbert special book Dogbert's Clues for the Clueless explained that, though tube socks and a paperweight make useless gifts by themselves, they can be combined into something useful for assaulting the gift-giver.\n• In Sourcery, Rincewind attempts to fight the Sourcerer with a half-brick in a sock. He later fills his other sock with sand in the Dungeon Dimensions. Coin: You're going to fight You're going to fight them with a sock full of sand? Rincewind: No, I'm going to No, I'm going to run away . The sock full of sand is for when they follow me.\n• Morporkians in general feel that if twenty-to-one odds in your favor are unavailable, a halfbrick in a sock and a dark alley to lurk in are a good second.\n• Given a Call-Back in Unseen Academicals. When it looks like a wizard fight is about to break out, Ponder (who wasn't around for the events of Sourcery, but knows about them) notices Rincewind taking off his sock and thinks \"It was probably the same sock.\"\n• Referenced in the first Starfist novel: as a child from a lower-class background sent to an elite school, Joseph Dean decided to take matters into his own hands when tormented by a bully over his Embarrassing Middle Name. He calmly and efficiently laid the bully's head open with \"a field-expedient cosh made from a gym sock and a chunk of broken concrete,\" which got him kicked out of the school but also flagged as a potential recruit for military service.\n• The Dresden Files: In the short story \"Heorot,\" Harry is attacked by a lowlife wielding a weighted sock. It's specified as a \"dirty gym sock,\" the implication being that the thug took it off and stuffed something heavy in it just minutes before. Harry is ambushed and smacked in the head, preventing him from concentrating enough to use magic, but he manages to disarm the guy by wrapping the sock around his wizard's staff and yanking it away. Then he gets in a Groin Attack with the other end.\n• The Stainless Steel Rat: In \"The Stainless Steel Rat's Revenge\" Jim is in a heavily surveilled society where weapons are easily detected and hard to come by. Under his sheets, he stealthily assembles a weapon from available components: a sock full of coins.\n• Agatha Christie:\n• Parker Pyne Investigates: In \"The Gate of Baghdad\", the killer attempts to make it look like the murder victim had been coshed with a sock full of sand by planting damp sand in the spare socks carried by one of the other passengers.\n• Hickory Dickory Dock: The final murder of the book is committed with a paperweight in a sock.\n• In Mr. Mercedes and following works in that trilogy, Hodges has the \"Happy Slapper\", which is a sock that has the foot part filled with ball bearings.\n• In The Blacklist episode \"Marvin Gerard\", Dembe is interrogated by a man hitting him with a pair of billiard balls in a tube sock.\n• Burn Notice: Fiona places a couple of cans of soda in a pillowcase and uses it to attack two men.\n• Arrested Development mentions a sock filled with nickels in a play being put on by the warden.\n• Becomes a Running Gag on iCarly, where Sam lays into a writer with a sock full of butter. The \"Buttersock\" had a few other mentions, including \"iOpen a Restaurant\" and \"iParty with Victorious.\"\n• There was an episode of Monk where a guy did this to himself: He tied the sock weapon to a ceiling fan so as to give himself contusions and frame another man.\n• The Janitor on Scrubs claims that his father used to do this. It's unlikely that he was telling the truth, of course.\n• In the Seinfeld episode \"The Reverse Peephole\", Kramer and Newman reverse the peepholes on their apartment doors so that they look inside the apartment rather than out. When asked what purpose that could possibly serve, they bring up the possibility that some lunatic could be waiting inside to ambush them with a sock full of pennies. At the end of the episode, a minor character gets ambushed in this exact way by another character who mistakenly thought that his wife was cheating on him with the first character. \"He should have had a reverse peephole...\"\n• 30 Rock: A drunk woman challenges Liz to a fight, and tells her she has two minutes to fill a sock up and meet her outside.\n• One CSI episode featured a padlock in a sock as the murder weapon. Wielded by a Psycho Lesbian, no less.\n• This is the signature weapon of In Living Color!'s Homey D. Clown, an ex-convict clown with a chip on his shoulder. He mostly uses it to punish dimwits.\n• Referenced several times in Orange Is the New Black. In one case, when discussing an article for a prison newsletter on how to deal with a bunkmate stealing things, Piper suggests purchasing a sturdy lock down at the commissary, while Flaca has her own ideas on how to use the lock. Flaca: That's what I'm saying. Buy a lock, stick it in a sock, and slock the bitch down.\n• A sock full of rocks is the weapon of choice for in Irisu Syndrome!, at least in the bad endings.\n• A variant occurs in Super Danganronpa 2 where the students have to solve a murder mystery within a murder mystery involving a missing school swimsuit, a broken fish tank and a victim with a bashed-in skull. At Mioda's offhanded suggestion, The Hero figures that the culprit wrapped the tank's gravel in the swimsuit and tied it into a knot so that they could disguise the swimsuit's going missing as a random pervert sneaking onto the campus (also a convenient Red Herring to lead the police off their trail).\n• The Escapists: Combining a soap with a sock creates a sock mace, a mid-tier weapon. Combining a sock with a battery creates a \"super\" sock mace... that is \"super\" in name only, since it has the exact same attack power as the regular sock mace.\n• The \"Rock in a sock\" in Cataclysm. Truly a weapon of desperation, especially since more reliable weapons can be crafted from smashed furniture most of the time.\n• Used in an Imagine Spot in Johnny Wander, as the characters discuss what to do with $50 worth of small change.\n• A unique weapon of the Angry Marines is a powered adamantium-weave sack of doorknobs.\n• Family Guy: After Meg gets out of prison, Connie D'Amico and her friends are teasing her in the school cafeteria. Meg ignores them and buys a bunch of soda cans from a vending machine. She loads them into a bag, and uses the bag on the group Batter Up! style.\n• When Chris briefly attended a wealthy boarding school, the other students held him down in bed and attacked him with socks full of money.\n• The Simpsons: When Homer and his buddies become a vigilante force because the police can't catch the Classy Cat-Burglar stalking the neighborhood, Jimbo joins. He's told that his Weapon of Choice should be sack full of door knobs (a news anchor interviewing Homer later mentions that beatings with such a weapon have skyrocketted).\n• In the South Park episode \"Lice Capades\", Kenny is accused of having lice. The kids all gather bars of soap and socks and all signs point to them throwing a traditional blanket party on him...but it turns out the plan was to \"wash him with the soap, and dry him off with the socks.\"\n• A variation is used in the Looney Tunes short Hare Trimmed. In response to being hit with a glove by Yosemite Sam, Bugs Bunny takes his own glove, puts a brick in it, and hits Sam with it. When he empties the bag, the brick is completely crumbled. Bugs Bunny: HA! YOU HAVE INSULTED ZE GREAT LOVER, THE MARQUIS OF QUEENSBURY RULES! TAKE ZIS!!! (slaps Yosemite Sam with a glove)\n• Brock Samson from The Venture Bros.' is said to have once killed a guy with a sock full of party snaps.\n• There's a rumor/urban legend that Bing Crosby beat his children with a sack filled with oranges, because that would cause serious pain but no visible bruises or internal injury. The Grifters claims the opposite effect (nasty looking bruises if done correctly; internal injury if not).\n• If US Patent 6,641,059 is to be believed, protecting sprinker heads from such weapons is Serious Business", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/SockItToThem", "media_links": ["/pmwiki/pmwiki.php/Manga/DetectiveConan", "/pmwiki/pmwiki.php/Film/DeathWish", "/pmwiki/pmwiki.php/Film/FullMetalJacket", "/pmwiki/pmwiki.php/Film/TheGrifters", "/pmwiki/pmwiki.php/Film/Mallrats", "/pmwiki/pmwiki.php/Film/HeavenlyCreatures", "/pmwiki/pmwiki.php/Film/Scum", "/pmwiki/pmwiki.php/Creator/RayWinstone", "/pmwiki/pmwiki.php/Literature/Starfist", "/pmwiki/pmwiki.php/Literature/TheDresdenFiles", "/pmwiki/pmwiki.php/Literature/TheStainlessSteelRat", "/pmwiki/pmwiki.php/Creator/AgathaChristie", "/pmwiki/pmwiki.php/Literature/ParkerPyneInvestigates", "/pmwiki/pmwiki.php/Literature/HerculePoirot", "/pmwiki/pmwiki.php/Literature/MrMercedes", "/pmwiki/pmwiki.php/Series/TheBlacklist", "/pmwiki/pmwiki.php/Series/BurnNotice", "/pmwiki/pmwiki.php/Series/ArrestedDevelopment", "/pmwiki/pmwiki.php/Series/ICarly", "/pmwiki/pmwiki.php/Series/Victorious", "/pmwiki/pmwiki.php/Series/Monk", "/pmwiki/pmwiki.php/Series/Scrubs", "/pmwiki/pmwiki.php/Series/Seinfeld", "/pmwiki/pmwiki.php/Series/ThirtyRock", "/pmwiki/pmwiki.php/Series/CSI", "/pmwiki/pmwiki.php/Series/InLivingColor", "/pmwiki/pmwiki.php/Series/OrangeIsTheNewBlack", "/pmwiki/pmwiki.php/VideoGame/IrisuSyndrome", "/pmwiki/pmwiki.php/VisualNovel/SuperDanganronpa2", "/pmwiki/pmwiki.php/VideoGame/TheEscapists", "/pmwiki/pmwiki.php/VideoGame/Cataclysm", "/pmwiki/pmwiki.php/Webcomic/JohnnyWander", "/pmwiki/pmwiki.php/TabletopGame/Warhammer40000", "/pmwiki/pmwiki.php/WesternAnimation/FamilyGuy", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/WesternAnimation/SouthPark", "/pmwiki/pmwiki.php/WesternAnimation/LooneyTunes", "/pmwiki/pmwiki.php/WesternAnimation/TheVentureBrothers", "/pmwiki/pmwiki.php/Music/BingCrosby"], "non_media_links": ["/pmwiki/pmwiki.php/Main/BadGuysPlayPool", "/pmwiki/pmwiki.php/Main/SubTrope", "/pmwiki/pmwiki.php/Main/ImprovisedWeapon", "/pmwiki/pmwiki.php/Main/AnimeAndManga", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/IWillPunishYourFriendForYourFailure", "/pmwiki/pmwiki.php/Main/SanitySlippage", "/pmwiki/pmwiki.php/Main/YourMom", "/pmwiki/pmwiki.php/Main/VerbalTic", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/ComicStrip/Dilbert", "/pmwiki/pmwiki.php/Discworld/Sourcery", "/pmwiki/pmwiki.php/Main/EldritchAbomination", "/pmwiki/pmwiki.php/Main/LovableCoward", "/pmwiki/pmwiki.php/Main/CallBack", "/pmwiki/pmwiki.php/Discworld/UnseenAcademicals", "/pmwiki/pmwiki.php/Main/EmbarrassingMiddleName", "/pmwiki/pmwiki.php/Main/GroinAttack", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/RunningGag", "/pmwiki/pmwiki.php/Main/ExactlyWhatItSaysOnTheTin", "/pmwiki/pmwiki.php/Main/PsychoLesbian", "/pmwiki/pmwiki.php/Main/DopeSlap", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/TheHero", "/pmwiki/pmwiki.php/Main/RedHerring", "/pmwiki/pmwiki.php/Main/Webcomics", "/pmwiki/pmwiki.php/Main/ImagineSpot", "/pmwiki/pmwiki.php/Main/WebOriginal", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/AlphaBitch", "/pmwiki/pmwiki.php/Main/BatterUp", "/pmwiki/pmwiki.php/Main/ClassyCatBurglar", "/pmwiki/pmwiki.php/Main/WeaponOfChoice", "/pmwiki/pmwiki.php/Main/SubvertedTrope", "/pmwiki/pmwiki.php/Main/CoolAndUnusualPunishment", "/pmwiki/pmwiki.php/Main/YourHeadASplode", "/pmwiki/pmwiki.php/Main/RealLife", "http://www.google.com/patents?id=UhANAAAAEBAJ&printsec=abstract&zoom=4#v=onepage&q&f=false", "/pmwiki/pmwiki.php/Main/SeriousBusiness"]}