{"title": "Waterfall Puke", "content": "Sometimes, the creators really want to show just how disgusting, Squicky, or teeth-rottening something is to a character, but don't think a Vomit Discretion Shot is necessary (seeing as this tactic is using applied in comedy shows and the 'disgusting' thing in question isn't so bad, it's pretty much justified). So there is the Waterfall Puke—a stream of yellowish (or rainbow) ick that flows from the character's mouth to show that they are disgusted. Ironically enough, nobody else seems to notice that the character is vomiting, or even make an attempt to clean it up when they do.\n\nNote that this is more common in anime and manga, where details can be exaggerated for comedic effect.\n\nCompare the Vomit Indiscretion Shot, Vomit Chain Reaction. Contrast Vomit Discretion Shot. See also the relatively less squicky Drool Deluge.\n• Video Girl Ai (the image on this page). Ai does this after eating her own food.\n• Lina does this in an early episode of Slayers when Gourry demonstrates a moment of Fridge Brilliance: Lina says she'd never eat a worm, yet she used a worm to catch the fish she's eating right now. The fish ate the worm and Lina ate the fish so by extension, Lina ate the worm too. Cue trope.\n• Jango does this in one of the One Piece movies, as an Oh, Crap! reaction to the Marines that just showed up.\n• Hyatt, every time she dies on Excel Saga, escalates from Incurable Cough of Death to Blood from the Mouth to this.\n• Excel does this, as well, while pledging her loyalty to Il Palazzo in the first episode of the anime. \"If you tell me to strip, I'LL STRIP RIGHT AWAY!! If you tell me to throw up—\" *BLERGH* \"I'LL THROW UP!!\"\n• Done in Spiritual Successor OVA Puni Puni Poemi by the titular character.\n• Junta Momonari pukes this way in DNA², when touched by women or seeing a naked one.\n• Pandy does this once in Dead Leaves.\n• In A Day in the Life, Draug pukes up rainbows after moving too much through his allies' support.\n• Girls Bravo: As does Fukuyama when exposed to Kirie's cooking.\n• Izumi Curtis of Fullmetal Alchemist has Waterfall Blood. It's only used once or twice in the manga but seems to recur more often in Brotherhood.\n• in Canaan does this, though it's blood, when she is shot through the stomach. It ain't pretty. You've been warned .\n• In chapter 492 of Naruto Guy gets seasick and vomits upon seeing a huge gorilla out of shock.\n• Kai (Kaisuke in the manga) does this for no apparent reason in the anime adaptation of AKIRA. It's waterfall blood though.\n• Ika-chan from Squid Girl replicates the effect of this trope, but isn't actually vomiting. Rather, she's horking up squid ink because Chizuru wanted to make squid ink pasta.\n• Sabato of Bludgeoning Angel Dokuro-chan does this for a good solid minute when Dokuro whacks her with Excalibolg (as Sakura had used her as a Human Shield to try to avoid punishment for touching Dokuro's boob).\n• Although this counts more as a Spit Take, Rei Hino from Sailor Moon is known for doing this a couple times when she's shocked or surprised and something just happens to be in her mouth at the time. A more 'charming' one happens in the middle of SuperS when discussing a new villian, Rei gets surprised and opens her mouth, and so the tea she was drinking flows back into her tea cup, then later on, she drinks it again.\n• Rune Soldier Louie: In episode 6, Merrill tries showing a bit of leg to stop the golem long enough to . Instead of being turned on, it pukes, with Louie nodding in agreement. Naturally, Merrill was offended (at 15:16-15:26, here).\n• During the montage in Episode 1 of Konosuba, we see repeated shots of Aqua puking rainbow waterfalls after having a pub party.\n• Queen's Blade has Leina, in the fourth episode, attempt to cook and eat a wild mushroom... which ends in this trope and an apparent Mushroom Samba.\n• It showed up in MANswers once when it was superimposed on a tiger.\n• A sketch on Little Britain had a prim old lady from the Women's Institute react with a ridiculously over-the-top, Overly Long Gag version of this whenever her Little Englander values were challenged in any way. She also didn't make any attempt to avoid vomiting directly onto whoever/whatever caused the offence.\n• Black Pigeon, one of Yapool's many Choju in Ultraman Ace, gushes large amounts of corrosive pigeon milk (a regurgitated fluid normally provided by pigeons as sustenance for their offspring) during his battle with Ace that has the possibility to cause paralysis.\n• That's Just Me, which randomly switches into anime for scenes hard to do in live-action, does this a lot. A famous scene is when Elizabeth pukes water after being shocked by the poor behavior of the 8th graders, then it changes into her doing a Spit Take in live-action.\n• Vomit/Spit Line: Intercom: \"And the 8th graders have 530 points!\" Elizabeth: *drinking water* \"That's not so bad!\" Intercom: \"And the 7th graders have 920 points!\" Elizabeth: *spit/puke* \"WHAT?!\"\n• MapleStory has a toggle button you can press that shows your avatar doing this. With the right amount of NX Cash to buy the option, after all.\n• Ark would do this in Terranigma if you ate something bad.\n• Pangya has an emote, \"(puke)\", which does this. It's frequently used as a reaction to a spectacularly flubbed shot.\n• In the PC game Family Flights whenever your plane experinced turbelence, some people might get sick, and thus this would happen and would require you to clean it up. It was rainbow colored instead of yellow though.\n• In Abobo's Big Adventure, Kirby does this in his death animation, vomiting up dozens of video game characters.\n• In Keio Flying Squadron 2, the sumo daruma boss does this following the move where he spins around on a pencil.\n• In The Legendary Starfy, Evil weaponises it in the form of Wave Motion Puke which squishes the entire screen from above. If you failed to deflect it? It's One-Hit Kill.\n• In the trailer for Con Man: The Game, Alan Tudyk (in animated form) does this twice after he states that the food at the con needs to be kept fresh by the player.\n• In The Flash Tub cartoon Platform Hero, Green Dinosaur, after being The Load for so long, helps Platform Hero cross the Broken Bridge in front of Dark Dragon's castle by sniffing the air, sprouting a wing... and disgorging an enormous stream of vomit that fills the gap.\n• SMG4's Mario Bloopers: One scene in the blooper \"Boil the Big Bully\" involved Mario imagining himself as a Pepsi machine vomiting Pepsi.\n• The intro sequence for Acquisitions Incorporated spinoff The \"C\" Team has Ryan's character Donaar do this to demonstrate his breath acid attack.\n• Futurama: Happens to the unfortunate Mushu the whale, all so that Kif can reclaim a watch it ate. (Bender also uses it as a distraction to escape a pair of cops chasing him).\n• Asami does it in The Legend of Korra when she hears what's inside the 'Street Gruel' that she's eating.\n• Mort does this in Madagascar 3: Europe's Most Wanted. Mort: I'm so excited that my tummy's gonna- (puke)\n• Family Guy: In \"Quagmire's Dad\", Brian vomits for 30 uninterrupted seconds when he finds out that the girl he just slept with was Quagmire's sex-changed father.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/WaterfallPuke", "media_links": ["/pmwiki/pmwiki.php/Anime/VideoGirlAi", "/pmwiki/pmwiki.php/Manga/VideoGirlAi", "/pmwiki/pmwiki.php/LightNovel/Slayers", "/pmwiki/pmwiki.php/Manga/OnePiece", "/pmwiki/pmwiki.php/Manga/ExcelSaga", "/pmwiki/pmwiki.php/Anime/PuniPuniPoemi", "/pmwiki/pmwiki.php/Manga/DNA2", "/pmwiki/pmwiki.php/Anime/DeadLeaves", "/pmwiki/pmwiki.php/Manga/ADayInTheLife", "/pmwiki/pmwiki.php/Manga/GirlsBravo", "/pmwiki/pmwiki.php/Manga/FullmetalAlchemist", "/pmwiki/pmwiki.php/Anime/Canaan", "/pmwiki/pmwiki.php/Manga/Naruto", "/pmwiki/pmwiki.php/Manga/Akira", "/pmwiki/pmwiki.php/Manga/SquidGirl", "/pmwiki/pmwiki.php/LightNovel/BludgeoningAngelDokuroChan", "/pmwiki/pmwiki.php/Anime/SailorMoon", "/pmwiki/pmwiki.php/Anime/RuneSoldierLouie", "/pmwiki/pmwiki.php/LightNovel/KonoSuba", "/pmwiki/pmwiki.php/Anime/QueensBlade", "/pmwiki/pmwiki.php/Series/MANswers", "/pmwiki/pmwiki.php/Series/LittleBritain", "/pmwiki/pmwiki.php/Series/UltramanAce", "/pmwiki/pmwiki.php/VideoGame/MapleStory", "/pmwiki/pmwiki.php/VideoGame/Terranigma", "/pmwiki/pmwiki.php/VideoGame/Pangya", "/pmwiki/pmwiki.php/VideoGame/FamilyFlights", "/pmwiki/pmwiki.php/VideoGame/AbobosBigAdventure", "/pmwiki/pmwiki.php/VideoGame/KeioFlyingSquadron", "/pmwiki/pmwiki.php/VideoGame/TheLegendaryStarfy", "/pmwiki/pmwiki.php/Creator/AlanTudyk", "/pmwiki/pmwiki.php/WesternAnimation/Futurama", "/pmwiki/pmwiki.php/WesternAnimation/TheLegendOfKorra", "/pmwiki/pmwiki.php/WesternAnimation/Madagascar3EuropesMostWanted", "/pmwiki/pmwiki.php/WesternAnimation/FamilyGuy", "/pmwiki/pmwiki.php/WesternAnimation/GravityFalls"], "non_media_links": ["/pmwiki/pmwiki.php/Main/Squick", "/pmwiki/pmwiki.php/Main/TastesLikeDiabetes", "/pmwiki/pmwiki.php/Main/VomitDiscretionShot", "/pmwiki/pmwiki.php/Main/VomitIndiscretionShot", "/pmwiki/pmwiki.php/Main/VomitChainReaction", "/pmwiki/pmwiki.php/Main/VomitDiscretionShot", "/pmwiki/pmwiki.php/Main/DroolDeluge", "/pmwiki/pmwiki.php/Main/Anime", "/pmwiki/pmwiki.php/Main/Manga", "/pmwiki/pmwiki.php/Main/LethalChef", "/pmwiki/pmwiki.php/Main/FridgeBrilliance", "/pmwiki/pmwiki.php/Main/OhCrap", "/pmwiki/pmwiki.php/Main/OnceAnEpisode", "/pmwiki/pmwiki.php/Main/IncurableCoughOfDeath", "/pmwiki/pmwiki.php/Main/BloodFromTheMouth", "/pmwiki/pmwiki.php/Main/SpiritualSuccessor", "/pmwiki/pmwiki.php/Main/LethalChef", "/pmwiki/pmwiki.php/Main/BloodFromTheMouth", "https://static.tvtropes.org/pmwiki/pub/images/s_face.jpg", "/pmwiki/pmwiki.php/Main/RuleOfFunny", "https://static.tvtropes.org/pmwiki/pub/images/kaisukebloodbarflolwut_1736.jpg", "/pmwiki/pmwiki.php/Main/HumanShield", "/pmwiki/pmwiki.php/Main/ThanksForTheMammary", "/pmwiki/pmwiki.php/Main/ShortTank", "/pmwiki/pmwiki.php/Main/ShowSomeLeg", "/pmwiki/pmwiki.php/Main/FunnyBackgroundEvent", "/pmwiki/pmwiki.php/Main/CrossPoppingVeins", "https://www.youtube.com/watch?v=7RYyc5TAa9Q", "/pmwiki/pmwiki.php/Main/MushroomSamba", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/VulgarHumor", "/pmwiki/pmwiki.php/Main/OverlyLongGag", "/pmwiki/pmwiki.php/Main/SpitTake", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/AllegedlyFreeGame", "/pmwiki/pmwiki.php/Main/TrueFinalBoss", "/pmwiki/pmwiki.php/Main/WaveMotionGun", "/pmwiki/pmwiki.php/Main/WaterfallPuke", "/pmwiki/pmwiki.php/Main/OneHitKill", "/pmwiki/pmwiki.php/WebVideo/ConMan", "/pmwiki/pmwiki.php/Main/WebAnimation", "/pmwiki/pmwiki.php/WebAnimation/TheFlashTub", "/pmwiki/pmwiki.php/Main/TheLoad", "/pmwiki/pmwiki.php/Main/BrokenBridge", "/pmwiki/pmwiki.php/Main/WebVideo", "http://knowyourmeme.com/memes/puking-rainbows", "/pmwiki/pmwiki.php/Machinima/Supermarioglitchy4sSuperMario64Bloopers", "/pmwiki/pmwiki.php/WebOriginal/AcquisitionsIncorporated", "/pmwiki/pmwiki.php/Main/WesternAnimation"]}