{"title": "Does Not Drive", "content": "Automobiles are an important part of our society; most of us rely on our cars to take us to work, school, or to otherwise facilitate our daily lives to the point where we take our cars for granted. For many, owning and driving a car creates a sense of freedom as they are able to go where they please whenever they please. However, some people simply do not drive for any of various reasons. This reluctance, or inability to drive in many cases, may reveal something about the character, be it their attitudes or their culture.\n\nThis trope comes in several flavors:\n• The character is too important to do such a menial thing. This person is usually very affluent or a member of royalty, so is often driven by a chauffeur.\n• The character is too unimportant to be allowed to drive. They may be a grunt without the proper permission or a low-caste individual without the social standing to operate a motor vehicle.\n• The character knows perfectly well how to drive but is not allowed, either through necessity or by choice. They may be fairly competent drivers but stay off the wheel for legal or cultural reasons, or may be totally inept and are kept off the streets for everyone else's safety.\n• The character may simply prefer not to drive or is indifferent to driving and never bothered to learn. They may be environmentally minded or health conscious, opting to walk, bike, or use public transit whenever they can, or, may simply enjoy these experiences over driving.\n• The character has no need to drive. They may live in a tight-knit podunk in the middle of nowhere or in a heavily urbanized area, where other forms of transportation, such as walking or public transit, are more viable.\n• The character had no opportunity to learn to drive, from any of the above cultural reasons, or just not being developmentally mature enough to learn.\n\nThis trope can result in Drives Like Crazy and Had the Silly Thing in Reverse when a character is asked to drive. Contrast Universal Driver's License, where anyone can drive a any sort of vehicle regardless of experience, and Cool Car or Drives Like Crazy, where a driving character can be judged by how they drive. A sister trope to Driving Stick and Are You Sure You Can Drive This Thing? Works with this trope in effect may feature The Driver, and a Driving Test signifies a change in character.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/DoesNotDrive", "media_links": ["/pmwiki/pmwiki.php/WesternAnimation/TheLegendOfKorra", "/pmwiki/pmwiki.php/ComicBook/SpiderMan", "/pmwiki/pmwiki.php/ComicBook/Tintin", "/pmwiki/pmwiki.php/Film/IRobot", "/pmwiki/pmwiki.php/Film/ThePrincessDiaries", "/pmwiki/pmwiki.php/Creator/SarahVowell", "/pmwiki/pmwiki.php/Literature/Sisterland", "/pmwiki/pmwiki.php/Literature/OctoberDaye", "/pmwiki/pmwiki.php/Series/TheBigBangTheory", "/pmwiki/pmwiki.php/Series/FoylesWar", "/pmwiki/pmwiki.php/Series/MidnightCaller", "/pmwiki/pmwiki.php/Series/JessicaJones", "/pmwiki/pmwiki.php/WesternAnimation/TheLegendOfKorra", "/pmwiki/pmwiki.php/WesternAnimation/SpongeBobSquarePants", "/pmwiki/pmwiki.php/WesternAnimation/TheVentureBros"], "non_media_links": ["/pmwiki/pmwiki.php/Main/InvokedTrope", "/pmwiki/pmwiki.php/Main/DrivesLikeCrazy", "/pmwiki/pmwiki.php/Main/CountryMouse", "/pmwiki/pmwiki.php/Main/CityMouse", "/pmwiki/pmwiki.php/Main/DrivesLikeCrazy", "/pmwiki/pmwiki.php/Main/HadTheSillyThingInReverse", "/pmwiki/pmwiki.php/Main/AreYouSureYouCanDriveThisThing", "/pmwiki/pmwiki.php/Main/UniversalDriversLicense", "/pmwiki/pmwiki.php/Main/CoolCar", "/pmwiki/pmwiki.php/Main/DrivesLikeCrazy", "/pmwiki/pmwiki.php/Main/DrivingStick", "/pmwiki/pmwiki.php/Main/AreYouSureYouCanDriveThisThing", "/pmwiki/pmwiki.php/Main/TheDriver", "/pmwiki/pmwiki.php/Main/DrivingTest", "/pmwiki/pmwiki.php/Main/MundaneUtility", "/pmwiki/pmwiki.php/Main/HilarityEnsues", "/pmwiki/pmwiki.php/Main/InvertedTrope", "/pmwiki/pmwiki.php/Main/FantasticRacism", "/pmwiki/pmwiki.php/Main/InvokedTrope", "/pmwiki/pmwiki.php/Main/TheWatson", "/pmwiki/pmwiki.php/Main/DrivesLikeCrazy", "/pmwiki/pmwiki.php/Main/ManChild", "/pmwiki/pmwiki.php/Main/TheReliableOne", "/pmwiki/pmwiki.php/Podcast/RedPandaAdventures", "/pmwiki/pmwiki.php/Main/CountryMouse", "/pmwiki/pmwiki.php/Main/CallARabbitASmeerp", "/pmwiki/pmwiki.php/Main/AreYouSureYouCanDriveThisThing", "/pmwiki/pmwiki.php/Main/DrivesLikeCrazy"]}