{"title": "Think Music", "content": "A long-lasting Game Show Trope. When the big money's on the line, a piece of music often plays while the contestant is given some time to think out their answer. In many cases, this keeps the same musical motif as the show's main theme, but some shows use a completely different melody for the think music.\n• Perhaps the best known example is \"Think!\", the \"Jeopardy!\" Thinking Music from Jeopardy!, which plays during the 30-second span in which the contestants write down their Final Jeopardy! questions. It is in the form of a Tick Tock Tune. Listen to a fifteen-minute loop here .\n• On sister show Wheel of Fortune, a light music cue plays throughout the Toss-Up rounds, the Speed-Up round and during the 10-second countdown in the Bonus Round. Initially, however, Speed-Up rounds were silent, and the only sound in the Bonus Round was a beeping timer.\n• Several of Jay Wolpert's game shows (Blackout, Rodeo Drive, Wait Til You Have Kids) feature sort of a trope within this trope during Bonus Rounds: a slow piece with notes that alternate back and forth on each second, with repeating Truck Drivers Gear Changes throughout to add suspense.\n• Match Game has a variant, as the think music plays while the celebrities write their answers.\n• On Tic-Tac-Dough, the center square was always a two-part question. A synthesized think cue played while the contestant was given extra time to ponder the question. The original edition (1956-59) had think music for the center square from in-house musicians.\n• However, if the center box was a musical category, like Opera, the musical clue would play, followed by a few seconds of silence, so that the contestant would not be confused.\n• Stretching the definition a bit, but the \"plonk plonk plonk\" timer that counts down the 60-second limit in the Winner's Circle on the Pyramid franchise is actually considered part of the music package. (The Donny Osmond version used an actual music bed.)\n• When Pyramid was revived in 2017, the original \"plonk\" track returned, but had dramatic underscoring added.\n• The \"plonk\" timer was also used on the short-lived Go and Double Talk, the original Chain Reaction, and early seasons of the American version of Sale of the Century.\n• A soft music cue plays throughout rounds on Lingo while the contestants guess the words, sounding much like a mellower mix of the Theme Tune. A similar piece also plays during Bonus Lingo.\n• Several pricing games on The Price Is Right use this, most often in games that require the contestant to manipulate a prop to determine the price: e.g., moving the number blocks in Switcheroo, the price tags in Race Game, the paddles in Bonkers, etc.\n• You Bet Your Life played a short reprise of the show's theme, \"Hello, I Must Be Going (Hurray for Captain Spaulding!)\", as the contestant pair pondered their answer to the Jackpot question.\n• The think music on Countdown is as iconic in the United Kingdom as the Jeopardy! music is in the United States.\n• The Jack Narz version of Concentration had a short \"rebus reveal\" cue that was played when time ran short in the main game.\n• Classic Concentration version also sometimes had a softer version of the theme play as Alex read off the numbers being revealed of a tie breaking 3rd rebus.\n• Video Game example: In the Mario Party series, there is one minigame BGM track per game that is generally used for the thinking-based minigames in that game.\n• Camouflage (ABC, 1961-62) had a light in-house orchestrated 10-second think piece for contestants searching out the hidden object in her picture drawing.\n• Finders Keepers employed think music during the Hidden Pictures portion of the game, which also doubled as the intro music before kicking into the theme song during the show's opening.\n• Think Fast, another Nickelodeon game show, used various renditions of its Theme Tune for each event; when the event was more of a \"mental\" than a \"physical\" contest, the music consisted of nothing more than a handful of notes and barely audible rhythmic cymbals. There was also a brief \"think cue\" used when a piece of the Brain Bender was revealed.\n• Dog Eat Dog, especially during the final round.\n• Distraction, during the \"Bonus Round\"; the US version also used \"think cues\" during the main game more often than the UK version.\n• Who Wants to Be a Millionaire?, as well as most of its clones and spinoffs, have some form of \"think music\" going the entire show.\n• Where in the World Is Carmen Sandiego? had two, both performed by Rockapella - \"How much you wanna risk?\" during the wagering portion of the game, and \"Where do you wanna go?\" as the winning contestant wrote down his desired trip destination if he captured Carmen.\n• Face The Music played a cheesy 10-second bit in the Championship Game when a contestant was studying the baby picture for $10,000.\n• Get the Picture had a 10-second cue similar to the above when the team was studying the nine pictures at the beginning of Mega Memory.\n• The short-lived You Don't Know Jack game show parodied this with intentionally overly loud music to distract the contestants, usually played by a marching band.\n• Professor Layton has many puzzles and there is thinking music being played while in a puzzle. It even made it into the movie!\n• Panel Quiz Attack 25 has two: a cue that plays while the bonus game clues are being shown, and another five-second Tick Tock Tune after a question is read during the main game.\n• Swedish long-running gameshow Kvitt eller dubbelt (Double Or Nothing, based on The $64 000 Question) used as think music Proclamation from Spirituals for String Choir and Orchestra by Morton Gould. The piece subsequently entered the collective conscious as the most stress-inducing music ever. Have a listen here: [1]", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/ThinkMusic", "media_links": ["/pmwiki/pmwiki.php/Series/Jeopardy", "/pmwiki/pmwiki.php/Series/WheelOfFortune", "/pmwiki/pmwiki.php/Creator/JayWolpert", "/pmwiki/pmwiki.php/Series/Blackout", "/pmwiki/pmwiki.php/Series/WaitTilYouHaveKids", "/pmwiki/pmwiki.php/Series/MatchGame", "/pmwiki/pmwiki.php/Series/TicTacDough", "/pmwiki/pmwiki.php/Series/Pyramid", "/pmwiki/pmwiki.php/Series/Go", "/pmwiki/pmwiki.php/Series/ChainReaction", "/pmwiki/pmwiki.php/Series/SaleOfTheCentury", "/pmwiki/pmwiki.php/Series/Lingo", "/pmwiki/pmwiki.php/Series/ThePriceIsRight", "/pmwiki/pmwiki.php/Series/YouBetYourLife", "/pmwiki/pmwiki.php/Series/Countdown", "/pmwiki/pmwiki.php/Series/Concentration", "/pmwiki/pmwiki.php/VideoGame/MarioParty", "/pmwiki/pmwiki.php/Series/Camouflage1961", "/pmwiki/pmwiki.php/Series/FindersKeepers", "/pmwiki/pmwiki.php/Series/ThinkFast", "/pmwiki/pmwiki.php/Series/DogEatDog", "/pmwiki/pmwiki.php/Series/Distraction", "/pmwiki/pmwiki.php/Series/WhoWantsToBeAMillionaire", "/pmwiki/pmwiki.php/Series/WhereInTheWorldIsCarmenSandiego", "/pmwiki/pmwiki.php/Series/FaceTheMusic", "/pmwiki/pmwiki.php/Series/GetThePicture", "/pmwiki/pmwiki.php/VideoGame/YouDontKnowJack", "/pmwiki/pmwiki.php/VideoGame/ProfessorLayton", "/pmwiki/pmwiki.php/Anime/ProfessorLaytonAndTheEternalDiva", "/pmwiki/pmwiki.php/Series/PanelQuizAttack25", "/pmwiki/pmwiki.php/Series/The64000Question"], "non_media_links": ["/pmwiki/pmwiki.php/Main/GameShowTropes", "/pmwiki/pmwiki.php/Main/JeopardyThinkingMusic", "/pmwiki/pmwiki.php/Main/TickTockTune", "https://www.youtube.com/watch?v=HuABhumm6fY", "/pmwiki/pmwiki.php/Main/SpeedRound", "/pmwiki/pmwiki.php/Main/BonusRound", "/pmwiki/pmwiki.php/Main/BonusRound", "/pmwiki/pmwiki.php/Main/BonusRound", "/pmwiki/pmwiki.php/Main/TruckDriversGearChange", "/pmwiki/pmwiki.php/Main/SubvertedTrope", "/pmwiki/pmwiki.php/Main/ThemeTune", "/pmwiki/pmwiki.php/Main/VideoGame", "/pmwiki/pmwiki.php/Main/ThemeTune", "/pmwiki/pmwiki.php/Main/BonusRound", "/pmwiki/pmwiki.php/Main/WhoWantsToBeWhoWantsToBeAMillionaire", "/pmwiki/pmwiki.php/Main/TickTockTune", "https://www.youtube.com/watch?v=MfBqIcEqoqA"]}