{"title": "Videogame Dashing", "content": "Many newer action games characters will have the ability to rocket forward or backward with their legs trailing after them as if firing a jet-pack horizontally, though they usually aren't wearing one. When doing this they will be able to travel a distance many times the length of their body in a split second, better than any Real Life combat lunge. This move tends to be triggered by tapping or flicking the same direction more than once but some games have a dedicated 'dash button'.\n\nThe occasional upgrade or power-up may allow a character to do this in mid-air, a move usually known as air-dashing. It can also be done before a jump for a longer trajectory, which is called dash-jumping. Very rarely a character may be able to dash on walls or ceilings, a wall-dash.\n\nAs with the Unnecessary Combat Roll, expect this maneuver to take the place of simple running if there are no limits on its use. Note that while printed media or shows with Limited Animation tend to portray a regular lunge in this fashion, it is usually due to characters being shown in mid-lunge with the startup omitted.\n\nSee also Dash Attack. May be used in conjunction with a Jump Jet Pack.\n• This is a notable feature in the Mega Man X series and its spin-offs, with all the above-mentioned variants present in at least one game. The regular ground dash is a modification of the sliding tackle from the first Mega Man series, and even shares the property of passing under certain enemy attacks.\n• The series justifies this by putting booster rockets on the characters' boots, which flare up when you dash. X's new armor in Command Mission additionally features a compartment on X's back which serves the same purpose (and even generates a \"scarf\" for no other reason than to look cool).\n• By the time of X7, the playable cast was able to air dash by default on top of this (Zero gained the ability in X4 and X5, finally internalizing it by X6, whereas the air dash was restricted to an attribute of X's armors in most games). X's armors tend to enable him to utilize upgraded dashes (such as Blade Armor's Mach Dash in X6 a variant of the basic air dash allowing X to move in one of the four cardinal directions; it was invincible on startup and traveled twice the distance of a normal air dash and invincible shadow dashes allowing X to phase through enemies in X8). These traits would be given (under certain circumstances) to Zero in his series and the various Biometal Models in Mega Man ZX.\n• Dashing would later be backported into the Classic series with Bass, starting in Mega Man & Bass (he is Zero's predecessor, after all). Bass' design appears to sport the boot rockets that the X series characters possess.\n• The Mega Man Legends series replaced this ability with a continuous forward boost (if the right Leg Parts are equipped) and a Unnecessary Combat Roll.\n• Grolla Seyfarth from the Rosenkreuzstilette series can perform dashes like Zero does from the Mega Man Zero in her side-game as she is his expy (as well as one to Rider). Pamela Arwig's dashing ability falls under this tropes as well.\n• Rocket Knight Adventures uses this extensively because Sparkster is actually wearing a jet-pack.\n• Castlevania: Symphony of the Night is (in)famous for the backwards variant, but later Castlevania games have characters who can dash in multiple directions.\n• Devil May Cry's Dante can do this when using the Trickster fighting style (when fully leveled up, Dante can use Dash up to three times in succession). Trickster also gives Dante access to, among other acrobatic maneuvers, Sky Star, an air dash.\n• Dante in Dm C Devil May Cry doesn't have a ground dash of this variety but he can boost through the air by jumping when he has an Angel weapon equipped.\n• A lot of modern fighting games allow doing this, such as Guilty Gear, Tatsunoko vs. Capcom or even Jump Super Stars.\n• Some of the adventurers in Recettear are able to dash by doubletapping the movement keys. They amount of movement they retain varies (e.g. Charme the Thief can still strafe, Nagi damages enemies she runs into). Some also have a Dash Attack which cause them to jump straight forward and damage anyone in the way.\n• Ratchet of, well, Ratchet & Clank obtains a power up in the game called the Charge Boots, which allow him to dash across short distances.\n• MapleStory has some skills which allow character to do this, though limited animation often forces them to stand upright from start to finish.\n• One of the basic movement abilities in Dragonica, with dash-jumping also implemented.\n• This occurs in Robot Unicorn Attack (original and Heavy Metal version) when the X button is pressed.\n• Sonic Unleashed has an air dash that can be upgraded to cover more distance when used.\n• A few characters in Super Smash Bros.. can do this as an attack. Fox, Falco and Wolf, most notably, but Ike also has a chargeable dash attack.\n• Don't forget about wave dashing in Melee (tapping the jump button and then air-dodging diagonally into the ground, allowing a character to slide a short distance without changing their stance). Despite being controversial and having various exploits, it looks like standard video game dashing. Except for Luigi, whose low traction results in him sliding ridiculously far.\n• Cloud has this as his normal running animation, as a nod to Dissidia Final Fantasy.\n• [PROTOTYPE] has a movement upgrade called the Air Dash, which allows you to shoot forward in the direction of your movement key. It's capable of receiving a boost in effect as an upgrade. Then there's the Double Air Dash and its subsequent boost upgrade.\n• A lot of fully charged melee attacks will send Alex lunging several paces forward. By the time you finish a melee combo with each attack fully charged, Alex may have moved the length of about a car to a couple of them.\n• Non-video game example: the main characters of Samurai Pizza Cats can continuously run like this. However, it doesn't apply in their Famicom game, which uses anime-style Wheel o' Feet for running animations instead.\n• A powerup in the first Wario Land game gives Wario a hat with horizontal jet boosters, which send him rocketing forward when he uses it (land and air alike).\n• Alice: Madness Returns introduces the Dodge move, allowing Alice to \"phase\" into an ethereal flutter of butterflies while propelling her several yards in one direction before finally materializing again.\n• In No More Heroes 2: Desperate Struggle, Henry's quick dash is one of his basic moves. Several must be linked together for faster motion.\n• Distorted Travesty uses dashing quite a lot, both to extend the range of jumps and to dodge enemy attacks or environmental obstacles. There is also a short-range dash if precision jumping is necessary. A powerup partway through allows the use of an air dash as well. You will learn to use them all effectively or you will never get anywhere in the game.\n• Every Unreal game to date has this in the form of the dodge ability, accessible via double-tap of a movement key. In some games, it can even be extended by jumping mid-dodge.\n• The Air Slide ability in the Kingdom Hearts series is a basic air dash. 3D ups the ante with the Sonic Impact and Double Impact abilities, which let you do up to three air dashes in a row, the second propelling you feet first so you can kick enemies. The Sliding Sidewinder/Cresent abilities allow the dashes to be chained into an attack.\n• Terra from Birth by Sleep is the only member of his game's trio with access to the ground-based Slide (as opposed to Aqua's Cartwheel and Ven employing the series-staple Dodge Roll). A later Command (Sonic Impact) allows Terra to chain together multiple Slides as well as use them as a charging attack.\n• All characters in the Magical Girl Lyrical Nanoha A's Portable games could perform a quick air dash with the X button at the cost of either one bar of the Sprint Meter (in the first game) or a certain amount of energy from their Mana Meter (in the second game).\n• Wryn from the indie game Bleed combines this with a special Quadruple Jump maneuver in one. You can propel yourself in any direction and change the arc of your jumps/dashes too.\n• Dragon Nest's Warrior class, and by extension all of its subclasses, have access to the Dash skill. Unlike most examples, it actually involves running fast instead of sliding along. It can be comboed into one of two Dash Attacks.\n• Hound Dog of Mad Stalker: Full Metal Force can perform a dash attack by using its thrusters and strike down foes with its sword; this attack can also be canceled by gurading, making it possible to boost your way through the stages much more quickly. In the remake of Mad Stalker, the game incorporates a dash button to get of tight situations or air-dash while in mid-air.\n• Rogue Legacy has a dash skill available if you buy the rune and equip it. It's one of the more useful runes, allowing the player further mobility, which comes in handy when traversing the castle.\n• In Pepsiman, the player can dash to run faster, plow through light obstacles and jump over the larger Bottomless Pits, with a \"whoosh\" sound effect.\n• Xoda Rap from Noitu Love 2: Devolution can perform a dash kick on ground or in mid-air.\n• A handful of League of Legends champions have this ability, including Shen, Graves, and Lucian.\n• In Environmental Station Alpha, the Dash Booster items allow you to Flash Step through enemies, red blocks and most obstables.\n• While sprinting in The Elder Scrolls is typically just a faster run which costs stamina, The Elder Scrolls V: Skyrim adds the Whirlwind Sprint Shout (WULD NAH KEST), which applies a sudden burst of speed with gravity not taking over until the Shout is done.\n• Every Titan in Titanfall can do this expending charges. The Ogre can do it once, the Atlas twice and the Stryder thrice.\n• Several units in Dawn of War can be upgraded to get a sudden burst of speed when engaging enemy units in melee and knocking them down (the Kroot leap instead, but the effect is the same).\n• Starcraft II adds a Charge ability to the Protoss Zealots, which gives them a huge speed boost when close to the enemy in order to get close.\n• The Tales Series calls dashes \"quicksteps\" though how much they fit this varies per game. It's most apparent in Tales of Graces which let you dash forward, backward and around enemies. Due to the speed of dashes compared to normal running, the negligible cost compared to free running, and the different defensive properties for each dash direction (forward dashes reflect projectiles and can also become a Dash Attack with certain skills, sidesteps are invincible to vertical strikes, and backdashes are invincible to horizontal strikes), this will eventually become the only way any player will move around.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/VideogameDashing", "media_links": ["/pmwiki/pmwiki.php/VideoGame/MegaManX", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsVSkyrim", "/pmwiki/pmwiki.php/VideoGame/MegaManX", "/pmwiki/pmwiki.php/VideoGame/MegaMan", "/pmwiki/pmwiki.php/VideoGame/MegaManXCommandMission", "/pmwiki/pmwiki.php/VideoGame/MegaManZero", "/pmwiki/pmwiki.php/VideoGame/MegaManZX", "/pmwiki/pmwiki.php/VideoGame/MegaManAndBass", "/pmwiki/pmwiki.php/VideoGame/MegaManLegends", "/pmwiki/pmwiki.php/VideoGame/Rosenkreuzstilette", "/pmwiki/pmwiki.php/VisualNovel/FateStayNight", "/pmwiki/pmwiki.php/VideoGame/RocketKnightAdventures", "/pmwiki/pmwiki.php/VideoGame/CastlevaniaSymphonyOfTheNight", "/pmwiki/pmwiki.php/Franchise/Castlevania", "/pmwiki/pmwiki.php/VideoGame/DevilMayCry", "/pmwiki/pmwiki.php/VideoGame/DmCDevilMayCry", "/pmwiki/pmwiki.php/VideoGame/GuiltyGear", "/pmwiki/pmwiki.php/VideoGame/TatsunokoVsCapcom", "/pmwiki/pmwiki.php/VideoGame/JumpSuperStars", "/pmwiki/pmwiki.php/VideoGame/Recettear", "/pmwiki/pmwiki.php/VideoGame/RatchetAndClank", "/pmwiki/pmwiki.php/VideoGame/MapleStory", "/pmwiki/pmwiki.php/VideoGame/Dragonica", "/pmwiki/pmwiki.php/VideoGame/RobotUnicornAttack", "/pmwiki/pmwiki.php/VideoGame/SonicUnleashed", "/pmwiki/pmwiki.php/VideoGame/SuperSmashBros", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyVII", "/pmwiki/pmwiki.php/VideoGame/DissidiaFinalFantasy", "/pmwiki/pmwiki.php/VideoGame/Prototype", "/pmwiki/pmwiki.php/VideoGame/JettRocket", "/pmwiki/pmwiki.php/Anime/SamuraiPizzaCats", "/pmwiki/pmwiki.php/VideoGame/WarioLand", "/pmwiki/pmwiki.php/VideoGame/AliceMadnessReturns", "/pmwiki/pmwiki.php/VideoGame/NoMoreHeroes2DesperateStruggle", "/pmwiki/pmwiki.php/VideoGame/DistortedTravesty", "/pmwiki/pmwiki.php/VideoGame/Unreal", "/pmwiki/pmwiki.php/VideoGame/KingdomHearts", "/pmwiki/pmwiki.php/VideoGame/KingdomHearts3DDreamDropDistance", "/pmwiki/pmwiki.php/VideoGame/KingdomHeartsBirthBySleep", "/pmwiki/pmwiki.php/VideoGame/MagicalGirlLyricalNanohaAsPortable", "/pmwiki/pmwiki.php/VideoGame/Bleed", "/pmwiki/pmwiki.php/VideoGame/Vanquish", "/pmwiki/pmwiki.php/VideoGame/DragonNest", "/pmwiki/pmwiki.php/VideoGame/MadStalkerFullMetalForce", "/pmwiki/pmwiki.php/VideoGame/RogueLegacy", "/pmwiki/pmwiki.php/VideoGame/Pepsiman", "/pmwiki/pmwiki.php/VideoGame/NoituLove", "/pmwiki/pmwiki.php/VideoGame/LeagueOfLegends", "/pmwiki/pmwiki.php/VideoGame/EnvironmentalStationAlpha", "/pmwiki/pmwiki.php/Franchise/TheElderScrolls", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsVSkyrim", "/pmwiki/pmwiki.php/VideoGame/Titanfall", "/pmwiki/pmwiki.php/VideoGame/DawnOfWar", "/pmwiki/pmwiki.php/VideoGame/StarcraftII", "/pmwiki/pmwiki.php/VideoGame/TalesSeries", "/pmwiki/pmwiki.php/VideoGame/TalesOfGraces"], "non_media_links": ["/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/Main/UnnecessaryCombatRoll", "/pmwiki/pmwiki.php/Main/LimitedAnimation", "/pmwiki/pmwiki.php/Main/DashAttack", "/pmwiki/pmwiki.php/Main/JumpJetPack", "/pmwiki/pmwiki.php/Main/DenialOfDiagonalAttack", "/pmwiki/pmwiki.php/Main/ScarfOfAsskicking", "/pmwiki/pmwiki.php/Main/RuleOfCool", "/pmwiki/pmwiki.php/Main/UnnecessaryCombatRoll", "/pmwiki/pmwiki.php/Main/GlassCannon", "/pmwiki/pmwiki.php/Main/FragileSpeedster", "/pmwiki/pmwiki.php/Main/Expy", "/pmwiki/pmwiki.php/Main/StanceSystem", "/pmwiki/pmwiki.php/Main/FlashStep", "/pmwiki/pmwiki.php/Main/LeParkour", "/pmwiki/pmwiki.php/Main/FragileSpeedster", "/pmwiki/pmwiki.php/Main/BladeOnAStick", "/pmwiki/pmwiki.php/Main/FlashStep", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Main/WheelOFeet", "/pmwiki/pmwiki.php/Main/NintendoHard", "/pmwiki/pmwiki.php/Main/SprintMeter", "/pmwiki/pmwiki.php/Main/ManaMeter", "/pmwiki/pmwiki.php/Main/DoubleJump", "/pmwiki/pmwiki.php/Main/DashAttack", "/pmwiki/pmwiki.php/Main/BottomlessPits", "/pmwiki/pmwiki.php/Main/FlashStep", "/pmwiki/pmwiki.php/Main/MakeMeWannaShout", "/pmwiki/pmwiki.php/Main/MiniMecha", "/pmwiki/pmwiki.php/Main/DashAttack"]}