{"title": "Noob Bridge", "content": "These days, video games have pretty well-established genre conventions and standardized controls, so you can pick up most any game and have a general idea of how to play them. However, a lot of games also have their own unique aspects, especially to their control schemes, and their use is sometimes required to pass obstacles. Woe betide those people who just pick up a game and start playing it, though, without knowing about these things... some of which are clearly described in the accompanying manual, even.\n\nThe Trope Namer is the nickname of a crumbling bridge from Super Metroid—the first place in that game where use of the unique (even to the series) run button is required. A common story is that newbies who pick up the game often neglect that button and are stumped at how to pass the bridge. The term also metaphorically suggests a rite of passage that a newbie would have to undergo to become competent at a game.\n\nAnother fairly common example for this is Sheathe Your Sword, whenever it occurs in games that otherwise teach the player to slash/blast/nuke anything that moves (plus any important-looking stuff that does not move). As a result, the average player will not even be aware that there is a button for doing so.\n\nEuclid's Elements of Geometry includes an extremely old and surprisingly literal example: the fifth proposition is traditionally known as the \"Asses' Bridge \", because the diagram looks somewhat bridgelike and the proof is said to be the first one that is complex enough to scare off newbies to the subject.\n\nNot to be confused with a Broken Bridge, where completing a dungeon or level opens up a new area on the game map. Nor should it be confused with Noob Cave.\n\nContrast Antepiece, where a piece of level design clearly gives you a visual hint on how to overcome an early challenge and learn the game's mechanics in a low risk environment. Compare Skill Gate Character and Wake-Up Call Boss for other forms of \"player rite-of-passages\".\n• Super Metroid is the Trope Namer, described above. Players who grew up with later Metroid games are more likely to fall victim to this, as those games don't have a run button.\n• Though since the Dash button was described in the manual, the giant drop that required Wall Jumping to escape was a bigger noob bridge for people who started with the SNES game.\n• The game also has the \"Noob Tube\", a glass tube that needs to be shattered with a Power Bomb to pass. This is the only tube in the game that Power Bombs do this, and it's not the only way to get into Maridia. However, if one doesn't press start at the title screen, the subsequent montage of clips shows that this is possible, as well as several hidden (but never required) moves.\n• An even more basic one is that the series includes doors that are opened by shooting them. The start of Metroid Prime 3: Corruption puts the player in the hangar of a friendly space station and door shooting is required to progress. The game assumes that this is obvious but for new players it is not logical to shoot friendly-controlled doors in order to open them.\n• The Batman: Arkham Series has a New Game+ mode, which removes the onscreen prompts for countering enemy attacks and will seriously kick the butt of anyone who hasn't absolutely familiarised themselves with the surprisingly deep combat system. Seriously, people often find starting again on Hard Mode easier than the NG+ version of Normal Difficulty if only because of how easy it is to fall into the trap of relying too heavily on the onscreen prompts.\n• Call of Juarez: A certain jump near the beginning of episode VII requires you to grapple a branch with the whip, then shorten the whip to bring yourself upwards before swinging across to the ledge. The in-game tutorial never mentions that you can shorten or lengthen the whip when grappling, so players who don't bother to read manuals will likely get stuck on that part for a while.\n• New Dance Dance Revolution players often return their feet back to the center tile after each step, not knowing that there is no penalty for leaving one's feet on the panels. Even though this is something that several of the games point out in their respective tutorials, most people don't bother watching them, or the original Japanese text explaining this fact is untranslated. Watching even a semi-serious player will show that they don't return their feet to the center; no \"professional\" DDR player would be caught dead doing it. If you don't break out of this habit you won't be clearing songs beyond level 4 on the current difficulty scale of 1 through 20.\n• This stemmed from new players playing on 'Beginner' difficulty, which replaced the background music video with a simulation of a character dancing on the pad, moving their feet as each arrow scrolled down. Since the dancing figure always stood on the metal square in the middle of the pad and put its feet out and pulled them back for each arrow, new players assumed they were supposed to do the same thing.\n• Daytona USA has the third and final turn of the Beginner course in all games, which is a sharp turn that mandates powersliding through it to complete without losing a lot of speed. Unfortunately, new players of the original are not likely aware of how to powerslide and usually end up eating wall; the result is that an overwhelming majority of players run out of time before finishing the required laps because they slam into the wall every time. Daytona USA 2 alleviates this a little by showing a powersliding tutorial during the Attract Mode.\n• If you've never played Disgaea before, the first battle with Mid-Boss can be incredibly difficult because it's the first level where Geo Effects play a large role, as well as being the first level where you're supposed to use the throwing mechanic. If you forget that you can toss your troops to the Geo Effects rather than trying to get there normally, most of your team will be dead before you get a second turn.\n• In Donkey Kong Country 3: Dixie Kong's Double Trouble!, people commonly have trouble figuring out how to beat Squirt when playing for the first time. It turns out that as Ellie the elephant, you can suck water by pressing L (or Down+R in the GBA version) while standing next to a waterfall. Next, you can squirt the water back at Squirt's eyes by pressing R. Once you figure that out, the boss becomes easy.\n• There's also the probability that the player doesn't know that Kiddy can skip on water surfaces briefly by rolling from a ledge, which is the only way to reach some of the bonus rounds in some of the river stages. In terms of just completing the levels, however, this technique isn't vital.\n• Several custom levels for Doom require the player to use straferunning to move faster or jump over wide gaps. Straferunning itself is a glitch in the game's physics, and new players may not even know about it, or realize that using a glitch is necessary in a serious level.\n• Doom Troopers has the Waterfall in level 1. The bridge acts as a Bottomless Pit, insta-killing your character. However, dead Mooks will float, allowing you to use them as platforms.\n• In Dreamfall: The Longest Journey, the music puzzle that lets Zoe out of the caves into Marcuria has been known to cause lots of trouble for new players, who didn't realize that a certain item from the previous location could be picked up and used on the wall symbols (which only become visible if Zoe holds said item and are located in what looks like a dead end otherwise) to reproduce the melody hummed by random encounter enemies on said location.\n• Eternal Darkness has a room with a giant worm that will trap the player in an illusion and prevent them from progressing, unless they use the sneak button to move without it noticing them. The problem? Unlike most examples, this Noob Bridge occurs right at the very end of the game, and the game never required the use of the sneak button before. (And an earlier encounter with the same monster with another character suggested an entirely different solution)\n• In Eversion, many people get stuck in world 2 and fully learn how the mechanics work only when they reach world 3-4, especially in non-HD versions. That's because eversion points are invisible unless you're standing right on them, and people often ignore the eversion point in 1-1 when they walk over it.\n• Final Fantasy franchise:\n• Final Fantasy VI:\n• The first boss battle shows off the game's Active Time Battle system. The boss, a giant snail, periodically retracts it vulnerable head into its shell, forcing the player to wait in real time for it to re-emerge.\n• The first battle with Ultros can be almost impossible for players who haven't figured out to put their characters in the back row: if they haven't, Ultros can easily kill Banon with one of his attacks, the death of which means you lose the battle instantly.\n• Final Fantasy VII: Like its immediate predecessor, an early boss punishes the player for ignoring the Active Time Battle system by responding with a powerful Counter Attack while in a certain stance, forcing the player to wait in real time for the stance to end. Unfortunately, a bit of sloppy translation renders this a bit of a Guide Dang It!.\n• People new to Final Fantasy Tactics, or strategy games, will attempt a battle with just Ramza and Delita...not realizing that you can pick out your new units from a list.\n• Dorter Trade City is also a choke point for SRPG noobs, this being the first real battle where players have to deal with both vertically-oriented maps and ranged opponents, and that success can't necessarily be granted by rushing the enemy with your squires (general key to victory: bring black mages and an archer with you.)\n• Final Fantasy XII has two accessories that give a variety of benefits when equipped, but they mostly come at a heavy price. One accessory reduces your MP to zero and it can't be refilled until the item is removed and the other accessory gives the Silence status effect that can't be cured unless the item is taken off. Because most players saw the beneficial effects first and didn't bother to read past that, there were a ton of confused players asking on the internet why their character's MP was stuck at zero or why they could not remove Silence. This was a big case of read the damn item full description.\n• Golden Sun has sand waterfalls in the Very Definitely Final Dungeon which you can only cross by running. This is the only time in the game that running is required at all.\n• The Legend of Zelda:\n• People used to modern inventory systems that let you highlight even blank slots may be in for a shock in In the first game, press Start to bring up your inventory and you'll find you can only move the cursor to items you actually have and can use, not incomplete weapons or spaces where they're supposed to go later. So if you don't get any bombs when you start, but collect the bow and boomerang in the first dungeon, you may end up thinking the game is broken when you find you have more than one sub-weapon but aren't allowed to switch between them. You need to find an arrow for your new bow before you can select and use it, even though you may be savvy enough to remember that the bow uses rupees for ammo instead, which confounds things further.\n• The first mission in The Legend of Zelda: Link's Awakening is to retrieve Link's lost sword. Along the way, the player will encounter some Sea Urchins that they need to push out of the way in order to reach their destination. While pushing obstacles is not a new mechanic, pushing things with the shield, let alone pushing enemies that look like traps, is new at this point in the series. The game doesn't explicitly tell the player to do this, but rather has them piece together two different clues encountered just earlier: the tutorial in the library that teaches them how to push enemies with the shield (which could be easily missed) and the sign that warns them to not touch the Sea Urchins with their bare hands.\n• Marathon: You'll be stuck on \"Cold Fusion\" until you figure out that you can activate switches by shooting them with grenades. The game kind of hints at this by giving you a bunch of grenades (which you'll need if you've already fired all of yours), but it's possible some people might not figure it out immediately.\n• In Maze Of Galious, a gate blocks a corridor in the first dungeon, and it's not obvious how to open gates. (The way to do it is to stand next to the gate and hold down the direction control towards it for a certain amount of time.)\n• La-Mulana has a door you have to attack to open, in a fashion similar to the doors in Metroid.\n• Mega Man 4 has one in the form of the penultimate boss. Due to the height at which its weak spot is, good luck getting past him with just the standard P-Shooter. As Roahm Mythril demonstrates , the Charged Mega Buster has just enough reach to hit the weak spot; the uncharged form just can't quite reach. There is also the Drill Bomb's often overlooked \"remote detonation\" you can make it explode early by pushing B and Splash Damage properties making it the only other effective weapon to hit the weak point.\n• Meteos has Bavoom, which is very hard to use unless you use the speeder; and Hotted and Wiral, which are very hard to use without secondary ignitions. These two things are very important if you want to beat harder opponents.\n• Monster Hunter provides a distinct example in that the game as a whole is this. Charging in and challenging the games' titular monsters like one would for any other action game and just smashing buttons will get you killed. The action tends to be slower, more purposeful, and actually requires observation as well as patience. The sheer myriad of intricacies and nuances in gameplay mechanics can be incredibly daunting to any player, no matter how many action games they've played.\n• Nocturne: Rebirth has Hagall Hills, where the enemies will destroy the player unless they learn to at least use the skill tree system and the Familiar summoning system, among other mechanics. Unfortunately, most of the tutorials in the game are skippable, causing many players to struggle with this area.\n• In Papers, Please, on day 3, Jorji will arrive in your booth bearing absolutely no documentation whatsoever. It's plainly obvious that you're supposed to deny him entry, but without anything to use your denial stamp on, it's not so clear how. What the player needs to do is open the rulebook and use the discrepancy highlighter to highlight the rule that states that people trying to enter the country need a passport, and then highlight the empty countertop, which makes the Inspector dismiss Jorji. The game has received multiple updates attempting to make this clearer. Highlighting both rules in the rulebook and the countertop is required later on in the game. In particular, once you are required to provide a reason for denial.\n• Stealth in PAYDAY 2 tends to be a brick wall for newbies. New players tend to forget that walking around with bulky armor and highly visible guns will have them spotted by cameras and guards several yards away. Before the stealth mechanics were changed in an update, players new to stealth would also frequently forget that they couldn't answer more than 2 pagers unless they had the Smooth Talker skill and only that player with the skill was allowed to answer up to 4 pagers.\n• New Popn Music players on Battle Mode may not notice that they can attack their opponent by pressing their side's blue button. It is not uncommon to see two players in Battle Mode with attack gauges that stay at level 3 and never get used. Although outside of Japan, this is typically due to language barriers, as the game is mostly in Japanese.\n• In Prince of Persia, nearly all enemies can be defeated by waiting for them to step forward, then timing a strike before they can defend, so you can get through most of the game without ever learning how to parry. Until you hit Level 8 and encounter one guard who never steps forward.\n• Mastering all the myriad uses of the boxing glove gun in Rockin Kats is necessary to get anywhere in the game. In fact, the player can't even beat the first level without knowing about being to use it to rebound off the floor and grab and swing from things. Fortunately, if the player leaves the game on the title screen long enough, it shows them all the things that can be done with the boxing glove gun.\n• Sin and Punishment: If you're still using auto-aim by the time you get to Polestar at the end of Stage 2-2, stop. What many stuck players don't know is that auto-aim does less damage than manual-aimed shots, and will never do enough damage to reliably finish it off.\n• Examples from the Sonic the Hedgehog series:\n• Sonic and the Black Knight: The Will-O-Wisps are glowing blue orbs of energy that explode and can hurt you when hit. You're supposed to use the \"kick\" mechanic to kick them into things. Thing is, that mechanic is only really used twice in the main game, and those instances are easy to miss, so you might not even know you can when you find the Will-O-Wisps much more often in the post-game.\n• Sonic the Hedgehog (2006) In one part of Kingdom Valley, you play as Rouge and have to find three keys, one of which is behind a stained-glass window that can only be broken with Rouge's wall-bomb-plant move. Said move is never mentioned in the game or even in the instruction manual, and since this is the only time you actually have to use the move, you'll be more likely to discover it by blind luck than anything else.\n• In Sonic Lost World, Sonic has a mid-air kick rarely seen in previous games. While Omochao will explain the kick to you near the beginning of the game, Omochao can be turned off. It's also explained in the manual, but no one reads that. Those who turned him off or weren't paying attention will then be stuck in Silent Forest Act 1, where Sonic is required to defeat a group of spider robots to proceed, who are invulnerable to Sonic's normal jump attacks until they're kicked.\n• In Stealth Inc. 2: A Game of Clones, in order to get one of the clothing items, you need to place one teleporter on or near a switch and the other under a block. The problem is getting the teleporter under the block; there's a wall to the right of it, so you can't get on the right side and push it, and the gap is also too small to throw a teleporter between the block and the wall and then push the block onto it. The solution: stand next to the block and hold the \"place teleporter\" button, and the teleporter will automatically be placed under the block. You aren't told about this, and all other blocks in the game have enough space nearby that you CAN push the block onto the teleporter.\n• Street Fighter III: Parrying. While it is possible to get by the game without using this, God help you if you find yourself against a decent opponent, AI or human, who can bear you down back and forth one way or another.\n• In Super Mario Galaxy 2, there is a chasm early on in Supermassive Galaxy that must be cleared using the long jump. While the game explains in a nearby tutorial monitor on how to use the long jump, this still stumped some players as the long jump was not needed in the first Super Mario Galaxy and was absent in Super Mario Sunshine, meaning players who had just recently gotten into Super Mario platformers may easily become confused about what exactly to do to perform a long jump.\n• Team Fortress 2:\n• Several of the classes in the game have integral aspects to their playstyle that are not readily obvious to new players. So, when you see a soldier who never rocket jumps, a demoman who never charges his stickybombs, a pyro who never airblasts, or a heavy that doesn't jump before revving his minigun, you know the person hasn't played TF2 for very long.\n• Prior to the Tutorials, there was nothing in-game that told you how to use each class. This was ok for traditional FPS classes like the Soldier but for the Engineer, there was absolutely nothing on how to build buildings, collect metal from ammo, turning the building, and upgrading them by whacking. Compounding this was that since there wasn't a single player mode, you had to jump into a live server, and promptly get kicked when you haven't immediately set up a sentry. Later tutorials mitigated this by not only including an engineer-specific tutorial, but also by including a single-player map that let the player figure things out.\n• Its predecessor, Team Fortress Classic has a similar problem, plus the in-game weapon models are much less obvious as to which weapons deal more damage. Thus, you get a lot of new players who use in combat whatever weapon the class spawns holding, be it the (all generally useless against enemy players) Engineer's railgun, Pyro's flamethrower, or Medic's Super nailgun.\n• Tomb Raider examples:\n• Tomb Raider: The Prophecy: In the Angkor Wat area, you have to sprint and long-jump to get to a certain door in time. Didn't know about the sprint button? Enjoy being stuck.\n• In Tomb Raider, there's an area where Lara must make a long jump into a pool of water far below. There is only a small square of space in the pool that isn't so shallow that it would lead to a lethal fall. However, even a perfectly executed running jump cannot reach it. This is the only point in the game where she absolutely must perform a dive while jumping (which previously seemed like only a cosmetic addition) in order to reach the small square of deep water.\n• Tomb Raider III adds the ability to sprint and the ability to crouch. You will need to learn to do both for the sake of timed runs and certain boulder traps, which can only be dodged by having Lara sprint towards them before ducking beneath a step on their path.\n• In Undertale:\n• The first boss fight is meant to teach players who are trying to spare monsters that you have to experiment your approach in giving monsters mercy rather than doing one strategy over and over (an NPC several minutes earlier tells you this as well). Players that didn't know how to spare the first boss would try to attack her until her HP was low enough and then try to spare her. The game is specifically programmed to make your next hit be the killing blow if the enemy's HP is at a certain low threshold since you're not supposed to attack everyone and then try to spare them, which would defeat the point of giving mercy.\n• Many players are slow to grasp that the only way to spare Undyne is to run from battle. Not only does no other encounter in the game require the player to flee even in a Pacifist Run, and not only is fleeing not even an option in most Boss Battles (as any player would expect), but Undyne's very first action in battle is to temporarily prevent you from fleeing.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/NoobBridge", "media_links": ["/pmwiki/pmwiki.php/VideoGame/SuperMetroid", "/pmwiki/pmwiki.php/VideoGame/SuperMetroid", "/pmwiki/pmwiki.php/VideoGame/MetroidPrime3Corruption", "/pmwiki/pmwiki.php/VideoGame/BatmanArkhamSeries", "/pmwiki/pmwiki.php/VideoGame/CallOfJuarez", "/pmwiki/pmwiki.php/VideoGame/DanceDanceRevolution", "/pmwiki/pmwiki.php/VideoGame/DaytonaUSA", "/pmwiki/pmwiki.php/Franchise/Disgaea", "/pmwiki/pmwiki.php/VideoGame/DisgaeaHourOfDarkness", "/pmwiki/pmwiki.php/VideoGame/DonkeyKongCountry3DixieKongsDoubleTrouble", "/pmwiki/pmwiki.php/VideoGame/Doom", "/pmwiki/pmwiki.php/VideoGame/DoomTroopers", "/pmwiki/pmwiki.php/VideoGame/DreamfallTheLongestJourney", "/pmwiki/pmwiki.php/VideoGame/EternalDarkness", "/pmwiki/pmwiki.php/VideoGame/Eversion", "/pmwiki/pmwiki.php/Franchise/FinalFantasy", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyVI", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyVII", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyTactics", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyXII", "/pmwiki/pmwiki.php/VideoGame/GoldenSun", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZelda", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaI", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaLinksAwakening", "/pmwiki/pmwiki.php/VideoGame/Marathon", "/pmwiki/pmwiki.php/VideoGame/MazeOfGalious", "/pmwiki/pmwiki.php/VideoGame/LaMulana", "/pmwiki/pmwiki.php/VideoGame/MegaMan4", "/pmwiki/pmwiki.php/VideoGame/Meteos", "/pmwiki/pmwiki.php/VideoGame/MonsterHunter", "/pmwiki/pmwiki.php/VideoGame/NocturneRebirth", "/pmwiki/pmwiki.php/VideoGame/PapersPlease", "/pmwiki/pmwiki.php/VideoGame/PAYDAY2", "/pmwiki/pmwiki.php/VideoGame/PopnMusic", "/pmwiki/pmwiki.php/VideoGame/PrinceOfPersia1", "/pmwiki/pmwiki.php/VideoGame/RockinKats", "/pmwiki/pmwiki.php/VideoGame/SinAndPunishment", "/pmwiki/pmwiki.php/VideoGame/SonicTheHedgehog", "/pmwiki/pmwiki.php/VideoGame/SonicAndTheBlackKnight", "/pmwiki/pmwiki.php/VideoGame/SonicTheHedgehog2006", "/pmwiki/pmwiki.php/VideoGame/SonicLostWorld", "/pmwiki/pmwiki.php/VideoGame/StealthBastard", "/pmwiki/pmwiki.php/VideoGame/StreetFighterIII", "/pmwiki/pmwiki.php/VideoGame/SuperMarioGalaxy2", "/pmwiki/pmwiki.php/VideoGame/SuperMarioGalaxy", "/pmwiki/pmwiki.php/VideoGame/SuperMarioSunshine", "/pmwiki/pmwiki.php/VideoGame/TeamFortress2", "/pmwiki/pmwiki.php/VideoGame/TeamFortressClassic", "/pmwiki/pmwiki.php/Franchise/TombRaider", "/pmwiki/pmwiki.php/Franchise/TombRaider", "/pmwiki/pmwiki.php/VideoGame/TombRaiderIII", "/pmwiki/pmwiki.php/VideoGame/Undertale"], "non_media_links": ["/pmwiki/pmwiki.php/Main/StockControlSettings", "/pmwiki/pmwiki.php/Main/ReadTheFreakingManual", "/pmwiki/pmwiki.php/Main/TropeNamer", "https://metroid.wikia.com/wiki/N00b_bridge", "/pmwiki/pmwiki.php/Main/SheatheYourSword", "/pmwiki/pmwiki.php/Main/DieChairDie", "/pmwiki/pmwiki.php/Main/OlderThanDirt", "http://en.wikipedia.org/wiki/Pons_asinorum", "/pmwiki/pmwiki.php/Main/BrokenBridge", "/pmwiki/pmwiki.php/Main/NoobCave", "/pmwiki/pmwiki.php/Main/Antepiece", "/pmwiki/pmwiki.php/Main/ShowDontTell", "/pmwiki/pmwiki.php/Main/SkillGateCharacter", "/pmwiki/pmwiki.php/Main/WakeUpCallBoss", "/pmwiki/pmwiki.php/Main/TropeNamer", "/pmwiki/pmwiki.php/Main/SharkTunnel", "/pmwiki/pmwiki.php/Main/NewGamePlus", "/pmwiki/pmwiki.php/Main/TimedMission", "/pmwiki/pmwiki.php/Main/AttractMode", "/pmwiki/pmwiki.php/Main/GeoEffects", "/pmwiki/pmwiki.php/Main/GeoEffects", "/pmwiki/pmwiki.php/Main/DiagonalSpeedBoost", "/pmwiki/pmwiki.php/Main/GoodBadBugs", "/pmwiki/pmwiki.php/Main/BottomlessPit", "/pmwiki/pmwiki.php/Main/Mooks", "/pmwiki/pmwiki.php/Main/NoobBridge", "/pmwiki/pmwiki.php/Main/ActiveTimeBattle", "/pmwiki/pmwiki.php/Main/ActiveTimeBattle", "/pmwiki/pmwiki.php/Main/CounterAttack", "/pmwiki/pmwiki.php/Main/GuideDangIt", "/pmwiki/pmwiki.php/Main/WakeUpCallBoss", "/pmwiki/pmwiki.php/Main/ReadTheFreakingManual", "/pmwiki/pmwiki.php/Main/SandIsWater", "/pmwiki/pmwiki.php/Main/VeryDefinitelyFinalDungeon", "/pmwiki/pmwiki.php/Main/FanNickname", "/pmwiki/pmwiki.php/LetsPlay/RoahmMythril", "https://youtu.be/Ai7Gbcdvkck?t=12m13s", "/pmwiki/pmwiki.php/Main/ChargedAttack", "/pmwiki/pmwiki.php/Main/SplashDamage", "/pmwiki/pmwiki.php/Main/Familiar", "/pmwiki/pmwiki.php/Main/TimeLimitBoss", "/pmwiki/pmwiki.php/Main/ReadTheFreakingManual", "/pmwiki/pmwiki.php/Main/ViolationOfCommonSense", "/pmwiki/pmwiki.php/Main/PacifistRun", "/pmwiki/pmwiki.php/Main/BossBattle"]}