{"title": "Peek-a-Bogeyman", "content": "The Peek A Bogeyman is one level more harmless than the Harmless Villain. He's (almost always) a cartoon monster who is more of a jerk than \"evil\". He takes advantage of the frightening image for which other more industrious of his kind have labored, and uses his existence to frighten people.\n\n\"Boo!\" And then he laughs when they run away. This is all he does. Sometimes it's his designated job. He probably wouldn't know what to do if someone wasn't frightened of him, which is often An Aesop.\n\nCharacters should be careful about what genre they are in, because true horror movie ghosts often pretend to be this to lull their so-called \"Genre Savvy\" prey into a false sense of security. Alternately, all it takes is one good scare to trigger a Fright Deathtrap.\n\nSometimes overlaps with Things That Go \"Bump\" in the Night, but not always. Often the foil of the Reluctant Monster. Compare to the Noble Demon, who is a more serious version of this. Shouldn't be confused with the real Bogeyman. Not to be confused with the actually scary Peek-a-Boo Corpse.\n• The Hamburglar in the McDonald's commercials once fit the Harmless Villain Trope, but sometime around the mid-80s they made him cuter, funnier, and friendlier, placing him in this Trope. The Goblins (later renamed the Fry Guys) were the same.\n• A decidedly adult spin is put on this trope in the XXXenophile story \"The Monster Under the Bed\".\n• The Disney/Pixar movie Monsters, Inc. was about a society of monsters that did this to gather power from the screams of frightened children.\n• This is what Shrek was in the beginning of his movie, more as a device to maintain his privacy.\n• The citizens of Halloween Town in The Nightmare Before Christmas scare people for fun. It's a tradition. The scale of meanness in the scaring varies from harmless (Jack) to sadistic (Oogie Boogie).\n• Stuart, Cyrus, and Judge in The Frighteners.\n• This is what the Harvesters in The Deaths of Ian Stone used to be, with a side order of Physical God—Emotion Eaters by nature, they instilled fear of themselves in humanity so they'd always have a ready supply of food. By the film's beginning, they've mostly abandoned this (having discovered the addictiveness of the fear humans feel in the moments before death), but Gray is still at it, keeping his conscience pure.\n• Schleppel the bogeyman in Reaper Man doesn't even do that. Other bogeymen hide under beds or in wardrobes and then leap out to scare people. Schleppel just stays there... at first.\n• In Hogfather, we meet the original bogeyman, who apparently used to be legitimately terrifying, but has had his power sapped by old age and younger pretenders sapping the amount of belief available for him to subsist on. As he grew old, he took the job of the Tooth Fairy, collecting children's teeth and keeping them safe so those teeth won't be used by someone trying sympathetic magic, which Archancellor Ridcully describes as \"Magic so ancient it's age of the world stuff\".\n• The bogeymen who are around these days are banished when their prey hides under bedclothes. As Feet of Clay demonstrates, the City Watch have a protocol of dealing with belligerent bogeymen by putting a blanket over the bogeyman's own head, thus giving it a brief existential crisis.\n• Luigi's Mansion:\n• The normal species of ghosts that hang from the ceiling in Luigi's Mansion. All they do is drop down to scare Luigi, and then vanish. (However, there is a subspecies that attacks with bombs.)\n• Blue ghosts also act like this; they pop out to scare Luigi, then run.\n• In the sequel Gold Greenies are like the Blue ghosts in the first game. (Except the two that come out of the hockey goal in the fourth mansion, which do attack.)\n• Tatara Kogasa from Touhou is probably the most harmless non-human in the whole franchise. She's a karakasa that eats surprise, and she always try to surprise people. However, she's actually pretty bad at it, and will sulk if she fails. Akyuu even suggested to the townspeople to pretend to be surprised just so they won't feel bad seeing her sulking. Other than harmless surprises, she doesn't actually attack any humans at all.\n• The Lurking Tempest from the Vortex Pinnacle dungeon in World of Warcraft It pretends to be dead when you're facing it, then pops up and flings lightning bolts when you're not.\n• Spend too long in the Krypt in Mortal Kombat 9, and the Krypt Monster will appear; he's an ugly looking guy, but all he does is scare the player and run away. He sometimes even leaves a few Koins.\n• Squidge the Bogey from Tales of the Questor. It's implied that his people have an entire culture/economy based around scaring children and extorting food and trinkets out of them.\n• SCP-650 of the SCP Foundation. It uses Offscreen Teleportation to teleport behind its victim, then waits for the person to turn around and freak out upon seeing it. And if you've gotten used to that, it'll start getting creative; it's been reported it has been acting innocuously to people that got used to it, and in one instance it popped into a visible corner, looking terrified of a nonexistant something right behind the person it was trying to scare.\n• Other ghosts besides Casper the Friendly Ghost in any medium he appears in. In fact, scaring is Serious Business.\n• The Flying Dutchman of SpongeBob SquarePants is sometimes shown as just wanting to scare people. Other times, he's done things like forcing people to be his crew members, eating them, and carrying the dead to Davey Jones' locker.\n• Any and all ghosts in Filmation's Ghostbusters dabble into this from time to time, though Prime Evil despises the entertainment value of fear for humans and the ghosts who don't go all the way into outright bullying and intimidation tactics. And depending on how much an episode tries to be kid-friendly, he can forsake scares entirely and get into typical villain world domination stuff including brainwashing, terrorism, attempted mass murder, zombie-making bombs,ghost-making gasses, the list goes on...\n• A Real Life example would be any dressed-up worker at a haunted house, mostly because of the fact that they aren't allowed to touch people, for obvious reasons.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/PeekABogeyman", "media_links": ["/pmwiki/pmwiki.php/ComicBook/XXXenophile", "/pmwiki/pmwiki.php/WesternAnimation/MonstersInc", "/pmwiki/pmwiki.php/WesternAnimation/Shrek", "/pmwiki/pmwiki.php/WesternAnimation/TheNightmareBeforeChristmas", "/pmwiki/pmwiki.php/Film/TheFrighteners", "/pmwiki/pmwiki.php/Film/TheDeathsOfIanStone", "/pmwiki/pmwiki.php/VideoGame/LuigisMansion", "/pmwiki/pmwiki.php/VideoGame/LuigisMansion", "/pmwiki/pmwiki.php/VideoGame/LuigisMansionDarkMoon", "/pmwiki/pmwiki.php/VideoGame/Touhou", "/pmwiki/pmwiki.php/VideoGame/WorldOfWarcraft", "/pmwiki/pmwiki.php/VideoGame/MortalKombat9", "/pmwiki/pmwiki.php/Webcomic/TalesOfTheQuestor", "/pmwiki/pmwiki.php/WesternAnimation/CasperTheFriendlyGhost", "/pmwiki/pmwiki.php/WesternAnimation/AaahhRealMonsters", "/pmwiki/pmwiki.php/WesternAnimation/SpongeBobSquarePants", "/pmwiki/pmwiki.php/WesternAnimation/FilmationsGhostbusters"], "non_media_links": ["/pmwiki/pmwiki.php/Main/HarmlessVillain", "/pmwiki/pmwiki.php/Main/PunchclockVillain", "/pmwiki/pmwiki.php/Main/AnAesop", "/pmwiki/pmwiki.php/Main/WrongGenreSavvy", "/pmwiki/pmwiki.php/Main/FrightDeathtrap", "/pmwiki/pmwiki.php/Main/ThingsThatGoBumpInTheNight", "/pmwiki/pmwiki.php/Main/ReluctantMonster", "/pmwiki/pmwiki.php/Main/NobleDemon", "/pmwiki/pmwiki.php/Main/ThingsThatGoBumpInTheNight", "/pmwiki/pmwiki.php/Main/PeekABooCorpse", "/pmwiki/pmwiki.php/UsefulNotes/McDonalds", "/pmwiki/pmwiki.php/Main/HarmlessVillain", "/pmwiki/pmwiki.php/Main/ComicBooks", "/pmwiki/pmwiki.php/Main/PhysicalGod", "/pmwiki/pmwiki.php/Main/EmotionEater", "/pmwiki/pmwiki.php/Main/MySpeciesDothProtestTooMuch", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Discworld/ReaperMan", "/pmwiki/pmwiki.php/Discworld/Hogfather", "/pmwiki/pmwiki.php/Main/GodsNeedPrayerBadly", "/pmwiki/pmwiki.php/Discworld/FeetOfClay", "/pmwiki/pmwiki.php/Main/PuffOfLogic", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/MoneySpider", "/pmwiki/pmwiki.php/Main/Karakasa", "/pmwiki/pmwiki.php/Main/EmotionEater", "/pmwiki/pmwiki.php/Main/MrExposition", "http://www.wowhead.com/npc=45704", "/pmwiki/pmwiki.php/Main/WebComics", "/pmwiki/pmwiki.php/Main/WebOriginal", "http://www.scp-wiki.net/scp-650", "/pmwiki/pmwiki.php/Wiki/SCPFoundation", "/pmwiki/pmwiki.php/Main/OffscreenTeleportation", "/pmwiki/pmwiki.php/Main/NothingIsScarier", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/SeriousBusiness", "/pmwiki/pmwiki.php/Main/SapientEatSapient", "/pmwiki/pmwiki.php/Main/Psychopomp", "/pmwiki/pmwiki.php/Main/DependingOnTheWriter", "/pmwiki/pmwiki.php/Main/NotSoHarmlessVillain", "/pmwiki/pmwiki.php/Main/NeverSayDie", "/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/Main/RealLife"]}