{"title": "Photoshop Filter of Evil", "content": "Photoshop Filter of Evil is a trope about when a news program and/or documentary shows a photo of a criminal/victim in color, then shows a eerie black and white/negative of the photo to emphasize something malevolent about the person. Often combined with a slow zoom on the subject's now-black eyes, just to spotlight the creepiness.\n\nYou'll also hear a sound effect as the photo switches filters, like someone is throwing the giant \"make negative\" lever. Usually something like a giant clunk, followed by the sound of rusty nails on a blackboard.\n\nSomething very close to this actually happens in real life, as anyone who has had the lights suddenly go out on them can attest; the latent image on the retina tends to be chroma-inverted due to \"bleaching\" of the rod cells.\n\nSee also Deliberately Monochrome, Red Filter of Doom.\n• Many political advertisements make extensive use of this trope, often through using an unflattering photo of the candidate being targeted on a particular issue or by a particular campaign. Many times, the photo will be hazy or, while zooming in, will appear grainy to the viewer. Other times, the photo will be cropped from a video, frozen at a particular frame to make the candidate look physically bad.\n• The History Channel lives, breathes, and eats this trope. Monster Quest has had a reenacted first wild hog perspective attack or three, where the post-production crew apparently felt little shame applying a desaturation filter and jarring piano chords. Ice Road Truckers even does this for accidents or ice cracks.\n• Notorious example: TIME Magazine did the desaturation and edge burn bit on a photograph of O.J. Simpson, in addition to resizing and moving the man's prisoner ID number. The resulting image made O.J. Simpson's skin appear darker and gave a heavy vignette. The manipulation became extremely obvious when Newsweek used the same photo with accurate color, resulting in a side-by-side comparison when the two magazines were displayed together at newsstands. This was met with significant outcry. TIME would eventually issue an apology for the cover.\n• A variant is the Fox News Channel showing obviously altered photos of New York Times reporters they accused of being \"attack dogs\".\n• Martin Bryant, perpetrator of the Port Arthur Massacre, was represented in the media with a picture that had been digitally altered to look like an Evil Albino. One would think the fact he murdered 35 people would be enough to turn the public against him...\n• People that Stephen Colbert has decided are \"destroying America\" often get this treatment.\n• Elizabeth Short, The Black Dahlia, has this done to her photo quite often on documentaries. It's usually meant to add chilling eeriness, emphasizing the way she was gruesomely murdered and severed. It's not applied to the actual crime scene photos, mind you, but her vanity head shot.\n• A popular variant on Australian tabloid television is to slow footage to ~6 frames/second.\n• The method is Older Than Television, though was used not as a trope, but as a prank. R.W. Wood once asked a young lady to pose for a photo to be printed in Encyclopædia Brittanica article he was writing. She was flattered, but had no idea he's the trailblazer of IR and UV photography, the article is about fluorescence, and her photo is going to look like this .\n• The Wii has this filter in the Photo Channel complete with a dramatic shock sound effect.\n• The DVD release of the Higurashi: When They Cry anime used this effect on the cover art to emphasize that this is a dark, violent show. The sleeves are reversible so that you can display the cute, colorful artwork from the original Japanese release if you want.\n• An early episode of The Chaser's War on Everything has the group lampshading and spoofing this trope by using the same technique on the Australian PM. Hilarity Ensues.\n• Parodied in Dave Barry Hits Below the Beltway, where two political candidates running against each other each show their opponent in hideous and increasingly libelous grainy black-and-white photographs, escalating to showing them shaking hands with Hitler and Darth Vader respectively.\n• Homestar Runner:\n• Used on Original Bubs in the Strong Bad Email \"original\", as Strong Bad describes the \"bubbling pit of crude turmoil\" lurking behind the scenes. It goes greyscale, too.\n• Lampshaded in an episode of Strong Bad's Cool Game for Attractive People. When Strong Bad sees part of a marathon of rockumentaries in \"Baddest of the Bands\", he observes \"Uh-oh, they did that inverted negative photo thing; somebody's going to rehab.\"\n• A minor Easter Egg from Homestuck features a wacky (mildly crude) sound clip of Nicolas Cage from Snake Eyes with transformations making it into something a bit... disturbing. The visual accompaniment uses an effect much like this, except it's not a photonegative (rather, the image's color is distorted and JPEG artifacts become exaggerated).\n• In My Little Pony: Equestria Girls (2013), Sunset Shimmer's attack ad meant to discredit Twilight Sparkle as a candidate for Princess of the Fall Formal features this over footage of Twilight's clumsy attempts to do research in the school library.\n• My Little Pony: Friendship Is Magic has this in \"For Whom The Sweetie Belle Toils\" just before Luna shows Sweetie Belle the Bad Future.\n• Parodied by The Non-Adventures of Wonderella here .\n• In Plumbers Don't Wear Ties, the developers apparently just got Photoshop and were playing with it while making the game. The result: Tons of filtered photos in ridiculously random places.\n• Resident Evil 3: Nemesis has the entire screen pause and go to photonegative when faced with a Live Selection: where you're given two options to deal with an impending threat. Played most straight with the titular Nemesis' first appearance after it murders Brad right in front of you.\n• Resident Evil 5 uses a color negative filter when a character goes into Dying status.\n• Used for horror in film in Ringu, as it happens every time somebody dies by .\n• 10 O'Clock Live often mock the papers doing this. Like having cleric Abu Qatada depicted as some sort of nuclear cloud or having Nick Clegg as an amoeba.\n• The Yarudora series uses this trope a few times in several of its games.\n• Double Cast, the 1st game, uses it during a sequence of the Genocide Route, when the protagonist and Haruka discover Shoko's body in her bathtub , and confirm, to their horror, her death ;\n• Sampaguita, the 3rd game, uses it on two occasions:\n• On the game's box cover , although it's done to symbolize the mystery behind Maria and her memories, as she's not evil.\n• And during the game, when the protagonist gets fatally shot while protecting his lover Maria with his body , in Good End 3 and Normal End 2 .\n• The Onion: The cheap trick of reversing the colors of a photo to make the subject look creepy is spoofed among many other examples of Manipulative Editing in the manufactured satirical crime story \"Man Had Sex With Wife Thousands Of Times Before Killing Her \".", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/PhotoshopFilterOfEvil", "media_links": ["/pmwiki/pmwiki.php/Webcomic/TheNonAdventuresOfWonderella", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/Creator/FoxNewsChannel", "/pmwiki/pmwiki.php/Creator/StephenColbert", "/pmwiki/pmwiki.php/VisualNovel/HigurashiWhenTheyCry", "/pmwiki/pmwiki.php/Series/TheChasersWarOnEverything", "/pmwiki/pmwiki.php/Creator/DaveBarry", "/pmwiki/pmwiki.php/VideoGame/StrongBadsCoolGameForAttractivePeople", "/pmwiki/pmwiki.php/Webcomic/Homestuck", "/pmwiki/pmwiki.php/Creator/NicolasCage", "/pmwiki/pmwiki.php/Film/SnakeEyes", "/pmwiki/pmwiki.php/WesternAnimation/MyLittlePonyEquestriaGirls2013", "/pmwiki/pmwiki.php/WesternAnimation/MyLittlePonyFriendshipIsMagic", "/pmwiki/pmwiki.php/Webcomic/TheNonAdventuresOfWonderella", "/pmwiki/pmwiki.php/VisualNovel/PlumbersDontWearTies", "/pmwiki/pmwiki.php/VideoGame/ResidentEvil3Nemesis", "/pmwiki/pmwiki.php/VideoGame/ResidentEvil5", "/pmwiki/pmwiki.php/Film/Ringu", "/pmwiki/pmwiki.php/Series/TenOClockLive", "/pmwiki/pmwiki.php/VisualNovel/Yarudora", "/pmwiki/pmwiki.php/VisualNovel/DoubleCast", "/pmwiki/pmwiki.php/VisualNovel/Sampaguita", "/pmwiki/pmwiki.php/Website/TheOnion"], "non_media_links": ["/pmwiki/pmwiki.php/Main/TheKenBurnsEffect", "/pmwiki/pmwiki.php/Main/RealityIsUnrealistic", "/pmwiki/pmwiki.php/Main/TruthInTelevision", "/pmwiki/pmwiki.php/Main/DeliberatelyMonochrome", "/pmwiki/pmwiki.php/Main/RedFilterOfDoom", "/pmwiki/pmwiki.php/Main/JawsFirstPersonPerspective", "/pmwiki/pmwiki.php/UsefulNotes/OJSimpson", "/pmwiki/pmwiki.php/Main/UnfortunateImplications", "http://blogcritics.org/ojs-last-run-a-tale-of/", "http://mediamatters.org/research/2008/07/02/fox-news-airs-altered-photos-of-ny-times-report/143921", "/pmwiki/pmwiki.php/Main/EvilAlbino", "/pmwiki/pmwiki.php/Main/OlderThanTelevision", "http://www.eskimo.com/~nickz/uv/img/UVlensFluorescence.jpg", "/pmwiki/pmwiki.php/UsefulNotes/Wii", "/pmwiki/pmwiki.php/Main/HilarityEnsues", "/pmwiki/pmwiki.php/WebAnimation/HomestarRunner", "/pmwiki/pmwiki.php/WebAnimation/StrongBadEmail", "/pmwiki/pmwiki.php/Recap/StrongbadEmailE177Original", "/pmwiki/pmwiki.php/Main/LampshadeHanging", "/pmwiki/pmwiki.php/Main/EasterEgg", "http://www.mspaintadventures.com/?s=6&p=darkcage", "/pmwiki/pmwiki.php/Main/AttackOfThePoliticalAd", "/pmwiki/pmwiki.php/Main/BadFuture", "http://nonadventures.com/2008/09/06/electoral-dysfunction/", "/pmwiki/pmwiki.php/Main/ImplacableMan", "/pmwiki/pmwiki.php/UsefulNotes/NickClegg", "/pmwiki/pmwiki.php/Main/KillThemAll", "/pmwiki/pmwiki.php/Main/BadEnd", "/pmwiki/pmwiki.php/Main/BloodIsSquickerInWater", "https://static.tvtropes.org/pmwiki/pub/images/sampaguita_cover_1118.png", "/pmwiki/pmwiki.php/Main/TheHeroDies", "/pmwiki/pmwiki.php/Main/TakingTheBullet", "/pmwiki/pmwiki.php/Main/ManipulativeEditing", "https://www.youtube.com/watch?v=apwjgE0n9fc"]}