{"title": "Dive! Dive! Dive!", "content": "Stock Phrases used on submarines or anything to do with something going down. Commonly used in a panicky, unrealistic way to indicate that the submariners are in trouble or need to escape.\n\nNot to be confused with Attack! Attack! Attack! or Tora! Tora! Tora!.\n• Madagascar: \"Hoover Dam! We're still in New York. Abort mission! Dive, dive!\"\n• Both Shrek and Donkey say this to Dragon during an Aerial Canyon Chase scene in Shrek 4-D (the 3-D Movie that plays at Universal Studios).\n• In Flash Gordon PRINCE VULTAN gives the order \"SQUADRON FORTYYYYY! DIIIVEE!\"\n• All submarine movies have a dive scene: K19: The Widowmaker, The Hunt for Red October, U571, Crimson Tide, The Enemy Below ... The Hunt for Red October also features an Inversion of this trope, with a submarine doing an \"Emergency Blow\" of its ballast tanks to send the submarine rocketing to the surface to avoid an incoming torpedo. This sends a 100 meter submarine bolting out of the water like a breaching whale while stunned sailors on the surface look on.\n• Rob Schneider in Down Periscope. \"Prepare for dive!\"\n• One of the reasons why Das Boot is so great: it plays the trope straight then subverts it when instead of being saved by diving, the submarine is endangered by the fact that it's sinking .\n• In a deleted scene in Austin Powers in Goldmember, Dr. Evil tried giving these types of commands, parroted by Frau Farbissina, tilting the sub every which way, until an unnamed officer gave some real commands. Dr. Evil even said he did it out of love for Das Boot, \"or as we call it in English... 'The Boot'\".\n• Heard in Run Silent, Run Deep on a couple of occasions, including once when it is cut off by the depth charge that sinks the submarine.\n• In Morning Departure, the Trojan dives in an attempt to avoid the Sea Mine, with disastrous consequences.\n• Averted in Alistair MacLean's novel Ice Station Zebra. Many scenes take place aboard a nuclear submarine, and the first time that it dives, the captain merely says \"Okay men, we're going down.\" The protagonist finds this rather disappointing.\n• In the \"Health and Safety\" episode of QI, Ross Noble got this as a buzzer.\n• An episode of NCIS that takes place aboard a submarine on a training exercise features both diving and an emergency blow.\n• The Bruce Dickinson song \"Dive Dive Dive\" is one long series of groan-inducing nautical Unusual Euphemisms for sex.\n• When the Wardog Squadron goes after Scinfaxi in Ace Combat 5: The Unsung War, it initially performs an emergency submersion, but is forced to break surface and emergency-submerge again to fire its missiles. Eventually, Wardog squadron inflicts so much damage that when they try to dive again, they can't: it would sink the ship.\n• DIVE DIVE DIVE HIT YOUR BURNERS PILOT!!! The immortal introduction to a mission in FreeSpace 2 that starts with you playing chicken of a huge alien Battlestar about to run you over.\n• Ed, Edd n Eddy: Ed says this when he swallows his video camera through its view.\n• Using this command in an urgent, panicky fashion used to be Truth in Television during the early years of submarine warfare, when the boats could only stay submerged for fairly short periods and travelled faster while on the surface. Being spotted by enemy aircraft was the boat's cue to commence a crash dive . Improved hydrodynamics and battery technology allowed more modern diesel-electric submarines to stay submerged for hours at a time and make better speed at snorkel depth than on the surface, and nuclear-powered vessels theoretically only need to surface to resupply and rotate their crews.\n• U.S. Navy fast-attack submarines really do make this announcement when commencing a dive (though generally with less emotion, as it's a routine command).\n• German U-boats used the word \"Alarm!\" to begin an emergency dive.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/DiveDiveDive", "media_links": ["/pmwiki/pmwiki.php/WesternAnimation/EdEddNEddy", "/pmwiki/pmwiki.php/Film/ToraToraTora", "/pmwiki/pmwiki.php/WesternAnimation/Madagascar", "/pmwiki/pmwiki.php/WesternAnimation/ShrekFourD", "/pmwiki/pmwiki.php/Ride/UniversalStudios", "/pmwiki/pmwiki.php/Film/FlashGordon1980", "/pmwiki/pmwiki.php/Creator/BrianBlessed", "/pmwiki/pmwiki.php/Film/K19TheWidowmaker", "/pmwiki/pmwiki.php/Film/TheHuntForRedOctober", "/pmwiki/pmwiki.php/Film/U571", "/pmwiki/pmwiki.php/Film/CrimsonTide", "/pmwiki/pmwiki.php/Film/TheEnemyBelow", "/pmwiki/pmwiki.php/Film/TheHuntForRedOctober", "/pmwiki/pmwiki.php/Film/DownPeriscope", "/pmwiki/pmwiki.php/Film/DasBoot", "/pmwiki/pmwiki.php/Film/AustinPowersInGoldmember", "/pmwiki/pmwiki.php/Film/DasBoot", "/pmwiki/pmwiki.php/Film/RunSilentRunDeep", "/pmwiki/pmwiki.php/Film/MorningDeparture", "/pmwiki/pmwiki.php/Literature/IceStationZebra", "/pmwiki/pmwiki.php/Series/QI", "/pmwiki/pmwiki.php/Series/NCIS", "/pmwiki/pmwiki.php/VideoGame/AceCombat5TheUnsungWar", "/pmwiki/pmwiki.php/VideoGame/FreeSpace2", "/pmwiki/pmwiki.php/WesternAnimation/EdEddNEddy"], "non_media_links": ["/pmwiki/pmwiki.php/Main/StockPhrases", "/pmwiki/pmwiki.php/Main/CoolBoat", "/pmwiki/pmwiki.php/Main/AttackAttackAttack", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/AerialCanyonChase", "/pmwiki/pmwiki.php/UsefulNotes/ThreeDMovie", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/NoIndoorVoice", "/pmwiki/pmwiki.php/Main/LampshadeHanging", "/pmwiki/pmwiki.php/Main/SeaMine", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/UnusualEuphemism", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/TheBattlestar", "/pmwiki/pmwiki.php/Main/WesternAnimation", "https://www.youtube.com/watch?v=R8VIAVkj6Do", "/pmwiki/pmwiki.php/Main/EatTheCamera", "/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/Main/TruthInTelevision", "https://en.wikipedia.org/wiki/Crash_dive", "/pmwiki/pmwiki.php/Main/TechnologyMarchesOn"]}