{"title": "Artillery Game", "content": "Green's attempts to tunnel through the terrain are impressive, but Red's shots are landing closer each time. Who will win?\n\nAn artillery game is a video game within the Strategy Game genre which tasks the player with aiming and shooting to destroy opponents in a combat simulation. Usually the playing field (or battlefield, if you will) is shown in a Side View, with two opposing factions concentrated on opposite sides. Each faction starts with one or more units, which may take the form of tanks, cannons, mortars, or other artillery pieces.\n\nThe player determines the angle and velocity of each shot before firing, hopefully adjusting for such factors as gravity and wind speed (among other factors). Successfully striking a unit may cause damage or instantly destroy the unit, and when all but one faction's forces are eliminated, that faction wins the battle.\n\nOther common features include randomly generated terrain and unit placement, as well as causing missed shots to blast holes wherever they land — which can lead to \"tunneling\" strategies where a player (over the course of several turns) shoots through (or down) a tall barrier in order to fire a high-powered shot directly at the opponent instead of attempting to lob shots over the obstruction. Because the task of the game is to come up with a winning combination of speed and angle, these games will often display visible trails from previous shots so the player can refine their aim on subsequent turns.\n\nMost examples of artillery games are Turn-Based Strategy by tradition, but there also exist several games played in real time instead. Turn-based games may also impose a time limit on each player's turn.\n• Angry Birds is a single-player version in which the player typically takes out the enemy pigs through collateral damage rather than direct hits.\n• Angry Birds 2 is the sequel, offering souped-up graphics, new gameplay options, and a more story-like feel than the original.\n• Artillery released in 1980 on the Apple ][ is the Ur-Example, expanding on prior text-based games with a graphical representation of the battlefield, as well as including wind speed as a factor for trajectories.\n• Artillery Duel, the first widely-popular installment in the genre.\n• The Avengers: Bunker Busters, another single-player game where the Avengers themselves are the projectiles!\n• for Windows 3.1, a one-on-one between two cartoonish cannons.\n• is a real-time artillery game with a first-person perspective, interspersed with obstacle navigation sequences.\n• and its sequels, which is another single-player version with a medieval theme.\n• Destruct, an Easter Egg within Tyrian, and one of the uncommon real-time examples.\n• , a BASIC program in which gorillas stand atop city buildings and fling exploding bananas.\n• Graphwar, where instead of directly controlling the angle or trajectory of your shot you type in a mathematical function which determines the path the shot takes.\n• , and the similar openn source game Slingshot, which replace tanks and terrain with spaceships and planetoids. The multiple gravitational sources make for complex trajectories.\n• Hedgewars, an open-source, freeware Worms clone with various added perks.\n• Hill Kill, an obscure single-player BASIC variant on the Apple ][. Unlike many variants, you are the only one shooting, with a single hill between you and the target house. Due to how hits are calculated, it is entirely possible to fire a shot straight at the house with enough velocity to skip right through the hill. On the flip side, this same mechanic can cause the shot to also go right past the house.\n• , a DOS game with two tiny tanks pegging at each other across a broad, hilly landscape. Site now M.I.A.\n• , a 3D update to Gravity Wars. The multiple gravitational sources in 3D make for extremely complex trajectories.\n• Pocket Tanks is based on Scorched Tanks, which is in turn based on Scorched Earth.\n• Scorched Earth and open-source Fan Sequel — the original, the self-proclaimed \"Mother of All Games\", is the best known example. Its multitude of play configuration options makes it the Trope Codifier.\n• ShellShock Live is about abstract tank warfare, and originally began as a Kongregate title, before eventually expanding into a full-blown Steam and Xbox One release.\n• Space Tanks is a Windows game where each tank is restricted to its own planetoid and must compensate for the gravity of other bodies to hit opponents.\n• from 2DPlay.com adds ammo types, shields, and unit movement to the basic concept.\n• — at least two separately-developed artillery games with this name exist. The link and current page image refer to the 1990 DOS version, also called \"BOMB\" from the name of the executable.\n• Worms has a comedic style with a diverse arsenal and lots of movement options.\n• Zee Artillery, aka ZART, is also a real-time example.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/ArtilleryGame", "media_links": ["/pmwiki/pmwiki.php/VideoGame/TankWars1990", "/pmwiki/pmwiki.php/VideoGame/AngryBirds", "/pmwiki/pmwiki.php/VideoGame/AngryBirds2", "/pmwiki/pmwiki.php/VideoGame/AngryBirdsStarWars", "/pmwiki/pmwiki.php/Franchise/StarWars", "/pmwiki/pmwiki.php/VideoGame/ArtilleryDuel", "/pmwiki/pmwiki.php/VideoGame/TheAvengersBunkerBusters", "/pmwiki/pmwiki.php/WesternAnimation/TheAvengersEarthsMightiestHeroes", "/pmwiki/pmwiki.php/VideoGame/Tyrian", "/pmwiki/pmwiki.php/VideoGame/Graphwar", "/pmwiki/pmwiki.php/VideoGame/Gunbound", "/pmwiki/pmwiki.php/VideoGame/Hedgewars", "/pmwiki/pmwiki.php/VideoGame/PocketTanks", "/pmwiki/pmwiki.php/VideoGame/ScorchedEarth", "/pmwiki/pmwiki.php/VideoGame/ShellshockLive", "/pmwiki/pmwiki.php/Website/Kongregate", "/pmwiki/pmwiki.php/VideoGame/Worms", "/pmwiki/pmwiki.php/VideoGame/ZeeArtillery"], "non_media_links": ["/pmwiki/pmwiki.php/Main/StrategyGame", "/pmwiki/pmwiki.php/Main/SideView", "/pmwiki/pmwiki.php/Main/PlayerVersusPlayer", "/pmwiki/pmwiki.php/Main/TankGoodness", "/pmwiki/pmwiki.php/Main/HitPoints", "/pmwiki/pmwiki.php/Main/OneHitPointWonder", "/pmwiki/pmwiki.php/Main/RandomlyGeneratedLevels", "/pmwiki/pmwiki.php/Main/EverythingBreaks", "/pmwiki/pmwiki.php/Main/TurnBasedStrategy", "/pmwiki/pmwiki.php/Main/RealTimeStrategy", "/pmwiki/pmwiki.php/UsefulNotes/AppleII", "/pmwiki/pmwiki.php/Main/UrExample", "/pmwiki/pmwiki.php/Main/CatapultToGlory", "http://theodor.lauppert.ws/games/bangbang.htm", "http://en.wikipedia.org/wiki/Beach_Head_%28video_game%29", "http://armorgames.com/play/3614/crush-the-castle", "/pmwiki/pmwiki.php/Main/EasterEgg", "http://en.wikipedia.org/wiki/Gorillas_%28video_game%29", "http://www.gravitywars.co.uk/", "/pmwiki/pmwiki.php/UsefulNotes/AppleII", "http://theodor.lauppert.ws/games/howitzer.htm", "http://www.mammothgravitybattles.com/", "/pmwiki/pmwiki.php/Main/FanSequel", "http://www.scorched3d.co.uk/", "/pmwiki/pmwiki.php/Main/TropeCodifier", "http://www.killsometime.com/games/4197/Tanks", "http://theodor.lauppert.ws/games/tankwars.htm"]}