{"title": "Forgot to Gag Him", "content": "At long last, Captain Superhero has been captured by your clever traps! His superpowers are entirely nullified, and he's tied up with specially-prepared Unobtainium-bonds that you know for a fact that he couldn't break even if he got his powers back somehow. He's completely immobilized and helpless! Heck, you'd Just Shoot Him if it wasn't for certain unavoidable, external factors...\n\n...what, GAG him? That's a touch too kinky. Wouldn't want people to get a Foe Yay vibe here, would we? Besides, it's not like he can cast spells or unleash destructive, supersonic yells or anything like that. All he can do is talk. Heck, maybe listening to him ranting about your Evil Plan or begging for his life could be kinda' fun.\n\nAlthough... what he's saying sorta makes sense... and your most faithful retainer seems to be spending a lot of time listening to him, for some reason... well, what's the worst that could happen, really?\n\nThis is a situation where the hero's been captured and immobilized, but he's still got the use of his mouth, and proceeds to talk his way out of trouble. What, exactly, this involves varies. It could be a Batman Gambit; providing the villain or his minions with just the right information (fake or not) that you know will push them into doing what you want them to - or you could play on whatever fears and concerns they may have to bluff your way out. Alternately, you could appeal to their better nature, reminding them that Even Evil Has Standards, perhaps prompting a Heel\u0096Face Turn or Mook\u0096Face Turn. Whisper sweet, honeyed words to both the villain and his henchmen to provoke an Enemy Civil War. Maybe you could bribe The Dragon or some of the other Mooks into helping you out. In any case, a lot of trouble could've been avoided if the villain had thought to gag him.\n\nCompare Talking Your Way Out, the supertrope describing all means of getting out of trouble with words; Hannibal Lecture, a fellow subtrope, which is when someone is taken captive with the intention of being broken through interrogation, only to break their captor instead; and Poisonous Captive, a more general case of the captive undermining the captors' confidence and effectiveness through manipulation.\n\nNot a subtrope of Bound and Gagged.\n• Inverted in Fullmetal Alchemist when the heroes capture Pride, who doesn't make a sound besides slowly tapping on Al's detached head/helmet. They realize too late they'd allowed him to tap out his exact coordinates in Morse Code.\n• Empowered: Our heroine finds herself in this position quite a lot, though she sometimes accidentally reminds the baddies to apply a gag. At one point, she tells her captor that he needs to get to a hospital, right away. She's NOT bluffing, and manages to save his life. She's seen in the waiting room later with his wife and daughter, no longer tied up. Sometimes, there's a reason to listen to the people you forgot to gag.\n• A Dragon in Shining Armour: When OuRyuumon is captured, he manages to convince the mayor who was being extorted by Dorbickmon to send for the Royal Knights, which ultimately leads to his rescue.\n• Lyra Silvertongue from His Dark Materials got her nickname by pulling this off - after being captured by the armored bears, she ingratiates herself with them, luring their leader into a false sense of confidence, ultimately leading to his downfall in a duel.\n• Miles from Vorkosigan Saga manages to Heel\u0096Face Turn so many people with his sheer gift of the gab that one Admiral instructs his men to cut out his tongue if he tries to speak. It still doesn't save him from getting talked into turning sides later...\n• Both averted and played straight in Dune. When Lady Jessica and Paul are captured by the Harkonnens, she is gagged so she can't use her Bene Gesserit Voice ability on them. Unfortunately for the Harkonnens guarding them, Paul also knows how to use the Voice.\n• Plato's The Republic (making this Older Than Dirt) begins with an account of Polemarchus insisting that Socrates accept his hospitality — giving him the choice of remaining voluntarily or having Polemarchus and his friends detain him by force. When Socrates asks if he might persuade them to let him go, Polemarchus replies that they will simply refuse to listen to anything he has to say.\n• Dr. Mark Sloan, in one episode of Diagnosis: Murder, gets kidnapped by the insane children of a Mad Bomber whom he got sent to the electric chair. He manages to play them against each other, while secretly sending clues to his partners-in-crimesolving, leading to his inevitable rescue. One of the agents on the case even comments that they really should've shot him right away...\n• Ben Linus from Lost is a Manipulative Bastard who gets beaten and/or captured by main characters roughly once per season. However, his Chessmaster skills lead to one Hannibal Lecture after another, causing discord among survivors and ultimately advancing Ben's interests.\n• A truly shining example from Season 4: Sawyer finally wises up and tries to just shoot Ben on the spot while he is beaten, bloodied and with his hands bound. Linus talks himself out of it on the spot, but is still locked in a solitary room in a basement. Then he talks himself out of that too, and is allowed to eat with everybody in the kitchen while still being closely watched. Skip one episode and he is left totally by himself, playing a piano with a shotgun hidden inside it, just in case. And by this point he has already lied to, manipulated, and even ordered the killing of main characters multiple times, so they REALLY should have known what to expect.\n• The Equalizer: If one is going to hold Control captive, one must gag him or one may as well say he's not captured at all.\n• Enforced in Game of Thrones when Jorah captures Tyrion. Jorah did have the sense to gag the man known for his silver tongue, but Tyrion simply loudly hums an annoying song until it's taken out (which works to both's benefit, as they realize Tyrion wants to go where Jorah is taking him).\n• Averted in the opening of The Elder Scrolls V: Skyrim, when Jarl Ulfric Stormcloak and several of his followers are captured (along with a stray horse thief and the Player Character). Everyone else in the wagon is a prisoner with their wrists tied, but Ulfric is Bound and Gagged to prevent him from using dragon Shouts on his captors.\n• Word of God has said that in the Dragon Age universe, any time Varric Tethras has the chance to start talking, he's already won. Yet nobody ever thinks to gag him. Subverted in Dragon Age II, however, in which he's captured and very much not gagged - because his captor, Seeker Cassandra Pentaghast, wants him to talk.\n• The Order of the Stick:\n• Haley, the party's rogue, manages to talk down some bandits by pointing out the economic issues with their chosen profession.\n• Averted when the Order is dragged off to face trial in Azure City in chains: Miko has the sense to gag Vaarsuvius, the party's wizard, so s/he can't cast spells.\n• Exterminatus Now: Cult leader Silas Morth does this to himself when he asks a captured Inquisition agent if she has any last words before she's sacrificed to summon a demon. She does, actually: she asks, out loud, if the cultists know they're working to summon a demon named Kevin. The resulting Derailed for Details throws the ritual off its tracks.\n• Batman has been known to use this approach whenever he's captured but can't directly escape (or does not wish to initially). This includes that time in the Justice League cartoon when he prevented Harley Quinn from killing him by playing on her insecurities and her affection for The Joker, and when he was caught by the Injustice Gang, he proceeds to (overtly) seduce one member of the crew while (covertly) bribing another. In the latter case, Lex does threaten to have him gagged if he makes more trouble, but nothing comes of it.\n• In My Little Pony: Friendship Is Magic, Rarity is captured by creatures who want to use her gem finding powers for their own purposes. She turns the tables by whining so obnoxiously through the whole thing that at one point they even agree to work for her just to get her to stop, and are desperate to get rid of her by the end.\n• In Avatar: The Last Airbender, after Jet is revealed to be a Well-Intentioned Extremist, Katara freezes him to a tree to prevent him from blowing up an Earth Kingdom town. However, she doesn't gag him. Then Jet whistles the signal to set off the explosion, and Longshot shoots.\n• A version of this occurs in a later episode when Omashu has been invaded by the Fire Nation. They encase King Bumi in a metal box and suspend him in mid-air, thinking that if he can't move or touch the ground, he can't Earthbend. However, as Bumi himself points out, \"they didn't cover my face!\" Cue Bumi Earthbending himself, still in the box, out of the suspension and along the delivery tunnels by jutting his chin in different directions!", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/ForgotToGagHim", "media_links": ["/pmwiki/pmwiki.php/Manga/FullmetalAlchemist", "/pmwiki/pmwiki.php/Literature/HisDarkMaterials", "/pmwiki/pmwiki.php/Literature/VorkosiganSaga", "/pmwiki/pmwiki.php/Literature/Dune", "/pmwiki/pmwiki.php/Creator/Plato", "/pmwiki/pmwiki.php/Literature/TheRepublic", "/pmwiki/pmwiki.php/Creator/Socrates", "/pmwiki/pmwiki.php/Series/DiagnosisMurder", "/pmwiki/pmwiki.php/Series/Lost", "/pmwiki/pmwiki.php/Series/TheEqualizer", "/pmwiki/pmwiki.php/Series/GameOfThrones", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsVSkyrim", "/pmwiki/pmwiki.php/Franchise/DragonAge", "/pmwiki/pmwiki.php/VideoGame/DragonAgeII", "/pmwiki/pmwiki.php/Webcomic/ExterminatusNow", "/pmwiki/pmwiki.php/Franchise/Batman", "/pmwiki/pmwiki.php/WesternAnimation/JusticeLeague", "/pmwiki/pmwiki.php/WesternAnimation/MyLittlePonyFriendshipIsMagic", "/pmwiki/pmwiki.php/WesternAnimation/AvatarTheLastAirbender"], "non_media_links": ["/pmwiki/pmwiki.php/Main/CaptainSuperhero", "/pmwiki/pmwiki.php/Main/Unobtainium", "/pmwiki/pmwiki.php/Main/WhyDontYouJustShootHim", "/pmwiki/pmwiki.php/Main/BoundAndGagged", "/pmwiki/pmwiki.php/Main/FoeYay", "/pmwiki/pmwiki.php/Main/WordsCanBreakMyBones", "/pmwiki/pmwiki.php/Main/MakeMeWannaShout", "/pmwiki/pmwiki.php/Main/EvilPlan", "/pmwiki/pmwiki.php/Main/TheStarscream", "/pmwiki/pmwiki.php/Main/TemptingFate", "/pmwiki/pmwiki.php/Main/TalkingYourWayOut", "/pmwiki/pmwiki.php/Main/BatmanGambit", "/pmwiki/pmwiki.php/Main/EvenEvilHasStandards", "/pmwiki/pmwiki.php/Main/HeelFaceTurn", "/pmwiki/pmwiki.php/Main/MookFaceTurn", "/pmwiki/pmwiki.php/Main/EnemyCivilWar", "/pmwiki/pmwiki.php/Main/ScrewTheRulesIHaveMoney", "/pmwiki/pmwiki.php/Main/TheDragon", "/pmwiki/pmwiki.php/Main/Mooks", "/pmwiki/pmwiki.php/Main/TalkingYourWayOut", "/pmwiki/pmwiki.php/Main/HannibalLecture", "/pmwiki/pmwiki.php/Main/PoisonousCaptive", "/pmwiki/pmwiki.php/JustForFun/IThoughtItMeant", "/pmwiki/pmwiki.php/Main/BoundAndGagged", "/pmwiki/pmwiki.php/Main/AnimeAndManga", "/pmwiki/pmwiki.php/Main/AnimatedArmor", "/pmwiki/pmwiki.php/Main/ComicBooks", "/pmwiki/pmwiki.php/Comicbook/Empowered", "/pmwiki/pmwiki.php/Main/SaveTheVillain", "/pmwiki/pmwiki.php/FanFic/ADragonInShiningArmour", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/HeelFaceTurn", "/pmwiki/pmwiki.php/Main/CompellingVoice", "/pmwiki/pmwiki.php/Main/OlderThanDirt", "/pmwiki/pmwiki.php/Main/MortonsFork", "/pmwiki/pmwiki.php/Main/TakeAThirdOption", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/MadBomber", "/pmwiki/pmwiki.php/Main/WhyDontYouJustShootHim", "/pmwiki/pmwiki.php/Main/ManipulativeBastard", "/pmwiki/pmwiki.php/Main/HannibalLecture", "/pmwiki/pmwiki.php/Main/GuileHero", "/pmwiki/pmwiki.php/Main/TormentByAnnoyance", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/PlayerCharacter", "/pmwiki/pmwiki.php/Main/BoundAndGagged", "/pmwiki/pmwiki.php/Main/NoIndoorVoice", "/pmwiki/pmwiki.php/Main/WordOfGod", "/pmwiki/pmwiki.php/Main/TheCharmer", "/pmwiki/pmwiki.php/Main/Webcomics", "/pmwiki/pmwiki.php/WebComic/TheOrderOfTheStick", "/pmwiki/pmwiki.php/Main/AmbiguousGender", "/pmwiki/pmwiki.php/Main/DerailedForDetails", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/SelfRestraint", "/pmwiki/pmwiki.php/Recap/JusticeLeagueS1E8And9InjusticeForAll", "/pmwiki/pmwiki.php/Main/SexFaceTurn", "/pmwiki/pmwiki.php/Main/EveryManHasHisPrice", "/pmwiki/pmwiki.php/Main/PityTheKidnapper", "/pmwiki/pmwiki.php/Main/WellIntentionedExtremist"]}