{"title": "Station Ident", "content": "\"No sports, no rock, no information\n\nFor mindless chatter, we're your station!\n\nYou're reading TV Tropes at tvtropes.org, 209.15.34.67 port 80. Coming up next, an entry on stations announcing themselves.\n\nIn broadcasting, it is common for stations or networks to give some kind of announcement as to what station or network you are watching/listening on. This typically happens just before a feature begins. Many network mascots and logos are born in idents. They also may contain a theme tune, carry a common motif, or carry no common element at all. Sometimes, specific idents may be created for specific events (such as holidays or specific programs). Early idents, which were basic and fairly static, can accidentally be Nightmare Fuel to younger viewers. Shorter versions, which tend to appear in the space between programmes and adverts, are known as Stings, or Break Bumpers.\n\nAmerican broadcast stations are required, under federal law, to declare their call sign and city of license at least once an hour, as close to the top of the hour as is reasonably possible. Obviously radio stations have to announce; a TV station may give it in audio, visual or both. Note this only applies to broadcast stations; a station that is on the Internet or is a cable-only or satellite-based station (Music Choice, Sirius/XM, CNN, USA, HBO, MTV, etc,) do not have call signs and are not required to identify themselves. That said, many do so anyways, in part to mimic the older broadcast format, in part because, well, it's not exactly a bad thing to remind people of what, exactly, they're listening to or watching.\n\nIdents are still quite popular in European television. The BBC has a fairly consistent design of idents across its TV channels, as does ITV and Channel 4. British idents often have a continuity announcer, a disembodied voice note or, in the case of The BBC in the 1950s and most ITV regions up until about 1980, an on-screen announcer that informs you of the next program or two and whether you might want to put the kids to bed for this one. British idents aim to entertain or mystify rather than simply inform, and sometimes their onscreen display may be relevant to the content of the show to follow.\n\nBy contrast, many broadcasters outside of Europe do not typically use such elaborate continuity. For example, although U.S. networks tend to have a package of presentation elements for commercials and features such as pop-up \"snipes\", on-screen bugs for persistent identification have been commonplace since the 1990's, and longer idents would slow the transition between programs, and in turn, cut into valuable commercial time. The standard practice is to air commercials for upcoming programs over the credits of the previous one, with any form of verbal announcement done over the Vanity Plate (which usually lead into either the next program, or a local commercial break preceding it). The aforementioned legal identification is usually just fine print on a short bumper or promo for a station's syndicated or news programming (\"Tonight at Eleven; can TV Tropes ruin your life? Find out in our exclusive investigation.\"), and overlaid on-screen through automation. If a channel does have themed idents, they are typically short bumpers without a voiceover. Longer and more elaborate idents were used more often during the early era of television, especially to promote programs being broadcast in the then-new color format, and there are still notable examples of idents still used today (such as HBO's famous Feature Presentation intro and fanfare ).\n\nMany examples can be found at the idents.tv blog, which covers this kind of stuff with a vengeance. Audio clips of U.S. and Canadian radio station identifications can be heard at Top of the Hour. The Ident Gallery has videos of some of the British ones mentioned here.\n• NBC had the iconic \"snake\" animation for its previous logo, followed by the introduction of a special ident with a multi-colored peacock to denote programs that were \"brought to you in living color on NBC.\" It began as a static slide in 1956, was replaced by an animated version the following year, and replaced by a new version in 1962; once NBC's lineup was entirely in color, it was used to denote original productions.\n• In 1975, NBC introduced the first computer-animated ident in U.S. television with a new logo consisting of red and blue trapezoids forming an \"N\". Said logo was the subject of a lawsuit from Nebraska Educational Television, who spent only $150 to have a very similar logo designed for them (NBC's version reportedly cost $1 million!). In 1979, after research found that many people had associated NBC with the peacock (despite not technically being its main logo), a variation of the trapezoid N with a version of the peacock (the \"Proud N\") became their primary logo. A six-feathered version (by Chermayeff and Geismar ) debuted in 1986.\n• Before The Tonight Show during Jay's first tenure, \"NBC, America's late night leader!\"\n• The identity of CBS has always revolved around its \"eyemark\" logo; it is the longest tenured network TV logo in the United States, debuting in 1951. It was designed by William Golden.\n• 97.1FM WDRV The Drive in Chicago doesn't have a particularly-unusual ident...except that it's read by their morning DJ Steve Downes, known to everybody outside Chicago as the Master Chief.\n• From 1998 to 2001, ABC used bumpers and promos with a minimalist style, often incorporating yellow and black geometric patterns and greyscale photos of its stars, along with the tagline \"We Love TV\" or \"America's (#1) Broadcasting Company\". The network's \"Start Here\" branding featured bumpers and promos with glossy 3D discs adorned with symbols, representing different device platforms, such as TV, PCs, mobile, etc. The \"Start Here\" scheme was dropped in 2013 for a more cinematic look, with the main logo gaining a less complex gloss and new color variations (the butterscotch-tinted version got the most screen time as the network's main bug, but red and steel blue versions were also common). In 2018, another new scheme was introduced, now with concentric circle motifs, and the color variations dropped in favor of just the black/grey version.\n• HBO's 1980s \"Feature Presentation\" is almost certainly the most recognized American ident of the cable/satellite age, which is a bit odd when you consider it's a pay channel to which a lot of people don't subscribe. A 21st century refresh , by Pittard Sullivan, made an even more complex city in CGI that is zoomed through before the message appears and a quickened version of the theme plays.\n• This is CNN.\n• Revived in 2013 after a hiatus. There were also versions with CNN anchors delivering the famous phrase as well, such as Anderson Cooper.\n• Nickelodeon, in the 1980s and well into the 1990s, created dozens of animated and live-action station IDs with its amorphous orange logo in various shapes. The most famous set of such idents featured the vocal contributions of Eugene Pitt and his doo-wop group The Jive Five, who originated the classic \"Nick Nick Nick\" jingle still in use today. The logo of a quarter-century was dispensed of in 2009, however.\n• There was the pinball that bounced around the world, before they dropped the blob on us in 1984.\n• Cartoon Network has had a number of afternoon blocks over the years which typically feature CGI hosts as continuity announcers. On the other hand, continuity in [adult swim] has no voices at all.\n• Episodes of Star Wars: The Clone Wars on Cartoon Network featured characters from the series in front of the regular logo. One starred R2-D2 \"accidentally\" knocking over a couple of letters to leave \"Artoo Network\".\n• [adult swim] uses text to direct talk to its audience in the \"bumps\". The formal sign on of the sub-channel is the parental discretion notice.\n• [adult swim] also had quite a few other ones, usually strange Japanese images and text for the Saturday night Anime block, but now they've outdone themselves with some truly surreal tags of hands coming out of computers, poor quality 3D and digital voices, and a fetus opening its eyes and shining laser beams. It's always accompanied by a \"You are now watching [adult swim]\" or other logo like any... more ordinary station ident.\n• Syfy: Before the name change, they had an ident campaign where the letters \"iF\" sat in the air. Something ordinary came up and upon making contact with the letters transformed into something amazing via Conspicuous CG, and the iF would expand to the name 'Sci Fi.' Many different firms were responsible for these IDs. The current IDs were done by Proud Creative and feature various objects forming the Syfy logo.\n• The CW originally had idents and bumpers evoking the shape of its logo, with a lot of curved stripes in green, white, and orange.\n• National Educational Television, had a logo from 1966 to 1968 with the top of the \"T\" being a mesh globe with an actual flame inside it. Its previous logo was reinstated afterward, with an animated ident featuring the letters animating in, and a house roof forming above it (connecting to the T).\n• Its successor, PBS, began with a simple, logoless slide, before adopting its first real logo and ident in 1971 , a stabilization of the initials with the \"P\" resembling a human head. This logo was designed by Herb Lubalin, whose best known work is probably the ITC Avant Garde Gothic typeface. The current logo first came about in 1984, depicting the \"P\" from the previous logo flipped to the right and with two other profiles (one is formed through negative space; accentuated in the original idents by having them animate out); this rendition was designed by Chermayeff & Geismar, also known for the Chase logo and the aforementioned 1986 NBC peacock. Since 1998, this mark has been rendered on a circle; for a time, there were national bumpers with people jumping around the circled logo (held by a person as a prop). The network's current presentation has used a more cinematic look, typically with the slogan \"Be More PBS\".\n• PBS Kids had \"The P-Pals\" from 1993-1998, which were more cartoony versions of the \"P\" logo. Their slogan was the same as the regular station, but sung as, \"This is, PBS!\". The loud voices were considered Nightmare Fuel when they were still on air, but now a classic for any `90s kid. In 1999, The P-Pals were replaced by two green kids who only said, \"doink!\". Still in use, they are popular with small children, though a bit disliked by fans of the P-Pals.\n• One of PBS's most prominent members, WGBH in Boston, had used its famous Vanity Plate as an ident too.\n• Disney Channel had some fairly creative ones from the 80's through the early 90's. The present-day ones combine this trope with Ad Bumpers.\n• The 1983-1997 ident includes:\n• Window Fog (Animated): Mickey makes the Disney Channel out of the fog window. (Space, City, Train, or Sea)\n• Paper: Mickey folds and cuts the paper to form the Disney Channel logo and says \"Don't cut any corners!\"\n• Doors (Animated): Mickey opens various doors (Including one from Alice in Wonderland) and finds the Disney Channel logo on the garage door. Mickey opens it.\n• Pancakes: Mickey makes pancakes for breakfast (Two small and one big round pancake). Then place it on the plate on the Disney forming the Disney channel logo. And then, Mickey puts syrup on it.\n• Clay: Mickey uses rolling pin to roll the clayball to form the logo.\n• Safari (Animated): Mickey goes through the jungle where he finds a temple with the logo.\n• Record Player: Mickey tests some records on the record player (Old MacDonald had a Farm and Tosca). Then, it finds the mouse shaped record which plays the station's ident song. Then Mickey turns it off.\n• Water (Animated): Mickey fills up the water of the Disney Channel logo.\n• Super Market: Mickey goes grocery shopping and buys TV Dinner which resembles the logo.\n• Musical Baby Mobile: Mickey tries to calm a baby down from all it's tantrum with somethings. Until he winds the musical baby mobile, It finally calms him down. It plays the ident song. And the mobile formed the logo.\n• Nightmare: Mickey has a nightmare of a ghost (the Disney Channel logo) chasing Mickey at an art museum (filled with \"art\" of the previously mentioned Disney Channel idents).\n• Paint: Mickey pours paint and mixes it to resemble the logo.\n• Movie Countdown: Mickey stops the countdown and removes the regular circle and replace it with the Hidden Mickey version, Then continues the countdown.\n• Hats: Mickey finds the right hat on the ball. He finds the MMC hat and sprays it silver.\n• Photo Booth: Mickey gets his picture taken at the photo booth.\n• Workout: Mickey does the workout in a gym. The barbells parts falls into the floor and resemble the Disney Channel logo.\n• Stamp (Animated): Mickey uses the stamp ink to stamp The Disney Channel logo.\n• Maze (Animated): Mickey uses toy soldiers on the maze of The Disney Channel logo.\n• Shadow Puppet (Animated): Mickey makes some shadow puppet until it forms the logo.\n• Washington DC: Mickey goes to various places in Washington DC. Until he finds the building with the logo.\n• Sorting Clothing: Mickey goes into the closet to get rid of old clothing, And replaces with some new clothing and sweaters with the logo.\n• Blocks: Mickey finds square blocks but cannot fit into the logo. He uses the electric saw to turn them into circles and place them and says \"A Chip off the old block\".\n• Train Set: Mickey builds a train set on the that forms the logo.\n• The Brave Engineer: Mickey and Minnie goes on a haunted ride. Filled with Nightmare Fuel and spooky stuff, Then it went to the light door which has the logo.\n• TV: Mickey uses a cardboard box to resemble a TV which has the logo.\n• Teleport: Mickey uses a Mouse hat and the bee to teleport, After that, The bee forms the logo and zooms at us.\n• Driving a Car: Mickey goes out driving, He finds the pedestrian crossing sing, a go right sign, Then the Disney Channel logo (where he sees the truck of tomatoes falling out the truck and into Mickey's windshield. Mickey uses the windshield wipers, and it resembles the logo.\n• MTV turned this into an art form, featuring animated shorts, guest appearances by stars, you name it — half the fun of watching in The '80s was seeing what creative/wacky new ident would come up. Here's a sampler.\n• The sports divisions of the major networks tend to have long idents used to introduce their telecasts, which are typically montages that flaunt the major leagues and events they hold rights to, culminating with their most significant (such as CBS with The Masters and the NCAA basketball tournament, Fox with The World Cup and World Series, and NBC with the Olympic Games). At least one of them will often culminate in mentioning that they're broadcasting the Super Bowl this year. The only major network who doesn't have such an extravagant ident is ABC, since the official dismantling of ABC Sports and its replacement by \"ESPN on ABC\" (although ESPN on ABC does have a short ident, seen at the top of broadcasts, and occasionally as a bumper during the broadcast itself).\n• On a related note, the National Football League has a contractual requirement for all of its broadcasters to air a short ident before kickoff and after the game, treated by the league as the official beginning and end of a game telecast — given that everything in between is subjected to various oversight rules and copyright ownership by the league (the latter excluding ESPN for some reason — maybe because no one ever takes intellectual property from Disney and gets away with it) As with the above, one of these vanity plates will also traditionally boast that the network is the that year's Super Bowl broadcaster, when appropriate.\n• A non-commercial application of the trope is commonly found in most types of Two-Way Radio, per FCC requirements and generally accepted best practice. When you transmit, you identify yourself and whoever you are trying to talk to. This applies both to professionals such as police officers and fighter pilots, as well as amateurs such as CB and Ham radio operators. Some radios, usually radio repeaters, are programmed to automatically transmit their callsign, often in Morse code or with an automated message giving information such as the current time every so often to meet FCC requirements.\n• The CBC has had several of these through the years, perhaps none more iconic than the \"Exploding Pizza\" of the 1970s and early '80s.\n• CTV's overall design since 1998 has frequently featured red, green, and blue ribbons around Canadian landscapes (representing the three shapes in its logo, and its three major divisions at the time; entertainment, news, and sports. Though CTV shuttered its own sports division when it bought TSN), often attached to the back of the CTV logo itself. Other bumpers at the time featured personalities of CTV's programming interacting with the logo as three-dimensional shapes (such as using the \"C\" as a ball).\n• Their 2011 redesign shifted from landscapes to more of a blue and white look, but the ribbon logo was still there. CTV adopted a revised logo in 2018, along with a new flat look.\n• A-Channel, which became CTV's sister network in an acquisition (later A and now CTV Two), had idents featuring the channel's distinct stylized \"A\" forming in places (such as on the side of a road, and a formation of migrating birds)\n• In its current form as CTV Two, its on-air presentation is nearly identical to CTV itself.\n• Multicultural station CHNM in Vancouver (which got bought by Rogers and turned into an Omni station) used to have bumpers showing crossovers between mainstream culture and ethnic culture; such as a Sikh riding a motorcycle with backed by Indian-infused rock, and one featuring lion dancers dressed in the colors of the local Canadian Football League team, the BC Lions.\n• Toronto independent station CITY-TV had probably one of the best known examples in Canada of this, featuring looks at various locations in and around the city (emphasizing its slogan, \"Everywhere\"), famously voiced by the late Mark Dailey.\n• BBC One:\n• For the majority of the 20th Century, BBC1 used various renditions of a rotating globe. The mechanical \"Mirror Globe\" was used from 1969 to 1985, the \"Computer Originated World\" from 1985 to 1991, and Lambie-Nairn did a spruced up CGI globe with shadows and smoke designed by Lambie-Nairn containing the numeral \"1\" that was in use from 1991 to 1997; its exit coincided with a massive revamp of the BBC's identity. From 1997 to 2002, the Lambie-Nairn designed idents depicted a hot-air balloon in the likeness of a globe flying around various landscapes. The older globes have sometimes been used for certain Retraux or period piece series and specials, such as Life On Mars and Ashes to Ashes (2008) (which used the black and blue Mirror Globe), and the 2017 special Children in Need Rocks the '80s (which used the third blue and yellow version). In most of these cases, they were digital re-creations (complete with the regional captions where applicable), but BBC Wales went the extra mile for Life on Mars and dug out their original Mirror Globe model for it.\n• They switched to a series known as Rhythm & Movement in 2002 (also produced by Lambie-Nairn), featuring people in dancing or moving in synch with a heavy dose of red in their clothing or on the set, and all of these idents had variations on the same tune. These were often attacked by viewers as boring and Political Correctness Gone Mad due to the number of different races and cultures featured. It didn't help that they opted not to use an on-screen clock (one was reportedly designed), leaving them in the lurch without a really serious ident (aside from the \"ballet\" one) when the Queen Mother died the day after the new look debuted.\n• As a nod to the round shape of the globe, the idents used between 2006 and 2016 focused around round objects or things moving in a circle. Some of these were also used on BBC America, albeit in truncated forms. The \"circles\" idents were done by Red Bee Media.\n• 2017 saw the launch of the \"Oneness\" idents, which features footage of group activities such as dancing, swimming and wheelchair rugby designed by photographer Martin Parr. Following its launch, critical reception has been overwhelmingly negative with some considering it a duller, cheaper rehash of the already unpopular Rhythm & Movement idents.\n• BBC Two:\n• For the majority of its existence, the channel has used animated number 2s (the two exceptions being between 1986-1991, which opted for a colourful \"TWO\" that rose from or sunk into a white background), and from 2018 onward which employed a curved line bringing to mind the shape of a 2). The most famous version of the \"2\" was a sans-serif digit used between 1991 and 2018 (albeit with a minor alteration in shape in 2007).\n• In particular, the 1991-2001 idents, by Lambie-Nairn, are cult classics. The series consisted of the shape of a 2 appearing in some kind of surreal or arty sequence.\n• Lambie-Nairn revamped the 2 in 2001. In this set of idents, the 2 was a yellow sentient being in a yellow void. In one ident, it sprouts a flamethrower with which it burns up its environment, in another it sprouts arms and flips around the \"BBC TWO\" square (which is backwards before 2 flips it), and in another, it tries to get several 2s to knock into each other as if they were dominoes, but one falls the wrong direction. There were many more, and they were all dropped in 2007 after concerns that they were too cheerful and not really appropriate for serious programming.\n• In 2007, the \"Window on the World\" idents were launched, which saw the 2 represented as a window or cut-out to various scenary. Often related to the show about to premiere, expect to see the 2 shape as a car sunroof or side mirror before Top Gear (UK). An ident of a tent door in the shape of a 2 unzipping open revealed many other tents outside to open broadcasts of the Glastonbury outdoor music festival. The tent ident also has varying levels of daylight outside, which seems to reflect the current time in Britain. Unfortunately, it downplayed the humor of the 2 by depicting it as an inanimate object in different forms to appeal serious programmes, some fans were not happy about this and it only got worse 2 times (first in 2009, then in 2013). In July 2014, the 1991-2001 idents were revived alongside the current set (and a few special ones) to mark the channel's 50th anniversary. The Window on the World set was retired completely in November 2014 in favor of a full, second run for the 1991-2001 idents.\n• BBC Two has also been known to commission show-specific idents to go before programmes, including Wallace & Gromit and Heroes, in which the 2 numeral gets eclipsed in a perfectly duplicated effect to the way the earth does in the show's opening credits. In 1998, Red Dwarf Night had a series of idents in which a robotic 2 (similar to the later yellow version) fell in love with a Skutter.\n• BBC One also copied this for Christmas idents following their circular theme with Wallace & Gromit again in Christmas 2008 in honor of A Matter of Loaf and Death , Doctor Who in Christmas 2009 in honor of \"The End of Time\" , and also because Russell T. Davies saw the Wallace and Gromit Christmas ident and decided \"me too.\" , The Gruffalo's Child in Christmas 2011 and Shrek, The Princess and the Frog and Up in Christmas 2012, and Toy Story in Christmas 2013. Having taken note from the flaws of the aforementionned sentient 2 idents, all of these also have character-less variations introducing the news and serious programmes And in the special case of the 2009-2010 New Year's period until the regular idents were reinstated on January 2, driving home the fact that in Doctor Who, David Tennant regenerated into Matt Smith on the New Year; the idents featured Tennant, so...\n• The former BBC 2W (a primetime opt-out block of BBC Two in Wales on digital television) had a clever deconstruction of the \"logo box\" element common to BBC One and Two's presentation of the time, by having it exist physically within a scene but still falling in the same spot it usually lies (such as on a garage door opened by someone, the brand on a beer tap, or lighting up as part of a Christmas display). From the introduction of the \"Window on the World\" idents and being folded entirely in 2009 in favour of BBC Two Wales, 2W simply used the standard BBC Two idents. Around the time the block went on-air, there was also a variation of the aforementioned \"backwards logo\" ident with the BBC Two logo being flipped to 2W.\n• As of September 2018, BBC Two now uses animated idents depicting a variety of surreal or artistic sequences, all following the screen template of a curved line roughly taking the shape of a number 2 going down the middle of the screen. This series was designed by Lambie-Nairn's successor company Superunion and animated by various artists from across the worldwide art domain and the British VFX industry (up to and including Aardman Animations), enabling a multitude of disparate animation styles across the idents.\n• BBC Three's idents were a bit more abstract than the above, and heavy on CGI. The channel's idents originally featured skits involving a cast of CGI \"blob\" characters on or around a giant version of its wordmark, voiced with clips from the BBC's archives.\n• BBC Four's are even more abstract; the original ident was basically a computer-generated 3D waveform of the continuity announcer's voice, meaning that no two idents were ever exactly alike. In 2005, it was replaced by idents which begin as a seemingly singular scene, but is then split into asymmetric quadrants that create a surreal effect (such as an overhead shot of a cherry blossom tree which turns into four individual shots of it, and people jumping into a swimming pool but at different times—with the water only rippling in their respective quadrant).\n• In 2019, as part of programming celebrating 30 years of the internet, BBC Four added several new idents modelled upon \"oddly satisfying\" videos, mainly involving close-ups of things such as paint on a speaker, things being sliced, and the like.They have been kept in rotation beyond the event they were designed to go with.\n• BBC HD, the BBC channel which aired high-definition shows before being replaced by an HD version of BBC Two in 2013, had its own set of unique idents. In them a rather ordinary scene is shown (such a boy fishing, or an Asian couple sitting on a park bench). A diamond-shaped pane enters the screen, and through the pane a dramatised, fun, over-the-top, colourful, high-definition version of the scene is seen. For example, a queue for the ice-cream truck viewed through the HD pane is a musical song-and-dance number. These usually ended with the BBC HD logo.\n• The new BBC Scotland channel features scenes from various locales with a glassy version of the channel's emblem filling with liquid.\n• BBC News has two major idents: a 15-second animation of radio waves emanating over the globe, and a minute-long montage of CG news transmissions making their way to the BBC News Centre, both accompanied by techno-style music that wouldn't be out of place at an apocalyptic rave.\n• The latter is referred to as the Countdown and has changed a lot over the past ten years since the red paint job and David Lowe music was introduced. Countdowns are common on internationally-focused news channels, BBC's World News channel for the rest of the world has its own countdown focusing mainly on that channel's anchors. Sky News in Australia and France 24 also have their own countdowns.\n• The BBC News countdown used to end with a shot of Television Centre, reflecting the current time of day. When the channel moved studios in March 2013 the music was revamped and new shots of Broadcasting House were used.\n• BBC America used a red, white and blue balloon before changing to the logo on a maroon background accompanied by generic music.\n• As of 2013, ITV's four stations tend to be live-action based with ITV's being more down-to-earth while ITV2 and ITV4 have more of a comedic edge. The sole exception is ITV3, which is CGI-animated with 2D-cutouts in a 3D-snowglobe. In 2019, ITV shifted to a new project under which there will be new idents weekly, showcasing a British artist and works incorporating the ITV logo: the network admitted that it wanted to stop looking at idents as \"wallpaper\" that only change every 5 to 10 years.\n• In the days when ITV was a single regionalized network, the Vanity Plates from the various regional stations often doubled up as station IDs on local programmes.\n• Oddly enough, Northern Ireland's regional variant of ITV, Ulster Television, is one of the only channels in the UK where the continuity announcer is visible.\n• Channel 4's idents have generally been focused on their blocky \"4\" logo (which the exception of between 1996 and 2004):\n• The original Channel 4 idents from the 1980s consisted of coloured blocks flying together to make the \"4\". The 2004-2015 logos pay homage to the originals by having the logo come together from various objects and then fly apart as the camera moves past.\n• There were two (and only two) regular exceptions, for their NFL coverage , and for the Italian Football\n• The 2004-2015 set liked to use heavy CGI to make flybys and zoom-throughs of real locations where objects at different distance appear to form the channel's logo in an optical illusion. One is at the top of this entry, and that's one of the EASIER ones .\n• Amusingly, there existed a real life version of the optical illusion outside of their main building in London.\n• Impressively, Channel 4 even got the producers of The Simpsons to make a special entry into this set, where Homer repeatedly shocks himself trying to retrieve a cluster of Duff cans caught on a power line (which itself sort of looks like the logo if you squint hard enough). When Homer tries again at night, the logo is formed by a pattern of power surges in an overhead view of Springfield. A Clumsy Copyright Censorship modification of this sequence was used as part of the Couch Gag on the episode \"Specs and the City.\"\n• The 2015-2017 set of idents , directed by Jonathan Glazer (Under the Skin), have taken the blocks to an abstract extreme. The logo itself is never actually seen but the block shapes that are associated with the logo are depicted as crystals in water, rocks and whatever the hell that dancing thing is.\n• The current set of idents since 2017 don't show the logo itself neither but feature a friendly giant silver humanoid whose body is made by the blocks shapes interacting with the British populace. The diverse crowds that it meets and its shouting annoying a town's populace are respectively representative of Channel 4 providing (to quote its page on this wiki) \"a platform for programmes catering to minorities such as audiences of colour, people with disabilities\" and its penchant for causing controversy.\n• Another alternative set used alongside the above two main sets shows the blocks flying around on a colourful background forming the shapes such as a clock or Homer Simpson.\n• During its focus on \"intelligent and insightful\" programming in the 2005-2012 period, sister channel More 4 did some screensaver-like effects with the logo's elements. After rebranding into a lifestyle channel in 2012, its idents consist of mechanical scrapbooks littering live-action locales\n• 4Music has had several sets, including an Elevator Gag.\n• Film4's idents are tropes themselves, including Slow-Motion Drop, Chase Scene and Soft Glass. Expect a lot of Bullet Time.\n• E4's idents are Deranged Animation, and they used to have a regular competition to create new surreal cartoons that end with the E4 logo.\n• Channel 5's spinoff Fiver (now called 5STAR) likes bright pastels on a black background. Their continuity announcers are prone to commenting on the previous programme and engaging in occasional snark.\n• 5USA uses numerous Eagleland subtropes, with the current identity featuring montages of scenes of various U.S. cities, landmarks, and landscapes.\n• The UK version of Spike run by 5 has scenes evoking the diagonal stripe in the channel's logo, where a character becomes more more cinematic and action-y when it enters a diagonal \"stripe\" (such as a man running into it and turning into a hawk, a wolf turning into an astronaut, etc.)\n• Digital Freeview comedy channel Dave (formerly UKTV Gold 2) has a group of people engaged in non-sequitur hijinks in and around a mansion before a show begins.\n• The ABC logo is probably the most famous of our lot, being a distinctive Lissajous curve or \"squiggle\", created to reference the network's radio origins. It is the only logo to have survived virtually intact since its inception, with the only major changes being the general design (it's now best explained as being a flat worm).\n• Nippon Television (NTV) has used a sign-on and sign-off ID for many years which features a bird spreading its wings much like the first NBC peacock (though it was originally not in color until 1972).\n• Aside from the usual mundane idents, the animated short on TVNZ stations TV1 and TV2 was an especially cute example. It played back when the stations closed down transmission for the night, from 1979 until 1994 when TVNZ switched to 24-hour broadcasting.\n• Dutch broadcaster TROS (one of the constituents of the Netherlands' public broadcasting framework) has had some of the more iconic idents (also known as a \"leader\" in Dutch), featuring an eight-pointed star with a television-shaped square in the middle . One of their end-of-broadcast idents that was used in the mid-to-late eighties was recorded as the longest idents at the time, spanning over at least a whole minute. One of their more famous theme tunes used in idents in the early nineties had the slogan \"Doe mee met de makers, kom bij de TROS!\" (Join the creators, come to the TROS!)\n• The logo of Rede Globo — the country's biggest broadcaster — is a metallic sphere (representing the Earth) with a cut-out of a television screen containing a second sphere. Said logo was first introduced in 1976 with a blue and white color scheme, before going to a chrome look in 1980, and the first iteration of its present form — with said television cutout containing a rainbow-colored fill — in 1986.\n• By the 1980's, the network's idents had started to heavily utilize CGI, while the logo itself became increasingly intricate in its appearance as 3D graphics technology (such as ray tracing) evolved. By the 21st century, the network had introduced \"glass\" idents featuring a translucent version of the logo forming atop aerial footage of various locations. In 2008, the network began to backtrack on the intricate logo, going for a simpler chrome finish with a purple tint, and the rainbow fill now having a scanline effect. In 2014, the network introduced an even simpler version with a white, \"plastic\" appearance, and began to increase its use of a two-dimensional version of the mark across its presentation. Even then, the idents themselves have continued to maintain the overall style and cinematic feel of idents from the late 20th century.\n• Their most well-known presentation element is the \"plim-plim \" — a bumper which features the logo pinging with a sonar-like sound. As shown in the montage, these have included both traditional idents, as well as shorts by Brazilian animators that feature the logo and/or sounder in various ways.\n• BBC One's idents are frequently the target of Take That! on other shows, sometimes on the BBC itself, either as a statement on the quality of the shows or on the network's branding image. As the channel introduced the Movement & Rhythm idents, BBC Three's adult toon show Monkey Dust frequently made fun of them. Another comedy spoofed the circles motif by plastering the BBC One name over footage from a colonoscopy camera.\n• In a similar vein, topical live-action comedy satire Dead Ringers used to occasionally parody the idents' announcer, featuring the original ident with a new comical commentary.\n• Monty Python's Flying Circus regularly spoofs the BBC One globe idents and continuity announcements. Most famous examples: Announcer: We interrupt this program to annoy you and make things generally irritating. Announcer: It's 8 o'clock and time for the news now on BBC Two, with on BBC One, me telling you this. Announcer: , and nearly time for six past nine. On BBC Two it will shortly be 6½ minutes past nine. Later on this evening it will be 10 o'clock, and at 10:30 we'll be joining BBC Two in time for 10:33. And don't forget tomorrow, when it'll be Well, it's five past nine , and nearly time for six past nine. On BBC Two it will shortly be 6½ minutes past nine. Later on this evening it will be 10 o'clock, and at 10:30 we'll be joining BBC Two in time for 10:33. And don't forget tomorrow, when it'll be 9:20 . Those of you who missed 8:45 on Friday will be able to see it again this Friday at a quarter to nine.\n• Another Python opening uses the world-famous Thames ident in its original context, as their continuity announcer runs down the station line-up before disparaging the BBC fare that is next.\n• BBC Scotland football sketch show Only An Excuse? ended one episode in the balloon era with the balloon forming the bald head of Scottish football comentator Chick Young.\n• The WKRP in Cincinnati Theme Tune is meant to resemble this.\n• The video to the credits even looks like an old community ident for a TV affiliate until the roll call begins.\n• and don't forget \"WKRP,with more music, and Les Nesmann\"\n• When the Earth blows up at the end of Goodies episode \"Earthanasia\", it cuts to the BBC 1 mirror globe ident. Then that blows up, too.\n• The song Doowutchyalike by Digital Underground has a break-down near the end, and a woman announcing that the song is giving radio stations a few seconds to play their station identifications.\n• \"You're listening to Qwerpline here on QWRP FM.\"", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/StationIdent?from=Main.StationIdentification", "media_links": ["/pmwiki/pmwiki.php/Creator/Channel4", "/pmwiki/pmwiki.php/Creator/Channel4", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/Creator/CNN", "/pmwiki/pmwiki.php/Creator/HBO", "/pmwiki/pmwiki.php/Creator/MTV", "/pmwiki/pmwiki.php/Creator/TheBBC", "/pmwiki/pmwiki.php/Creator/TheBBC", "/pmwiki/pmwiki.php/Series/TheTonightShow", "/pmwiki/pmwiki.php/Franchise/Halo", "/pmwiki/pmwiki.php/Creator/JamesEarlJones", "/pmwiki/pmwiki.php/Creator/CNN", "/pmwiki/pmwiki.php/Creator/Nickelodeon", "/pmwiki/pmwiki.php/Creator/CartoonNetwork", "/pmwiki/pmwiki.php/Creator/AdultSwim", "/pmwiki/pmwiki.php/WesternAnimation/StarWarsTheCloneWars", "/pmwiki/pmwiki.php/Creator/AdultSwim", "/pmwiki/pmwiki.php/Creator/AdultSwim", "/pmwiki/pmwiki.php/Creator/AdultSwim", "/pmwiki/pmwiki.php/Creator/Syfy", "/pmwiki/pmwiki.php/Creator/TheCW", "/pmwiki/pmwiki.php/Creator/PBS", "/pmwiki/pmwiki.php/Creator/DisneyChannel", "/pmwiki/pmwiki.php/Disney/AliceInWonderland", "/pmwiki/pmwiki.php/Creator/MTV", "/pmwiki/pmwiki.php/Creator/ESPN", "/pmwiki/pmwiki.php/Creator/ESPN", "/pmwiki/pmwiki.php/Creator/CBC", "/pmwiki/pmwiki.php/Creator/CTV", "/pmwiki/pmwiki.php/Creator/TheBBC", "/pmwiki/pmwiki.php/Series/LifeOnMars2006", "/pmwiki/pmwiki.php/Series/AshesToAshes2008", "/pmwiki/pmwiki.php/Series/TopGearUK", "/pmwiki/pmwiki.php/WesternAnimation/WallaceAndGromit", "/pmwiki/pmwiki.php/Series/Heroes", "/pmwiki/pmwiki.php/Series/RedDwarf", "/pmwiki/pmwiki.php/WesternAnimation/AMatterOfLoafAndDeath", "/pmwiki/pmwiki.php/Series/DoctorWho", "/pmwiki/pmwiki.php/Creator/RussellTDavies", "/pmwiki/pmwiki.php/WesternAnimation/Shrek", "/pmwiki/pmwiki.php/Disney/ThePrincessAndTheFrog", "/pmwiki/pmwiki.php/WesternAnimation/Up", "/pmwiki/pmwiki.php/WesternAnimation/ToyStory", "/pmwiki/pmwiki.php/Creator/DavidTennant", "/pmwiki/pmwiki.php/Creator/MattSmith", "/pmwiki/pmwiki.php/Creator/AardmanAnimations", "/pmwiki/pmwiki.php/Music/BillBailey", "/pmwiki/pmwiki.php/Creator/ITV", "/pmwiki/pmwiki.php/Creator/Channel4", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/Film/UnderTheSkin", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/Creator/ChannelFive", "/pmwiki/pmwiki.php/Creator/ParamountNetwork", "/pmwiki/pmwiki.php/Creator/TheABC", "/pmwiki/pmwiki.php/WesternAnimation/MonkeyDust", "/pmwiki/pmwiki.php/Series/DeadRingers", "/pmwiki/pmwiki.php/Series/MontyPythonsFlyingCircus", "/pmwiki/pmwiki.php/Series/WKRPInCincinnati", "/pmwiki/pmwiki.php/Series/TheGoodies", "/pmwiki/pmwiki.php/Music/DigitalUnderground"], "non_media_links": ["/pmwiki/pmwiki.php/Main/DepthDeception", "/pmwiki/pmwiki.php/Wiki/TVTropes", "/pmwiki/pmwiki.php/Main/DescribeTopicHere", "/pmwiki/pmwiki.php/Main/NightmareFuel", "/pmwiki/pmwiki.php/UsefulNotes/AmericanTelevisionStations", "/pmwiki/pmwiki.php/Main/ContentWarnings", "/pmwiki/pmwiki.php/Main/CommercialPopUp", "/pmwiki/pmwiki.php/Main/CreditsPushback", "/pmwiki/pmwiki.php/Main/VanityPlate", "/pmwiki/pmwiki.php/Main/UnreadableDisclaimer", "/pmwiki/pmwiki.php/Main/TVTropesWillRuinYourLife", "https://www.underconsideration.com/brandnew/archives/hbo_fanfare_intro.php", "http://www.idents.tv", "http://www.tophour.com", "http://www.theidentgallery.com", "/pmwiki/pmwiki.php/Main/CatchPhrase", "http://www.cgstudionyc.com/", "http://en.wikipedia.org/wiki/William_Golden", "https://www.youtube.com/watch?v=i1NKoMNy5bY", "https://www.youtube.com/watch?v=KgdnknJuB74", "http://vimeo.com/2703001", "/pmwiki/pmwiki.php/UsefulNotes/BlockProgramming", "/pmwiki/pmwiki.php/Main/TheyChangedItNowItSucks", "/pmwiki/pmwiki.php/Main/ConspicuousCG", "https://www.youtube.com/watch?v=zwsulS6tq0Y", "https://www.youtube.com/watch?v=mf_gEptaPJg", "/pmwiki/pmwiki.php/UsefulNotes/Fonts", "/pmwiki/pmwiki.php/Main/NightmareFuel", "/pmwiki/pmwiki.php/Main/VanityPlate", "https://www.youtube.com/watch?v=LBSJUcSDrgE", "/pmwiki/pmwiki.php/Main/AdBumpers", "/pmwiki/pmwiki.php/Main/ContinuityNod", "/pmwiki/pmwiki.php/Main/NightmareFuel", "/pmwiki/pmwiki.php/Main/TheEighties", "http://youtu.be/3rd9d-JNWME", "/pmwiki/pmwiki.php/UsefulNotes/Basketball", "/pmwiki/pmwiki.php/UsefulNotes/TheWorldCup", "/pmwiki/pmwiki.php/UsefulNotes/Baseball", "/pmwiki/pmwiki.php/UsefulNotes/OlympicGames", "/pmwiki/pmwiki.php/UsefulNotes/SuperBowl", "/pmwiki/pmwiki.php/UsefulNotes/NationalFootballLeague", "/pmwiki/pmwiki.php/Main/DisneyOwnsThisTrope", "/pmwiki/pmwiki.php/Main/EveryoneKnowsMorse", "https://www.youtube.com/watch?v=u7zj81gOrLQ", "/pmwiki/pmwiki.php/UsefulNotes/CanadianFootballLeague", "/pmwiki/pmwiki.php/Main/Retraux", "/pmwiki/pmwiki.php/Main/PoliticalCorrectnessGoneMad", "/pmwiki/pmwiki.php/UsefulNotes/TheHouseOfWindsor", "/pmwiki/pmwiki.php/Main/NoBudget", "/pmwiki/pmwiki.php/Main/LighterAndSofter", "/pmwiki/pmwiki.php/Main/MoodWhiplash", "/pmwiki/pmwiki.php/Recap/DoctorWhoS30E17E18TheEndOfTime", "/pmwiki/pmwiki.php/Main/FollowTheLeader", "/pmwiki/pmwiki.php/Main/TheNthDoctor", "/pmwiki/pmwiki.php/Main/FunForSome", "/pmwiki/pmwiki.php/Main/ThrowItIn", "https://www.youtube.com/watch?v=2r3rbthELZU", "https://www.youtube.com/watch?v=yEu711Kv9_w", "/pmwiki/pmwiki.php/Main/France24", "/pmwiki/pmwiki.php/UsefulNotes/NorthernIreland", "https://www.youtube.com/watch?v=hdS4Z8eu2-Q", "https://www.youtube.com/watch?v=C4Q_IZIUzkA", "http://www.theidentgallery.com/c4-2004.php", "http://en.wikipedia.org/wiki/File:Channel_4_Horseferry_Road_Ext_Logo.jpg", "/pmwiki/pmwiki.php/Main/ClumsyCopyrightCensorship", "/pmwiki/pmwiki.php/Main/CouchGag", "https://www.youtube.com/watch?v=aWvUJATjJDE", "/pmwiki/pmwiki.php/Main/NightmareFuel", "https://www.youtube.com/watch?v=2Ei_XdwSghQ", "/pmwiki/pmwiki.php/Main/More4", "/pmwiki/pmwiki.php/Main/ElevatorGag", "/pmwiki/pmwiki.php/Main/SlowMotionDrop", "/pmwiki/pmwiki.php/Main/ChaseScene", "/pmwiki/pmwiki.php/Main/SoftGlass", "/pmwiki/pmwiki.php/Main/BulletTime", "/pmwiki/pmwiki.php/Main/DerangedAnimation", "http://estings.e4.com/", "/pmwiki/pmwiki.php/Main/Eagleland", "http://youtu.be/3ZX95pp3EWw", "https://www.youtube.com/watch?v=3sKyiJOPmg0", "https://www.youtube.com/watch?v=1bHJzrryb1I", "https://www.youtube.com/watch?v=B0E3nY4yvko", "https://www.youtube.com/watch?v=fYnna35BNE0", "/pmwiki/pmwiki.php/Main/GenreThrowback", "https://www.youtube.com/watch?v=eftvaZPzDSc", "https://www.youtube.com/watch?v=Xe2XZIEyxdo", "/pmwiki/pmwiki.php/Main/TakeThat", "/pmwiki/pmwiki.php/Main/SelfDeprecation", "https://www.youtube.com/watch?v=NJPdZsgeCco", "/pmwiki/pmwiki.php/Main/OverlyLongGag", "/pmwiki/pmwiki.php/Main/ThemeTune", "/pmwiki/pmwiki.php/Main/EarthShatteringKaboom", "/pmwiki/pmwiki.php/Main/BBC1", "/pmwiki/pmwiki.php/Podcast/Qwerpline"]}