{"title": "Money Multiplier", "content": "by \n\nUsed with permission. by Lethalityrush Used with permission.\n\nIn Video Games and Game Shows this is an item/ability/situation that increases the amount of money gained. Some versions instead give you loot upon activation/during use.\n\nCompare Score Multiplier, Experience Booster, Random Drop Booster. See also Luck Stat and Meta Power-Up.\n• Colin and Sasha from Advance Wars both have money multiplier powers, though in slightly different ways. Colin's CO Power, Gold Rush, multiplies his current stash of money by 1.5. Meanwhile, Sasha passively gets 100 more gold per turn from allied cities than other COs would, and her Super CO power grants her extra cash when attacking enemy units. Unsurprisingly, teaming them up as tag partners in Dual Strike is monumentally Game Breaking.\n• There are also two CO Skills that function similarly to Sasha's powers that anyone can equip. And, yes, you can give them to her and have them stack with her natural powers, making things even more ludicrous.\n• Age of Empires III: The Japanese can send a card from their home city which increases the amount of resources gathered from treasures.\n• Alice: Madness Returns: The game's currency is \"teeth\". The Steam dress increases breakables teeth drops. The Silk Maiden dress increases enemy teeth drops.\n• Two Artix Entertainment minigames and . In these Web Games you can buy weapons that will increase the amount of gold you receive from killing monsters.\n• The Lucky Keyring item in Battlerite Royale boosts the amount of gold you find in chests and loot orbs, making it useful in the early game for filling your last ability and item slots at vendors.\n• Bendy in Nightmare Run: When playing as Alice, every now and then a can of bacon soup will randomly double, triple, quadruple or even sextuple in amount, making her ideal for gathering more cans of bacon soup quickly. The trade-off is that she has the lowest health pool in the game.\n• BoxxyQuest: The Gathering Storm has the Altcoin, an accessory that doubles the amount of karma (the game\u0092s term for gold) you get after battle, but only if the party member holding it is on-screen when the battle ends.\n• Chantelise: The Coin Emblem multiples the value of the coins dropped by enemies, turning some of them from 10pix coins to 50pix coins.\n• Chrono Trigger has an accessory that turns experience gained into money instead.\n• In Danganronpa, spending enough time with Celestia Ludenberg will give the protagonist one of the rare skills usable outside of trials, \"Raise.\" It triples the amount of Monocoins found hidden in the school, and increases the coins won during class trials by 10%. New Danganronpa V3, has \"Fundraising,\" which you earn from spending time with Maki Harukawa, which doubles the coins you get from class trials.\n• The Dark Souls series has the Covetous Silver Serpent Ring, which increases the amount of souls gained from killing enemies (which function as both money and experience points), and the Covetous Gold Serpent Ring, which increases item drop chance from enemies. There's also the Symbol of Avarice, which is a Mimic that you wear on your head, that does both of these things. It stacks with the Silver Serpent Ring too, but not the Gold for some reason.\n• The Antiquarian in Darkest Dungeon doesn't multiply the amount of gold you get, but rather increases the amount you can carry. Normally, in DD, a stack of 1,750 gold takes up one slot in your inventory, and you have a strictly limited number of slots you can put things in, meaning that you end up having to abandon a lot of spare change unless you're willing to drop a resource that might mean the difference between life and death later (and once dropped something is lost for good). The Antiquarian has a passive effect that buffs that to 2,500 gold per stack (an increase of about 40%), as well as letting you pick up small artefacts that are financially valuable but only drop with her in the party; one of them, the Minor Antique, is worth 500 gold and can be stacked 20 times per slot. When you put all this together with the Antiquarian's relative lack of combat power, you get a situation where Antiquarian runs can be harder than runs without them due to a hero slot being spent on comparatively little actual damage, but you end up doing a lot of them anyway because she invariably comes out holding a sack of cash larger than herself.\n• Diablo:\n• Magic Find in Diablo II, which increases the quality of magical items dropped from enemies.\n• Diablo III has Gold Find, increases the amount of gold found, and Magic Find, increases the value of magical items found.\n• The Broker specialist in the Disgaea series can be put in a piece of equipment, increasing the money you gain from defeating enemies by up to three times per specialist.\n• An item called \"Dwarven Merchant's Belt\" in Dragon Age: Origins gives you a +5% bonus to monetary gains.\n• The Black Emporium DLC for Dragon Age II introduces the Rune of Fortune, which can be embedded into each piece of armor that Hawke wears (up to four). It increases the likelihood of enemies dropping money when they're killed, and the effect stacks. There are also a number of amulets, rings, and belts which make enemies more likely to drop money or valuable equipment.\n• Dubloon features an equippable glove that gives money with each successful melee attack.\n• In Eagle Island, one can find and equip two types of perks that increase the amount of golden seeds obtained: Treasure Hunter for chests, and Scavenger for defeated enemies.\n• Being an Imperial in The Elder Scrolls V: Skyrim does this, or at least is supposed to do this (their special inborn ability is Imperial Luck, which adds a 100% chance of 2-10 gold in any chest or corpse that has gold). The only problem is that while the ability works as it should, a bug results in it secretly being added to characters of all races after passing through the starting dungeon, Helgen Keep. There is also the Thieves' Guild-only quest No Stone Unturned, which if completed (it involves finding 24 specific gems with no clues where they are) grants the Prowler's Profit ability, which adds 1-4 gems in mostly the same way as Imperial Luck.\n• The Fallout perk Fortune Finder increases the amount of money found, while the Scrounger perk increases the amount of ammo found.\n• Final Fantasy:\n• The Cat Hood from Final Fantasy VI makes you win twice as many Gil after a battle. It even doubles the gil you recover after it got stolen.\n• Final Fantasy VII: There's the Gil Plus Materia. Gil is the game's currency.\n• Final Fantasy X: There are armor properties which increase gil received.\n• Flight: Getting cranes multiplies the amount of money earned for a short time for a maximum of 5x.\n• In FTL: Faster Than Light, you can find a scrap recovery arm which rises the amount of scrap earned from any source by 10%.\n• In Stern Pinball's Game of Thrones, one of the Awards that can be purchased is the Golden Hand, which gives an extra 750,000 bonus points at the end of each ball.\n• Choosing House Lannister at the beginning of the game puts a x2 multiplier on all Gold earned in the game. This can also be achieved by choosing House Greyjoy at the beginning and then defeating House Lannister, as Greyjoy takes the abilities of all houses it defeats.\n• Granblue Fantasy: An effect in the Journey Drop Shop allows players to increase the amount of Rupies earned during battles.\n• In Grand Theft Auto 2, completing a mission (and collecting a few pickups in the second level) rises the game multiplier, which is the number every amount of money is multiplied every time you complete a mission or just cause mayhem. Thus, it's wise to complete the easiest missions first to rise the multiplier, and save the hardest missions for the end to get the most benefit from them.\n• In Hoard, all monetary gains are doubled if you survive for 30 seconds without losing all of your health, and tripled if you survive for 60 seconds.\n• A key consideration in Kingdom of Loathing is magnifying loot drops. The main method is increasing the drop rate on items by a percentage (of its normal rate). You can also magnify the meat gains, too, but quests don't normally need meat drops. Most players consider a familiar that increases item drop rates to be, at minimum, essential, unless sheer XP grinding is needed. (Oh, by the way, while not as easy, you can magnify XP too.)\n• In La-Mulana, a certain MSX ROM combination gives you an extra coin every time you pick up coins.\n• In the Video Game Remake of the game, luck fairies increase the amount of drops from both enemies AND various breakable things. This makes grinding money incredibly easy.\n• In most of the Lego Adaptation Games, you can get stud multipliers, which stack, meaning you can collect as much as 3840 times the studs.\n• In Lost Odyssey, Sed has passive abilities that increase the amount of money and experience gained from battles, which is why he's typically the one chosen to fill the useless fifth slot in the party, since the other four slots will obviously be taken by the four immortal party members who are just plain better than the mortals since all four of them can learn every ability in the game.\n• The Factor and Pirate hirelings in Might and Magic VII increase all gold found by +10% (and take a 5% cut themselves), under the idea that they know how to spot rare and valuable coins amongst the common ones.\n• Minecraft has item enchantments that work like this. Weapons with the \"Looting\" enchantment increase the maximum number of items that can be looted from each monster, up to three extra. Tools like picks with the \"Fortune\" enchantment increase the drop rate of diamonds and lapis lazuli by up to 120%.\n• In Painkiller, the Greed Black Tarot card which doubles the money gained from destroying items. However, it is the most expensive card to place and enough coins are already gotten without that card to place the rest of them.\n• Persona 4: Two Arcana Chance effects can do this: 2X Yen and increased treasure gains.\n• In Video Game/Persona 5'', one ability of the Star Confidant doubles the money earned in battle if you attack from ambush and defeat the enemy in one round. The Sun Confidant has several powers that give you a chance of being able to ask for extra money during a Hold Up, but if you fail then the enemy will beak off negotiations and either attack you again or summon reinforcements.\n• Pokémon:\n• The Amulet Coin and Luck Incense items double the amount of money gained from defeating Trainers.\n• The Gen VI move Happy Hour doubles the amount of prize money earned after a battle.\n• In Pokémon Ruby and Sapphire Versions, there is a glitch where the wrong amount of money will be displayed if the Amulet Coin is held when Pay Day is used, leaving the impression that the Amulet Coin does not affect Pay Day. However, if the player checks his/her Trainer Card, it will be discovered that the money earned from Pay Day has correctly been doubled and added to the player's total savings. This error was fixed in Pokémon FireRed and LeafGreen Versions, as well as all subsequent games.\n• Pass Powers, introduced in Generation V, include increasing the reward money from winning Trainer battles.\n• Generation VI games have the Prize Money O-Power, which increases the amount of money gained from winning a trainer battle depending on the level of the O-Power used, up to triple the amount with a level 3 O-Power. You can stack it with the Amulet Coin and Luck Incense items for even more money.\n• Puzzle Quest: Anything that raises your Cunning score raises the percentage of gold won during victory and the amount of gold that appears on the puzzle board. Forging items with the Rune of Greed gives you a base +20 on gold won, to a base max of +80 (for all four equitable items). Modifier Runes will increase that gain by 50%, 75%, 100%, 200% or -50%, depending on the rune used.\n• Ratchet & Clank:\n• Most games in the series have a New Game+ known as Challenge Mode . In Ratchet & Clank (2002), all bolt values were doubled. In every other game that has the mode, you start with no multiplier and gain a multiplier that goes higher and higher as you kill more enemies, but the multiplier disappears if you get hit. The multiplier usually caps at x20, but some of the other games have a lower cap.\n• In Ratchet: Deadlocked, after beating the game, you unlock the ability to buy Jackpot Mods, which will increase enemy money drops by 50% if they're killed on a weapon with the mod on it.\n• Some of the games have boxes that will double the amount of money you earn for a limited time. In Ratchet & Clank Future: Tools of Destruction, it also doubles the Raritanium you receive. In games that have Challenge Mode, the box will multiply your multiplier by 2, so in Ratchet & Clank: Up Your Arsenal, you could max out your bolt at x20, and hit the crate to get a x40 multiplier!\n• In Rogue Legacy, you can spend money to increase the amount of money you get from collecting gold. The spelunker class, made specifically for collecting loot, also has such a bonus.\n• The Rich Board in the Snowboard Kids series is an atypical example in that it adds 1 G to your money for every roughly one-fifth of a second you spend in a race any time you're not incapacitated. It does not increase the amount of G you earn doing anything else, however. The Poverty Board, meanwhile, is its inverted counterpart, which removes 1 G from your money at a slightly slower rate. The Poverty Board does not have any advantages to make up for that.\n• The Sonic Riders series has the Gambler gear: it doubles the Rings earned in a race if you win, but halves them if you place poorly. Zero Gravity introduces the Wanted gear, which gives additional rings (+25% in ZG) if you finish a race without taking damage.\n• Super Mario Bros.:\n• Mario & Luigi: Superstar Saga: The Green Wallet doubles the amount of money gained from battles.\n• The first Mario Party game has two alternate boxes to store your coins: The Casino Box will either double or halve the number that's actually deposited and the Lucky Box will add 10% more coins to those that you earned.\n• In Paper Mario: The Thousand-Year Door, you can use the Money Money badge to multiply your battle winnings. And the growth is exponential; by the time you can get this, it probably isn't too hard to free up 5 BP, and since each costs the same, it becomes progressively easier to get more of these badges. The Gold Bar ×3 item presumably was created just so that you could store all the money you get from these, as each is worth 300 coins for purchase and sale, and your coin limit is a measly 999.\n• In Super Mario RPG, the Coin Trick is an accessory that doubles all coins dropped by enemies.\n• The Super Robot Wars series has the \"Luck\" and \"Bless\" SP commands, which doubles the money earned by one unit the next time it fights an enemy. Luck works on the caster, while Bless can affect any allied unit.\n• A few characters in certain titles (e.g., Crow in SRW Z2 or Kyosuke in the Original Generation games) have special skills that earn 20% more money when they get a kill.\n• Team Fortress 2: the Administrator rewards 100 extra credits to all players if all credits are obtained in a wave in Mann vs Machine game mode.\n• An Untitled Story has an ability that increases the number of crystals received from crashing pots.\n• Warframe: Credit Boosters can be purchased and used to increase the amount of credits received during missions.\n• Wario Land has a money multiplier minigame at the end of each level (which can be bypassed, either in favor of an extra-lives minigame, or going straight to the coin-total room). It consisted of two buckets; one held a money bag, while the other held a heavy weight. Getting the money bag doubles the cash the player gained during the level (up to the limit of 999), while the weight cuts the player's cash-on-hand in half (rounding down). The buckets can be picked up to 3 times. The setup favors the player, as the potential gain from this minigame will almost always be higher than the potential loss, and the odds of both a gain and a loss are equal. (For example, if a player gets to the minigame with 80 coins, the worst possible result is walking out with 10 coins [a loss of 70], while the best possible result is a whopping 640 coins [a gain of 560].)\n• Virtual Boy Wario Land takes this MUCH further. At the end of each level the money multiplier minigame now can multiply the coins you have from that level by choosing the correct bucket holding money bags: how much it's multiplied depends on how many buckets you want to choose from. Getting Triple the coins means picking correctly from two buckets above you, getting Six Times the coins means picking correctly from three buckets, and the big Ten Times the coins means you must pick correctly from FOUR buckets! A wrong guess again halves your coins, so if you choose wrongly three times in a row, you leave with an eighth of what you came in with! But if you get three consecutive correct picks, you could leave with anywhere from twenty-seven times the coins (for three triple-coin games) to ONE THOUSAND times the coins (for picking the right bucket out of four each of three ten-times-coin games)!\n• World of Warcraft has \"hard modes\" in some encounters where killing a boss in a certain and more difficult manner than usual, such as the Tribute Run in Dire Maul where the early bosses are spared.\n• Warlords of Draenor had Treasure Seeker and Scavenger followers who increased gold and resource returns respectively. Due to the sheer amount of gold it was possible to gather in this way, the two abilities were condensed into one and gold rewards were replaced with resources.\n• Legion has two variants on this related to Champions. If one of their missions is run with more than a 100% chance of success, the additional percentage goes towards winning a bonus such as extra gold from treasure missions. Additionally, bodyguard Champions can be equipped with items that cause the completion of World Quests to award gold or Order Hall resources.\n• Zombidle: The Pillage and Plunder skill increases how fast the game's currency, Skulls, are gained.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/MoneyMultiplier", "media_links": ["/pmwiki/pmwiki.php/Franchise/Pokemon", "/pmwiki/pmwiki.php/VideoGame/NintendoWars", "/pmwiki/pmwiki.php/VideoGame/AgeOfEmpiresIII", "/pmwiki/pmwiki.php/VideoGame/AliceMadnessReturns", "/pmwiki/pmwiki.php/Creator/ArtixEntertainment", "/pmwiki/pmwiki.php/VideoGame/Battlerite", "/pmwiki/pmwiki.php/VideoGame/BendyInNightmareRun", "/pmwiki/pmwiki.php/VideoGame/BoxxyQuestTheGatheringStorm", "/pmwiki/pmwiki.php/VideoGame/Chantelise", "/pmwiki/pmwiki.php/VideoGame/ChronoTrigger", "/pmwiki/pmwiki.php/Franchise/Danganronpa", "/pmwiki/pmwiki.php/VisualNovel/NewDanganRonpaV3", "/pmwiki/pmwiki.php/VideoGame/DarkSouls", "/pmwiki/pmwiki.php/VideoGame/DarkestDungeon", "/pmwiki/pmwiki.php/VideoGame/Diablo", "/pmwiki/pmwiki.php/VideoGame/DiabloII", "/pmwiki/pmwiki.php/VideoGame/DiabloIII", "/pmwiki/pmwiki.php/Franchise/Disgaea", "/pmwiki/pmwiki.php/VideoGame/DragonAgeOrigins", "/pmwiki/pmwiki.php/VideoGame/DragonAgeII", "/pmwiki/pmwiki.php/VideoGame/Dubloon", "/pmwiki/pmwiki.php/VideoGame/EagleIsland", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsVSkyrim", "/pmwiki/pmwiki.php/VideoGame/Fallout", "/pmwiki/pmwiki.php/Franchise/FinalFantasy", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyVI", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyVII", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyX", "/pmwiki/pmwiki.php/VideoGame/Flight", "/pmwiki/pmwiki.php/VideoGame/FTLFasterThanLight", "/pmwiki/pmwiki.php/Website/GaiaOnline", "/pmwiki/pmwiki.php/Creator/SternPinball", "/pmwiki/pmwiki.php/VideoGame/GranblueFantasy", "/pmwiki/pmwiki.php/VideoGame/Hoard", "/pmwiki/pmwiki.php/VideoGame/LaMulana", "/pmwiki/pmwiki.php/VideoGame/LegoAdaptationGame", "/pmwiki/pmwiki.php/VideoGame/LostOdyssey", "/pmwiki/pmwiki.php/VideoGame/MightAndMagic", "/pmwiki/pmwiki.php/VideoGame/Minecraft", "/pmwiki/pmwiki.php/VideoGame/Painkiller", "/pmwiki/pmwiki.php/VideoGame/Persona4", "/pmwiki/pmwiki.php/Franchise/Pokemon", "/pmwiki/pmwiki.php/VideoGame/PokemonRubyAndSapphire", "/pmwiki/pmwiki.php/VideoGame/PokemonBlackAndWhite", "/pmwiki/pmwiki.php/VideoGame/PokemonXandY", "/pmwiki/pmwiki.php/VideoGame/PuzzleQuest", "/pmwiki/pmwiki.php/Franchise/RatchetAndClank", "/pmwiki/pmwiki.php/VideoGame/RatchetAndClank2002", "/pmwiki/pmwiki.php/VideoGame/RatchetDeadlocked", "/pmwiki/pmwiki.php/VideoGame/RatchetAndClankFutureToolsOfDestruction", "/pmwiki/pmwiki.php/VideoGame/RatchetAndClankUpYourArsenal", "/pmwiki/pmwiki.php/VideoGame/RogueLegacy", "/pmwiki/pmwiki.php/VideoGame/SnowboardKids", "/pmwiki/pmwiki.php/VideoGame/SonicRiders", "/pmwiki/pmwiki.php/Franchise/SuperMarioBros", "/pmwiki/pmwiki.php/VideoGame/MarioAndLuigiSuperstarSaga", "/pmwiki/pmwiki.php/VideoGame/MarioParty", "/pmwiki/pmwiki.php/VideoGame/SuperRobotWars", "/pmwiki/pmwiki.php/VideoGame/TeamFortress2", "/pmwiki/pmwiki.php/VideoGame/TerraBattle", "/pmwiki/pmwiki.php/VideoGame/AnUntitledStory", "/pmwiki/pmwiki.php/VideoGame/Warframe", "/pmwiki/pmwiki.php/VideoGame/VirtualBoyWarioLand", "/pmwiki/pmwiki.php/VideoGame/WorldOfWarcraft", "/pmwiki/pmwiki.php/VideoGame/Zombidle"], "non_media_links": ["http://lethalityrush.deviantart.com/art/Amulet-Coin-logic-474212152?q=Lethalityrush%2F49936939&qo=7", "http://lethalityrush.deviantart.com/", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/GameShows", "/pmwiki/pmwiki.php/Main/ScoreMultiplier", "/pmwiki/pmwiki.php/Main/ExperienceBooster", "/pmwiki/pmwiki.php/Main/RandomDropBooster", "/pmwiki/pmwiki.php/Main/LuckStat", "/pmwiki/pmwiki.php/Main/MetaPowerup", "/pmwiki/pmwiki.php/Main/GameBreaker", "http://www.ebilgames.com/games/Ninja/play.asp", "http://www.ebilgames.com/Games/UndeadAssault/play.asp", "/pmwiki/pmwiki.php/Main/WebGames", "/pmwiki/pmwiki.php/Main/RelationShipValues", "/pmwiki/pmwiki.php/Main/AlwaysCheckBehindTheChair", "/pmwiki/pmwiki.php/Main/ChestMonster", "/pmwiki/pmwiki.php/Main/NonActionGuy", "/pmwiki/pmwiki.php/Main/PlayerCharacter", "/pmwiki/pmwiki.php/Main/GoodBadBugs", "/pmwiki/pmwiki.php/Pinball/GameOfThrones", "/pmwiki/pmwiki.php/Main/AllYourPowersCombined", "/pmwiki/pmwiki.php/Videogame/GrandTheftAuto2", "/pmwiki/pmwiki.php/Videogame/KingdomOfLoathing", "/pmwiki/pmwiki.php/Main/VideoGameRemake", "/pmwiki/pmwiki.php/Main/GameBreaker", "/pmwiki/pmwiki.php/Main/ComplacentGamingSyndrome", "/pmwiki/pmwiki.php/Main/CantCatchUp", "/pmwiki/pmwiki.php/Main/VideoGame", "/pmwiki/pmwiki.php/Main/Persona5", "/pmwiki/pmwiki.php/Main/MoneyforNothing", "/pmwiki/pmwiki.php/Main/NewGamePlus", "http://ratchet.wikia.com/wiki/Challenge_mode", "/pmwiki/pmwiki.php/Main/InvertedTrope", "/pmwiki/pmwiki.php/Main/JokeWeapon", "http://sonic.wikia.com/wiki/Gambler", "http://sonic.wikia.com/wiki/Wanted", "/pmwiki/pmwiki.php/Main/NoDamageRun", "/pmwiki/pmwiki.php/Videogame/PaperMarioTheThousandYearDoor", "/pmwiki/pmwiki.php/Videogame/SuperMarioRPG", "/pmwiki/pmwiki.php/Videogame/WarioLand", "/pmwiki/pmwiki.php/Main/BettingMinigame", "/pmwiki/pmwiki.php/Main/BettingMinigame"]}