{"title": "Microwave Misuse", "content": "The purpose of a microwave is to heat leftover/frozen dinners up. But what happens if you insert things that's not meant to be edible in there?\n\nEver heard of the warning: \"DO NOT PUT METAL IN THIS OVEN\"? That's because it creates sparks and can start a fire. Often times in fictitious works, Hilarity Ensues.\n\nBut not so much if the explosion in question injures someone. Even less so if there was a small creature stuffed inside there and tortured to its death...\n\nAs mentioned above, may result in Stuff Blowing Up. Compare Microwave the Dog. Obviously, Don't Try This at Home. (Unfortunately, there are those who will and do.)\n• Yondemasu Yo Azazelsan has Beelzebub (a fly) trying to put his, uh, \"meal\" inside a microwave, even as Sakuma warns him not to. He gets stopped by Akutabe.\n• Foxtrot: Paige once put some soup in the microwave, and it exploded. When her mother asks to see the can, Paige answers \"I told you, it exploded.\" Andy: Paige, didn't we have this conversation about our first microwave?\n• The movie American Hustle is set in the 1970s, when the microwave was still a new invention. As such, it makes somewhat (but not much) more sense that Rosalynn disregards Irving's instructions not to put metal in the microwave (or \"science oven,\" as it's called by both of them) he received from Mayor Polito. It blows up and catches fire spectacularly.\n• On Gremlins, one of the titular monsters is killed in the microwave.\n• In Grosse Pointe Blank, Felix puts a potato-sized lump of plastic explosive in a microwave at a convenience store in an attempt to kill Martin.\n• The boys blow up a worm in the microwave in one scene of How To Eat Fried Worms.\n• Under Siege has a non-humorous example. Ryback wants to prepare a warm welcome for the terrorists who have taken over the battleship, so he puts a can containing combustible material inside a microwave and turns it on. When the terrorists arrive in the kitchen, the can inside the microwave explodes.\n• Brainiac: Science Abuse did this once per episode with a wide variety of objects. Due to the often explosive results of these experiments, there were multiple Do Not Try This at Home warnings both before and after.\n• In The Kids Are Alright (2018), which is set in the early seventies, Mike brings a microwave prototype home for testing. Peggy resents it because she sees it as an intrusion in her kitchen, so she sabotages it by putting a fork inside and turning it on. It shorts out a fuse and causes a blackout.\n• Maniac Mansion series:\n• One of the most infamous moments in Maniac Mansion involves blowing up a hamster in the microwave.\n• Day of the Tentacle follows its predecessor and lets you put a hamster in a microwave oven again. This time it is a required solution to a puzzle and the hamster is okay because it was cryogenically frozen and microwaving it revives it.\n• Strong Bad's Cool Game for Attractive People: If the microwave is examined, Strong Bad claims that it is unusable due to the doors being stuck shut by nacho entrails and mangled action figures.\n• Yakuza Kiwami 2 has a Heat Action where Kiryu stuffs an enemy's head into a convenience store microwave and orders the clerk to turn it on.\n• There was a whole YouTube channel devoted to answering the question \"Is It a Good Idea to Microwave This?\". And more often than not, it isn't.\n• Jacksfilms: In a Black Comedy example, the video \"punishing my terrible dog\" has Jack care for his dog, Klondike, whilst doing the Bird Box challenge . At the end, he mistakes the microwave for her crate and puts her really an obviously fake dog inside, and turns it on thinking he's locking her in for the night.\n• In one of the \"dumbest tweets\" videos in Most Amazing Top Ten, someone tweets that they tried microwaving their phone to charge it, but it exploded instead. This might be related to the fact that when the first induction-charging-capable iPhone was released, trolls promptly made fake ads claiming it was also microwave-compatible.\n• In one episode of Futurama, Fry stupidly puts a metal pack of popcorn into a microwave. This somehow combines with a supernova to send the planet express ship and crew back to the 1950s. It also destroys the microwave. This is a problem, because making a return trip to the future requires a functional microwave.\n• In the Johnny Bravo episode, \"Carnival of the Darned\", Johnny takes a device that Carl made tapes his food to it, and starts to put it in the microwave, which Carl points out it not something you can do with metal. Johnny ignores him and does anyway, resulting in the microwave exploding and making a mess of the kitchen.\n• An enduring Urban Legend holds that someone put their wet Chihuahua in the microwave to dry it out.\n• The discovery that one of the very few chemical reactions involving gold can be brought about by putting a plate with gold leaf decoration into a microwave, thus turning it a very vivid blue - heat plus microwave radiation oxidises gold, creating auric oxide - is one of the minor delights of an education in physical chemistry. Pissed off kitchen staff have done this to annoying hotel owners as a sort of \"screw you\", effectively destroying the most expensive plateware through one of those little mishaps.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/MicrowaveMisuse", "media_links": ["/pmwiki/pmwiki.php/Manga/YondemasuYoAzazelsan", "/pmwiki/pmwiki.php/Film/AmericanHustle", "/pmwiki/pmwiki.php/Film/Gremlins", "/pmwiki/pmwiki.php/Film/GrossePointeBlank", "/pmwiki/pmwiki.php/Film/UnderSiege", "/pmwiki/pmwiki.php/Series/BrainiacScienceAbuse", "/pmwiki/pmwiki.php/Series/TheKidsAreAlright2018", "/pmwiki/pmwiki.php/VideoGame/ManiacMansion", "/pmwiki/pmwiki.php/VideoGame/DayOfTheTentacle", "/pmwiki/pmwiki.php/VideoGame/StrongBadsCoolGameForAttractivePeople", "/pmwiki/pmwiki.php/VideoGame/Yakuza2", "/pmwiki/pmwiki.php/Film/BirdBox", "/pmwiki/pmwiki.php/WesternAnimation/Futurama", "/pmwiki/pmwiki.php/WesternAnimation/JohnnyBravo"], "non_media_links": ["/pmwiki/pmwiki.php/Main/HilarityEnsues", "/pmwiki/pmwiki.php/Main/CruelAndUnusualDeath", "/pmwiki/pmwiki.php/Main/StuffBlowingUp", "/pmwiki/pmwiki.php/Main/MicrowaveTheDog", "/pmwiki/pmwiki.php/Main/DontTryThisAtHome", "/pmwiki/pmwiki.php/Main/TruthInTelevision", "/pmwiki/pmwiki.php/Main/AnimeAndManga", "/pmwiki/pmwiki.php/ComicStrip/Foxtrot", "/pmwiki/pmwiki.php/Main/BrainlessBeauty", "https://www.youtube.com/watch?v=mOkK9-rLchU", "/pmwiki/pmwiki.php/Main/DoNotTryThisAtHome", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/HumanPopsicle", "/pmwiki/pmwiki.php/Main/ActionCommands", "https://www.youtube.com/watch?v=BvcIvHQcKNc", "/pmwiki/pmwiki.php/Main/WebOriginal", "/pmwiki/pmwiki.php/WebVideo/Jacksfilms", "/pmwiki/pmwiki.php/Main/BlackComedy", "/pmwiki/pmwiki.php/WebVideo/MostAmazingTopTen", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/RealityEnsues", "/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/Main/UrbanLegend"]}