{"title": "Ho Yay", "content": "Please don't list this on a work's page as a trope. Examples can go on the work's YMMV tab.\n\nThose moments of plot, dialogue, acting, etc., that fans delight in interpreting as homoerotic.\n\nIt probably originates from the old days, when the homosexuality taboo was serious enough that every gay pairing was considered a Crack Pairing, so when authors wrote same-sex characters as very intimate with each other, audiences largely accepted that they are just very good friends, and moved on, or when authors wrote outright references to homosexuality, most just laughed at the sheer absurdity of the thought.\n\nWith the gradual dissolution of homophobic moral codes, more and more writers have been able to publish and share their work uncensored, changing media forever. Nowadays, Yaoi Fans and Yuri Fans willingly interpret any interaction as potentially gay, for characters without canonical orientations and even for those specifically stated by their creators to be straight (in which case the author may be very annoyed by the fans' insistence otherwise).\n\nCultural differences also have their say here. The level of accepted physical intimacy between close friends and adult relatives is hardly constant across various eras and nationalities, so, for example, the hugs and kisses which seemed mundane for an antiquated reader may appear blatantly erotic in the eyes of a contemporary one. In particular, the concept of Romantic Two-Girl Friendship — and Romantic Two-Guy Friendship — highly intimate yet platonic, only began falling out of use in the latter half of the 19th century.\n\nWhen this is done intentionally, it's Homoerotic Subtext, or possibly Implied Love Interest or Ship Tease. Occasionally called Les Yay when referring to two women.\n\nIn the related trope called Foe Yay, even rivals or mortal enemies can get this treatment by fans and writers alike, especially if they have a more friendly past together, or one is inordinately obsessed with the other. In Fan Fic, this is the direct cause of many a Slash Fic.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/HoYay?from=Main.HoYayShipping", "media_links": ["/pmwiki/pmwiki.php/Film/StarTrekTheMotionPicture"], "non_media_links": ["http://cosmicduckling.com/spirk/i-night.html", "/pmwiki/pmwiki.php/Main/AcronymAndAbbreviationOverload", "/pmwiki/pmwiki.php/Main/ValuesDissonance", "/pmwiki/pmwiki.php/Main/CrackPairing", "/pmwiki/pmwiki.php/Main/SocietyMarchesOn", "/pmwiki/pmwiki.php/Main/YaoiFan", "/pmwiki/pmwiki.php/Main/YuriFan", "/pmwiki/pmwiki.php/Main/WordofGod", "/pmwiki/pmwiki.php/Main/RomanticTwoGirlFriendship", "/pmwiki/pmwiki.php/Main/HomoeroticSubtext", "/pmwiki/pmwiki.php/Main/ImpliedLoveInterest", "/pmwiki/pmwiki.php/Main/ShipTease", "/pmwiki/pmwiki.php/Main/FoeYay", "/pmwiki/pmwiki.php/Main/TheRival", "/pmwiki/pmwiki.php/Main/RivalTurnedEvil", "/pmwiki/pmwiki.php/Main/TheOnlyOneAllowedToDefeatYou", "/pmwiki/pmwiki.php/Main/FanFic", "/pmwiki/pmwiki.php/Main/SlashFic", "/pmwiki/pmwiki.php/HoYay/AnimeAndManga", "/pmwiki/pmwiki.php/HoYay/ComicBooks", "/pmwiki/pmwiki.php/HoYay/FanWorks", "/pmwiki/pmwiki.php/HoYay/Film", "/pmwiki/pmwiki.php/HoYay/Literature", "/pmwiki/pmwiki.php/HoYay/LiveActionTV", "/pmwiki/pmwiki.php/HoYay/Music", "/pmwiki/pmwiki.php/HoYay/Theater", "/pmwiki/pmwiki.php/HoYay/VideoGames", "/pmwiki/pmwiki.php/HoYay/WebAnimation", "/pmwiki/pmwiki.php/HoYay/Webcomics", "/pmwiki/pmwiki.php/HoYay/WebOriginal", "/pmwiki/pmwiki.php/HoYay/WesternAnimation", "/pmwiki/pmwiki.php/HoYay/WWE", "/pmwiki/pmwiki.php/HoYay/Other"]}