{"title": "Slippery as an Eel", "content": "Of all the sea creatures in the world, alongside dolphins, octopuses, sea otters , and whales, the sneakiest sea creature alongside the shark would be the moray eel. In nearly every form of media, eels are depicted as being sneaky creatures that have a propensity for tricking other sea creatures. It's a sure sign that they cannot be trusted. In other words, they're basically the oceanic version of snakes . Actual sea snakes (as opposed to mythical sea serpents) are Seldom-Seen Species , probably because they're far less intimidating-looking than moray eels, which basically look very bizarre and downright alien, right down to having Xenomorph-like jaws in its throat.\n\nMoray eels are the species most often used, due to their fearsome appearance, though the occasional Psycho Electric Eel may be used for this trope as well (despite electric \"eels\" being a type of knifefish). And sometimes, in an example of Artistic License \u0096 Biology, a moray will be a Psycho Electric Eel.\n• In One Piece there's Hammond, a villainous Small Name, Big Ego character who's also a Daggertooth Pike Conger fishman.\n• Flotsam and Jetsam from The Little Mermaid are a prime example of this trope, two slippery moray eels working as spies for the villain Ursula. Unusually for Disney villain sidekicks, they are not humorous the least bit, averting Vile Villain, Laughable Lackey.\n• There's an eel in The Water Babies film who's the lackey of the evil shark king. Don't recall if he was particularly sneaky in the trickster sense, but he was certainly a sycophantic brown-noser.\n• According to the song \"You're a Mean One, Mr. Grinch\" from How the Grinch Stole Christmas!, the Grinch is actually \"cuddly as a cactus and charming as an eel.\"\n• Robin Hood: When Prince John gets upset with Sir Hiss, he calls him an \"eel in snake's clothing!\" as he is a snake already, and therefore he had to go further than the typical insults.\n• Morey from the Flying Dutchman's cursed crew that appears in Pirates of the Caribbean: Dead Man's Chest and Pirates of the Caribbean: At World's End has an eel's head and neck as a personal mutation. Making the best out of it, it bites people in the face.\n• One of the nastier bizarre Alternate History animals generated by the time waves in A Sound of Thunder is a gigantic eel. It uses ambush tactics for its initial attack on the hero, then bends its body like a hairpin to line up its jaws for another strike, while coiling its tail around him like a constrictor snake.\n• In Freddi Fish, Eddie the Eel is depicted as a trickster who prevents Freddi and Luther from trying to go where they needed to, unless he is bribed.\n• Volteel Biblio from Mega Man Zero 3 is a very sneaky character, his level being particularly trap-infested and snaking through secret passages all over his Boss Fight arena to get the drop on you, being That One Boss of the game.\n• Assassin's Creed IV: Black Flag: Spotted moray eels can be found hiding in seaweed, and they do attack Edward.\n• Super Mario Bros. examples:\n• Unagi the Eel is an infamous example from Super Mario 64. While not necessarily malicious, it does not appear to like Mario, as it will start roaring and swimming around if he comes close and contact with it causes damage. Unagi later becomes a type of enemy in New Super Mario Bros., and return for Super Mario Odyssey now looking less cartoony and more like the demonic morays they were always meant to be.\n• Eely-Mouth from Super Mario Sunshine is a monster eel (that appears to be a hermaphrodite, oddly enough; some species are sequential hermaphrodites in real life) whose teeth are so bad that they somehow infect the water in Noki Bay, meaning Mario and FLUDD must go and clean things up, yet again.\n• Eels appear as enemies in Super Mario Galaxy.\n• Ogura, the Big Bad of the first two games in the Starfy series.\n• Kaiju Combat: Moratitan the giant moray is not particularly friendly.\n• Carrie's Order Up! has Reginald, an eel businessman, complete with hat and suitcase. Of course, his slipperiness is limited to trying slip in as long a lunch break as possible.\n• Huntail and Gorebyss, Pokémon that first featured in the third generation, are eel-like creatures that live in the sea; the former containing characteristics of moray eels, viperfish and gulper eels, and the latter based on the snipe eel and pipefish. Both are predator species, and use their respective characteristics to lure prey into range of attack.\n• Bug has red coloured moray eels as enemies in Quaria. They stick out of wall areas to attack an unsuspecting Bug, and some of them can spit fireballs. While underwater.\n• The black ooze that pursues the protagonist throughout GRIS takes the form of a gigantic eel that chases and snaps at her in the climax of the water level.\n• DSBT InsaniT: White Killer Eels really live up to their name.\n• Not only is Robber Eel, well, a robber, but he is slippery in the tricky sense too.\n• In the SpongeBob SquarePants episode \"Life of Crime\", Mr. Krabs refers to a thief he saw on TV as an \"eel in the kelp\" (a play on the term \"snake in the grass\").", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/SlipperyAsAnEel", "media_links": ["/pmwiki/pmwiki.php/Disney/TheLittleMermaid", "/pmwiki/pmwiki.php/Music/DeanMartin", "/pmwiki/pmwiki.php/Franchise/OnePiece", "/pmwiki/pmwiki.php/Disney/TheLittleMermaid", "/pmwiki/pmwiki.php/WesternAnimation/HowTheGrinchStoleChristmas", "/pmwiki/pmwiki.php/Disney/RobinHood", "/pmwiki/pmwiki.php/Film/PiratesOfTheCaribbeanDeadMansChest", "/pmwiki/pmwiki.php/Film/PiratesOfTheCaribbeanAtWorldsEnd", "/pmwiki/pmwiki.php/Film/ASoundOfThunder", "/pmwiki/pmwiki.php/Series/SpartacusBloodAndSand", "/pmwiki/pmwiki.php/VideoGame/FreddiFish", "/pmwiki/pmwiki.php/VideoGame/MegaManZero", "/pmwiki/pmwiki.php/Franchise/SuperMarioBros", "/pmwiki/pmwiki.php/VideoGame/SuperMario64", "/pmwiki/pmwiki.php/VideoGame/NewSuperMarioBros", "/pmwiki/pmwiki.php/VideoGame/SuperMarioSunshine", "/pmwiki/pmwiki.php/VideoGame/SuperMarioGalaxy", "/pmwiki/pmwiki.php/VideoGame/TheLegendaryStarfy", "/pmwiki/pmwiki.php/VideoGame/KaijuCombat", "/pmwiki/pmwiki.php/VideoGame/CarriesOrderUp", "/pmwiki/pmwiki.php/Franchise/Pokemon", "/pmwiki/pmwiki.php/VideoGame/PokemonRubyAndSapphire", "/pmwiki/pmwiki.php/VideoGame/Bug", "/pmwiki/pmwiki.php/VideoGame/Gris", "/pmwiki/pmwiki.php/WesternAnimation/SpongeBobSquarePants"], "non_media_links": ["/pmwiki/pmwiki.php/Main/NestedMouths", "/pmwiki/pmwiki.php/Main/IncrediblyLamePun", "/pmwiki/pmwiki.php/Main/PlayfulOtter", "/pmwiki/pmwiki.php/Main/ThreateningShark", "/pmwiki/pmwiki.php/Main/UndergroundMonkey", "/pmwiki/pmwiki.php/Main/SnakesAreEvil", "/pmwiki/pmwiki.php/Main/SeldomSeenSpecies", "/pmwiki/pmwiki.php/Main/RuleOfScary", "/pmwiki/pmwiki.php/Main/NestedMouths", "/pmwiki/pmwiki.php/Main/PsychoElectricEel", "/pmwiki/pmwiki.php/Main/ArtisticLicenseBiology", "/pmwiki/pmwiki.php/Main/PsychoElectricEel", "/pmwiki/pmwiki.php/Main/Anime", "/pmwiki/pmwiki.php/Main/Manga", "/pmwiki/pmwiki.php/Main/SmallNameBigEgo", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/MeaningfulName", "/pmwiki/pmwiki.php/Main/VileVillainLaughableLackey", "/pmwiki/pmwiki.php/Main/AlternateHistory", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/AnimalMotif", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/BossFight", "/pmwiki/pmwiki.php/Main/ThatOneBoss", "/pmwiki/pmwiki.php/Videogame/AssassinsCreedIVBlackFlag", "/pmwiki/pmwiki.php/Main/NightmareFuel", "/pmwiki/pmwiki.php/Videogame/SuperMarioOdyssey", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/SeldomSeenSpecies", "/pmwiki/pmwiki.php/Main/SeldomSeenSpecies", "/pmwiki/pmwiki.php/Main/UnderTheSea", "/pmwiki/pmwiki.php/Main/WebAnimation", "/pmwiki/pmwiki.php/WebAnimation/DSBTInsaniT", "/pmwiki/pmwiki.php/Main/BlatantBurglar", "/pmwiki/pmwiki.php/Main/WesternAnimation"]}