{"title": "Tragic One-Shot Character", "content": "Sometimes the character finds a new character (mostly girls) and likes them, but sadly this new character dies because of illness or other factors by the end of the episode, resulting in a Tear Jerker. No Real Life Examples, Please!\n\nSimilar to Victim of the Week, Girl of the Week and Monster of the Week and compared to A Death in the Limelight. It's a Sub-Trope of One-Shot Character.\n\nAs a Death Trope, all Spoilers will be unmarked ahead. Beware.\n• The final episode of the 80s Astro Boy anime has Astro on a spy mission to find the stolen blueprints of a prototypical version of him. Any robot made from the blueprints is deemed dangerous due to the built in bomb. It turns out the blueprints had been constructed into a robot already, and it was Astro's new friend and crush Nyoka. The bomb is set off to kill Astro. It doesn't detonate however they're unable to fix it and she dies. Astro keeps her legs as a reminder of her.\n• An episode of Gunslinger Girl has the titular girls undercover on an assassination mission. Rico meets a boy and it seems like they can become friends (or even spark a Puppy Love scenario) however she is made to Leave No Witnesses.\n• In Ojamajo Doremi Na~i~sho, Doremi befriends a girl named Nozomi in the hospital and learns that she dreams of becoming a witch. Doremi and her friends use their own witch powers to make Nozomi's dream come true for at least one night, and there is serious talk about officially making her a real witch once she gets better. Unfortunately Nozomi's illness takes a turn for the worse, and at the end of the episode Doremi is informed of her death.\n• In Machine Robo Rescue, Makoto finds an doctor at same age that him in hospital and she made an \"date\" with him and buy an present from an child from same hospital, but after saying goodbye she fall down and appears in Hospital in next day, after after she deliver the toy to the child the but the hospital burns, Makoto saves her, but she dies after. After this Makoto endure his work team leader\n• An episode of Vandread season two sees the Nirvana resupply at an extremely polluted planet, where pretty much every inhabitant is sick. Bart particularly bonds with a terminally-ill girl and resolves to protect her from the Harvester force attacking the planet, resulting in the most Character Development he has seen in the entire series so far. Unfortunately, she succumbs to her illness before the battle is over, and cannot finish a doll of Bart she was making (the hair is still missing). When Bart is given the doll, he shaves his head bald for the rest of the show in memory of her.\n• The Sisters arc of A Certain Scientific Railgun begins with Mikoto Misaka meeting one of her rumored clones, MISAKA 9982. Mikoto is having a hard time coming to terms with the experiment not only being real, but active, and the clone is symbolic of that, but the two manage to start bonding nevertheless. 9982 even keeps a gift from Mikoto that she doesn't even like because it was Mikoto that gave it to her. Then Mikoto finds out that that particular clone is scheduled to be killed that night, and isn't able to stop it. Also notable in that the episode starts a shift in tone for that arc different than the series so far.\n• Mobile Suit Gundam AGE: After Kio has been captured by Vagans, Ezelcant frees him to know the colony, and he's find Deen his Illness sister Lu that suffer because of radiation of Mars rays, Kio cooperate to Ezelcant to find medicine to her, but she didn't live much days after. Afters his rescued by Ash and his decide to became Technical Pacifist.\n• The Moonlight Sonata case of Detective Conan was ended with the Villain of the Week Seiji Asou Driven to Suicide. Shinichi/Conan sees this as My Greatest Failure and contributes greatly to his Character Development.\n• Kaworu Nagisa spends his entire televised lifetime in Neon Genesis Evangelion during episode 24. During this time, he enters a relationship with Shinji (confirmed to be romantic by Word of God), who is forced to kill him at the end of the episode. After everything Shinji went through over the course of the series, this is what serves as Shinji's tipping point, sending him into a suicidal state of depression that serves as the catalyst for much of his actions in the second half of The End of Evangelion. In fact, Kaworu is so prominent of a character that he repeatedly appears in Lilith's messages to Shinji during his time as the judger of humankind, representing the part of Shinji that wishes to reject Instrumentality.\n• Nina Tucker from Fullmetal Alchemist; her transformation into a Chimera and death at the hands of Scar continues to haunt the Elrics for the rest of the series, and never letting someone suffer as she did becomes a secondary goal in their quest.\n• Date A Live: Mayuri Judgment introduces the titular Mayuri, a girl that constantly spies on Shido's dates with his harem. She is actually an entity created from the girls' residual magical energy, and like them, she has developed feelings for Shido as well. She sacrifices her life to protect Shido at the end of the movie, but at the very least gets to experience love and die peacefully in the arms of someone who truly cared for her.\n• The Spider-Man story \"Leah \" has a young homeless girl collect pictures of him and look up to him whenever he swings overhead. She gets sick and is carried to the hospital by Spidey, but all they can do is make her comfortable until her liver and kidneys fail. Spidey, who's in a serious funk (having seen the pictures and realizes what he represented for her, when he'd never noticed her) gives her a kiss on the cheek as she dies\n• One Usagi Yojimbo strip has a character named Gon, who dies pretty much solely for the sake of a Gone with the Wind pun.\n• In Monica's Gang, Chuck Billy have Mariana an star that wishes live as human and born as little sister from him but she gets sick and dies and come back as an star and sometimes his back to visit Chuck.\n• The unfortunate Philmont Denlinger is introduced in Robin #56 and murdered in Robin #59. Tim blames himself for the death of this classmate since he's killed by school bullies that Tim knew were targeting him but Tim still, reluctantly and after speaking up for Phil, allowed him to walk away with. This means that outside of his murderers Tim and Ives were the last people to see Phil alive.\n• A Certain Magical Index:\n• Played With in the Sisters arc. Touma briefly meets Mikoto's \"little sister\" Misaka, then runs into her again and befriends her, then finds her lying dead in an alley... and later finds another Misaka cleaning up the first's corpse. Turns out that both Misakas are clones of Mikoto, and that the unit who died (#10031) is not the same as the one he spent time with (#10032), but she is the one he was initially introduced to. The rest of the arc is about preventing #10032 and her successors from meeting the same fate. \n\nA Certain Scientific Railgun, a P.O.V. Sequel from Mikoto's perspective, plays this much more straight (see the Anime & Manga section above).\n• Touma himself effectively \"dies\" at the end of the first novel when his memories are destroyed, but for the remainder of the series he fakes being the same person in order to prevent himself from becoming this to Index.\n• Sword Art Online has done this at least three times:\n• The second novel (a collection of short Interquels to the Aincrad arc) introduces Sachi, a girl who developed feelings for Kirito only to die tragically by the end of her story.\n• Again in the second novel, Kirito and Asuna adopt a young girl named Yui, who is revealed to be an AI and dies tragically, albeit with the hope that she can one day be revived. Come the third novel this is Subverted, with Yui successfully coming Back from the Dead and becoming a Recurring Character.\n• The Mother's Rosario arc centers around Asuna making a new online friend named Yuuki, who is later revealed to be dying of AIDS.\n• In Space: Above and Beyond, if you're assigned to the 58th and you aren't in the opening credits, you're doomed. The fullest example of this is Kelly Winslow in the \"Never No More\"/\"The Angriest Angel\" two-parter, a supporting character in the episode until Chiggy von Richthofen blows up her escape pod. This prompts brain-injured squadron commander T.C. McQueen to personally go out and blow Chiggy out of space.\n• Holly Gribbs from CSI appears only in the Pilot, at the end of which she is shot. Downplayed in that she doesn't die until the next episode, but her death still greatly affects the CSI team and is referenced fairly often throughout the rest of the series.\n• Supergirl: \"Myriad\" Non shows up at CatCo to monologue and see Kara's face as he uses his Mind Control device to force three of her friends to leap off the skyscraper. Two of them we know: James and Winn. The third, \"Kelly,\" is a woman who seems to be a friend of Kara's but who has never been mentioned before. Supergirl races to save all three but misses Kelly, who becomes street pizza as a result so Supergirl has one more thing to angst about.\n• On Lucifer a priest needs Lucifer's help and is unfazed by the fact that Lucifer claims to be the actual Devil. Lucifer is greatly impressed by the priest courage and deep faith. A the end of the episode the priest dies in a Heroic Sacrifice and Lucifer is heartbroken. Lucifer tries to inflict A Fate Worse Than Death on the priest's killer but is talked down by Chloe who reminds him that the priest would not have wanted that.\n• The Buffy the Vampire Slayer episode \"Help\" has Buffy trying to save a psychic girl called Cassie who has foreseen her own death. Buffy manages to save Cassie from attempted sacrifice by a demon cult, but she then suddenly drops dead from natural causes.\n• Star Trek: Voyager has Tuvix - a Transporter Accident Fusion Dance of the stoic Tuvok, and the enthusiastic Neelix. Tuvix has characteristics of both men, bordering on The Ace, and he's certainly a handy crewman to have around. Then the Doctor and Harry Kim find a solution with the transporter to reverse the effects, which should be a cause for celebration until Tuvix utters the Wham Line: \"I don't want to die.\" The episode then becomes a metaphorical trolley problem - let Tuvok and Neelix stay dead for the sake of this new being, or put Tuvix through the transporter to save two of their friends? Status Quo Is God on Voyager, and since you're on this particular page, you probably know where this is headed.\n• One episode of The Powerpuff Girls involves the titular characters creating an additional Powerpuff Girl... with ingredients that aren't exactly the same ones Prof. Utonium used, resulting in a horribly deformed Powerpuff Girl they called Bunny. Because of the Status Quo Is God rule, at the end of the episode, Bunny explodes into a big ball of light due to her growing unstable. At the end of the episode, the PPGs and the narrator himself mourn her. The narrator: For the first... and final time... The day is saved... thanks to the Powerpuff Bunny! [sobs]\n• Samurai Jack; X-9, an ex-robot assassin who wanted nothing more than to play jazz with his Precious Puppy Lulu, only to be called back for One Last Job against the titular samurai and get cut down just like every other robot mook that challenged Jack.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/TragicOneShotCharacter", "media_links": ["/pmwiki/pmwiki.php/Anime/AstroBoy", "/pmwiki/pmwiki.php/Manga/GunslingerGirl", "/pmwiki/pmwiki.php/Anime/OjamajoDoremi", "/pmwiki/pmwiki.php/Toys/MachineRobo", "/pmwiki/pmwiki.php/Anime/Vandread", "/pmwiki/pmwiki.php/Manga/ACertainScientificRailgun", "/pmwiki/pmwiki.php/Anime/MobileSuitGundamAGE", "/pmwiki/pmwiki.php/Manga/DetectiveConan", "/pmwiki/pmwiki.php/Anime/NeonGenesisEvangelion", "/pmwiki/pmwiki.php/Manga/FullmetalAlchemist", "/pmwiki/pmwiki.php/LightNovel/DateALive", "/pmwiki/pmwiki.php/ComicBook/SpiderMan", "/pmwiki/pmwiki.php/ComicBook/UsagiYojimbo", "/pmwiki/pmwiki.php/Film/GoneWithTheWind", "/pmwiki/pmwiki.php/ComicBook/MonicasGang", "/pmwiki/pmwiki.php/ComicBook/RobinSeries", "/pmwiki/pmwiki.php/ComicBook/RobinSeries", "/pmwiki/pmwiki.php/LightNovel/ACertainMagicalIndex", "/pmwiki/pmwiki.php/Manga/ACertainScientificRailgun", "/pmwiki/pmwiki.php/LightNovel/SwordArtOnline", "/pmwiki/pmwiki.php/Series/SpaceAboveAndBeyond", "/pmwiki/pmwiki.php/Series/CSI", "/pmwiki/pmwiki.php/Series/Supergirl2015", "/pmwiki/pmwiki.php/Series/Lucifer2016", "/pmwiki/pmwiki.php/Series/BuffyTheVampireSlayer", "/pmwiki/pmwiki.php/Series/StarTrekVoyager", "/pmwiki/pmwiki.php/WesternAnimation/ThePowerpuffGirls", "/pmwiki/pmwiki.php/WesternAnimation/SamuraiJack"], "non_media_links": ["/pmwiki/pmwiki.php/Main/TearJerker", "/pmwiki/pmwiki.php/Administrivia/NoRealLifeExamplesPlease", "/pmwiki/pmwiki.php/Main/VictimOfTheWeek", "/pmwiki/pmwiki.php/Main/GirlOfTheWeek", "/pmwiki/pmwiki.php/Main/MonsterOfTheWeek", "/pmwiki/pmwiki.php/Main/ADeathInTheLimelight", "/pmwiki/pmwiki.php/Main/SubTrope", "/pmwiki/pmwiki.php/Main/OneShotCharacter", "/pmwiki/pmwiki.php/Main/DeathTrope", "/pmwiki/pmwiki.php/Main/BittersweetEnding", "/pmwiki/pmwiki.php/Main/PuppyLove", "/pmwiki/pmwiki.php/Main/LeaveNoWitnesses", "/pmwiki/pmwiki.php/Main/CharacterDevelopment", "/pmwiki/pmwiki.php/Main/ImportantHaircut", "/pmwiki/pmwiki.php/Main/ClonesArePeopleToo", "/pmwiki/pmwiki.php/Main/OneeSama", "/pmwiki/pmwiki.php/Main/GutPunch", "/pmwiki/pmwiki.php/Main/CerebusSyndrome", "/pmwiki/pmwiki.php/Main/TechnicalPacifist", "/pmwiki/pmwiki.php/Main/VillainOfTheWeek", "/pmwiki/pmwiki.php/Main/DrivenToSuicide", "/pmwiki/pmwiki.php/Main/MyGreatestFailure", "/pmwiki/pmwiki.php/Main/CharacterDevelopment", "/pmwiki/pmwiki.php/Main/WordOfGod", "/pmwiki/pmwiki.php/Main/TheMovie", "/pmwiki/pmwiki.php/Main/TheMovie", "/pmwiki/pmwiki.php/Main/TheHero", "/pmwiki/pmwiki.php/Main/HaremGenre", "http://i.imgbox.com/jp5WyzEH.jpg", "/pmwiki/pmwiki.php/Main/PlayedWith", "/pmwiki/pmwiki.php/Main/ClonesArePeopleToo", "/pmwiki/pmwiki.php/Main/POVSequel", "/pmwiki/pmwiki.php/Main/AmnesiacHero", "/pmwiki/pmwiki.php/Main/Interquel", "/pmwiki/pmwiki.php/Main/Subverted", "/pmwiki/pmwiki.php/Main/BackFromTheDead", "/pmwiki/pmwiki.php/Main/RecurringCharacter", "/pmwiki/pmwiki.php/Main/LittlestCancerPatient", "/pmwiki/pmwiki.php/Main/RedShirt", "/pmwiki/pmwiki.php/Main/TheDreaded", "/pmwiki/pmwiki.php/Main/SinkTheLifeboats", "/pmwiki/pmwiki.php/Main/CareerEndingInjury", "/pmwiki/pmwiki.php/Main/MindControl", "/pmwiki/pmwiki.php/Main/RuleOfThree", "/pmwiki/pmwiki.php/Main/HeroicSacrifice", "/pmwiki/pmwiki.php/Main/AFateWorseThanDeath", "/pmwiki/pmwiki.php/Main/MoralityChainBeyondTheGrave", "/pmwiki/pmwiki.php/Main/TeleporterAccident", "/pmwiki/pmwiki.php/Main/FusionDance", "/pmwiki/pmwiki.php/Main/TheAce", "/pmwiki/pmwiki.php/Main/WhamLine", "/pmwiki/pmwiki.php/Main/IDontWantToDie", "/pmwiki/pmwiki.php/Main/StatusQuoIsGod", "/pmwiki/pmwiki.php/Main/BittersweetEnding", "/pmwiki/pmwiki.php/Main/TheGrotesque", "/pmwiki/pmwiki.php/Main/StatusQuoIsGod", "/pmwiki/pmwiki.php/Main/PreciousPuppy", "/pmwiki/pmwiki.php/Main/OneLastJob"]}