{"title": "Stock Series Finales", "content": "When a television series isn't cancelled abruptly, writers have time to wrap things up. There seem to be a pretty standard set of types of Series Finales to end on, provided the show's creators have time to plan it out in advance. Most of these can all be mixed together as one wishes. Occasionally, the series may then be Un-Cancelled, and the writers find themselves in a corner.\n• Villain Death: The main antagonist dies, ideally, by being defeated by the good guy. This may just be the set up for the proper ending which may take on any of the below forms.\n• Birth: A long-running couple gives birth to their first child.\n• Back to Normal: In a supernatural or superhero show, the main character is robbed of their supernatural abilities/technologies/friends and goes back to living a normal life (or, at the very least, tells his or her loved ones about his or her powers and decides to go on the run and try to live a normal life while keeping his or her powers under wraps).\n• Distant Finale: The show flashes forward into the future to show what happened to the main characters.\n• Gainax Ending: In the end, something happens...and nobody understands what the hell actually happened — unless the viewer is really good at drawing conclusions and can piece together what happened, and even if a viewer can do that, there would still be loose ends and unanswered questions to plot holes and noodle incidents.\n• Graduation: If the series centers on kids in school, expect this to be the final episode, especially if it's a high school series. If it's a live action show with aging actors who would resemble graduating high school students by the end of production, then it's all the better. A series centered on college students rarely have this as an ending (as most college shows, whether or not they're spin-offs, don't last) but the graduation ending on college shows does exist.\n• Grand Finale: Failure Is the Only Option stops being in effect, and with failure suddenly not the only option, the series premise is finally resolved. Since Tropes Are Not Bad, this stock ending can be met with lots of fanfare as the character we root for succeed.\n• Here We Go Again!: The series ends on a middle note, referencing something from one of the earliest episodes and showing that Nothing Really Changed after all.\n• Death: The main character(s) die.\n• Bolivian Army Ending: Like Death, but with specifics left to the viewer's imagination. May or may not include a post credits scene that hints at the characters still being alive.\n• Last Minute Hookup: The two Will They or Won't They? characters finally get together.\n• Moving: The cast or the principal stars move away. This is usually the case in family sitcoms, and some that end this way are Clip Show episodes. May go hand in hand with a graduation ending as the high school students go their separate ways.\n• Walk Into the Sunset and And the Adventure Continues: The series ends with the characters going off on another adventure. This ending is the one ripe for fans to either write fanfiction about what happens after the series ends or fans to pester the show creators into continuing the series.\n• Wedding: The main couple or a pair of supporting characters are married off.\n• \"Where Are They Now?\" Epilogue: Sometimes used in conjunction with other ending tropes (particularly the \"Graduation\" ending, the \"Moving Out\" ending, and the Distant Finale ending); what happens to the characters in the future is summarized either in a captioned statement or a voiceover narration, usually on a person-by-person basis.\n• The entire series is revealed to be All Just a Dream (whether it's from the mind of someone dying, someone unconscious/in a coma, or from someone sleeping). Often, this is the bad writers' way out of a series or done to retcon anything considered Fanon Discontinuity. If you're a series writer, use caution and sufficient foreshadowing before using this.\n• Final Battle: An action/adventure series usually ends with this. May be a precursor to any of the above.\n\nAs you might expect, this is an ending trope. Expect unmarked spoilers.\n• To no one's surprise, Lord Voldemort died at the end of the last Harry Potter book.\n• At the end of both Sabriel and Abhorsen, the Sealed Evil in a Can is sealed up once more, and the world is safe.\n• By the end of Inuyasha Naraku is indeed finally destroyed.\n• Static Shock had a cure found for the Bang Babies in its finale. Fortunately, thanks to another exposure to the Bang Baby gas, Static keeps his powers, and even becomes stronger than ever.\n• The Secret World of Alex Mack also found a cure in its finale. However, it's left up in the air if Alex actually takes it or not.\n• Star Trek: The Next Generation ended with a future screen.\n• Star Trek: Voyager and Star Trek: Enterprise include glimpses of the future of their characters.\n• After a lengthy battle that finally resolves the Human-Cylon war, the series finale of Battlestar Galactica ends with a look at the fate of all the characters before jumping ahead several thousand years into the future.\n• The Mad About You finale jumps the show 20+ years into the future, presenting the Buchmans' now-adult daughter Mabel showing what became of her family and the rest of the characters.\n• The infamous ending of Digimon Adventure 02. In this ending, the cast is shown as adults, with each of them having kids and a nice job, along with their Digimon partners.\n• The rather original finale to Codename: Kids Next Door is a flashback episode intercut with interviews with the kids as middle-aged adults (played by live action actors).\n• The epilogue to the final Harry Potter book, which shows Harry and Ginny and Ron and Hermione being married couples who see their sons and daughters off at Kings Cross Station.\n• Six Feet Under ends with flash forwards to the eventual death of every still living character.\n• Babylon 5 did at least two distant endings. One involved glimpses of humanity's future up to a million years ahead, then a more conventional version many episodes later, featuring the fate of the principal characters.\n• China Beach has the surviving veterans reunite and visit the Vietnam War Memorial in Washington D.C.\n• Scrubs ends with J.D. imagining one possible future for the group, complete with marriages, kids, and Christmases spent together. JD: And who's to say this isn't what happens? Who can tell me that my fantasies won't come true...just this once.\n\nFailure Is the Only Option...Not\n• The Fugitive: Richard Kimble finally confronts the One-Armed Man and manages to clear his name for the murder of his wife.\n• Star Trek: Voyager: The USS Voyager finally made it home after 7 years of failed attempts.\n• When they thought that Stargate SG-1 was ending, the producers wrote a story line that featured the final defeat of both the Replicators and the System Lords.\n• Ed, Edd n Eddy has the titular characters finally be accepted by the rest of the neighborhood kids in the movie.\n• In the relatively obscure cartoon Dogstar, The main characters are given the device that allows them to summon the missing titular ship that contains all the world's dogs that got lost after civilization migrated to a new planet after they destroyed Earth by pollution. Afterwards, the Big Bad inadvertently destroys it, and they have to migrate back to the newly repaired Earth.\n• Adrian Monk finally solves his wife's murder at the end of the eighth season.\n• Good Times has the main characters finally having success at various endeavors they had been struggling with during the show's run.\n• Kim Possible ended its Post-Script Season with Kim and gang's graduation from high school.\n• The Suite Life on Deck: \"Graduation On Deck\" which ends both Zack and Cody and On Deck.\n• The Steve Harvey Show: Romeo, Lydia, and Bullethead graduate from high school. This was originally supposed to be the final episode, but thanks to Executive Meddling, it became the next-to-last episode. However, it is shown as the final episode in syndication.\n• Leave It to Beaver: Although not shown onscreen in this episode, many references are made to Beaver graduating from eighth grade (i.e., entering high school in the fall) and Wally graduating from high school (and getting ready to enter college).\n• House of Anubis: The Movie, Touchstone of Ra, took place during graduation and is at least assumed to be the finale, with all the students graduating from the Academy of Adventure.\n• In-Universe on the show Sing it Loud! for Liv and Maddie, which ends with Liv's character Stephanie Einstein graduating.\n• Star Trek: Voyager also has the birth of Official Couple Tom and B'Elanna's first child, Miral Paris.\n• Farscape has Aeryn pregnant throughout the final season, although for a time in the Miniseries wrap up the baby is carried by Rygel. The baby is born in the miniseries (after making its way back to Aeryn).\n• Chandler and Monica's adoptive children were born in the Friends series finale.\n• Amen ended with the birth of Thelma and Reuben's son.\n• Niles and Daphne's son is born in the final episode of Frasier\n• Mama's Family ends with the birth of Tiffany Thelma Harper, Vint and Naomi's daughter.\n• Lost ends with most of the cast reuniting in a self-created afterlife, then exiting through a glowing door together.\n• Every Joss Whedon series generally kills off at least one major character in the finale.\n• Robin Hood ended with its eponymous character dying and getting a Together in Death scene with Marian.\n\nHere We Go Again!\n• Dai-Guard ends with the characters (and presumably Japan) having accepted that the giant monsters, Heterodynes, are a natural disaster, akin to hurricanes and earthquakes, so will just continue doing their best to save lives. After taking out the biggest Heterodyne yet, of course.\n• The final Seinfeld episode finds Jerry and George having the exact same conversation that they were having at the beginning of the show's very first episode.\n• The infamous ending to Stephen King's The Dark Tower series, where (after a full page of the author urging the reader to stop right there because endings can never satisfy the buildup a story creates) Roland finally enters the Tower, only to find that it resets him back to where he started in Book 1 of the adventure (albeit with the implication he has a chance of getting it right this time).\n• The animated series Mighty Max ends with Big Bad Skull Master killing all the supporting characters, only to be defeated by Max at the end in a move which teleports Max all the way back to the first episode of the series (although, as he retains his full memories of the entire series, presumably he has a chance of doing better this time round).\n• The canonical ending to the final episode of Red vs. Blue is a scene that directly mirrors the first scene from the first episode of the series.\n• The end of Mystery Science Theater 3000 has Mike and the bots now on Earth and living in an apartment... where they now watch bad movies all on their own choice. The film in question they're watching at the end? The Crawling Eye, the same film watched in the first official episode of the series.\n• The Fresh Prince of Bel-Air ended with Uncle Phil's family moving to a new house.\n• iCarly ended with Carly moving to Italy with her father.\n• Frasier has the titular character leaving Seattle, ostensibly to take a job in San Francisco. In the final moments of the show, however, it's revealed he instead took a flight to Chicago to meet up with his love interest.\n• Fraggle Rock ends with Doc moving to the desert to accompany Ned Shimmelfinney (or, in the UK version, the lighthouse getting automated and B.J. becoming the caretaker of a castle), sad that he has to leave the Fraggles now that he's learned of their existence. It turns out Fraggle Rock exists there too.\n• In the last episode of Friends, Chandler and Monica move to the suburbs, and it's mentioned that all of them have lived in that apartment at some point. (Phoebe was established as having shared it with Monica prior to the first episode; Ross gets a retcon that he stayed there for a while when his and Monica's grandmother still lived there.)\n• The Series Fauxnale of Scrubs has J.D. moving to a different hospital. (Then he moves back to Sacred Heart when it gets Un-Canceled, only it's not the same Sacred Heart any more.)\n• Star Trek: Deep Space Nine, whose producers knew they weren't getting a movie, has this happen to many of the characters following the Final Battle — Sisko is taken up to join the Prophets, Odo returns to the Great Link, O'Brien takes a teaching job at Starfleet Academy, Worf becomes the Federation ambassador to the Klingon homeworld, Garak remains on Cardassia after the war, and Rom goes off to become the Grand Nagus. Kira, Bashir, Ezri Dax, and Quark remain on the station.\n• Broad City ends with Abbi moving to Colorado to focus on her art.\n• My Little Pony: Friendship Is Magic ended with Twilight moving back to Canterlot and becoming the new ruler of Equestria.\n\nWill They or Won't They?\n• Kim Possible ended originally with the Last Minute Hookup of Kim and Ron before the show was Un-Canceled.\n• Danny Phantom ended with the Last Minute Hookup as well. And unlike the above, it didn't get Un-Canceled.\n• The Friends finale ended with Ross and Rachel getting back together. For good, this time.\n• Family Matters ended with Urkel finally getting his girl, Laura, when they share a kiss after Urkel almost dies in outer space.\n• How I Met Your Mother ends when Ted realizing that he really did love Robin the whole time and goes to her apartment with the symbol of their love, the blue french horn.\n• Neon Genesis Evangelion is the most infamous, though the actual ending is relatively easy to understand if you take a College Course on Philosophy, Psychology, and/or Religious Studies.\n• The Prisoner (1967): In the end, everyone goes crazy, wears weird costumes, and sings Dem Bones all day long. Would have been the Trope Namer if Gainax wasn't so infamously divisive at endings.\n• Mystery Science Theater 3000's first finale (when Comedy Central had canceled them, and the Sci-Fi Channel hadn't yet Un-Canceled them) has Mike and the bots fly the Satellite of Love out to the edge of the universe, where they all ascend as beings of pure energy. Meanwhile, Dr. Forester reenacts the notoriously confusing ending of 2001: A Space Odyssey (with the Monolith replaced by a giant VHS tape labeled \"the worst movie ever\") and reverts to a baby, and his mother Pearl takes the opportunity to Raise Him Right This Time.\n• Parks and Recreation has had so many series fauxnales that several episodes fall into some of these tropes. \"Lil Sebastian\" (Season 3 finale) falls into the And the Adventure Continues trope, with Leslie thinking about running for city council, Tom quitting his job, and Ron's ex-wife Tammy 1 returning. \"Leslie and Ben\" falls into the wedding trope, with Leslie and Ben's wedding. \"Moving Up\" is a Distant Finale, with a 3-year Time Skip. The actual series finale is a \"Where Are They Now?\" Epilogue.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/StockSeriesFinales", "media_links": ["/pmwiki/pmwiki.php/Literature/HarryPotterandTheDeathlyHallows", "/pmwiki/pmwiki.php/Literature/TheOldKingdom", "/pmwiki/pmwiki.php/Manga/Inuyasha", "/pmwiki/pmwiki.php/WesternAnimation/StaticShock", "/pmwiki/pmwiki.php/Series/TheSecretWorldOfAlexMack", "/pmwiki/pmwiki.php/Series/StarTrekTheNextGeneration", "/pmwiki/pmwiki.php/Series/StarTrekVoyager", "/pmwiki/pmwiki.php/Series/StarTrekEnterprise", "/pmwiki/pmwiki.php/Series/BattlestarGalactica2003", "/pmwiki/pmwiki.php/Series/MadAboutYou", "/pmwiki/pmwiki.php/Anime/DigimonAdventure02", "/pmwiki/pmwiki.php/WesternAnimation/CodenameKidsNextDoor", "/pmwiki/pmwiki.php/Literature/HarryPotterandTheDeathlyHallows", "/pmwiki/pmwiki.php/Series/WillAndGrace", "/pmwiki/pmwiki.php/Series/SixFeetUnder", "/pmwiki/pmwiki.php/Series/BabylonFive", "/pmwiki/pmwiki.php/Series/ChinaBeach", "/pmwiki/pmwiki.php/Series/Scrubs", "/pmwiki/pmwiki.php/Series/TheFugitive", "/pmwiki/pmwiki.php/Series/StarTrekVoyager", "/pmwiki/pmwiki.php/Series/StargateSG1", "/pmwiki/pmwiki.php/WesternAnimation/EdEddNEddy", "/pmwiki/pmwiki.php/WesternAnimation/Dogstar", "/pmwiki/pmwiki.php/Series/Monk", "/pmwiki/pmwiki.php/Series/GoodTimes", "/pmwiki/pmwiki.php/WesternAnimation/KimPossible", "/pmwiki/pmwiki.php/Series/SavedByTheBell", "/pmwiki/pmwiki.php/Series/HeadOfTheClass", "/pmwiki/pmwiki.php/Manga/AzumangaDaioh", "/pmwiki/pmwiki.php/WesternAnimation/FishHooks", "/pmwiki/pmwiki.php/Manga/FruitsBasket", "/pmwiki/pmwiki.php/Series/TheBradyBunch", "/pmwiki/pmwiki.php/Series/TheCosbyShow", "/pmwiki/pmwiki.php/Anime/OjamajoDoremi", "/pmwiki/pmwiki.php/Series/TheSuiteLifeOnDeck", "/pmwiki/pmwiki.php/Series/TheSteveHarveyShow", "/pmwiki/pmwiki.php/Manga/KOn", "/pmwiki/pmwiki.php/Series/LeaveItToBeaver", "/pmwiki/pmwiki.php/Series/HouseOfAnubis", "/pmwiki/pmwiki.php/Series/LivAndMaddie", "/pmwiki/pmwiki.php/Series/StarTrekVoyager", "/pmwiki/pmwiki.php/Series/Farscape", "/pmwiki/pmwiki.php/Series/Coupling", "/pmwiki/pmwiki.php/Series/Friends", "/pmwiki/pmwiki.php/Series/Amen", "/pmwiki/pmwiki.php/Series/Frasier", "/pmwiki/pmwiki.php/Series/MamasFamily", "/pmwiki/pmwiki.php/Series/Lost", "/pmwiki/pmwiki.php/Creator/JossWhedon", "/pmwiki/pmwiki.php/Series/RobinHood", "/pmwiki/pmwiki.php/Anime/DaiGuard", "/pmwiki/pmwiki.php/Series/Seinfeld", "/pmwiki/pmwiki.php/Franchise/TheDarkTower", "/pmwiki/pmwiki.php/Literature/TheGunslinger", "/pmwiki/pmwiki.php/WesternAnimation/MightyMax", "/pmwiki/pmwiki.php/Series/MysteryScienceTheater3000", "/pmwiki/pmwiki.php/Film/TheCrawlingEye", "/pmwiki/pmwiki.php/Series/TheFreshPrinceOfBelAir", "/pmwiki/pmwiki.php/Series/ICarly", "/pmwiki/pmwiki.php/Series/Frasier", "/pmwiki/pmwiki.php/Series/FraggleRock", "/pmwiki/pmwiki.php/Series/Friends", "/pmwiki/pmwiki.php/Series/Scrubs", "/pmwiki/pmwiki.php/Series/StarTrekDeepSpaceNine", "/pmwiki/pmwiki.php/Series/BroadCity", "/pmwiki/pmwiki.php/WesternAnimation/MyLittlePonyFriendshipIsMagic", "/pmwiki/pmwiki.php/WesternAnimation/KimPossible", "/pmwiki/pmwiki.php/WesternAnimation/DannyPhantom", "/pmwiki/pmwiki.php/Series/Friends", "/pmwiki/pmwiki.php/Series/FamilyMatters", "/pmwiki/pmwiki.php/Series/HowIMetYourMother", "/pmwiki/pmwiki.php/Anime/NeonGenesisEvangelion", "/pmwiki/pmwiki.php/Series/ThePrisoner1967", "/pmwiki/pmwiki.php/Series/MysteryScienceTheater3000", "/pmwiki/pmwiki.php/Series/ParksAndRecreation"], "non_media_links": ["/pmwiki/pmwiki.php/Main/UnCancelled", "/pmwiki/pmwiki.php/Main/BabiesEverAfter", "/pmwiki/pmwiki.php/Main/BroughtDownToNormal", "/pmwiki/pmwiki.php/Main/DistantFinale", "/pmwiki/pmwiki.php/Main/GainaxEnding", "/pmwiki/pmwiki.php/Main/NoodleIncident", "/pmwiki/pmwiki.php/Main/GraduateFromTheStory", "/pmwiki/pmwiki.php/Main/GrandFinale", "/pmwiki/pmwiki.php/Main/FailureIsTheOnlyOption", "/pmwiki/pmwiki.php/Main/TropesAreNotBad", "/pmwiki/pmwiki.php/Main/HereWeGoAgain", "/pmwiki/pmwiki.php/Main/BookEnds", "/pmwiki/pmwiki.php/Main/StatusQuoIsGod", "/pmwiki/pmwiki.php/Main/KillEmAll", "/pmwiki/pmwiki.php/Main/BolivianArmyEnding", "/pmwiki/pmwiki.php/Main/KillEmAll", "/pmwiki/pmwiki.php/Main/LastMinuteHookup", "/pmwiki/pmwiki.php/Main/WillTheyOrWontThey", "/pmwiki/pmwiki.php/Main/ClipShow", "/pmwiki/pmwiki.php/Main/StockSitcomGrandFinale", "/pmwiki/pmwiki.php/Main/RidingIntoTheSunset", "/pmwiki/pmwiki.php/Main/AndTheAdventureContinues", "/pmwiki/pmwiki.php/Main/WeddingDay", "/pmwiki/pmwiki.php/Main/WhereAreTheyNowEpilogue", "/pmwiki/pmwiki.php/Main/DistantFinale", "/pmwiki/pmwiki.php/Main/AllJustADream", "/pmwiki/pmwiki.php/Main/AssPull", "/pmwiki/pmwiki.php/Main/FanonDiscontinuity", "/pmwiki/pmwiki.php/Main/FinalBattle", "/pmwiki/pmwiki.php/Main/SealedEvilInACan", "/pmwiki/pmwiki.php/Main/DistantFinale", "/pmwiki/pmwiki.php/Main/FailureIsTheOnlyOption", "/pmwiki/pmwiki.php/Main/EarnYourHappyEnding", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/PostScriptSeason", "/pmwiki/pmwiki.php/Main/ExecutiveMeddling", "/pmwiki/pmwiki.php/Main/TheMovie", "/pmwiki/pmwiki.php/Main/AcademyOfAdventure", "/pmwiki/pmwiki.php/Main/InUniverse", "/pmwiki/pmwiki.php/Main/OfficialCouple", "/pmwiki/pmwiki.php/Main/GoIntoTheLight", "/pmwiki/pmwiki.php/Main/TogetherInDeath", "/pmwiki/pmwiki.php/Main/HereWeGoAgain", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Machinima/RedVsBlue", "/pmwiki/pmwiki.php/Main/SeriesFauxnale", "/pmwiki/pmwiki.php/Main/UnCanceled", "/pmwiki/pmwiki.php/Main/FinalBattle", "/pmwiki/pmwiki.php/Main/AscendToAHigherPlaneOfExistence", "/pmwiki/pmwiki.php/Main/WillTheyOrWontThey", "/pmwiki/pmwiki.php/Main/LastMinuteHookup", "/pmwiki/pmwiki.php/Main/UnCanceled", "/pmwiki/pmwiki.php/Main/LastMinuteHookup", "/pmwiki/pmwiki.php/Main/UnCanceled", "/pmwiki/pmwiki.php/Main/GainaxEnding", "/pmwiki/pmwiki.php/Main/UnCanceled", "/pmwiki/pmwiki.php/Main/RaiseHimRightThisTime", "/pmwiki/pmwiki.php/Main/SeriesFauxnale", "/pmwiki/pmwiki.php/Main/AndTheAdventureContinues", "/pmwiki/pmwiki.php/Main/TimeSkip", "/pmwiki/pmwiki.php/Main/WhereAreTheyNowEpilogue"]}