{"title": "Phony Article", "content": "A Phony Article is a magazine ad dressed up to look like an article from the magazine, with a tiny little tag in the corner or at the top saying something like \"advertisement\" or \"advertising feature\".\n\nThis is particularly prevalent in magazines that are already basically promotional, as these give the illusion the magazines at least have some content.\n• The New Yorker often has a few pages of cartoons by that magazine's regular cartoonists, advertising the product.\n• Reader's Digest also has these.\n• Games Magazine used to have a regular puzzle where the object was to identify which of its ads is a Phony Ad for a nonexistent product. Hilarity ensued when Newman's Own Salad Dressing debuted in a 1982 issue and readers kept insisting it was the fake ad (there wasn't one in the issue in question...).\n• Saturday Night Live performed a live-action version of this in the 2008/09 season, where a series of Pepsi ads shown during an episode featured SNL's \"MacGruber\" character, played by the normal actor and produced by the normal team. The style and placing of the segments made it unclear whether they were truly ads for the soft drink, or a parody of ads for softdrinks.\n• A common sight in Nintendo Power magazine, trying to convince \"nintenfriends\" of how awesome the SNES was over the Sega CD and Genesis. Ass-pulled stats were a given.\n• Later, they had phony covers. Granted, they are fairly different than the actual cover format.\n• Common in major American newspapers such as USA Today and the Wall Street Journal to sell things like 'fireplaces in a box' which were built by allegedly Amish people and coin collections by private parties which are usually much cheaper and easier to buy through your own bank, but are presented as 'amazing deals'.\n• Used as a plot-point in an episode of Mathnet, where a businessman, hoping to devalue the price of a certain berry, takes out ads in Berry Magazines where he uses faulty sampling data to link the food-stuff to skin blemishes. Pat and George expose the problem, but admit that the damage has been done and they need more evidence if they want anything more than \"a correction on page 183\".\n• New Scientist sometimes does this, for instance a two-part \"Advertising Feature\" about how awesome cloud computing is and how it's going to change everything, with an IBM logo discreetly placed at the end.\n• These appear pretty frequently on websites: on a news site they might be disguised to look like a link to another article on the site, and on file-sharing websites the ads often appear to look like the button you press to download the file - it might take some hunting to find the real one.\n• A regular feature of Saturday and Sunday magazine supplements in British Newspapers. Often done in exactly the same typeface, font, style, etc., as the actual editorial content, with only the tiny words \"Advertising Feature\" to alert you to the fact you are not reading editorial content.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/PhonyArticle", "media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/Series/SaturdayNightLive", "https://tvtropes.org/pmwiki/pmwiki.php/Series/MacGyver"], "non_media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/Main/AdvertisingDisguisedAsNews", "https://tvtropes.org/pmwiki/pmwiki.php/Magazine/TheNewYorker", "https://tvtropes.org/pmwiki/pmwiki.php/Main/LampshadeHanging", "https://tvtropes.org/pmwiki/pmwiki.php/Magazine/NintendoPower", "https://tvtropes.org/pmwiki/pmwiki.php/Main/AssPull", "https://tvtropes.org/pmwiki/pmwiki.php/UsefulNotes/BritishNewspapers"]}