{"title": "Recurring Boss Template", "content": "You've decided to play through a game series you like. After the third game, you start to notice a pattern: Some of these guys look or act similar to a boss from the last few games. You have discovered the Recurring Boss Template.\n\nThis is when a game series seems to reuse a boss in some way, but with something changed, often repeatedly throughout the series. It may have more attacks than the last time, or it may look different, but at the core it's still the same Cosmic Horror you faced two games ago.\n\nSimilar to, but not to be confused with Recurring Boss and Legacy Boss Battle, which are simply one character, machine, creature, or species of creature that gets the boss spot more than one time.\n• Kirby:\n• The series seems to love using either limbless cyclopean Eldritch Abominations or Teleport Spam wizards as the final bosses. These bosses often have attacks involving raining balls of paint (or some equivalent) and firing beams out of portals. Super Smash Bros.., which was also made by HAL Laboratories, also uses this pattern with Master Hand, Crazy Hand and .\n• Kirby games traditionally have Whispy Woods as a boss, but if he doesn't appear, and sometimes even if he does, you can bet there will be some tall, tree-like object with a similar appearance, name, and attack pattern. Examples include King Golem, Wicked Willow, Floaty Woods, Whispy's Revenge, Flowery Woods, Clanky Woods, Yggy Woods, and Parallel Woods.\n• There's an entire archetype of \"Knight\" bosses, from the four so far with Knight in their name, to slightly more esoteric ones like Metal General.\n• House of the Dead:\n• The series commonly uses a Final Boss that takes a humanoid form, and floats around throwing energy at you, often named after the most sinister-sounding tarot cards. Except for 4, in which the Final Boss is a giant ice insect that has its lower body underground. This one is named after The World... yeah, It Makes (Some) Sense In Context. Several of these final bosses have a final attack in which they unleash a large number of hard-to-hit projectiles above or behind you, forcing you to deal with the attacks first before you can continue firing away at the boss.\n• They dropped the Tarot Motifs entirely for The House of the Dead: OVERKILL. So, the final boss of that game is simply named \"Mother\"... which is pretty fitting, in an extremely creepy, misogynistic, Freudian, and just overall Squick-laden way.\n• Super Mario Bros.:\n• The Mario & Luigi series for the Nintendo handhelds take pride in using ghostly, (most of the time) purple final bosses. And Bowser getting possessed/mind controlled/fused with/whatever else by the Big Bad And every game in the series has a Wiggler boss (the Swiggler from Partners in Time being a Shroob variation), which will have a Shockwave Stomp.\n• New Super Mario Bros.:\n• The Koopalings in the three games where they appear take their cues from Super Mario Bros. 3 (especially with the magic scepter attacks), while sharing the spin attack Ludwig premiered in Super Mario World.\n• Every time you fight Bowser in the series, the battle is some variant of the battles against him in the original Super Mario Bros. (the ones with the bridge and the axe). It also shows up in Super Mario 3D Land.\n• Bowser also has a habit of fighting Mario in arenas with fragile floors that he can be tricked into breaking. First seen in Super Mario Bros. 3, but makes a comeback in Mario Party 5 and Super Mario Galaxy.\n• The Legend of Zelda frequently has bosses that either:\n• Have an eye as a weakness.\n• Are killed by throwing bombs into their mouths.\n• The Final Boss that ends with an elaborate sword duel.\n• Gradius games tend to involve Recurring Bosses, but near their ends, they have variations on a \"gun wall\" boss, variations on a boss whose legs the player must duck and weave through, and variations on the organic Anticlimax Boss.\n• Final Fantasy:\n• There are similarities among the bosses at the start of Final Fantasy IV, Final Fantasy V, Final Fantasy VI, and Final Fantasy VII. You know, the ones where you have to refrain from attacking halfway through the battle.\n• Tutorial bosses could be exempted. Those are designed to teach people to wait despite being turn-based.\n• IV, V, and VI all have bosses who rely heavily on Quake and may have abiltiies to remove Float (The White Dragon, Catastrophe, and the Dirt Dragon, respectively).\n• IV has several bosses in the form of \"main boss and two flunkies,\" such as Baigan, the Magus Sisters, and the CPU. For these bosses, it is unwise to kill off (both of) the flunkies first: not only will they be revived to full health by the main boss, but in the case of the CPU, said revival is accompanied by a devastating attack. VIII takes the formula and changes it up a bit: in fights such as the NORG Pod and Mobile Type-8, the flunkies are invulnerable, serving mainly as sources of Muggable items and Drawable magic for the player in addition to whatever they do for their bosses.\n• Mega Man\n• Mega Man X. Sigma. Two- to three-stage boss, first with a robot body with lightsaber/twin claws/a spiked throwing shield/energy scythe/whatever, then more on the level of One-Winged Angel variants.\n• Mega Man Zero and Mega Man ZX. Various characters. A human form, followed by a One-Winged Angel. Reversed for Omega and .\n• There's quite a variety of Devils to be seen throughout the entire series. Whether they're Yellow, Green, Black, or Rainbow, they are all able to split themselves into globs to launch at you and form into various weapons. They also tend to be That One Boss; the exception is in Mega Man X: Command Mission, where they're demoted into regular enemies. That being said, if you purposefully beef them 2 of them up by hitting them with the attacks of their own element, they not only get healed but become stronger as well at the benefit of increased experience and FME: the effect is cumulative and once you power the experience-increasing variety to the point where killing one will practically guarantee a level-up for the entire cast, they can easily kill anyone in 1 hit and get a boatload of turns to easily do so as well. Although usually at that point, they rarely if ever take advantage of their massively powered up status and actually attack you and instead opt to run away on their next turn, taking the EXP with them.\n• Metroid games have a few examples of this. For example, the final bosses of Metroid Fusion and Metroid: Zero Mission have a eary similar attack pattern (walk slowly forwards, stop, swing their claws in a huge arc) and weak spot (in the chest), although the one in Zero Mission spices things up a bit by also firing missiles and lasers.\n• Metal Gear:\n• Most games are guaranteed to end with a melee battle. You can try to shoot The Boss in Metal Gear Solid 3, but she'll deflect your bullets, strip you of your gun, and force you into CQC. It's not just melee battles, either. There is almost always the following;\n• Battle against a giant robot that must be taken down with missiles (Metal Gear Rex/Metal Gear Rays/The Shagohod/Metal Gear Ray/ )\n• Battle where you use a sniper rifle (Sniper Wolf/Vamp/The End/Crying Wolf/Quiet)\n• Battle against someone in a maze-like area (Vulcan Raven/Fatman/The Fury/Raging Raven/Eli )\n• Battle against an opponent who can hide from you and attacks from above (Gray Fox/Vamp/The Fear/Laughing Octopus/The Skulls Parasite Unit)\n• The first boss battle in a Raiden game is usually against a duo of machine, with one appearing slightly before the other.\n• Several bosses' gimmick(s) have actually been reused in different expansion packs in World of Warcraft. Such as, for example:\n• Mind control. Mostly used by Jammal'an and first by Arugal.\n• Gruul petrifies the party and shatters them if they're too close. Later in Wrath, another boss does the same thing. In Cataclysm, Ozruk does the same thing again.\n• Brutallus and Argaloth share the same model and a very similar Meteor Slash mechanic (an attack that must be absorbed by several people stacking up to split the damage, then switching off after a while), albeit with Argaloth being a considerably simpler fight.\n• Sapphiron's ice bomb mechanic and the required LOS cover is reused in the Sindragosa encounter. The two also happen to be reanimated blue dragons.\n• Kingdom Hearts has several of these, most notably the giant \"leader\" boss who summons lesser foes from the ground and the \"armor\" boss who's made up of mechanized limbs that attack both together and separately.\n• Major Stryker has three templates, each used once in each episode, though with differences.\n• Castlevania has several:\n• Dracula himself. Aside from his varied One-Winged Angel forms, his first form always uses Teleport Spam while throwing fireballs. Dracula's \"potential hosts\" from the Castlevania: Chronicles of Sorrow games as well use the teleport and fireball routine.\n• Dracula's aide, Death, often uses different tricks from game to game, but he always summons mini-sickles out of thin air to hunt you down.\n• Golems and giant armors as major blockades in your path or as proper boss fights. This kind of enemy is massive and slowly walks back and forth while dealing very powerful attacks at close range. Particularly notable was the final boss of Dawn of Sorrow, Menace, which was about 3 times the size of the Final Armor enemies. Even Dracula discarded his usual transformation in favor of this template in Order of Ecclesia.\n• Contra has quite a few.\n• The Gun Wall boss of the original game is reused many times in the series, usually as a early-game boss or a minor obstacle.\n• The Final Boss of the original Contra, a giant heart with mook-spawning capsules, is a good contender for the most-reused boss in the series.\n• The Final Boss of the arcade Super Contra (a skeletal dragon-thing with snake-like arms) is a close runner up.\n• The Darius series has two of them:\n• (Insert Word Here) Fossil, a coelacanth. Starting with King Fossil from Darius. Usually the first or second boss in the game, and appears in almost every single one of them.\n• Great Thing. A sperm whale with a load of cannons attached to it, and often the Final Boss in every Darius game he's appeared in. And he's usually incredibly difficult in each game he's in. In Darius Twin, he's an optional second-to-last boss, and is the only boss to have his own specialized music separate from the normal boss music.\n• Sonic the Hedgehog usually has one of two things for a final boss (though not necessarily the True Final Boss), either a giant walking robot, as seen in Sonic the Hedgehog 2, Sonic & Knuckles, Sonic Heroes, Sonic Rush, and Sonic Advance 2 (though there it can't move), or the final boss is a flying serpent like robot, as seen in Sonic Adventure, Sonic the Hedgehog (2006), Sonic Unleashed, and Sonic Colours. The True Final Boss is usually a fight where you use Super Sonic. As such, you are always invincible, and you merely need to chase/get to the boss while keeping hold of as many rings as possible. These bosses generally involve merely dashing forwards and slamming either yourself or one of its own attacks into it, regardless of whether it's one of Eggman's machines or an Eldritch Abomination.\n• The Dark Souls series tends to have the final boss be a non-traditional, underplayed boss fight with a tragic character, in direct opposition to the common \"epic\" final bosses in most games. This was initially averted in Dark Souls 2 with ; fits the mold perfectly, but is a Bonus Boss instead. Scholar of the First Sin changes this, however, with , the True Final Boss.\n• Toontown Online did this all the way through 2008. The lower half is the same since 2003, the jumping was used for the V.P. and C.J. fights, and once more, the undercarriage was used until 2006. Because of this, the C.E.O. never uses his undercarriage, not even one bit.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/RecurringBossTemplate", "media_links": ["/pmwiki/pmwiki.php/Franchise/Kirby", "/pmwiki/pmwiki.php/VideoGame/SuperSmashBros", "/pmwiki/pmwiki.php/VideoGame/KirbyAndTheAmazingMirror", "/pmwiki/pmwiki.php/VideoGame/KirbysEpicYarn", "/pmwiki/pmwiki.php/VideoGame/KirbyMassAttack", "/pmwiki/pmwiki.php/VideoGame/KirbySuperStar", "/pmwiki/pmwiki.php/VideoGame/KirbyTripleDeluxe", "/pmwiki/pmwiki.php/VideoGame/KirbyPlanetRobobot", "/pmwiki/pmwiki.php/VideoGame/KirbyStarAllies", "/pmwiki/pmwiki.php/VideoGame/HouseOfTheDead", "/pmwiki/pmwiki.php/Franchise/SuperMarioBros", "/pmwiki/pmwiki.php/VideoGame/MarioAndLuigi", "/pmwiki/pmwiki.php/VideoGame/NewSuperMarioBros", "/pmwiki/pmwiki.php/VideoGame/SuperMarioBros3", "/pmwiki/pmwiki.php/VideoGame/SuperMarioWorld", "/pmwiki/pmwiki.php/VideoGame/SuperMarioBros", "/pmwiki/pmwiki.php/VideoGame/SuperMario3DLand", "/pmwiki/pmwiki.php/VideoGame/SuperMarioBros3", "/pmwiki/pmwiki.php/VideoGame/MarioParty", "/pmwiki/pmwiki.php/VideoGame/SuperMarioGalaxy", "/pmwiki/pmwiki.php/Franchise/TheLegendOfZelda", "/pmwiki/pmwiki.php/VideoGame/Gradius", "/pmwiki/pmwiki.php/Franchise/FinalFantasy", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyIV", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyV", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyVI", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyVII", "/pmwiki/pmwiki.php/Franchise/MegaMan", "/pmwiki/pmwiki.php/VideoGame/MegaManClassic", "/pmwiki/pmwiki.php/VideoGame/MegaManX", "/pmwiki/pmwiki.php/ComicBook/CaptainAmerica", "/pmwiki/pmwiki.php/VideoGame/MegaManZero", "/pmwiki/pmwiki.php/VideoGame/MegaManZX", "/pmwiki/pmwiki.php/VideoGame/MegaManXCommandMission", "/pmwiki/pmwiki.php/Franchise/Metroid", "/pmwiki/pmwiki.php/VideoGame/MetroidFusion", "/pmwiki/pmwiki.php/VideoGame/MetroidZeroMission", "/pmwiki/pmwiki.php/VideoGame/MetalGear", "/pmwiki/pmwiki.php/VideoGame/MetalGearSolid3", "/pmwiki/pmwiki.php/VideoGame/Raiden", "/pmwiki/pmwiki.php/VideoGame/WorldOfWarcraft", "/pmwiki/pmwiki.php/Franchise/KingdomHearts", "/pmwiki/pmwiki.php/VideoGame/MajorStryker", "/pmwiki/pmwiki.php/Franchise/Castlevania", "/pmwiki/pmwiki.php/VideoGame/CastlevaniaChroniclesOfSorrow", "/pmwiki/pmwiki.php/VideoGame/Contra", "/pmwiki/pmwiki.php/VideoGame/Darius", "/pmwiki/pmwiki.php/VideoGame/SonicTheHedgehog", "/pmwiki/pmwiki.php/VideoGame/SonicTheHedgehog2", "/pmwiki/pmwiki.php/VideoGame/SonicAndKnuckles", "/pmwiki/pmwiki.php/VideoGame/SonicHeroes", "/pmwiki/pmwiki.php/VideoGame/SonicRush", "/pmwiki/pmwiki.php/VideoGame/SonicAdvance2", "/pmwiki/pmwiki.php/VideoGame/SonicAdventure", "/pmwiki/pmwiki.php/VideoGame/SonicTheHedgehog2006", "/pmwiki/pmwiki.php/VideoGame/SonicUnleashed", "/pmwiki/pmwiki.php/VideoGame/SonicColours", "/pmwiki/pmwiki.php/VideoGame/DarkSouls", "/pmwiki/pmwiki.php/VideoGame/ToontownOnline"], "non_media_links": ["/pmwiki/pmwiki.php/Main/CosmicHorror", "/pmwiki/pmwiki.php/Main/RecurringBoss", "/pmwiki/pmwiki.php/Main/LegacyBossBattle", "/pmwiki/pmwiki.php/Main/EldritchAbomination", "/pmwiki/pmwiki.php/Main/TeleportSpam", "/pmwiki/pmwiki.php/Main/WhenTreesAttack", "/pmwiki/pmwiki.php/Main/FinalBoss", "/pmwiki/pmwiki.php/Main/PowerFloats", "/pmwiki/pmwiki.php/Main/TarotMotifs", "/pmwiki/pmwiki.php/Main/FinalBoss", "/pmwiki/pmwiki.php/Main/ItMakesSenseInContext", "/pmwiki/pmwiki.php/Main/TurnsRed", "/pmwiki/pmwiki.php/Main/TarotMotifs", "/pmwiki/pmwiki.php/VIdeoGame/TheHouseOfTheDeadOverkill", "/pmwiki/pmwiki.php/Main/BodyHorror", "/pmwiki/pmwiki.php/Main/VasquezAlwaysDies", "/pmwiki/pmwiki.php/Main/Squick", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/ShockwaveStomp", "/pmwiki/pmwiki.php/Main/PlayingTennisWithTheBoss", "/pmwiki/pmwiki.php/Main/GoForTheEye", "/pmwiki/pmwiki.php/Main/FeedItABomb", "/pmwiki/pmwiki.php/Main/FinalBoss", "/pmwiki/pmwiki.php/Main/RecurringBoss", "/pmwiki/pmwiki.php/Main/AnticlimaxBoss", "/pmwiki/pmwiki.php/Main/InvincibleMinorMinion", "/pmwiki/pmwiki.php/Main/TeleportSpam", "/pmwiki/pmwiki.php/Main/StarWars", "/pmwiki/pmwiki.php/Main/Wolverine", "/pmwiki/pmwiki.php/Main/GrimReaper", "/pmwiki/pmwiki.php/Main/OneWingedAngel", "/pmwiki/pmwiki.php/Main/OneWingedAngel", "/pmwiki/pmwiki.php/Main/ThatOneBoss", "/pmwiki/pmwiki.php/Main/DegradedBoss", "/pmwiki/pmwiki.php/Main/ItemCrafting", "/pmwiki/pmwiki.php/Main/OneWingedAngel", "/pmwiki/pmwiki.php/Main/TeleportSpam", "/pmwiki/pmwiki.php/Main/FinalBoss", "/pmwiki/pmwiki.php/Main/FinalBoss", "/pmwiki/pmwiki.php/Main/CognizantLimbs", "/pmwiki/pmwiki.php/Main/WarmUpBoss", "/pmwiki/pmwiki.php/Main/SpaceWhale", "/pmwiki/pmwiki.php/Main/FinalBoss", "/pmwiki/pmwiki.php/Main/ThatOneBoss", "/pmwiki/pmwiki.php/Main/TrueFinalBoss", "/pmwiki/pmwiki.php/Main/TrueFinalBoss", "/pmwiki/pmwiki.php/Main/EleventhHourSuperpower", "/pmwiki/pmwiki.php/Main/EldritchAbomination", "/pmwiki/pmwiki.php/Main/BonusBoss", "/pmwiki/pmwiki.php/Main/TrueFinalBoss"]}