{"title": "Nuns 'n' Rosaries", "content": "This trope is when all Christians are not only all Catholic, but all Roman Catholic (as opposed to Eastern Catholic or Orthodox).\n• If they're part of an order, the men will be priests with crosses, or monks with brown robes and shaven heads, and the women will be nuns in typical habits and wearing or holding rosaries.\n• Lay people will cross themselves and go to confession.\n• Old ladies wearing black veils (these may be either nuns' habits or Widow's Weeds, or something like a , depending on exactly who these women are) will be kneeling at their pews praying the Rosary.\n• People who are very ill or dying will receive the Anointing of the Sick or Last Rites.\n• Occasionally you will see troops of little boys in suits and little girls in full bridal attire, traditional for First Holy Communion, which often takes place at Easter.\n• If the kids go to Catholic school, they wear their uniforms all day after school.\n• The icing on the cake, of course, will be the Ominous Latin Chanting.\n• Families will often be fairly large. The Catholic church's official stance on abortion and/or birth control may be discussed.\n• Characters who identify as Catholic, whether practicing or not, will often have a Guilt Complex.\n• Statues of The Virgin Mary, various saints, and occasionally Jesus Himself will be prominently visible and the characters pray to them, or in front of them. In particular, the front garden of the characters' house will probably have a statue of Mary inside of a stylized scallop shell.\n• Every Catholic church will have stained-glass windows and high gothic arches.\n• A female character may decide to become a nun.\n• Sometimes, the Catholic Schoolgirls Rule trope is discussed or played with. (Depending on the Writer, it may be deconstructed.)\n• If the kids go to either a public school or a private school that isn't a Catholic school, they attend religious education (officially referred to as CCD or catechism), typically on Saturday morning. Even if they do go to a Catholic school, they may attend such classes if preparing for a sacrament (such as Confirmation). (Think of it like Cram School, except it focuses on the teachings of the Church rather than preparing for an exam.)\n• Similarly, an engaged couple is required to do \"pre-Cana\" classes/counseling beginning six months in advance of the wedding, which will always be a very elaborate event, at least on television. (In Real Life, smaller, simpler weddings are certainly doable, and aren't necessarily a full Mass, particularly in the case of a Catholic marrying a non-Catholic.) In addition to standard pre-Cana classes, some couples may also do an \"engagement encounter\" retreat.\n• As mentioned above, Catholic weddings and funerals are always elaborate, highly-ritualized events, complete with a full Mass in the most opulent church building available. Even if the bride and groom and/or their families are mentioned as being poor.\n• Those married couples who aren't so Happily Married will probably not divorce, but rather will put on a Happy Marriage Charade, especially if they happen to live in a very Close-Knit Community. They may or may not try to work it out or attend (either religious or secular) marriage counseling. The Catholic church frowns upon civil divorce, and encourages couples to work out their problems whenever possible, however, contrary to popular belief, does not prohibit civil divorce or legal separation. What it does prohibit is remarriage after a civil divorce, unless a Church annulment has been obtained as well. Someone who is divorced and wants to remarry without this step may do so, but they will have to do so outside of the Catholic church...and they are not permitted to receive Holy Communion. Rarely, they might be separated (but not divorced), or might get a civil divorce and an annulment from the Church. In some of the more extreme examples, Divorce Requires Death.\n• Teens or preteens receiving The Talk (girls in particular) will be advised that sex before marriage is considered a sin, and that virginity is valued...and can never be restored once lost. Some choose to do it anyway (see the above-mentioned Catholic Schoolgirls Rule trope), others won't.\n• Kids and teens who attend Catholic school will be taught by Stern Nuns. (Those who don't will be threatened with being sent to a school like this.) Additionally, such a school will usually (though not always) be a One-Gender School.\n• If a family is shown sitting down to dinner on a Friday night, expect them to be eating fish.\n• A female character who is facing an unwanted pregnancy, or a high-risk pregnancy, will cite religious reasons as to why abortion is out of the question, even if she was never particularly devout before.\n• Gayngst may also be a factor, if the work decides to delve into LGBT+ issues vs. the Catholic Church's teachings on sexuality.\n\nIn other words, just the basic stereotypical stuff. None of the complexities to confuse the audience, and especially none of the controversies (unless it's Ripped from the Headlines).\n\nIn Anime, it's related to Creepy Cool Crosses, Church Militants, and Nuns Are Mikos. Anime Catholicism is very different than actual Catholicism.\n\nMore frequent in American and Japanese TV series/movies than in European ones.\n\nTrope name comes from, but isn't related to, the hard rock group Guns N' Roses. It also has nothing to do with the opening theme song for Baccano!!.\n\nCompare Hollywood Nuns. See also Artistic License \u0096 Traditional Christianity and the Useful Notes page on Christianity.\n• Subverted in Hellsing, where one of the major conflicts is between the Protestants and the Catholics over how to deal with vampires and other demons.\n• Of course, it's the Anglican church, so you get to keep all the fancy decorative bits, and things like holy water, and there's no difficulty over Alucard's source of bullets or anything like that. Now, if England were run by Lutherans...\n• Maria\u0086Holic is interesting in that the writers are both having fun with the Catholic Schoolgirl Lesbian Genre and are fully aware of the actual Catholic teachings. One rare serious moment has the Student Council President explaining the Catholic beliefs and how non-Christians get along in that environment. All in all, it's rather respectful to both.\n• The nun division in Mahou Sensei Negima!'s academy defense is utterly saturated with this trope. Of course, they only show up in one arc, and even then it's quite a brief one, as only 3 members are ever seen.\n• Highlander (1) has this when Macleod goes into a cathedral to pray. Lots of nuns and crossing yourself when the Kurgan bids them happy Halloween... It is holy ground, though, and the Kurgan follows the Immortals' prohibition on fights there..\n• A confessional of this type is set up in the firehouse in Ladder 49. Although this might not count, since it's one of the jokes played on the rookies .\n• In the fourth series finale of Misfits, Nadine and her protectors are all cloistered, habit-wearing nuns. There's also a running gag of Rudy trying to get through 50,000 Hail Marys in order to be forgiven his many sins.\n• You can see Fr. Mulcahy do a number of standard things in M*A*S*H. He blesses people with the Sign of the Cross, hears confessions, gives dying soldiers the Last Rites, and occasionally crosses himself. His constant charity work and fundraising through gambling are also typical.\n• In the episode of The Simpsons where Bart and Homer convert to Roman Catholicism, it's pretty much a cliché fest, full of nuns and confessionals. Marge imagines Catholic Heaven at one point, and sees a bunch of Irish, Mexican and Italian people partying. Not to mention, Homer's and Bart's most favourite activities were to become Bingo, pancakes, praying with rosaries, and blasting the streets with tommy-guns.\n• The blog Wear Your Mantilla briefly discusses this trope , in relation to a stock photo of an olive-skinned woman with a headcovering and a rosary.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/NunsNRosaries", "media_links": ["/pmwiki/pmwiki.php/Music/GunsNRoses", "/pmwiki/pmwiki.php/LightNovel/Baccano", "/pmwiki/pmwiki.php/Manga/Hellsing", "/pmwiki/pmwiki.php/Manga/MariaHolic", "/pmwiki/pmwiki.php/LightNovel/MariaSamaGaMiteru", "/pmwiki/pmwiki.php/Manga/MahouSenseiNegima", "/pmwiki/pmwiki.php/Film/Highlander", "/pmwiki/pmwiki.php/Film/Ladder49", "/pmwiki/pmwiki.php/Series/Misfits", "/pmwiki/pmwiki.php/Series/MASH", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons"], "non_media_links": ["/pmwiki/pmwiki.php/Main/ChristianityIsCatholic", "/pmwiki/pmwiki.php/Main/ConfessInConfidence", "/pmwiki/pmwiki.php/Main/WidowsWeeds", "https://en.wikipedia.org/wiki/Mantilla", "/pmwiki/pmwiki.php/Main/SchoolUniformsAreTheNewBlack", "/pmwiki/pmwiki.php/Main/OminousLatinChanting", "/pmwiki/pmwiki.php/Main/GoodGirlsAvoidAbortion", "/pmwiki/pmwiki.php/Main/RaisedCatholic", "/pmwiki/pmwiki.php/Main/GuiltComplex", "/pmwiki/pmwiki.php/UsefulNotes/Jesus", "/pmwiki/pmwiki.php/Main/FreudWasRight", "/pmwiki/pmwiki.php/Main/TakingTheVeil", "/pmwiki/pmwiki.php/Main/CatholicSchoolgirlsRule", "/pmwiki/pmwiki.php/Main/DependingOnTheWriter", "/pmwiki/pmwiki.php/Main/RiteOfPassage", "/pmwiki/pmwiki.php/Main/CramSchool", "/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/Main/InformedPoverty", "/pmwiki/pmwiki.php/Main/PotteryBarnPoor", "/pmwiki/pmwiki.php/Main/HappilyMarried", "/pmwiki/pmwiki.php/Main/HappyMarriageCharade", "/pmwiki/pmwiki.php/Main/CloseKnitCommunity", "https://en.wikipedia.org/wiki/Declaration_of_nullity", "/pmwiki/pmwiki.php/Main/DivorceRequiresDeath", "/pmwiki/pmwiki.php/Main/TheTalk", "/pmwiki/pmwiki.php/Main/DoubleStandard", "/pmwiki/pmwiki.php/Main/NatureAdoresAVirgin", "/pmwiki/pmwiki.php/Main/DefiledForever", "/pmwiki/pmwiki.php/Main/CatholicSchoolgirlsRule", "/pmwiki/pmwiki.php/Main/SternNun", "/pmwiki/pmwiki.php/Main/OneGenderSchool", "/pmwiki/pmwiki.php/Main/GoodGirlsAvoidAbortion", "/pmwiki/pmwiki.php/Main/Gayngst", "/pmwiki/pmwiki.php/Main/QueerAsTropes", "/pmwiki/pmwiki.php/Main/HeteronormativeCrusader", "/pmwiki/pmwiki.php/Main/TheThemeParkVersion", "/pmwiki/pmwiki.php/Main/RippedFromTheHeadlines", "/pmwiki/pmwiki.php/Main/Anime", "/pmwiki/pmwiki.php/Main/CreepyCoolCrosses", "/pmwiki/pmwiki.php/Main/ChurchMilitant", "/pmwiki/pmwiki.php/Main/NunsAreMikos", "/pmwiki/pmwiki.php/Main/AnimeCatholicism", "/pmwiki/pmwiki.php/Main/HardRock", "/pmwiki/pmwiki.php/Main/HollywoodNuns", "/pmwiki/pmwiki.php/Main/ArtisticLicenseTraditionalChristianity", "/pmwiki/pmwiki.php/Main/UsefulNotes", "/pmwiki/pmwiki.php/UsefulNotes/Christianity", "/pmwiki/pmwiki.php/Main/Anime", "/pmwiki/pmwiki.php/Main/Manga", "/pmwiki/pmwiki.php/Main/ShownTheirWork", "/pmwiki/pmwiki.php/Main/StudentCouncilPresident", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/EvenEvilHasStandards", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/NewMedia", "http://wearyourmantilla.blogspot.com/2010/06/catholic-woman.html"]}