{"title": "Mad Marble Maze", "content": "A common gameplay element (or, often, a game's whole premise) involving rolling some sort of sphere from the beginning of a level to the end. The player might be pushing the ball around, inside the ball, running atop the ball, or tilting the level to control the ball.\n\nMany wooden mechanical versions of this game exist, generally having a pair of knobs to manipulate the angle of the field and a large number of holes before the end to get caught in. However, most video game versions have the player manipulating the ball directly rather than tilting the field.\n• A demo of just this comes with HTC phones to show off the accelerometer.\n• The Legend of Zelda:\n• Super Mario Sunshine has the infamous Watermelon Festival mission where you must roll a watermelon safely to a juicer while putting up with some truly janky physics.\n• Super Mario Galaxy has a few levels of this sort; there's a Power Star in the ball, and Mario has to get it to the end of the level to get it out of the ball.\n• Wii Fit has one exercise that consists of this, using the balance board.\n• The Legend of Zelda:\n• Twilight Princess has the minigame RollGoal in the boat rental shop. Beating every level allows you to use the frog lure.\n• Breath of the Wild has a Shrine that requires you to use motion controls to roll an orb through a small maze and then fling it up into the air onto a ramp. Though the way the motion controls work with the platform means that you could turn it upside-down to its smooth underside and skip straight to the flinging part.\n• The Mercury series are these, using a blob of mercury in lieu of a sphere.\n• Crash Bandicoot: The Wrath of Cortex has a couple of levels like this, with Crash inside the ball.\n• Spyro: A Hero's Tail has the Ball Gadget, which you must roll along a track or path, with Spyro inside like a large hamster wheel, to either get Dragon Eggs and Light Gems, or reach a new level.\n• The bizarre climax to The Muldoon Legacy.\n• That One Puzzle in Sonic 2006.\n• Ōkami has several \"push a ball\" puzzles, ranging from merely annoying to infuriating. That One Sidequest involves rolling three of them up a hill.\n• Cameltry (also known as On the Ball) is one of the few video game versions involving manipulating the field instead of the ball.\n• The Special Stages from the first Sonic the Hedgehog game seem to be inspired by Cameltry, the difference being that you control Sonic while the maze spins by itself. Years later, Sonic the Hedgehog 4 also used this type of gameplay and the fields are now rotatable.\n• , an Unreal Tournament III mod and 2nd place winner of the \"Make Something Unreal\" contest.\n• Assassin's Creed III: Liberation has one of these as a First Civilization puzzle.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/MadMarbleMaze", "media_links": ["/pmwiki/pmwiki.php/VideoGame/MarbleMadness", "/pmwiki/pmwiki.php/VideoGame/SuperMonkeyBall", "/pmwiki/pmwiki.php/VideoGame/MarbleBlastGold", "/pmwiki/pmwiki.php/WesternAnimation/Futurama", "/pmwiki/pmwiki.php/Franchise/TheLegendOfZelda", "/pmwiki/pmwiki.php/VideoGame/SuperMarioSunshine", "/pmwiki/pmwiki.php/VideoGame/SuperMarioGalaxy", "/pmwiki/pmwiki.php/VideoGame/WiiFit", "/pmwiki/pmwiki.php/Franchise/TheLegendOfZelda", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaTwilightPrincess", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaBreathOfTheWild", "/pmwiki/pmwiki.php/Series/AmericanGladiators", "/pmwiki/pmwiki.php/VideoGame/Ballance", "/pmwiki/pmwiki.php/VideoGame/Hamsterball", "/pmwiki/pmwiki.php/VideoGame/SonicTheHedgehog2006", "/pmwiki/pmwiki.php/VideoGame/Okami", "/pmwiki/pmwiki.php/VideoGame/SonicTheHedgehog1", "/pmwiki/pmwiki.php/VideoGame/SonicTheHedgehog4", "/pmwiki/pmwiki.php/VideoGame/UnrealTournamentIII", "/pmwiki/pmwiki.php/VideoGame/AssassinsCreedIIILiberation"], "non_media_links": ["/pmwiki/pmwiki.php/Main/BloodSport", "/pmwiki/pmwiki.php/Main/MiniDungeon", "/pmwiki/pmwiki.php/Main/CuttingTheKnot", "/pmwiki/pmwiki.php/Main/Mercury", "/pmwiki/pmwiki.php/Videogame/CrashBandicootTheWrathOfCortex", "http://www.wickedsmallgames.com/games/s/spin-the-black-circle/play-game.html", "/pmwiki/pmwiki.php/Main/InteractiveFiction", "/pmwiki/pmwiki.php/Main/ThatOnePuzzle", "/pmwiki/pmwiki.php/Main/ThatOneSidequest", "http://en.wikipedia.org/wiki/The_Ball_%28video_game%29", "http://en.wikipedia.org/wiki/Switchball"]}