{"title": "Pitch Mob", "content": "In commercials set in a supermarket or similar setting, a pair of shoppers will chance upon Product X, whereupon one of them will begin lauding the product. Immediately, other shoppers (that is to say, random strangers) will begin to join the conversation, each one taking his/her turn at extolling the product. Expect at least one person to offer a comment whilst passing by, without even slowing down long enough to actually join the group.\n\nBonus points if the \"protagonist\" was initially shopping alone when the Pitch Mob approaches.\n\nThis can be seen as an attempt to apply the Bandwagon Technique on a smaller scale.\n\nThis trope is practically forgotten these days, though it was recently revived in a public service announcement. A more modern variation is a group of people together in a discreet environment (office, bus/train, etc) extolling the product, typically to one another rather than to a singular \"protagonist\" as described above.\n• One commercial for Navy Federal Credit Union has a supermarket cashier, bagger, and every single one of the eight or so customers in line insisting that the woman at the head of the line should switch her bank to — you guessed it — Navy Federal Credit Union.\n• Consumer Cellular has a spot with a group of people on an airplane.\n• An ad for J.G. Wentworth offers a twist on the modern variant — a group of city bus passengers sing the praises of the company to each other (and the camera)... quite literally, via opera .\n• And like any good opera, it's not over until the Fat Lady sings.\n• This spot appears to be a re-imagining of a previous spot which featured an actual opera.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/PitchMob", "media_links": [], "non_media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/Main/BandwagonTechnique", "https://tvtropes.org/pmwiki/pmwiki.php/Main/ForgottenTrope", "https://www.youtube.com/watch?v=cN9OKXtzHtE", "https://tvtropes.org/pmwiki/pmwiki.php/Main/WholesomeCrossDresser"]}