{"title": "Battle-Halting Duel", "content": "It's the Final Battle, and chaos is reigning supreme all around the Big Bad and the Hero, who are leading their respective armies to battle. The audience gets to see all sorts of little pieces of the surrounding climatic battle, but then, suddenly, the first blow is struck between the Big Bad and the Hero (usually the Big Bad first).\n\nThen, everything goes silent.\n\nAll around the chaotic fighting grinds to a sudden halt as the main event between our hero and the Big Bad gears up. All the fighters stop fighting and come into a circle surrounding the battle as the two main characters start circling, ready at any moment to strike. This moment when everything stops because of the Strike Heard Around the World is the Battle Halting Battle. Everyone stops and puts aside their differences to watch the fight between their leaders.\n\nRelated to Combat by Champion, in which case it's understood that the duel will actually decide the battle. May be caused by Leave Him to Me. Possibly a more willing version of Locked Out of the Fight.\n• Fullmetal Alchemist has this in the final battle, when Edward regains his arm, at the cost of Al's soul, and takes it out on Father, who'd caused the situation that necessitated Al's sacrifice in the first place. Despite pretty much everybody having contributed to beating the hell out of Father immediately prior, they recognize that for Edward, It's Personal , and stand down as he engages in a No-Holds-Barred Beatdown on Father's ass .\n• King Of Hell: Right as The War between the Black and White Sects starts, Majeh steps in the middle and challenges EVERYONE to a one-on-one duel, and proceeds to curbstomp the people that step up.\n• Due to the nature of the friendly war in Dog Days, this happens on occasion when heroes clash, and Leonmichelle in particular is prone to draw all attention to her.\n• Berserk:\n• When 15 years old, Guts takes part in the storming of a castle. Furious fighting occurs in the courtyard after the attackers breach the defenses, when the enemy champion Bazuso appears and kills several hapless soldiers and challenges any foe to face him in single combat. This somehow brings all fighting everywhere to a halt, as the defenders are enjoying the sight of the entire attacking force being so afraid of Bazuso's reputation that not one of them will accept his challenge, no matter what rewards or threats their employer gives to motivate them. Then Guts steps forward and demands ten gold pieces if he kills Bazuso, which the tight-fisted noble haggles down to seven. Everyone thinks he's going to get himself killed, but instead he slays Bazuso in a Curb-Stomp Battle. There's a moment of stunned silence, and then cheers break out among the attackers, who quickly rout the dispirited defenders.\n• During the Battle of Doldrey, Raid Captain Guts and General Boscogn engage in a one-on-one fight to the death, which the horsemen on either side can't help forming a circle around to gawk at. The justification is that both Guts and Boscogn are so strong that no one dares to get too close to their dancing blades, lest he become Half the Man He Used to Be.\n• The Wizard in the Shadows has this with Harry vs has this, along with a bit of Leave Him to Me.\n• Child of the Storm, by the same author as the above, has Harry vs Daken - the former having completely lost his temper thanks to death and Daken baiting him, while the latter just lures him in, then stabs him in the heart, killing him. Then the Phoenix takes over. The rematch a few chapters later is similar, but Harry's instead in a Tranquil Fury and plays to his advantages (ranged abilities) and wins comfortably.\n• In , everyone stops fighting to watch the climatic duel between Stannis and Euron. Even the dragon Dreadwing pauses. Fortunately, when Euron is about to win Devan Seaworth shakes off his stupor and slices open Euron's back .\n• In The Lion King II: Simba's Pride, the start of the final battle fits the description.\n• In Troy, the big battle between Achilles or rather, Patroclus in Achilles' armour and Hector causes the battle to halt around them, especially when .\n• The final battle of The Last Jedi is halted when\n• Happens in Alexander Nevsky between the titular prince and the Grand Master of the Teutonic Knights, both sides standing apart to let their bosses battle.\n• In Harry Potter and the Deathly Hallows, the final battle with Voldemort effectively starts this way, though the \"strike\" seen by all is Harry revealing himself from under his cloak.\n• Right before Harry reveals himself everyone in the room is silently watching Voldemort duel Kingsley, McGonagall and Slughorn and Bellatrix duel Hermione, Luna and Ginny. Mrs. Weasley jumps in to fight Bellatrix and the rest is history...\n• In the novelization World of Warcraft: Tides of Darkness, the next-to-last battle between The Alliance and The Horde takes place near Blackrock Spire, the orc stronghold. The Alliance besieges the stronghold, when the orc warchief Orgrim Doomhammer leads a counter-attack. During the battle, he encounters the Alliance supreme commander Lord Anduin Lothar. After Lothar's death, his lieutenant Turalyon picks up his broken sword and knocks out Doomhammer. The defeat of their warchief sends the the Horde into a full retreat.\n• Happens frequently in the Tales of the Branion Realm series. Justified by the fact that when one of the combatants is on fire, you probably want to stand away.\n• Combining with Keystone Army, this is how most Redwall final battles end, the book's hero taking out the Big Bad in single combat and the rest of the vermin fleeing for their lives.\n• In the Belisarius Series, the Roman army is forced to make a fighting retreat against the Rajputs, and Valentinian, covering Belarius as he escapes near capture, engages Rana Sanga. The fact Valentinian survives the initial clash and manages to give as good as he got causes the Rajputs to come to a complete halt as they see an epic duel in the offing, which quickly becomes official. The Rajputs do not pursue the retreating Romans, the army's commander doesn't even try ordering them to, and the Romans do not make any move to counterattack, watching the fight at long distance.\n• It's over so quickly it's not really much of a duel, but when Merlin and Vortigern face off in Merlin (1998) and Merlin splits the lake ice with Excalibur, sending Vortigern to a frozen, watery grave , it certainly catches everyone's attention. Some combatants literally pause in mid-swing to stare at what just happened.\n• Seen in Troy: Fall of a City when Hector and Patroclus (in Achilles' armour) meet. Also discussed by Achilles, ahead of time. \"I miss the hush. When I meet an opponent worthy of me . Everyone around us stops to watch. The din of battle drains away like a wave. And for a few moments, it's just the two of us. And then I kill him . And then everyone gets back to what they were doing.\"\n• On an early-1987 edition of Saturday Nights Main Event, one of the matches was a 20-man battle royal. Around the mid-point of the match, Hulk Hogan and André the Giant (the two had recently been announced as the main event of WrestleMania 3) came together. All other action stopped while these two went at it for a little bit.\n• In the 2008 Royal Rumble, wrestling legend Rowdy Roddy Piper was in the ring when fellow legend (and longtime rival) Superfly Jimmy Snuka entered. The two immediately started brawling, and in an apparently unscripted moment, every other wrestler stopped what they were doing to watch the fight. The camera even caught CM Punk giving John Morrison a \"can you believe how cool this is?\" nudge as they rested on the ropes.\n• Warhammer allows Hero Units and squad leaders to make personal challenges during combat rounds, which creates this effect as it's resolved before the rest of the combat (whether the fighting is pausing to wait for them or whirling around them is presumably left to the players' imaginations).\n• As of 6th edition this mechanic has been carried over to Warhammer 40,000 as well.\n• Flavor Text for the Auroran Firebird in EV Nova notes that battles between Federation and Auroran forces sometimes come to a halt to watch Viper/Firebird dogfights between renowned pilots.\n• In General Chaos, if any opposing soldiers get near enough to each other, everything else stops while the two duke it out in close combat.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/BattleHaltingDuel", "media_links": ["/pmwiki/pmwiki.php/Series/TroyFallOfACity", "/pmwiki/pmwiki.php/Manga/FullmetalAlchemist", "/pmwiki/pmwiki.php/Manhwa/KingOfHell", "/pmwiki/pmwiki.php/Anime/DogDays", "/pmwiki/pmwiki.php/Manga/Berserk", "/pmwiki/pmwiki.php/Disney/TheLionKingIISimbasPride", "/pmwiki/pmwiki.php/Film/Troy", "/pmwiki/pmwiki.php/Film/TheLastJedi", "/pmwiki/pmwiki.php/Film/AlexanderNevsky", "/pmwiki/pmwiki.php/Literature/HarryPotterAndTheDeathlyHallows", "/pmwiki/pmwiki.php/VideoGame/WorldOfWarcraft", "/pmwiki/pmwiki.php/Literature/TidesOfDarkness", "/pmwiki/pmwiki.php/Literature/TalesOfTheBranionRealm", "/pmwiki/pmwiki.php/Literature/Redwall", "/pmwiki/pmwiki.php/Literature/BelisariusSeries", "/pmwiki/pmwiki.php/Series/Merlin1998", "/pmwiki/pmwiki.php/Series/TroyFallOfACity", "/pmwiki/pmwiki.php/TabletopGame/Warhammer", "/pmwiki/pmwiki.php/TabletopGame/Warhammer40000", "/pmwiki/pmwiki.php/VideoGame/EscapeVelocity", "/pmwiki/pmwiki.php/VideoGame/GeneralChaos"], "non_media_links": ["/pmwiki/pmwiki.php/Main/WorthyOpponent", "/pmwiki/pmwiki.php/Main/WorldsBestWarrior", "/pmwiki/pmwiki.php/Main/FinalBattle", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/QuieterThanSilence", "/pmwiki/pmwiki.php/Main/CirclingMonologue", "/pmwiki/pmwiki.php/Main/CombatByChampion", "/pmwiki/pmwiki.php/Main/LeaveHimToMe", "/pmwiki/pmwiki.php/Main/LockedOutOfTheFight", "/pmwiki/pmwiki.php/Main/Anime", "/pmwiki/pmwiki.php/Main/ItsPersonal", "/pmwiki/pmwiki.php/Main/NoHoldsBarredBeatdown", "/pmwiki/pmwiki.php/Main/CurbStompBattle", "/pmwiki/pmwiki.php/Main/JustifiedTrope", "/pmwiki/pmwiki.php/Main/HalfTheManHeUsedToBe", "/pmwiki/pmwiki.php/Main/Fanfiction", "/pmwiki/pmwiki.php/Fanfic/TheWizardInTheShadows", "/pmwiki/pmwiki.php/Main/LeaveHimToMe", "/pmwiki/pmwiki.php/Fanfic/ChildOfTheStorm", "/pmwiki/pmwiki.php/Main/TranquilFury", "https://www.fanfiction.net/s/11298331/1/A-different-weasel-makes-a-difference", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/TheAlliance", "/pmwiki/pmwiki.php/Main/TheHorde", "/pmwiki/pmwiki.php/Main/OurOrcsAreDifferent", "/pmwiki/pmwiki.php/Main/TakeUpMySword", "/pmwiki/pmwiki.php/Main/BattleAura", "/pmwiki/pmwiki.php/Main/KeystoneArmy", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/WorthyOpponent", "/pmwiki/pmwiki.php/Main/WorldsBestWarrior", "/pmwiki/pmwiki.php/Wrestling/SaturdayNightsMainEvent", "/pmwiki/pmwiki.php/Wrestling/HulkHogan", "/pmwiki/pmwiki.php/Wrestling/AndreTheGiant", "/pmwiki/pmwiki.php/Wrestling/WrestleMania", "/pmwiki/pmwiki.php/Main/TabletopGames", "/pmwiki/pmwiki.php/Main/HeroUnit", "/pmwiki/pmwiki.php/Main/SergeantRock", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/FlavorText"]}