{"title": "Pony Express Rider", "content": "I, ________, do hereby swear, before the great and living God, that during my engagement, and while I am an employee of Russell, Majors and Waddell, I will, under no circumstances, use profane language, that I will drink no intoxicating liquors, that I will not quarrel or fight with any other employee of the firm, and that in every respect I will conduct myself honestly, be faithful to my duties, and so direct all my acts, as to win the confidence of my employers. So help me God.\n\nA rider for the Pony Express, a fast mail-delivery service between St. Joseph, Missouri and Sacramento, California. The service only operated from April 1860 to October 1861, when the first transcontinental telegraph line made it obsolete, and never received the federal mail contract that would have made the service profitable. Yet it became legendary out of all proportion to its duration, as an example of American individuality, ruggedness and \"can-do\" spirit. The idea of fast mounted couriers riding in relays between staging posts is Older Than Feudalism, going back at least to the Persian Empire (ca. 550\u0096330 BC). But the previous versions had been exclusively for government communications, rather than anyone who could pay the fees, and of the courage and toughness of the couriers and station-men there is no doubt.\n\nIn order to reduce mail delivery time to ten days, from the twenty-five days achieved by the fastest stagecoach, the founders of the Pony Express built stations every ten miles stocked with fresh horses. The riders recruited were little more than boys, usually weighing less than 125 pounds, and the hazards of the job were such that their employers declared \"Orphans Preferred\". They rode at a gallop from one station to the next, switching to fresh horses, and galloping on to the next station. Everything was designed to reduce weight and increase speed, and when carrying the text of Abraham Lincoln's first inaugural speech in March 1861, the service achieved a best time of seven days and seventeen hours.\n\nNaturally, there have been books and films about the Pony Express, and sometimes a Pony Express rider will appear in a story that isn't set in the correct time period, just because they're cool. Note the bit on the poster about \"skinny, wiry, not over eighteen\" - the Pony Express rider should look like a dustier version of a high school hipster, not John Wayne in his prime.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/PonyExpressRider", "media_links": ["/pmwiki/pmwiki.php/ComicBook/LuckyLuke", "/pmwiki/pmwiki.php/Film/HowTheWestWasWon", "/pmwiki/pmwiki.php/Film/SheWoreAYellowRibbon", "/pmwiki/pmwiki.php/Film/TheGunslingers", "/pmwiki/pmwiki.php/Series/MysteryScienceTheater3000", "/pmwiki/pmwiki.php/Film/ThePostman", "/pmwiki/pmwiki.php/Film/TwentyEightDaysLater", "/pmwiki/pmwiki.php/Literature/Discworld", "/pmwiki/pmwiki.php/Literature/Flashman", "/pmwiki/pmwiki.php/Creator/MarkTwain", "/pmwiki/pmwiki.php/Literature/DaveBarrySleptHere", "/pmwiki/pmwiki.php/Series/TheYoungRiders", "/pmwiki/pmwiki.php/TabletopGame/Traveller", "/pmwiki/pmwiki.php/TabletopGame/Deadlands", "/pmwiki/pmwiki.php/TabletopGame/TheDarkEye", "/pmwiki/pmwiki.php/Theatre/TheGirlOfTheGoldenWest", "/pmwiki/pmwiki.php/VideoGame/Gun", "/pmwiki/pmwiki.php/VideoGame/DayOfTheTentacle", "/pmwiki/pmwiki.php/VideoGame/FalloutNewVegas", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/WesternAnimation/RockyAndBullwinkle", "/pmwiki/pmwiki.php/WesternAnimation/TimeSquad"], "non_media_links": ["/pmwiki/pmwiki.php/Main/BrieferThanTheyThink", "/pmwiki/pmwiki.php/Main/OlderThanFeudalism", "/pmwiki/pmwiki.php/Main/RuleOfCool", "/pmwiki/pmwiki.php/Main/DawsonCasting", "/pmwiki/pmwiki.php/Main/ExactlyWhatItSaysOnTheTin", "/pmwiki/pmwiki.php/Main/LampshadedTrope", "/pmwiki/pmwiki.php/Main/PonyExpressRider", "/pmwiki/pmwiki.php/Main/AfterTheEnd", "/pmwiki/pmwiki.php/Main/SleptThroughTheApocalypse", "/pmwiki/pmwiki.php/Main/HatePlague", "/pmwiki/pmwiki.php/Discworld/GoingPostal", "http://wiki.travellerrpg.com/Poni", "/pmwiki/pmwiki.php/Main/WideOpenSandbox", "https://en.wiktionary.org/wiki/eoh", "/pmwiki/pmwiki.php/Main/WhatCouldHaveBeen"]}