{"title": "Bulverism", "content": "Bulverism is a logical fallacy in which one party simply assumes that the other party is wrong and explains their reasons for wanting to believe it rather than addressing the argument itself. It combines Begging the Question with the Genetic Fallacy.\n\nThe Other Wiki expresses Bulverism as:\n• You claim that A is true.\n• Because of B, you personally desire that A should be true.\n\nIn short, it can be summarized as \"You're only claiming X to be the case because you want X to be the case!\". This is fallacious, as whether or not someone wants something to be true has no bearing on whether or not it actually is.\n\nThe term was coined by C. S. Lewis in an essay of the same name in which he describes the (fictional) origin of the fallacy: a boy named Ezekiel Bulver heard his parents arguing when his mother said \"Oh you say that because you are a man.\" at which point Bulver realized that \"refutation is no necessary part of argument\".\n\nLewis himself summed up the fallacy as \"to assume without discussion that he [your opponent] is wrong and then distract his attention from this (the only real issue) by busily explaining how he became so silly.\"\n\nSimilar to Fallacy Fallacy, Ad Hominem, and Argumentum Ad Lapidem in that the opponent is finding or inventing biases in the other's argument rather than addressing the argument itself.\n• Both atheists (such as George Rey) and theists (such as Paul Vick) frequently assume that the other side is wrong, then attempt to explain how they fell into error. To elaborate on the given examples, Rey claims theists are self-deceived. Vick argues atheists lacked a strong father growing up, and therefore cannot believe in a fatherly God.\n• Communists in the past have alleged that those who don't believe in communism do so because of \"false consciousness\" (if they're working class) or, if bourgeois, won't because it goes against their class interest.\n• Those with extremist political and social views often employ this tactic. If another does not agree with them, they are clearly \"afraid to say what everyone thinks\", white knighting or trolling in a bid for attention, or perhaps internalizing these opinions when the person is white, black, female, etc. themselves.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/Bulverism", "media_links": ["/pmwiki/pmwiki.php/Creator/CSLewis"], "non_media_links": ["http://en.wikipedia.org/wiki/Bulverism", "/pmwiki/pmwiki.php/Main/BeggingTheQuestion", "/pmwiki/pmwiki.php/Main/GeneticFallacy", "/pmwiki/pmwiki.php/Wiki/TheOtherWiki", "/pmwiki/pmwiki.php/Main/FallacyFallacy", "/pmwiki/pmwiki.php/Main/AdHominem", "/pmwiki/pmwiki.php/Main/ArgumentumAdLapidem", "/pmwiki/pmwiki.php/Main/DaddyIssues", "/pmwiki/pmwiki.php/Main/OpinionMyopia", "/pmwiki/pmwiki.php/Main/InternalizedCategorism"]}