{"title": "Rivalry as Courtship", "content": "A character in a story becomes romantically interested in someone and believes that the best way to get his/her attention is by being just as good as (s)he is, if not better, at something that (s)he does. The fields can be academic, athletic, or something more mundane like board game tourneys, as long as they can contend. The characters may be strangers to each other, or they may already be familiar with each other; either way, one person develops feelings for and decides to pursue the other. Neither person has to know about the other's harbored affections, or lack thereof, but the suitor must strongly feel that (s)he has something to prove in order to be taken seriously. Said suitor may start out as an Unknown Rival in the beginning, but since success depends on the individual's level of ambition, this is likely to be a plight characteristic of a determined, yet disciplined romantic. It can also happen in the reverse order, i.e 2 characters being straight rivals at first, then one of them coming to like the other's company and care about them. (Friendly Rivalry often also works like this, albeit platonically.) I Was Just Passing Through and The Only One Allowed to Defeat You may come from this.\n\nThe courter may actually enjoy the activity they're engaged in, going on to do great things with the prospective relationship giving him/her just one more reason to perform well. Or, alternatively, the courter may not really care for the activity (at least not initially) and drop it once the courtship ends, since the point of taking it up in the first place had always been to make a good impression on and successfully romance the other party, with whatever other achievements being corollary.\n\nThe type of significance one character will have to another will depend on the nature of their rivalry. At best, the object of affection will be left with the impression that they're into the same things and see the suitor as someone (s)he can banter and have fun with. Or, acknowledge the other party as a Worthy Opponent who will provide a challenge, as \"iron sharpens iron\". At worst, the Love Interest will hate the other person's guts (maybe because of bad sportsmanship from one side or the other), but that suitor will still prefer the negative attention to that love interest not even knowing (s)he exists.\n\nCompare Friendly Rivalry or Defeat Means Friendship for non-romantic examples, although they could evolve into this trope. Contrast Foe Romantic Subtext and Dating Catwoman for when the two are outright enemies.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/RivalryAsCourtship", "media_links": ["/pmwiki/pmwiki.php/Manga/LoveGeneXX", "/pmwiki/pmwiki.php/Manga/Naruto", "/pmwiki/pmwiki.php/Series/DrakeAndJosh", "/pmwiki/pmwiki.php/VideoGame/DragonAgeII", "/pmwiki/pmwiki.php/WesternAnimation/TheAdventuresOfJimmyNeutronBoyGenius", "/pmwiki/pmwiki.php/WesternAnimation/TheJimmyTimmyPowerHour"], "non_media_links": ["/pmwiki/pmwiki.php/Main/BestHerToBedHer", "/pmwiki/pmwiki.php/Main/UnrequitedLove", "/pmwiki/pmwiki.php/Main/UnknownRival", "/pmwiki/pmwiki.php/Main/TheDeterminator", "/pmwiki/pmwiki.php/Main/FriendlyRivalry", "/pmwiki/pmwiki.php/Main/IWasJustPassingThrough", "/pmwiki/pmwiki.php/Main/TheOnlyOneAllowedToDefeatYou", "/pmwiki/pmwiki.php/Main/BecomingTheMask", "/pmwiki/pmwiki.php/Main/RelationshipUpgrade", "/pmwiki/pmwiki.php/Main/BirdsOfAFeather", "/pmwiki/pmwiki.php/Main/SpiritedCompetitor", "/pmwiki/pmwiki.php/Main/WorthyOpponent", "/pmwiki/pmwiki.php/Main/LoveInterest", "/pmwiki/pmwiki.php/Main/UnsportsmanlikeGloating", "/pmwiki/pmwiki.php/Main/IWasBeatenByAGirl", "/pmwiki/pmwiki.php/Main/SoreLoser", "/pmwiki/pmwiki.php/Main/FriendlyRivalry", "/pmwiki/pmwiki.php/Main/DefeatMeansFriendship", "/pmwiki/pmwiki.php/Main/FoeRomanticSubtext", "/pmwiki/pmwiki.php/Main/DatingCatwoman", "/pmwiki/pmwiki.php/Main/StalkerWithACrush", "/pmwiki/pmwiki.php/Main/GenderBender", "/pmwiki/pmwiki.php/Main/GenderFlip", "/pmwiki/pmwiki.php/Main/SeriesFinale", "/pmwiki/pmwiki.php/Main/RelationshipValues", "/pmwiki/pmwiki.php/Main/PlayerCharacter", "/pmwiki/pmwiki.php/Main/RomanceSidequest", "/pmwiki/pmwiki.php/Main/LoveInterests", "/pmwiki/pmwiki.php/Main/SlapSlapKiss", "/pmwiki/pmwiki.php/Main/BelligerentSexualTension"]}