{"title": "Wintry Auroral Sky", "content": "An aurora borealis — or australis in the Southern hemisphere — is a phenomenon occuring near the poles of the Earth when particles coming from the sun (known as the solar wind) gets aspired by the planet's magnetic field, whose poles are conveniently almost at the same place as the Earth's rotation poles. This creates magnificient and breathtaking light-shows that colour and illuminate the polar skies. Auroras are predominantly green, but they are known to come in other colours as well.\n\nThey, as such, have been consistently associated with frigid environments and became a staple background element in Slippy-Slidey Ice World settings, regardless of their geographical location. They, of course, are there mostly for Scenery Porn purposes, although they do convey the chilly feeling of their polar origins quite well.\n\nDo note that these aurora-filled Slippy-Slidey Ice World settings also mostly take place at night, in a rather convenient way. Else, how could we see them?\n• There are green and purple northern lights in many of the scenes set at night in Frozen. The plot even starts because, when they are kids, Anna wakes Elsa up not being able to sleep due to the lights. Little Anna: The sky's awake. So I'm awake. So we have to play.\n• In Pugs of the Frozen North, one can be seen in the sky from time to time. However, during a True Winter, it can get so cold that the lights freeze and fall to the earth.\n• In Alice: Madness Returns, the moon in the skies above the glacial Tundraful smokes a cigarette in a long-holder, and the resulting smoke results in green auroras lacing through the night sky.\n• Animal Crossing: In both City Folk and New Leaf, auroras can appears several times during the cold winters, even though if the summer is to be believed, the town's climate is nowhere near polar.\n• Somehow, auroras are seen above the top of Mount Fimbulventr from in Bayonetta 2. Granted, the area is cold, if the blizzard occuring outside is to be believed, but the Travel Montage at the beginning of the game reveals that Mount Fimbulventr is located somewhere in Kazakhstan. Then again, they add an undeniable and fitting mystical flair to the Final Boss arena.\n• In Crash Bash, the Polar Panic stage is set on a flat iceberg on the night sea, with auroras in the sky.\n• In Disney's Magical Quest games, these can be in the background of the icy levels.\n• The Elder Scrolls V: Skyrim often features these in clear night skies. You can even induce them if you know the right Thu'um for it.\n• Commonly used in the Kirby series:\n• Frozen Hillside, the icy racetrack from Kirby Air Ride, has green, blue and pink auroras high up in the purple skies.\n• In Kirby's Epic Yarn, the path to the Snow Land boss fight is revealed by unknitting a snowman on the map, and its yarn is used to knit a white aurora that decorates the night sky.\n• Kirbys Return To Dreamland heavily features northern lights in the icy White Wafers. They are bright enought to occur in broad daylight and are very colourful (a mix of red, violet, green and blue). One of the level features them so prominently that its music track is actually named \"Aurora Area \".\n• The sky of the frigid Planet Frostak in Kirby Star Allies is almost completely covered in multicoloured auroras.\n• Chillydip Cove in The Legendary Starfy takes place in a freezing cove (which is somehow right next to hot springs) inhabited by penguins, and its night sky is laced with auroras in several levels.\n• The northern lights can be seen when visiting Forochel at night in The Lord of the Rings Online. Justified in that it's a polar landscape and the northernmost region on the map.\n• Justified in the Sim Store exclusive town of Aurora Skies in The Sims 3, as it is based on an Icelandic township, and as such does feature auroras at nighttime. After all, it's all in the name.\n• The Oceanora Deep-Sea Cruise in the Streetpass Mii Plaza game Ultimate Angler lies in frosty waters filled with various icebergs, near the coasts of the Oceanora Island (which features various biomes including a tropical beach). This fishing spot takes place during nighttime and auroras shimmer in the dark skies, completing the polar atmosphere.\n• Super Mario Bros.:\n• The Double Dash!! racetrack Sherbet Land has been given, among many other visual improvements, a nightime aurora-laced sky in its Mario Kart 8 appearance. Ironically, Ice Ice Outpost, which does take place in a polar environment, has no auroras in its sky since the race takes place during daytime.\n• Most levels in the Frosted Glacier in New Super Mario Bros. U feature exquisite, multicolored northern lights in their nighty skies. Granted, the Frosted Glacier is one of the northernmost locations on the map, but it is on the same longitude than Layer-Cake Desert and Peach's Castle, and therefore most certainly not polar. Videogame geography at its best.\n• In Super Mario Galaxy, the entire Freezeflame Galaxy is surrounded by a massive green aurora borealis, which can even be seen from the fiery planets of the galaxy.\n• The aptly-named Snowball Park in Super Mario 3D World has green auroras in its night sky as well.\n• Same goes with the skies above the Shiverian Iceburn Circuit in Super Mario Odyssey.\n• The Snowball Summit minigame in Mario Party 3 takes place on a snowy mountaintop, underneath an aurora-laden night sky. The auroras change color during the course of the game.\n• In the 3DS remake of Mario & Luigi: Superstar Saga, the top outdoors floors in Joke's End, the frozen dungeon, shows a night sky laced with multicoloured auroras in the background.\n• The Summit stage, which is the Ice Climbers' home stage in Super Smash Bros: Brawl, is (at the start of the fight at least) located on top of a frozen moutain bathed in the shimmering lights of auroras borealis.\n• The Winter Interior in Tomodachi Life looks like a nightly frozen fjord, and features, along every other possible arctic cliché, shimmering auroras. Indoors.\n• In the Yoshi's Crafted World level \"Slip-Slide Isle\", which takes place on a frozen island, blue auroras shimmer in the night sky.\n\nAurora borealis? At this time of year, at this time of the day, in this part of the TV Tropes Wiki, localized entirely on this page?!", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/WintryAuroralSky", "media_links": ["/pmwiki/pmwiki.php/VideoGame/AliceMadnessReturns", "/pmwiki/pmwiki.php/Disney/Frozen", "/pmwiki/pmwiki.php/Literature/PugsOfTheFrozenNorth", "/pmwiki/pmwiki.php/VideoGame/AliceMadnessReturns", "/pmwiki/pmwiki.php/VideoGame/AnimalCrossing", "/pmwiki/pmwiki.php/VideoGame/Bayonetta2", "/pmwiki/pmwiki.php/VideoGame/CrashBash", "/pmwiki/pmwiki.php/VideoGame/DisneysMagicalQuest", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsVSkyrim", "/pmwiki/pmwiki.php/Franchise/Kirby", "/pmwiki/pmwiki.php/VideoGame/KirbyAirRide", "/pmwiki/pmwiki.php/VideoGame/KirbysEpicYarn", "/pmwiki/pmwiki.php/VideoGame/KirbysReturnToDreamland", "/pmwiki/pmwiki.php/VideoGame/KirbyStarAllies", "/pmwiki/pmwiki.php/VideoGame/TheLegendaryStarfy", "/pmwiki/pmwiki.php/VideoGame/TheLordOfTheRingsOnline", "/pmwiki/pmwiki.php/VideoGame/TheSims3", "/pmwiki/pmwiki.php/VideoGame/StreetpassMiiPlaza", "/pmwiki/pmwiki.php/Franchise/SuperMarioBros", "/pmwiki/pmwiki.php/VideoGame/MarioKart8", "/pmwiki/pmwiki.php/VideoGame/NewSuperMarioBrosU", "/pmwiki/pmwiki.php/VideoGame/SuperMarioGalaxy", "/pmwiki/pmwiki.php/VideoGame/SuperMario3DWorld", "/pmwiki/pmwiki.php/VideoGame/SuperMarioOdyssey", "/pmwiki/pmwiki.php/VideoGame/MarioParty3", "/pmwiki/pmwiki.php/VideoGame/MarioAndLuigiSuperstarSaga", "/pmwiki/pmwiki.php/VideoGame/SuperSmashBros", "/pmwiki/pmwiki.php/VideoGame/TomodachiLife", "/pmwiki/pmwiki.php/VideoGame/YoshisCraftedWorld", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons"], "non_media_links": ["/pmwiki/pmwiki.php/Main/Pun", "/pmwiki/pmwiki.php/Main/SlippySlideyIceWorld", "/pmwiki/pmwiki.php/Main/SceneryPorn", "/pmwiki/pmwiki.php/Main/SlippySlideyIceWorld", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/TheManInTheMoon", "/pmwiki/pmwiki.php/Main/TravelMontage", "/pmwiki/pmwiki.php/Main/FinalBoss", "/pmwiki/pmwiki.php/Main/WeatherManipulation", "/pmwiki/pmwiki.php/Main/MakeMeWannaShout", "https://www.youtube.com/watch?v=H7v-fNrzhms", "/pmwiki/pmwiki.php/Main/SlippySlideyIceWorld", "/pmwiki/pmwiki.php/Main/ShiftingSandLand", "/pmwiki/pmwiki.php/Main/HailfirePeaks"]}