{"title": "Escort Distraction", "content": "An Escort Distraction is a type of Room Shuffle that involves one character inviting another to go out as a ploy for a third character to set their own plans in motion in the absence of the other character, for whatever reason. Perhaps that third character wanted to do a Zany Scheme that the other one doesn't approve of, such as playing matchmaker with a crush, or something against the law, or anything really if that character is a stick in the mud that doesn't approve of anything zany. Perhaps the third character is actually setting up a Surprise Party for the other character, or is setting up anything to surprise Bob with.\n\nWhatever the case is, the goal is for the first character to distract the second one by escorting them to any place they like, and keep them away from the third character's scheme as long as possible.\n\nOf course, while the Escort Distraction can be a pretty serious ploy in certain cases, when it's a zany scheme in itself, expect a variety of potential things that can go wrong to pop up. Perhaps the third character has to go out of town because he forgot something crucial for his plan to work. Perhaps the second character forgot to bring his wallet and has to go back home. Perhaps the third character reveals later that he needs a little more time for his scheme to finish. Whatever the case is, the other character comes incredibly close to finding out about the third character's plans, and the first character has to distract or stall the second one before it's too late.\n\nIt is possible that neither escorter nor escortee are aware of what the third character is planning, meaning that the escorter has no idea he was meant as a distraction for the escortee until later. It is also possible for the audience to be unaware of that an Escort Distraction is in play until it is revealed so in the end.\n\nCompare and contrast Go Look at the Distraction, in which a character gets sent away without an escort.\n\nThis isn't about using multiple escorts to distract potential assaulters - that's Decoy Convoy. This isn't about distracting the escort from the escortee either (unless it's by means of escorting them out/having them escort another person). This is also not about that kind of \"Escort\" Distraction either, Get Your Mind Out of the Gutter!", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/EscortDistraction", "media_links": ["/pmwiki/pmwiki.php/Anime/DragonBallZ", "/pmwiki/pmwiki.php/Anime/GhostInTheShellStandAloneComplex", "/pmwiki/pmwiki.php/Music/Tsukipro", "/pmwiki/pmwiki.php/ComicBook/IdentityCrisis", "/pmwiki/pmwiki.php/WesternAnimation/MyLittlePonyTheMovie2017", "/pmwiki/pmwiki.php/Film/TheDarkKnight", "/pmwiki/pmwiki.php/Film/TheItalianJob2003", "/pmwiki/pmwiki.php/Literature/SherlockHolmes", "/pmwiki/pmwiki.php/Series/TheBigBangTheory", "/pmwiki/pmwiki.php/Series/StarTrekTheOriginalSeries", "/pmwiki/pmwiki.php/Series/StarTrekTheNextGeneration", "/pmwiki/pmwiki.php/Series/SchittsCreek", "/pmwiki/pmwiki.php/Theatre/Cabaret", "/pmwiki/pmwiki.php/VideoGame/YandereSimulator", "/pmwiki/pmwiki.php/WesternAnimation/Chowder", "/pmwiki/pmwiki.php/WesternAnimation/GravityFalls", "/pmwiki/pmwiki.php/WesternAnimation/MyLittlePonyFriendshipIsMagic", "/pmwiki/pmwiki.php/WesternAnimation/PhineasAndFerb"], "non_media_links": ["/pmwiki/pmwiki.php/Main/RoomShuffle", "/pmwiki/pmwiki.php/Main/ZanyScheme", "/pmwiki/pmwiki.php/Main/TheMatchmaker", "/pmwiki/pmwiki.php/Main/AndThatWouldBeWrong", "/pmwiki/pmwiki.php/Main/SurpriseParty", "/pmwiki/pmwiki.php/Main/GoLookAtTheDistraction", "/pmwiki/pmwiki.php/Main/DecoyConvoy", "/pmwiki/pmwiki.php/JustForFun/IThoughtItMeant", "/pmwiki/pmwiki.php/Main/HoneyTrap", "/pmwiki/pmwiki.php/Main/HighClassCallGirl", "/pmwiki/pmwiki.php/Main/GetYourMindOutOfTheGutter", "/pmwiki/pmwiki.php/Main/PersonOfMassDestruction", "/pmwiki/pmwiki.php/Main/DubNameChange", "/pmwiki/pmwiki.php/WebVideo/SwordArtOnlineAbridged", "/pmwiki/pmwiki.php/Main/AssInAmbassador", "/pmwiki/pmwiki.php/Main/WithFriendsLikeThese", "/pmwiki/pmwiki.php/Main/HaHaHaNo", "/pmwiki/pmwiki.php/Main/DeliveryGuyInfiltration", "/pmwiki/pmwiki.php/Recap/StarTrekS2E4MirrorMirror", "/pmwiki/pmwiki.php/Main/FirstKiss", "/pmwiki/pmwiki.php/Main/HilarityEnsues", "/pmwiki/pmwiki.php/UsefulNotes/TsaristRussia"]}