{"title": "Post-Somethingism", "content": "When people face what nothing in their past has prepared them for they grope for words to name the unknown, even when they can neither define nor understand it...The keyword was the small preposition, \"after,\" generally used in its latinate form \"post\" as a prefix...to mark out the mental territory of twentiety-century life. The world...became post-industrial, post-imperial, post-modern, post-structuralist, post-Marxist, post-Gutenburg, or whatever.\n\nIn academia, adding the prefix \"post\" to a movement, theory, genre, etc is quite common. The best way to describe the meaning of \"post\" in this context is to see that \"post\" is a synonym for \"beyond\", building on the innovations, theories, style, etc of the original in such a way as to take it beyond what the original was, creating a new theory, genre, whatever, in the process. See Also Evolving Trope.\n\nOften subverted in popculture. Usually when someone is being called a \"Post-something\", it amounts to Strawman.\n• Postmodernism, (which refers to a large number of loosely connected movements, including, but not limited to the trope used here) gets its name because its goal was/is to move beyond the movement of modernism. An excellent definition of postmodernism (insofar as postmodernism can be defined) is, \"an interruption of the modern mythological form.\"\n• And in recent years, there's been a growing movement towards what has been called \"Post-Post Modernism\", which is a rejection of Postmodernism in the same way Postmodernism is a rejection of Modernism.\n• This trope is rather common in the field of popular music, with \"post-\" genres of music essentially being reinventions of other popular genres, typically re-orienting them in a more experimental direction; Post-Punk, Post-Rock, and post-metal are the three most prominent instances of this. There are, however, a few outliers:\n• Post-Grunge took the more experimental grunge genre and oriented it in a more mainstream direction, something that allowed it to become massively popular after Kurt Cobain's 1994 suicide left audiences feeling disillusioned by the dark subject matter prevalent in grunge. The genre eventually became Deader Than Disco by the mid-2000's as a result of it stagnating very quickly.\n• Post-disco responded to the late 70's/early 80's anti-disco backlash by stripping away the funk elements of disco and combining the electronic elements of it with dub and R&B; the result had a significant impact on pop that's still felt today.\n• Post-Britpop responded to the downfall of Britpop in the late 1990's by combining the sound of it with American indie rock and experimental influences while also removing the overtly British subject matter.\n• The Other Wiki once had a humorous example in an article named \"Post Gangsta Rap\", sadly, said article no longer exists, so we don't get an explanation.\n• Post-Cyberpunk tries to move beyond the cynicism and hopelessness of Cyber Punk in various ways, such as giving hope for the future (The Matrix Trilogy does this with a messiah figure), showing the upside of technological progress (works that focus entirely on the bright side of cyber-technologies, and don't also show the potential downsides, are called \"cyber prep\") or by parodying or deconstructing Cyber punk tropes (Snow Crash and Transmetropolitan come to mind.)\n• Reconstruction could be said to be \"Post-Deconstruction\", in that it tries to move the genre beyond the criticism of the deconstruction, while at the same time accepting said criticism.\n• The Ur-Example is Post-Impressionism, a term used by art historians to describe artists like Vincent van Gogh, Henri de Toulouse-Lautrec, or Paul Gauguin, who built upon the innovations of the Impressionists and took painting to new styles of expression. Not so much a cohesive art movement as a bunch of loosely-affiliated, like-minded yet fiercely independent artists.\n• Many developed nations are said to have \"post-industrial\" economies, since the service and finance sectors are more important than the industrial sector.\n• Similarly, certain kinds of products are considered to be Post-Scarcity goods. An excellent example is computer software, which, once written, can be infinitely duplicated at virtually zero cost.\n• \"Postcolonialism\" is a more contentious example of this trope, in the sense that it seems to have taken on two distinctly different meanings that are only tangentially related. The first meaning seems to refer simply to the state of the world after the golden age of colonialism (that is, from the 15th century to the early 20th). The second one refers to the kinds of sociological and economic ideologies and analyses that first emerged during the mid 20th-century, which examined the impact and implications of colonialism in-depth, often being highly critical towards colonialism and Occidentalism for their suppression (and in some cases total erasure) of cultures and people outside what is typically defined as the Western world.\n• Even though the term was first coined in 1992, the term 'post-truth' has only recently (following the election of Donald Trump) catapulted into mainstream usage. Referring to constant repeating of Blatant Lies, even after said lies have been debunked, by appealing to emotion. The terms \"Fake News\" and \"Alternative Facts\" stem from this idea.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/PostSomethingism", "media_links": ["/pmwiki/pmwiki.php/Music/KurtCobain", "/pmwiki/pmwiki.php/Film/TheMatrix", "/pmwiki/pmwiki.php/Literature/SnowCrash", "/pmwiki/pmwiki.php/ComicBook/Transmetropolitan", "/pmwiki/pmwiki.php/Creator/VincentVanGogh", "/pmwiki/pmwiki.php/Creator/HenriDeToulouseLautrec"], "non_media_links": ["/pmwiki/pmwiki.php/Main/EvolvingTrope", "/pmwiki/pmwiki.php/Main/TheWarOnStraw", "/pmwiki/pmwiki.php/Main/PostModernism", "/pmwiki/pmwiki.php/Main/PostModernism", "/pmwiki/pmwiki.php/Main/PostModernism", "/pmwiki/pmwiki.php/Main/PostPunk", "/pmwiki/pmwiki.php/Main/PostRock", "/pmwiki/pmwiki.php/Main/PostGrunge", "/pmwiki/pmwiki.php/Main/Grunge", "/pmwiki/pmwiki.php/Main/DeaderThanDisco", "/pmwiki/pmwiki.php/Main/Disco", "/pmwiki/pmwiki.php/Main/Pop", "/pmwiki/pmwiki.php/Main/Britpop", "/pmwiki/pmwiki.php/Wiki/TheOtherWiki", "/pmwiki/pmwiki.php/Main/PostCyberpunk", "/pmwiki/pmwiki.php/Main/CyberPunk", "/pmwiki/pmwiki.php/Main/Reconstruction", "/pmwiki/pmwiki.php/Main/Deconstruction", "/pmwiki/pmwiki.php/Main/UrExample", "/pmwiki/pmwiki.php/UsefulNotes/DonaldTrump", "/pmwiki/pmwiki.php/Main/BlatantLies"]}