{"title": "Necktie Headband", "content": "Exactly What It Says on the Tin: someone wearing a necktie around the head as an improvised Martial Arts Headband.\n\nA trope often associated with salarymen and other corporate types whose business clothes come with a necktie. Sometimes they get overenthusiastic during an after-work party, or they get involved in Serious Business that justifies dropping the Dress Code.\n\nIn real life, most specifically in the hard drinking context, this custom comes from a drunken guy's ostensibly failed attempt to take off his necktie, which remains wrapped around his head for the rest of the party after they forget the matter or quit trying due to alcohol-numb fingers.\n• A 1999 This Is SportsCenter ad had anchors discussing a test of their Y2K emergency procedures. The test goes less than optimally as chaos in the offices break out. The kicker, though, is Charlie Steiner shoving his face into the camera, wearing a necktie on his head and holding a latern while shouting, \"Follow me! Follow me to freedom!\"\n• Worn by Bradley in an omake of Fullmetal Alchemist parodying the bit where he turns out not to be dead.\n• Oji \"Gabriel\" Tanaka does this when playing guitar in the early episodes of The Legend of Black Heaven. Later on, he just takes the tie off.\n• Seen on a horde of drunken salarymen in Peepo Choo.\n• Trigun: Vash the Stampede does this a couple times in both versions, when he gets down to some serious drinking. We never see the tie otherwise—he seems to only pull it out for this purpose.\n• My Monster Secret has a chapter where Youko's father Genjirou sports one of these after having too much to drink. This is doubly funny because 1) he wasn't even wearing a tie before, and 2) as a full-blooded vampire he's somewhere between two and three times taller than the rest of the cast.\n• Done by some of the clerks when they turn pirate in The Crimson Permanent Assurance short that accompanies Monty Python's The Meaning of Life.\n• Lisa sports one in The Room while she and Johnny get very drunk on Scotchka before their second love scene.\n• In Sam, Steve is wearing his necktie as headband by the end of his Stag Party.\n• Shaun in Shaun of the Dead does this to cover a dart wound.\n• Doctor Who: In \"The Girl in the Fireplace\", the Tenth Doctor dons his necktie as a headband after partying with 18th century French aristocrats. Of course, since it's the Doctor, it's all part of his plan to make the bad guys underestimate him.\n• Will does this on the first day at his upper class school in The Fresh Prince of Bel-Air arguing that while the dress code specifies a tie in a half-Windsor knot, it doesn't say where he has to wear it.\n• In a fifth season episode of How I Met Your Mother, Ted Mosby ends up with a tie wrapped around his head during a quick montage of a Drinking Game.\n• My Name Is Earl: Randy unties Earl's tie (which Earl doesn't know how to retie) in order to show Earl what he would look like as an eighties guy at a rock concert.\n• 100 Things to Do Before High School: In \"Sit at a Different Lunch Table Thing!\", Fenwick gets carried away with his impersonation of an 8th grader, and ends up dancing on the 8th grade patio wearing his tie as a headband.\n• In Osu! Tatakae! Ouendan, the salaryman dons a neckie headband to get ready for a showdown with a giant mouse monster.\n• Kane does it when tackling an after-hours assignment in Yellow Peril.\n• Used by the very first hero in The Superest: The Unopposinator .\n• The Adventures of Dr. McNinja: Dr. McNinja does this a couple of times when he's either about to do something awesome or when he's drunk.\n• Critical Role: Donned by Sam during Scanlan's solo assault on the manor in Episode 31.\n• In The Muppets' version of \"Jungle Boogie \", Sam the Eagle has this at one point, even though he was never wearing a tie in the first place.\n• An episode of Codename: Kids Next Door has Numbuh 1 teaming up with a former salaryman hunting a serpent-like tie monster whose breath forcibly turns people into suit-wearing businessmen who slave away in corporate management. The man in question, Vin Moosk, wears his former necktie as a headband and later goes on to become one of the few adults Numbuh 1 is trusting of/considers to be cool.\n• Agent/Principal Phil Coulson of Ultimate Spider-Man seems prone to this trope when going into battle. After all, nothing says Badass Principal like an improvised Martial Arts Headband.\n• At at least one factory in the US, labor union representatives wore their neckties on their heads to a meeting with Japanese executives overseeing the plant to show their willingness to stand for their positions.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/NecktieHeadband", "media_links": ["/pmwiki/pmwiki.php/Webcomic/YellowPeril", "/pmwiki/pmwiki.php/Series/SportsCenter", "/pmwiki/pmwiki.php/Manga/FullmetalAlchemist", "/pmwiki/pmwiki.php/Anime/TheLegendOfBlackHeaven", "/pmwiki/pmwiki.php/Anime/LuckyStar", "/pmwiki/pmwiki.php/Manga/PeepoChoo", "/pmwiki/pmwiki.php/Manga/Trigun", "/pmwiki/pmwiki.php/Manga/MyMonsterSecret", "/pmwiki/pmwiki.php/Film/MontyPythonsTheMeaningOfLife", "/pmwiki/pmwiki.php/Film/Grindhouse", "/pmwiki/pmwiki.php/Film/TheRoom", "/pmwiki/pmwiki.php/Film/Sam", "/pmwiki/pmwiki.php/Film/ShaunOfTheDead", "/pmwiki/pmwiki.php/Series/DoctorWho", "/pmwiki/pmwiki.php/Series/TheFreshPrinceOfBelAir", "/pmwiki/pmwiki.php/Series/HowIMetYourMother", "/pmwiki/pmwiki.php/Series/MyNameIsEarl", "/pmwiki/pmwiki.php/Series/OneHundredThingsToDoBeforeHighSchool", "/pmwiki/pmwiki.php/VideoGame/OsuTatakaeOuendan", "/pmwiki/pmwiki.php/Webcomic/TheAdventuresOfDrMcNinja", "/pmwiki/pmwiki.php/Franchise/TheMuppets", "/pmwiki/pmwiki.php/WesternAnimation/CodenameKidsNextDoor", "/pmwiki/pmwiki.php/WesternAnimation/UltimateSpider-Man"], "non_media_links": ["/pmwiki/pmwiki.php/Main/MundaneMadeAwesome", "/pmwiki/pmwiki.php/Main/StealthPun", "/pmwiki/pmwiki.php/Main/ExactlyWhatItSaysOnTheTin", "/pmwiki/pmwiki.php/Main/MartialArtsHeadband", "/pmwiki/pmwiki.php/Main/Salaryman", "/pmwiki/pmwiki.php/Main/LampshadeWearing", "/pmwiki/pmwiki.php/Main/SeriousBusiness", "/pmwiki/pmwiki.php/Main/DressCode", "/pmwiki/pmwiki.php/Main/SisterTrope", "/pmwiki/pmwiki.php/Main/LampshadeWearing", "/pmwiki/pmwiki.php/Main/MillenniumBug", "/pmwiki/pmwiki.php/Main/HilarityEnsues", "/pmwiki/pmwiki.php/Main/AnimeAndManga", "/pmwiki/pmwiki.php/Main/ConversationalTroping", "/pmwiki/pmwiki.php/Main/FriendlyNeighborhoodVampire", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/StagParty", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Recap/DoctorWhoS28E4TheGirlInTheFireplace", "/pmwiki/pmwiki.php/Main/PlayingDrunk", "/pmwiki/pmwiki.php/Main/ObfuscatingStupidity", "/pmwiki/pmwiki.php/Main/DrinkingGame", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/WebComics", "/pmwiki/pmwiki.php/WebComic/YellowPeril", "http://thesuperest.com/archives/2007/10/16/k01_unopposinator/", "/pmwiki/pmwiki.php/Main/McNinja", "/pmwiki/pmwiki.php/Main/WhatDidIDoLastNight", "/pmwiki/pmwiki.php/Main/WebVideo", "/pmwiki/pmwiki.php/WebVideo/CriticalRole", "https://www.youtube.com/watch?v=h4Bq69HfR0Y", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/BreathWeapon", "/pmwiki/pmwiki.php/Main/SharpDressedMan", "/pmwiki/pmwiki.php/Main/BadassTeacher", "/pmwiki/pmwiki.php/Main/MartialArtsHeadband", "/pmwiki/pmwiki.php/Main/RealLife"]}