{"title": "Holiday Mode", "content": "A general term for Video Game features that depend on the actual date or time the game is played. For non-online games, these are usually stored as Easter Eggs. Holiday Mode may do anything from changing a single sound or sprite, to adding extra enemies, or even giving access to levels that are not normally available.\n\nOne of the most common holidays to be noted by games—especially western games—is Christmas, but other special dates or times may be observed as well.\n\nMost examples of Holiday Mode only cause very minor changes that don't alter gameplay, although some cause enough changes that they're no longer just interesting, but the whole game seems very different.\n• Ace Online features several holiday events with associated changes:\n• Christmas: Snow in Arlington/Bygeniou City, Crazy Snowmen spawn, which drop Gift Boxes, Pretty Bows, and Wrappers, which can be combined at the Factory to make Presents.\n• For Valentine's this 2009, Bloody Valentines event is in effect - As of the latest patch, Event Mobs spawn in New Bark City and the Pandea Maps that may drop Broken Hearts. These Broken Hearts may be combined into even-exclusive marks or event-exclusive capsules.\n• For 2009 New Year's Event, Special Event bosses will spawn in mid-to-high level areas. They have a chance of dropping rare event items that can be combined into equippable holographic Marks.\n• Alice in the Mirrors of Albion celebrates the holiday seasons by triggering special locations, quests, monsters and items related to the event in question. For example, during Valentine's season, we are allowed to explore a wedding hall, and trade with the bride & bridegroom, as well as the musicians and flower girls, and some cupids. At Easter, the Easter Garden appears, and the player could encounter Easter Bunnies and the likes.\n• Ancient Domains of Mystery has special effects for Mondays, Friday the 13th, Halloween, Christmas, New Year, and the game creator Thomas Biskup's birthday (July 2nd). In a twist to this trope, the first two examples give a penalty rather than a bonus to the player - a very mild one in the first case, a rather nasty one in the second.\n• Animal Crossing famously celebrates holidays. The Japanese version would have events themed after holidays such as Golden Week, while the localized American version celebrated Labor Day and other U.S. holidays. Internationally known holidays like Christmas and Halloween were celebrated in all versions. The later games, however, celebrated made-up holidays instead, to make localization easier. City Folk and New Leaf bring back regional holidays, and keeps them enabled during Wi-Fi play, encouraging people to visit international friends to participate in their holidays.\n• Also, you are given a piece of birthday cake on your birthday by a random villager, which increases your feng shui, and you might also get birthday cards with gifts in the mail.\n• In New Leaf, talking to K.K. Slider on the Saturday before your birthday (or the day of if your birthday falls on a Saturday) leads to him playing a special birthday song for you, only obtainable this way. And then on the day of your birthday, the few villagers with the highest affection for you will actually hold a surprise party for you.\n• In Art of Fighting 3, each character has a birthday. If the game is played on a certain character's birthday, that character will become stronger and have the ability to perform their Desperation Attack at any time (which normally only happens when they are low on health).\n• Awesomenauts sets out various decorations in the backgrounds of the maps for a couple weeks during various holidays, including the game's anniversary.\n• In Batman: Arkham City, going to see Calendar Man on certain holidays will result in him telling you a story about a crime he committed on that day. On Mother's Day and Father's Day when he tells you how he killed his mother and father on those days . Never said Holiday Mode had to have cheery events! Doing this for all the holidays is required for the \"Storyteller\" achievement.\n• In Best Fiends, certain holidays will create different events to play, themed around the holiday for special costumes for Fiends. Along with this are changes to the Slugs' costumes and the game's soundtrack. The background of the hub world will also be added to as well at times with various props.\n• Billy Vs SNAKEMAN has some kind of Holiday Mode content active during half the year, mostly in the form of quests, but some months add items to what you can find while Collecting Ingredients or buy from the NPC vendor. Also, the village upgrade 'Ninja-Mas Tree' only does anything in December (And does it's thing ten times as well on the 25th).\n• BIT.TRIP RUNNER automatically changes to a Christmas theme in December. Commander Video's cape changes to a red and white pattern, and he wears a Santa Hat on the main menu. The main menu music is also replaced with chiptune Christmas music.\n• On April 1, in Black & White, the Creature's footprints will be replaced by smiley faces.\n• GunZ: The Duel has a Christmas version of its popular town level that shows up only around Christmas time. After Christmas is over, the level is gone.\n• Call of Duty: Modern Warfare has the level \"Winter Crash\", which is a Christmas-themed version of the level \"Crash\", complete with lots of snow, lights, and even the occasional sound of Santa in the distance. That's him dropping presents. HO HO HO!\n• In Castaway Paradise, when it's near Halloween the island's color scheme changes to emerald green and purple, the buildings and landmarks are appropriately decorated and the water around the island turns green and bubbling. Around Christmas, the buildings and landmarks are decorated and the grass and trees are covered in snow.\n• You can buy birthday cake in Castlevania: Portrait of Ruin.\n• The WiiWare version of Cave Story replaces the protagonist's sprites on Halloween and Christmas. On Halloween, he's a zombie and he receives a pumpkin mask in the Plantation; on Christmas, he's dressed like Santa and receives a reindeer mask.\n• In Cave Story+, nearly all the sprites are changed for Christmas; the player sprites, the NPC sprites, the bosses, the enemies, the item drops. Experience drops are changed to jingle bells, the missile drops have little ribbons tied around them, and the Demon Crown becomes a boxed present the Doctor wears on his head. And the Halloween sprites are just as elaborate.\n• Champions Online has a few holiday events. The most prominent is Bloodmoon which was originally for Halloween, but now happens every full moon. There's also a Christmas event, called Attack of the Misfit Toys, an April Fools Day event and an event for the anniversary of the game's release.\n• Christmas NiGHTS was a one level demo of NiGHTS into Dreams... for the Sega Saturn, whose main feature not present in the original game was to change the graphics and models based on the time of year. One of the fan favourites was on April Fools' Day, where Reala's character model would replace that of NiGHTS!\n• And on the Updated Re-release on the PlayStation 2, the Christmas NiGHTS mode also exists.\n• Really, most games that feature NiGHTS (even as a cameo) have some special event on both Christmas and April Fools' Day. For example in Sonic Shuffle, Lumina's model would be replaced with NiGHTS' on Christmas Eve. In Journey of Dreams, the My Dream room's music would change on these holidays.\n• While on the topic of Journey of Dreams, the game was even announced on April 1st and released Christmas season of the same year.\n• City of Heroes gave out special Christmas-themed powers. Winter events had an entire Ski Chalet appear in Pocket D, with special missions to save Baby New Year and ski slopes with badges for fast times. The game also featured Halloween Mode which turns off the sun, allows for some very violent trick or treating, and is heralded by frequent invasions of zombies, vampires, ghosts, demons, werewolves, monsters and angry women. Of lesser note is Valentine's Day mode, which basically enables some extra missions in the Pocket D.\n• Civilization III had a (mass) regicide mode, with (a) king unit(s) that had to be killed to win. If the computer clock is set to January 8 (Presley's birthday), the king unit is ... well, The King.\n• During December, Cooking Mama 3 puts Mama in a Santa outfit, sticks a Christmas tree background behind her and redecorates the stores in shopping mode with festive decor.\n• Clockwork Knight 2 for the Sega Saturn displayed holiday-themed title screens when the system's internal clock and calendar reached Christmas, New Year's Day, and Valentine's Day.\n• Cookie Clicker has a number of holiday events for Halloween, Christmas, Valentine's Day, and Easter, with different items that give various bonuses. There's also \"Business Day\", which takes place on April Fools' Day and replaces the various ridiculous cookie-producing buildings with (relatively) more serious ones and replaces golden and wrath cookies with functionally-identical \"contracts\". The \"Season Switcher\" ascension bonus lets you activate a holiday mode of your choice for 24 hours at any time in exchange for some cookies.\n• In Crusader, starting the game on Christmas will result in a special bonus level where you're surrounded by a dozen of the end boss in an open room with no cover, while you're armed with every gun in the game, and a techno-industrial remix of Christmas carols plays.\n• After beating D2 and sitting through the end credits, a clock appears counting down to (or the time past) December 31, 1999. If the player alters the Dreamcast's internal clock so that this post-credits display reaches midnight on New Year's Day, it triggers the message \"Welcome to the 21st Century!\" Not only that, but if you try to play a Dreamcast demo disc from the official magazine around Christmas the background will be Christmas themed.\n• The December 25 Christmas tree in Dark Castle's Great Hall was one of the most beloved Easter Eggs on early Macintoshes.\n• In Darwinia, about half of the Darwinians will have santa hats on during 25th of December and the ground is mostly white.\n• DC Universe Online has month-long in-game events for Valentine's Day, St. Patrick's Day, Spring, Summer, Halloween, and Christmas that give access to special Feats, Styles and base items. During these events, The Vault also changes appearance and music and the Christmas version replaces The Joker's introductory message with him singing \"Jingle Bells, Batman Smells\".\n• DEFCON of all games, has a Christmas modification: the whole world is seen from a polar perspective, reindeer fly instead of bombers, the haunting soundtrack is replaced by Christmas songs, and instead of the \"5 million dead\" it's \"5 million children made happy\". That's right, you're playing as multiple factions of Santa, all struggling to deliver presents. It adds a surreal sense of heartwarming to a cutthroat game of nuclear war.\n• As if Demon's Souls wasn't already Nintendo Hard enough, play it online on Halloween 2009 , where it will temporarily become Nintendo Harder.\n• In The Denpa Men, if you talk to your Denpa Men on Christmas, they'll acknowledge it. In addition to wishing you Merry Christmas, they'll also make observations, such as wondering why Santa hasn't been busted for breaking and entering yet.\n• In Donkey Kong Country 3: Dixie Kong's Double Trouble!, inputting a code in the file select screen changes the bonus room's music and bonus item look to a Christmas theme.\n• Dota 2 has events that happen around holidays, such as Frostivus for Christmas, Diretide for Halloween, and the New Bloom festival for Chinese New Year. Frostivus, in a Running Gag, is usually cancelled and replaced with a different event, such as the Greevling and Wraith Night.\n• In Dragon Quest IX, you can get holiday-themed items such as a cake if you use DLC at Christmas.\n• In Dungeon Crawl, if you play on an online server during the Christmas season, Cocytus, the icy Hell, is renamed The North Pole, and Antaeus, the boss of the area, has his appearance change to a more festive look[1] . This does not make the area any less challenging.\n• Dungeon Keeper had a secret level that was only accessible during a full moon. The game also showed happy birthday messages for the developers when it started.\n• Fable Heroes has the players all gain pumpkin heads if they play on Halloween.\n• Fallout 4's Diamond City redecorates for holidays such as Christmas and Halloween when the appropriate day rolls around, though it works on the in-game clock rather than the real-world day. City guards will also have special lines of dialogue for these days.\n• Fallout Shelter adds Halloween, Thanksgiving, and Christmas modes when those holidays come around. On top of allowing Skeleton, Ghost, Pilgrim, Santa Clause, and Elf costumes, the full-sized barracks and cafeterias become decorated with appropriately themed decorations and music.\n• Final Fantasy XI celebrates a number of Japanese-specific and worldwide holidays, although usually given Vana'diel-specific names and customs. The Harvest Festival happens around Halloween, for example, and still involves costumes as various monsters, Jack-o-lanterns, and handing out candy. Specifically, there is New Year's, Valentione's Day (Valentine's Day), Doll Festival and Feast of Swords (both related to Children's Day in Japan), Egg-stravaganza (Easter), Harvest Festival (Halloween), and the Starlight Festival (Christmas). There's also Celestial Nights and the Sunbreeze Festival during the summer,they don't appear to be related to specific holidays. Both Sunbreeze Festival and Starlight Festival have unique music playing at times in the towns, and there are fireworks during the former.\n• Similarly, Final Fantasy XIV celebrates various holidays, as filtered through Eorzean names and customs. These include Valentione's Day (Valentine's Day, a carry-over from XI), Heavensturn (Chinese New Year's), Hatching-tide (Easter), Firefall/Moonfire Faire (an original holiday that corresponds with fireworks-centric holidays like Independence Day), Little Ladies' Day (Girl's Day in Japan), All Saints' Wake (Halloween), and the Starlight Festival (Christmas).\n• Flight Rising has the elemental holidays, week-long festivals at the end of every month (except December) dedicated to one of the game's elemental flights. A special store opens during those weeks where you can use special currency, unique to each festival, to buy festival-exclusive apparel and familiars themed around that element. Additionally, there is an official contest each month where users can submit skins and accents, and the winners will have their skin/accent published for free and available to the entire player base through the Marketplace and Coliseum. Unofficially, the members of a flight will organize special events and contests on the forums during their festival, and it's tradition for the other ten flights to hold off on dominance pushes for the week before a festival so that a flight can have guaranteed dominance (and its gameplay benefits) during their own festival. However, none of the festivals explicitly correspond to real life holidays.\n• October: Riot of Rot (Plague) Yes, the festival celebrating all things creepy and gross is on the same week as Halloween. This probably isn't a coincidence.\n• Florensia celebrated Christmas 2008 with trees and decorations in the towns, and a special Christmas soundtrack. At Thanksgiving they offered cranberry sauce as a buff item.\n• In Fly FF, there have been Christmas events featuring special items and costumes. In addition, the landscape changes with respect to the seasons — red and orange trees with falling leaves in autumn, bare trees and a sprinkling of snow during the winter, and blossoms on the trees in spring.\n• An old update of Fraxy had a secret mode on April 1st; a secret mode based off of Gradius, complete with autoscrolling and an inability to turn (and turned the player into the Vic freaking Viper!). Later updates added the Vic Viper, the option to turn on autoscrolling, and a scenario mode based on the one that came with the Holiday Mode.\n• Gears of War 3 unlocks special holiday events in multiplayer: Pumpkin heads for Halloween, Exploding turkey / chicken launchers for Thanksgiving, Snowman heads for Christmas, and a Locust in football pads for Super Bowl week.\n• In Giana Sisters DS, the scrolling title screen not only changes depending on if it's day or night, but it also has a special Easter title screen where the passing enemies are replaced by rabbits.\n• Grand Theft Auto V: It snows during the Christmas season in GTA Online.\n• In Guild Wars, Wintersday and Halloween were both celebrated, with certain towns being decorated for the occasion.\n• The Far East continent of Cantha also celebrates the lunar new year in February and the Dragon Festival which roughly corresponds to the 4th of July.\n• It also celebrates Talk Like A Pirate Day with a few piratey NPCs and grog as a random drop; Thanksgiving, St. Patrick's Day, and Easter with themed drops; and April Fool's Day with goofy quests and joke changes to character models.\n• Hidden City Hidden Object Adventure had different artwork for Christmas, where characters are wearing Happy Holidays Dresses and fancy winter capes and coats trimmed with fur.\n• One Halo 3 multiplayer map, Valhalla, has a large wall on one side that features a different image on certain days of the year, including Veteran's Day, Halloween, and July 7 (Bungie Day). Halo 3 also displays joke \"advice\" messages on April Fool's Day. One was something to the effect of, \"You can avoid damage from a grenade if you sit on it like a goose.\"\n• The The Incredible Machine series had special parts available only on certain days. This includes a bat on Halloween, a Santa lamp on Christmas, and a dancing Leprechaun on St. Patrick's Day.\n• Jazz Jackrabbit has a holiday themed menu that starts on Thanksgiving and runs until the end of January. Aside from this the game is unaffected. This is even true of the special 'Holiday Hare' release.\n• Enemies in Killing Floor get reskinned during the Christmas, Halloween and summer periods. (If you want to know, the summer theme is \"circus freaks\". The Halloween mode was also changed in 2012 from generic Halloween monsters to Hillbilly Horror).\n• Kingdom of Loathing acknowledges most real-world holidays, sometimes in altered form (e.g. Easter becomes Oyster Egg Day).\n• These are recognized both on their real-life dates, and the corresponding dates to the in-game calendar to the first day each one was celebrated. A notable exception is Christmas, which has two in-game holidays: Yuletide is a day-long celebration occurring every Dougtember, while Crimbo is a month-long celebration, which takes place every December.\n• Because of the above, holidays occasionally overlap. In 2006, KoL-calendar Halloween fell on real-world December 25th. Result: a The Nightmare Before Christmas-inspired \"Crimboween\" celebrated on October 31st. In 2011, the in-game Feast of Boris fell on real-life St. Patrick's Day, resulting in the unique \"Drunksgiving\" event.\n• For the first few years of the game, the Thanksgiving analogue \"Feast of Boris\" wasn't celebrated on real-world Thanksgiving because the possibility that real-world Thanksgiving would fall on a stat day would lead to absolutely broken speedruns that couldn't be challenged until the next time such an occurrence happened. This eventually did happen.\n• Kirby: Squeak Squad had a special graphic with most of the characters and a giant cake appear before entering the menu. All it said was 'happy birthday.'\n• The DS The Legendary Starfy game gives you a cute \"Happy Birthday\" graphic with a cake before you go to the start menu if you play it on your birthday.\n• Playing LEGO Loco during Easter, Halloween, and Christmas unlocks special holiday pieces, as well as seasonal pieces.\n• Lethal League changes the weather in one of its stages when the player's computer's clock is set for the month of December. Additionally, Candyman's top hat changes to a Santa hat.\n• In Lexi-Cross, host Chip Ramsey had special pre-game messages for certain U.S. holidays.\n• In LittleBigPlanet, holiday downloadable content is released and sometimes free. This includes Leprechaun, Santa, and other costumes, along with some packs. Playing during certain developer birthdays, as well as the birthday of Media Molecule itself, can get you Pins that you can display on your account.\n• Madden NFL will appropriately mark up the field for October (breast cancer awareness month), as well as holidays. The game will also attempt to match the current weather at the stadium where you are playing, due to a partnership with the Weather Channel.\n• Play Magician's Quest: Mysterious Times on your birthday, and your fellow students will take note of it and congratulate you. If you have a boyfriend/girlfriend among them, they'll even give you a present.\n• MapleStory has holiday-specific events, including an entire Christmas-themed distant land. During the anniversary, it had special cake monsters that (every once in a blue moon) dropped special items.\n• The Ambrosia Software game Mars Rising would become Christmas-themed when played on Christmas.\n• In Mega Man ZX, an NPC gives you a slice of cake.\n• Mega Man ZX: Advent had unique chips and items that could be attained in one of two rooms depending on the month.\n• In Metal Gear Solid 2, the Gurlukovich soldiers carry dog tags bearing the personal information of Metal Gear fans who sent in their details. If you steal a soldier's dog tag, and examine them through the Scope/Camera with the Triangle button, and the date corresponds to the date of birth of the soldier, you'll see the words 'HAPPY BIRTHDAY' pop up on screen. A similar thing happens if, when putting your name in the Node at the beginning, you put in that day's date as your date of birth.\n• Minecraft for Halloween has zombies, skeletons, and zombie pigmen occasionally spawn in the game with a pumpkin or a jack o' lantern for a head instead of their regular heads. Which makes them immune to daylight.\n• Another update for Christmas 2012 changed the skins on Chests to make them look like wrapped gift boxes.\n• Bats also spawn more frequently around Halloween.\n• Monster Rancher DS combines this with Video Game Time. On the in-game week that would correspond with your system-entered birthday, either your assistant, your monster, or your pet owl will give you a gift.\n• Motor Mayhem puts Santa hats on all of the characters if you play the game on Christmas.\n• In the Munchers series of edutainment computer games (i.e., Number Munchers, Word Munchers), between December 1 and Christmas, one of the titular Munchers wears a Santa hat. However, this only occurs with computers that can remember the time/date or by leaving on a computer constantly, since not all computers were capable of such technology at the time.\n• In My Little Pony: Friendship Gardens, playing on your birthday will get you a surprise letter from the ponies.\n• NetHack subtly changes the game mechanics based on time of day and moon phase. For example, dogs are harder to tame at night during a full moon, and some monsters give different messages when talked to at night. There is a minor luck penalty on Friday the 13th. There's also the not-so-subtle effect that the Cockatrice's hissing attack has a 100% success rate during the new moon.\n• Nexus War games have had events for Christmas, Halloween, Easter, April Fools Day, St. Patrick's Day, and the ten-year anniversary of the founding of the game. One notable unique holiday occurred when a player sent a large care package of food to the original developer, who declared the day \"Meat Day\" and granted hundreds of additional actions to every character in the game. Events with a similar reward are still called \"Meat Day\" regardless of the reason for celebration.\n• 100% Orange Juice! has had special events for Halloween, Christmas and Valentine's Day, including a storyline in Christmas where Aru (Scramble) actually addresses the player and asks for help to retrieve 15 presents, and unlocking content for other chaacters; and there's also a Valentine's Day storyline, called \"Chocolate for The Sweet Gods\", where the game once again adreesses the player and ask for help to retrieve 50000 chocolates to unlock new content.\n• Operation Flashpoint of all games did this. Around Christmas time all of the small pine trees turn into Christmas trees, complete with presents.\n• Overwatch: On top of the Christmas, Halloween, and Chinese New Year events that take place every year The Overwatch Anniversary and Summer Games events may count, too , the Hollywood map is dressed up every Halloween, and ditto for King's Row and Hanamura every Christmas. The heroes will sometimes say something appropriate to the time of year as well; New Years' resolutions at the start of the year, and a Ship Tease during Valentine's/White Day if Genji and Mercy are on the same team on Hanamura.\n• PAYDAY The Heist had gift boxes very well hidden during the Christmas season in 2011 and 2012. Players who found the boxes unlocked the Santa mask and an achievement.\n• Perfect World had an amazingly annoying set of quests involving snowmen and Christmas cards in 2008.\n• Planetside has holiday specific events. On Christmas, snowmen and gingerbread men are placed on a variety of the maps (include the deserts), and finding them grants you use of a special item for the duration of the event. Other holidays, such as Halloween, have different events each year.\n• The original version of Plants vs. Zombies 2, which was released in late October 2013, had the three starting plants in Halloween costumes. This was removed in the first update. Christmas 2013 saw the release of limited-time \"Feastivus\" Christmas bonus levels, with zombies dressed as elves and so forth.\n• Pokémon:\n• Trainers in Sinnoh in Pokémon Diamond and Pearl can enjoy Diamond Dust weather instead of snow at Snowpoint City on several notable days, including certain holidays and developer Junichi Masuda's birthday on January 12.\n• Mt. Silver in Pokémon HeartGold and SoulSilver also features Diamond Dust on certain days, including the release date of the original Gold and Silver.\n• On your birthday, by talking to Lucas or Dawn (depending on who you're playing as), they'll acknowledge the fact that it's your birthday and congratulate you.\n• Pokémon HeartGold and SoulSilver do this as well, by talking to Gold or Lyra.\n• Pokémon X and Y has the Pokémon Center greet you with a surprise party and a birthday cake on the screen above the front desk. It also switches the music to a music box version of the Pokemon Center theme and Nurse Joy greets you with a happy birthday. Your birthday is also the only time you can obtain Supreme Wish PokéPuffs in Pokémon-Amie.\n• Pokémon Omega Ruby and Alpha Sapphire do the same thing as X and Y on the player's birthday.\n• Playing Puyo Puyo SUN during the month of December will stick the characters in Santa costumes in the game's Sound Test.\n• Raptor: Call of the Shadows has a birthday mode. Certain dates, which are the birthdays of some of the developers, give a non-standard version of the Apogee theme sung by said developpers and automatically activate the game's Silliness Switch cheat, which is anything but silly in difficulty as it adds lots of extra, very tough, enemies to the levels. These extra enemies are so tough it takes several shots from the most powerful weapon in the game to destroy them.\n• Rappelz has had candy cane monster drops and craftable Santa costumes. There is also a Christmas Rangifer, a red-nosed deerlike animal, wandering the maps. You can't attack or fight it, but if you look around nearby you may find wrapped gifts on the ground that you can gather.\n• The second and third Ratchet & Clank games have a Developer's Room called the Insomniac Museum that is usually available only after getting 100% Completion. True to its name however (in spite of being named after the developers of the game), the teleporter to the Museum will freely activate between the hours of 2AM and 3AM.\n• Rise of the Triad has its Holiday Mode triggered five times a year and gives a hat to certain team members on the loading screen.\n• 4th of July - An American flag for Wednt\n• Christmas - A Santa hat for Cassat, plus all the level music in the game is replaced with a catchy tune called \"Deadly Gentlemen\". Considering that ROTT is a First-Person Shooter, this may make it an Anti Christmas Carol. You can also see a picture with all the holiday hats if you wait long enough at the The End screen.\n• Runescape celebrates Christmas, Easter, Thanksgiving, and Halloween with somewhat large events which tend to involve short quest type things, giving out unique, untradeable rewards that are only available during their respective holiday seasons that year. Each holiday has begun to develop its own storyline. Originally, holidays were celebrated with massive, one-day holiday drops of tradeable holiday items which now sell for prices disproportionate to their utility. The Santa hats dropped in 2002 are now rare enough to sell for millions of coins, and a collection of the five, different colored party hats of 2001 now costs over 2 billion coins, which is MORE COINS THAN IT IS POSSIBLE TO HAVE AT ANY POINT IN THE GAME. The impact of these prices on the game's economy is the reason that holiday items released now are untradeable.\n• Scooby-Doo! Night of 100 Frights has hearts on all the Scooby Snacks on February 14, snow everywhere on December 25, and fireworks in the background on December 31.\n• The city in Shenmue gets redecorated for Christmas and other holidays, most of which the player will never see since it's easy to complete the game before then.\n• In Sid Meier's Pirates!, if your computer clock is set to September 19th (International Talk Like a Pirate Day), all the dialogue in the game is piratized.\n• Start up SimCity 4 on December 25 and load a city. If there is an area of the city with sufficient elevation, snow will appear on those areas when it's wintertime.\n• The Simpsons: Hit & Run had a festive version of the main menu, as well as a creepy version for Halloween and a romantic version for Valentine's Day.\n• The Simpsons: Road Rage has several characters who are only available on certain days of the year - Christmas Apu on December 25th, Hallowe'en Bart on October 31st, Thanksgiving Marge on the fourth Sunday in November, and New Year Krusty on January 1st.\n• Around Christmas time, Sonic Adventure allowed players to download a patch which added a Christmas tree to Station Square. Its sequel featured unlockable costumes for both Halloween and Christmas.\n• In the independent fan-game Sonic Robo Blast 2 (pictured), the game added hidden Easter eggs to collect around Easter time, and even kept track permanently of which ones you collected (so if you didn't get them all during one Easter time, you could finish the job the next year). During Christmas time, the game did a total visual and aural overhaul. The music for every level was replaced with a different Christmas tune, snow fell in every level, and many textures changed. Sadly removed in later versions, since the holiday modes caused some graphical problems.\n• In Sonic & All-Stars Racing Transformed, Alex Kidd was unlocked on December 25, 2012.\n• Spiral Knights gives its main area, Haven, a makeover and opens up some extra missions which you can run for tokens which you exchange for costumes three times a year.\n• Around Halloween, Haven gets darker and pumpkins are scattered around. You get to hunt for the Punkin King, who gives you three types of candy. Each of these candies is exchanged for a different type of mask, the higher-priced versions of which look less like a cheap cardboard mask and the most expensive versions lasting permanently. Each candy can also be traded for boxes which give you orange versions of lower-tier armor.\n• Around the Holiday season, Haven is covered with snow and festive decorations and the characters celebrate Winterfest. You get to help out Impostoclaus (a giant jelly with a moustache, glasses, a pipe, and a santa hat) who gives you tokens that you can trade in for Santy hats, the more expensive versions of which cause snow to fall around you. The tokens can also be traded in for boxes which give you white versions of lower-tier armor.\n• Lastly, around the time when Spiral Knights was released, you get to help out a baker whose cakes turned into monsters. Haven doesn't actually change much for this event, but you can trade in the tokens from the monster-cakes for cupcake-esque hats, the most expensive version of which matches your player's color and lasts permanently.\n• While Splatoon 2 has monthly online Splatfest events, there have been some special holiday events that come with free exclusive gear and a holiday-themed makeover for Inkopolis Square and all the multiplayer stages. These special holiday Splatfests include Splatoween (October 2018), Frosty Fest (January 2019), and Spring Fest (April 2019). The final Splatfest of the game, titled Final Fest: Splatocalypse, will take place in July 2019, both to commemorate the second anniversary of the game as well as to serve as the Grand Finale to the game's Splatfest events.\n• Star Wars: Galaxies got into the act too. The Star Wars Holiday Special, as much as everyone would rather forget it, had already given them Wookiee Life Day for Christmas... and as luck would have it, the Republic was founded on July 4th. And you celebrate it with fireworks and parades. How fortunate! Not to mention the Ewok Love Festival!\n• Star Wars: The Old Republic allows you to purchase special items from the Cartel Market around Halloween, and around the holidays you can throw snowballs at players and NPCs to collect parcels for Life Day-themed items.\n• The greeting in Stronghold is changed to \"Merry Christmas, my Lord!\" if you play on the 25th.\n• The Mario fan game Super Mario Blue Twilight DX has this for Christmas, April Fool's Day and (obviously) Halloween. To note:\n• On Halloween, the true final level is unlocked and you get to face Dracula in a true final battle for the real ending.\n• On Christmas, you unlock a mini 'side game' of sorts, showing Mario's quest to save Christmas by finding the ornaments stolen from the Mushroom Kingdom Christmas Tree. Cue two new levels with new enemies, graphics and music.\n• On April Fool's Day, Mario gets to visit Green Hill Zone and fight Sonic the Hedgehog.\n• And unlike in many fan games, these bonuses genuinely are tied to the computer's system clock. Which has probably confused a few people given that the final level and good ending is only legitimately playable in one day of the entire year.\n• Super Princess Peach changes its title screen depending on if it's day or night.\n• Super Smash Bros. Crusade changes the item boxes to the present boxes from Brawl during the month of December.\n• The clock in the Desk stage in Super Smash Flash 2 Beta changes its hand location depending on the time of the day set in your computer. The view in the window also changes depending on the time.\n• Team Fortress Classic had a party mode which could be activated by the server operator and gave all the characters party hats, changed grenades into gifts, and altered all the death announcements to fit the theme. Team Fortress 2 does the same thing, but sets it to automatically kick on to celebrate the week that the original game was released.\n• There's also a Halloween mode (that began in 2009), where taunts are often replaced with a dance move from the music video for Michael Jackson's \"Thriller\". Which is incredibly annoying if you're trying for a taunt-kill or one of the \"snapshot while taunting\" achievements.\n• Ah yes, the Halloween mode. From 2010 onwards, each Halloween they implemented a new Bonus Boss (or in 2013's case, a pseudo-gamemode involving the use of magic) and a backstory for it. These boss fights would take place on a Halloween-ified version of one of the maps. All players who defeat the boss (at any time) will get a cosmetic item that can be put on any class.\n• December has Australian Christmas (or Smissmas), where crates drop containing valuable loot that can be opened with specialized keys. In 2010 there was one variety that contained hats and miscs, where in 2011 they were separated into Naughty and Nice crates, the latter containing Christmas lights to decorate stock weapons with and the latter containing new aesthetic items. In 2012 onwards, the Naughty and Nice crates returned, this time the Naughty crates giving pre-decorated festive versions of several weapons. 2015's Tough Break Update (that took place during the month of December) gave you \"festivized\" weapon reskins (these work similar to the weapon reskins from Counter-Strike: Global Offensive). That's right: a reskin of a reskin.\n• Terraria:\n• In pre-1.2 versions on the PC, generating a new world during the Christmas season will have a chance to spawn you inside/near a Snow Biome. After the 1.2 Big Update, Snow Biomes spawn naturally in any new Worldgen. In addition, there is a special event during the season, the Frost Legion, that spawns a mob of killer Snowmen monsters, as well as the chance to invite a Santa Claus NPC to stay in your village. The 1.2.2 update added a special Christmas-themed event, the Frost Moon, triggered with a special item that can be crafted any time of year.\n• After the Big 1.2 Update, there was a supplementary Halloween Update that added Pumpkins, in-season Goodie Bags, and a graphical change during the holiday that causes Zombies, Slimes, Demon Eyes, and Rabbits in costume to spawn. A special Event, the Pumpkin Moon, was also added to the mix, as well as a whole parade of holiday costumes. Like the Frost Moon, the Pumpkin Moon can be triggered any time of year, not just around Halloween.\n• The Mobile edition gains several minor holidays with their own special items and, in the case of Easter and Thanksgiving, special bosses. These include: The Chinese New Year in January, Valentine's Day in February, St. Patrick's Day from March 5th to 31st, Easter throughout April, Oktoberfest from September 27th to Oktober 31st and Thanksgiving throughout November. Valentine's Day, Easter and Thanksgiving is also shared with the 3DS version. (The Wiesnbräu of Oktoberfest is present but not the rest of the items in the 3DS version and while the Guide mentions St. Patrick's Day, it also doesn't occur in the 3DS version).\n• Tiger Woods PGA Tour 2004 had \"Real Time Events\", challenges tied not just to a specific day but a specific date (such as December 8, 2003, the day of a full moon). Most of them rewarded the player with fairly generic equipment, but the Halloween and Thanksgiving events awarded special holiday-themed clothing.\n• Tsukihime has a small sketch if you play it around Christmas time involving some of the odder characters available. Its spin-off, Melty Blood, did this, too: the title screen features different artwork depending on when you play it, including Christmas Eve and Ren's birthday.\n• Twilight Heroes has special events for Halloween and real-world snow days. On the Ides of some months, the in-game theater is taken over by Julius Caesar jokes.\n• Tyrian prompts you if you want to play with Holiday Mode on when you start the game during the month of December or through the YESXMAS command-line parameter. Many sprite graphics are replaced and instead of a computer voice saying \"Good Luck\" at the start of a level, a different voice says \"Merry Christmas\".\n• In Wii Fit, the anthropomorphic Wii Balance Board that helps guide you through the game will offer special greetings on certain holidays, and also wish you a happy birthday.\n• World of Warcraft has several themed holidays, which usually deck out the major cities in decorations and add some limited time loot and quests.\n• In most of the You Don't Know Jack games, the voice that greets you as you start the game would have something special to say on holidays and various other occasions, including Elvis' birthday, the anniversary of the game's release, or if you were playing especially late at night. If you played a one player game on a weekend evening, it would criticize your lack of social life.\n• zOMG! celebrates quite a few major holidays, including Halloween, Christmas, Easter, and April Fool's Day. All of these events give you limited-edition loot and/or items for your avatar. Backpedaling a bit, zOMG!'s parent site Gaia Online goes into Holiday Mode for most major events, but especially for Halloween and Christmas. Halloween and Christmas feature header changes, NPC Costumes, special events (and on Halloween, the introduction of a new Race) zOMG events, and a reskin for Gaia Towns. (The normally decorative fountain becomes a Swimming Pool, Graveyard, or frozen pond depending on the time of year.) Gaians love to join in the fun, frequently going into Holiday Mode themselves.\n• In Zoo Tycoon you can purchase a Jack Lantern on Halloween, and a Snowman on Christmas (game time). The days in Zoo Tycoon last a few seconds, but you can place all the special ornaments you like if you pause the game in those specific days. Also, guests' clothing and buildings' decor will change color to orange and black on Halloween, and Santa's sleigh and a a witch on a broomstick will fly over in the appropriate dates.\n• The (unnamed) MMO played by The Guild had one such holiday as a plot point, where a real life gathering was planned to celebrate the end of the in-game festival season.\n• Google Doodles, which vary from holidays such as Christmas to the birth date of various famous people.\n• The free text editor EditPad produces special messages in the status bar on Christmas, New Year, and the programmer's birthday (February 16th).\n• Recent versions of the Lasertron laser tag system allow the operator to mark certain players as having a birthday. If any players are so marked, the computerized announcer will say \"Now activating birthday players!\" and that player's vest will actually wish them a happy birthday at the end of each game.\n• When logging into Microsoft Bob on your birthday, your animated host will wish you happy birthday, complete with a cake, balloons, and confetti appearing in the room.\n• Turn on a Nintendo DS on your birthday (which you can input into its memory) and you get a special activation jingle, as well as a birthday notification in PictoChat. Sadly, the DSi does not do this. Photos and videos made with the 3DS Camera on the set birthday will be put under a heading marked with a cake instead of the numerical date.\n• The old Sierra screensaver, \"Johnny Castaway\" often had special events occur on holidays like Christmas and Halloween.\n• The multimedia player/streamer/recorder VLC Media Player has a traffic cone as its tray icon. Around Christmas time, the traffic cone will be seen wearing a Santa hat.\n• If you boot up ZSNES on Christmas and have the snow effect on, you can see Santa's sleigh scrolling. Similarly, if you boot it up on April Fool's Day, you receive joke messages, such as:\n• Why are you playing games when you should be spending quality time with your family?\n• We are now reporting your gaming activities to Nintendo's central servers. Please wait a moment.\n• Bizhawk shows red/green static during Christmas and tunes it into a music tune.\n• iHeart Radio changes their icon to suit the current season, Frankenstein bolts at Halloween, Santa's hat at Christmas, etc.\n• Some Disney Theme Parks rides are changed during certain times of the year:\n• During September and October, Guardians of the Galaxy \u0096 Mission: BREAKOUT! changes to Guardians of the Galaxy — Monsters After Dark, an alternate storyline about Rocket and Groot attempting to escape from the facility when it loses power and its inhabitants are set free.\n• The Haunted Mansion is given an overlay based on The Nightmare Before Christmas during December.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/HolidayMode?from=Main.ChristmasMode", "media_links": ["/pmwiki/pmwiki.php/VideoGame/SonicRoboBlast2", "/pmwiki/pmwiki.php/VideoGame/AceOnline", "/pmwiki/pmwiki.php/VideoGame/AliceInTheMirrorsOfAlbion", "/pmwiki/pmwiki.php/VideoGame/AncientDomainsOfMystery", "/pmwiki/pmwiki.php/VideoGame/AnimalCrossing", "/pmwiki/pmwiki.php/VideoGame/ArtOfFighting", "/pmwiki/pmwiki.php/VideoGame/AVirusNamedTom", "/pmwiki/pmwiki.php/VideoGame/Awesomenauts", "/pmwiki/pmwiki.php/VideoGame/BatmanArkhamCity", "/pmwiki/pmwiki.php/VideoGame/BestFiends", "/pmwiki/pmwiki.php/VideoGame/BillyVsSNAKEMAN", "/pmwiki/pmwiki.php/VideoGame/BitTrip", "/pmwiki/pmwiki.php/VideoGame/BlackAndWhite", "/pmwiki/pmwiki.php/VideoGame/GunZ", "/pmwiki/pmwiki.php/VideoGame/CallOfDuty", "/pmwiki/pmwiki.php/VideoGame/ModernWarfare", "/pmwiki/pmwiki.php/VideoGame/CastawayParadise", "/pmwiki/pmwiki.php/VideoGame/CastlevaniaPortraitOfRuin", "/pmwiki/pmwiki.php/VideoGame/CaveStory", "/pmwiki/pmwiki.php/VideoGame/ChampionsOnline", "/pmwiki/pmwiki.php/VideoGame/NightsIntoDreams", "/pmwiki/pmwiki.php/VideoGame/SonicShuffle", "/pmwiki/pmwiki.php/VideoGame/CityOfHeroes", "/pmwiki/pmwiki.php/VideoGame/Civilization", "/pmwiki/pmwiki.php/Music/ElvisPresley", "/pmwiki/pmwiki.php/VideoGame/CookingMama", "/pmwiki/pmwiki.php/VideoGame/CookieClicker", "/pmwiki/pmwiki.php/VideoGame/Crusader", "/pmwiki/pmwiki.php/VideoGame/D2", "/pmwiki/pmwiki.php/VideoGame/DarkCastle", "/pmwiki/pmwiki.php/VideoGame/Darwinia", "/pmwiki/pmwiki.php/VideoGame/DCUniverseOnline", "/pmwiki/pmwiki.php/ComicBook/TheJoker", "/pmwiki/pmwiki.php/VideoGame/DEFCON", "/pmwiki/pmwiki.php/VideoGame/DemonsSouls", "/pmwiki/pmwiki.php/VideoGame/TheDenpaMen", "/pmwiki/pmwiki.php/VideoGame/DonkeyKongCountry3DixieKongsDoubleTrouble", "/pmwiki/pmwiki.php/VideoGame/Dota2", "/pmwiki/pmwiki.php/VideoGame/DragonQuestIX", "/pmwiki/pmwiki.php/VideoGame/DungeonCrawl", "/pmwiki/pmwiki.php/VideoGame/DungeonKeeper", "/pmwiki/pmwiki.php/VideoGame/FableHeroes", "/pmwiki/pmwiki.php/VideoGame/Fallout4", "/pmwiki/pmwiki.php/VideoGame/FalloutShelter", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyXI", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyXIV", "/pmwiki/pmwiki.php/VideoGame/FlightRising", "/pmwiki/pmwiki.php/VideoGame/Florensia", "/pmwiki/pmwiki.php/VideoGame/FlyFF", "/pmwiki/pmwiki.php/VideoGame/Fraxy", "/pmwiki/pmwiki.php/VideoGame/Gradius", "/pmwiki/pmwiki.php/VideoGame/GearsOfWar", "/pmwiki/pmwiki.php/VideoGame/GianaSistersDS", "/pmwiki/pmwiki.php/VideoGame/GrandTheftAutoV", "/pmwiki/pmwiki.php/VideoGame/GuildWars", "/pmwiki/pmwiki.php/VideoGame/HiddenCityHiddenObjectAdventure", "/pmwiki/pmwiki.php/VideoGame/Halo3", "/pmwiki/pmwiki.php/VideoGame/TheIncredibleMachine", "/pmwiki/pmwiki.php/VideoGame/JazzJackrabbit", "/pmwiki/pmwiki.php/VideoGame/KillingFloor", "/pmwiki/pmwiki.php/VideoGame/KingdomOfLoathing", "/pmwiki/pmwiki.php/WesternAnimation/TheNightmareBeforeChristmas", "/pmwiki/pmwiki.php/VideoGame/KirbySqueakSquad", "/pmwiki/pmwiki.php/VideoGame/TheLegendaryStarfy", "/pmwiki/pmwiki.php/VideoGame/LEGOLoco", "/pmwiki/pmwiki.php/VideoGame/LethalLeague", "/pmwiki/pmwiki.php/VideoGame/LexiCross", "/pmwiki/pmwiki.php/VideoGame/LittleBigPlanet", "/pmwiki/pmwiki.php/Creator/MediaMolecule", "/pmwiki/pmwiki.php/VideoGame/MaddenNFL", "/pmwiki/pmwiki.php/VideoGame/MagiciansQuestMysteriousTimes", "/pmwiki/pmwiki.php/VideoGame/MapleStory", "/pmwiki/pmwiki.php/Creator/AmbrosiaSoftware", "/pmwiki/pmwiki.php/VideoGame/MegaManZX", "/pmwiki/pmwiki.php/VideoGame/MetalGearSolid2", "/pmwiki/pmwiki.php/VideoGame/Minecraft", "/pmwiki/pmwiki.php/VideoGame/MonsterRancher", "/pmwiki/pmwiki.php/VideoGame/MotorMayhem", "/pmwiki/pmwiki.php/VideoGame/Munchers", "/pmwiki/pmwiki.php/VideoGame/MyLittlePony", "/pmwiki/pmwiki.php/VideoGame/NetHack", "/pmwiki/pmwiki.php/VideoGame/NexusWar", "/pmwiki/pmwiki.php/VideoGame/OneHundredPercentOrangeJuice", "/pmwiki/pmwiki.php/VideoGame/OperationFlashpoint", "/pmwiki/pmwiki.php/VideoGame/Overwatch", "/pmwiki/pmwiki.php/VideoGame/PAYDAYTheHeist", "/pmwiki/pmwiki.php/VideoGame/PerfectWorld", "/pmwiki/pmwiki.php/VideoGame/Planetside", "/pmwiki/pmwiki.php/VideoGame/PlantsVsZombies", "/pmwiki/pmwiki.php/Franchise/Pokemon", "/pmwiki/pmwiki.php/VideoGame/PokemonDiamondAndPearl", "/pmwiki/pmwiki.php/VideoGame/PokemonGoldAndSilver", "/pmwiki/pmwiki.php/VideoGame/PokemonGoldAndSilver", "/pmwiki/pmwiki.php/VideoGame/PokemonXAndY", "/pmwiki/pmwiki.php/VideoGame/PokemonRubyAndSapphire", "/pmwiki/pmwiki.php/VideoGame/PuyoPuyo", "/pmwiki/pmwiki.php/VideoGame/RaptorCallOfTheShadows", "/pmwiki/pmwiki.php/VideoGame/Rappelz", "/pmwiki/pmwiki.php/Franchise/RatchetAndClank", "/pmwiki/pmwiki.php/VideoGame/RiseOfTheTriad", "/pmwiki/pmwiki.php/VideoGame/Runescape", "/pmwiki/pmwiki.php/VideoGame/ScoobyDooNightOf100Frights", "/pmwiki/pmwiki.php/VideoGame/Shenmue", "/pmwiki/pmwiki.php/VideoGame/SidMeiersPirates", "/pmwiki/pmwiki.php/VideoGame/SimCity", "/pmwiki/pmwiki.php/VideoGame/TheSimpsonsHitAndRun", "/pmwiki/pmwiki.php/VideoGame/TheSimpsonsRoadRage", "/pmwiki/pmwiki.php/VideoGame/SonicAdventure", "/pmwiki/pmwiki.php/VideoGame/SonicRoboBlast2", "/pmwiki/pmwiki.php/VideoGame/SegaSuperstars", "/pmwiki/pmwiki.php/VideoGame/AlexKidd", "/pmwiki/pmwiki.php/VideoGame/SpiralKnights", "/pmwiki/pmwiki.php/VideoGame/Splatoon2", "/pmwiki/pmwiki.php/VideoGame/StarWarsGalaxies", "/pmwiki/pmwiki.php/Film/TheStarWarsHolidaySpecial", "/pmwiki/pmwiki.php/VideoGame/StarWarsTheOldRepublic", "/pmwiki/pmwiki.php/VideoGame/Stronghold", "/pmwiki/pmwiki.php/Franchise/Castlevania", "/pmwiki/pmwiki.php/VideoGame/SonicTheHedgehog", "/pmwiki/pmwiki.php/VideoGame/SuperPrincessPeach", "/pmwiki/pmwiki.php/VideoGame/SuperSmashBrosCrusade", "/pmwiki/pmwiki.php/VideoGame/SuperSmashFlash", "/pmwiki/pmwiki.php/VideoGame/TeamFortressClassic", "/pmwiki/pmwiki.php/VideoGame/TeamFortress2", "/pmwiki/pmwiki.php/Music/MichaelJackson", "/pmwiki/pmwiki.php/VideoGame/CounterStrike", "/pmwiki/pmwiki.php/VideoGame/Terraria", "/pmwiki/pmwiki.php/VisualNovel/Tsukihime", "/pmwiki/pmwiki.php/VideoGame/MeltyBlood", "/pmwiki/pmwiki.php/VideoGame/TwilightHeroes", "/pmwiki/pmwiki.php/Theatre/JuliusCaesar", "/pmwiki/pmwiki.php/VideoGame/Tyrian", "/pmwiki/pmwiki.php/VideoGame/WiiFit", "/pmwiki/pmwiki.php/VideoGame/WorldOfWarcraft", "/pmwiki/pmwiki.php/VideoGame/YouDontKnowJack", "/pmwiki/pmwiki.php/Website/GaiaOnline", "/pmwiki/pmwiki.php/Website/GaiaOnline", "/pmwiki/pmwiki.php/VideoGame/ZooTycoon", "/pmwiki/pmwiki.php/Creator/Sierra", "/pmwiki/pmwiki.php/Ride/DisneyThemeParks", "/pmwiki/pmwiki.php/Ride/GuardiansOfTheGalaxyMissionBreakout", "/pmwiki/pmwiki.php/Ride/TheHauntedMansion", "/pmwiki/pmwiki.php/WesternAnimation/TheNightmareBeforeChristmas"], "non_media_links": ["/pmwiki/pmwiki.php/Main/VideoGame", "/pmwiki/pmwiki.php/Main/EasterEgg", "/pmwiki/pmwiki.php/Main/RandomlyDrops", "/pmwiki/pmwiki.php/Main/HeartSymbol", "/pmwiki/pmwiki.php/Main/DesperationAttack", "/pmwiki/pmwiki.php/Main/Chiptune", "https://www.youtube.com/watch?v=9JCMHNhEUc0", "/pmwiki/pmwiki.php/Main/ArtifactOfDoom", "http://www.destructoid.com//ul/237705-cave-story-halloween-the-latest-on-aban-hawkins-more/CaveStory%20Halloween%20sprites-noscale.jpg", "/pmwiki/pmwiki.php/UsefulNotes/SegaSaturn", "/pmwiki/pmwiki.php/Main/UpdatedRerelease", "/pmwiki/pmwiki.php/Main/InnBetweenTheWorlds", "/pmwiki/pmwiki.php/Main/TheNightThatNeverEnds", "/pmwiki/pmwiki.php/Main/ArsonMurderAndJaywalking", "/pmwiki/pmwiki.php/Main/AprilFoolsDay", "/pmwiki/pmwiki.php/UsefulNotes/SegaDreamcast", "/pmwiki/pmwiki.php/Main/EasterEgg", "/pmwiki/pmwiki.php/Main/MoodWhiplash", "/pmwiki/pmwiki.php/Main/EndOfTheWorldAsWeKnowIt", "/pmwiki/pmwiki.php/Main/NintendoHard", "http://kotaku.com/5393483/demons-souls-gets-even-harder-for-halloween", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Main/RunningGag", "http://crawl.chaosforge.org/Antaeus", "/pmwiki/pmwiki.php/Main/GlobalCurrencyException", "/pmwiki/pmwiki.php/Main/AprilFoolsDay", "/pmwiki/pmwiki.php/UsefulNotes/SuperBowl", "/pmwiki/pmwiki.php/Main/YouMeanXmas", "/pmwiki/pmwiki.php/Main/FarEast", "/pmwiki/pmwiki.php/UsefulNotes/TalkLikeAPirateDay", "/pmwiki/pmwiki.php/Main/HappyHolidaysDress", "/pmwiki/pmwiki.php/Main/PrettyInMink", "http://kol.coldfront.net/thekolwiki/index.php/Kingdom_of_Loathing_Calendar", "/pmwiki/pmwiki.php/Main/Speedrun", "/pmwiki/pmwiki.php/Main/AchievementSystem", "/pmwiki/pmwiki.php/Main/CosmeticAward", "/pmwiki/pmwiki.php/Main/RelationshipValues", "/pmwiki/pmwiki.php/Main/AnyoneYouKnow", "/pmwiki/pmwiki.php/Main/LethalJokeCharacter", "/pmwiki/pmwiki.php/Main/VideoGameTime", "/pmwiki/pmwiki.php/Main/TakenForGranite", "/pmwiki/pmwiki.php/Main/OneHitKill", "/pmwiki/pmwiki.php/Main/GameBreaker", "/pmwiki/pmwiki.php/Main/EverythingTryingtoKillYou", "/pmwiki/pmwiki.php/Main/ShipTease", "/pmwiki/pmwiki.php/Main/SillinessSwitch", "/pmwiki/pmwiki.php/Main/SurpriseDifficulty", "/pmwiki/pmwiki.php/Main/DevelopersRoom", "/pmwiki/pmwiki.php/Main/OneHundredPercentCompletion", "/pmwiki/pmwiki.php/Main/FirstPersonShooter", "/pmwiki/pmwiki.php/Main/AntiChristmasCarol", "/pmwiki/pmwiki.php/Main/AndYourRewardIsClothes", "/pmwiki/pmwiki.php/Main/AndYourRewardIsClothes", "/pmwiki/pmwiki.php/Main/GrandFinale", "/pmwiki/pmwiki.php/Main/YouMeanXmas", "/pmwiki/pmwiki.php/Main/StopHavingFunGuys", "/pmwiki/pmwiki.php/Main/StopHavingFunGuys", "/pmwiki/pmwiki.php/Main/StopHavingFunGuys", "/pmwiki/pmwiki.php/Main/BonusBoss", "/pmwiki/pmwiki.php/Main/AndYourRewardIsClothes", "/pmwiki/pmwiki.php/Main/YouMeanXmas", "/pmwiki/pmwiki.php/Main/SantaClaus", "/pmwiki/pmwiki.php/Main/JokeCharacter", "/pmwiki/pmwiki.php/WebVideo/TheGuild", "/pmwiki/pmwiki.php/Wiki/ThisVeryWiki", "http://www.laser-tron.com/Laser_Tag_Manufacturer/Laser_Tag_Feature.htm", "/pmwiki/pmwiki.php/Main/YouBastard", "/pmwiki/pmwiki.php/Main/DrugsAreBad", "/pmwiki/pmwiki.php/Main/DigitalPiracyIsEvil", "/pmwiki/pmwiki.php/Main/HypocriticalHumor", "/pmwiki/pmwiki.php/Main/ParanoiaFuel"]}