{"title": "Dress Rehearsal Video", "content": "A specific type of Performance Video in which the band is playing, but there is no audience. The artist might be in a bar at closing time, or in an empty club/theater, or maybe they were On a Soundstage All Along. The kicker is that they have full lighting rigs, special effects like fog and lasers or Great Balls of Fire!, basically all the trappings of an actual concert. The absence of observers may be noted but is usually ignored.\n\nThis is perhaps the most pervasive concept in use. Almost all videos, especially rock videos, will use a Dress Rehearsal performance for band footage, interspersed with footage related to the video's overarching concept; but for some videos, this is the overarching concept.\n• Fozzy's song \"Judas\" consists mostly of a close-up of lead singer Chris Jericho's face, with the band playing in the background. Other characters wander in and out of shot from time to time, along with the band members (Jericho included) randomly speeding up or slowing down while still keeping time with the song.\n• Guns N' Roses: \"Paradise City\" - Zigzagged , in that the video starts this way, then builds on the band setting up and cuts between them performing with and without an audience. Lots of \"offstage\" shots that get the sense of a touring band round out the footage.\n• Whitesnake's \"Here I Go Again\", \"Ain't No Love in the Heart of the City\"\n• Almost all the videos from Queensrÿche's Operation: Mindcrime album feature, amongst the concept footage, the full stage set-up the band was using at the time, including wall-sized projection screens. It's especially notable when watching the videos back to back; they all seem to look the same.\n• Their clip for the song \"Breaking The Silence\" was a bona fide application of Dress Rehearsal, with no concept footage at all.\n• Especially common in the days before MTV, when many videos were actually Dress Rehearsals which were aired after the fact on musical concert shows like Britain's \"Top Of The Pops\":\n• Pink Floyd's Live at Pompeii takes this to extremes — it's a full concert movie (interspersed with interviews and behind-the-scenes footage in the special edition), only without any audience at all.\n• Korn's film \"The Encounter\" has them performing in a crop circle in the middle of a corn field. During the interview segments, they said that the aforementioned Pink Floyd - Live At Pompeii was the inspiration behind it.\n• Emerson, Lake & Palmer's Fanfare for the Common Man. Live performance in a stadium; three people surrounded by organs and keyboards, no audience, no effects, no crew, and seemingly in the middle of winter.\n• Many of Journey's early videos like \"Wheel In The Sky\" are of them on a soundstage.\n• Most of Billy Joel's videos from the Glass Houses record are of him and his band on a soundstage.\n• \"I'm Not Okay (I Promise)\" by My Chemical Romance has footage of a performance involving flashy lights, wind machines and tricksy camera angles... and turns out to be taking place in a garage.\n• Vertigo Venus played \"Everybody Down\" in an empty warehouse .\n• Queen, \"Bohemian Rhapsody\", \"You're My Best Friend\", \"Somebody to Love\", \"We Will Rock You\", \"Spread Your Wings\", \"Fat Bottomed Girls\", \"Don't Stop Me Now\", \"Crazy Little Thing Called Love\", \"Play the Game\", \"Another One Bites the Dust\", \"One Vision\", \"Princes of the Universe\", \"I Want It All\", \"The Miracle\", \"Headlong\", \"These Are the Days of Our Lives\", \"No-One But You\".\n• And emphatically not such Queen videos as \"Hammer to Fall\", as these employ footage of actual concert performances.\n• \"Friends Will Be Friends\", however, was filmed at a concert for the fan club (on a soundstage), so it could be either one.\n• Metallica filmed a back-up video for their first ever music video, \"One\", of them performing the song in an empty warehouse in the event that the mash-up version of the song (which incorporated a ten minute long abridged edit of the movie Johnny Got His Gun, whose novel served as the basis for the song \"One\") was banned by MTV. However, MTV greenlighted airing the mash-up video for \"One\", and the \"jamming\" version of the song was ultimately included on video with the mash-up version (as well as included on the Metallica music video DVD collection, as an extra).\n• The Foo Fighters have used this a few times.\n• \"All My Life\" is notable in that it is only confirmed to be a Dress Rehearsal Video at the end. They never show the crowd, but the video is made to assume the place will fill with time. It doesn't.\n• \"The Pretender\" is this to a T, just the band performing in an abandoned warehouse. Except they're just too awesome so the Culture Police show up. Then the wall explodes in red water.\n• Metric's \"Gimme Sympathy\" has a fun twist on this - the singer begins singing while in her dressing room putting on clothes, and then walks out onto an empty stage (with full lights and effects playing) and joins the band who has already started the song. Then whenever the camera focus on one bandmember, the others all swap places an instruments while off-camera.\n• Andrew W.K.'s \"Party Hard\" is mostly this trope, with a few intercuts to the strobe scenes that made it somewhat popular on the Internet to make/post sparsely animated (preferably flashing) GIF images with the words PARTY HARD located somewhere on it.\n• Bon Jovi's \"Livin on a Prayer\" has the first half of the video in black and white showing prep/rehearsal for a gig, the second half in colour showing the actual performance in front of the audience.\n• AFI's video for \"Medicate\" feature the band on a mostly empty stage and a full screen projection behind them. It also appears in black and white, except that gold colors are highlighted.\n• Limp Bizkit's video for \"My Way\" plays this trope a bit literally, with the concept of the video being that the wardrobe people want to try different costume ideas to see how it works. The video constantly cuts between the band as 50's lounge singers, Badass Bikers (Driving a Desk no less), and being cavemen. Played for Laughs.\n• The Agonist's Thank You, Pain can count as this.\n• Some parts of Blood on the Dance Floor's Bewitched and Believe.\n• The video for indie band The Shannon Lyon Pop Explosion's song \"Mods Rule\" was meant to look like a performance. The kicker is that the video was shot during the day in a local club, with about 30 of the band's friends pretending to be the \"audience.\" This allowed the band to repeat the song and re-set the cameras for various angles as many times as necessary to get the \"authentic\" feel of a performance.\n• R.E.M.'s \"Turn You Inside Out\" draws attention to the non-live nature of the performance, showing tech people and breaks, and at one point allowing Michael Stipe to turn the camera upside down.\n• Imagine Dragons' video for \"Gold\" just has the band performing against some fancy lighting effects.\n• Most of Nile's music videos have been this, such as \"Execration Text\" , and \"Sacrifice Unto Sebek\" .\n• Several music videos by the Swedish band Kent, for example the videos for \"Var är vi nu?\" and \"Mirage\".", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/DressRehearsalVideo", "media_links": ["/pmwiki/pmwiki.php/Music/BonJovi", "/pmwiki/pmwiki.php/Music/Fozzy", "/pmwiki/pmwiki.php/Music/GunsNRoses", "/pmwiki/pmwiki.php/Music/Kiss", "/pmwiki/pmwiki.php/Music/VanHalen", "/pmwiki/pmwiki.php/Music/Whitesnake", "/pmwiki/pmwiki.php/Music/Poison", "/pmwiki/pmwiki.php/Music/Queensryche", "/pmwiki/pmwiki.php/Music/OperationMindcrime", "/pmwiki/pmwiki.php/Music/Heart", "/pmwiki/pmwiki.php/Music/DefLeppard", "/pmwiki/pmwiki.php/Music/PinkFloyd", "/pmwiki/pmwiki.php/Music/Korn", "/pmwiki/pmwiki.php/Music/EmersonLakeAndPalmer", "/pmwiki/pmwiki.php/Music/Journey", "/pmwiki/pmwiki.php/Music/BillyJoel", "/pmwiki/pmwiki.php/Music/MyChemicalRomance", "/pmwiki/pmwiki.php/Music/Queen", "/pmwiki/pmwiki.php/Music/Metallica", "/pmwiki/pmwiki.php/Literature/JohnnyGotHisGun", "/pmwiki/pmwiki.php/Music/FooFighters", "/pmwiki/pmwiki.php/Music/Metric", "/pmwiki/pmwiki.php/Music/AndrewWK", "/pmwiki/pmwiki.php/Music/BonJovi", "/pmwiki/pmwiki.php/Music/AFI", "/pmwiki/pmwiki.php/Music/LimpBizkit", "/pmwiki/pmwiki.php/Music/LinkinPark", "/pmwiki/pmwiki.php/Music/TheAgonist", "/pmwiki/pmwiki.php/Music/BloodOnTheDanceFloor", "/pmwiki/pmwiki.php/Music/REM", "/pmwiki/pmwiki.php/Music/ImagineDragons", "/pmwiki/pmwiki.php/Music/Nile", "/pmwiki/pmwiki.php/Music/Kent"], "non_media_links": ["/pmwiki/pmwiki.php/Main/PerformanceVideo", "/pmwiki/pmwiki.php/Main/OnASoundstageAllAlong", "/pmwiki/pmwiki.php/Main/GreatBallsOfFire", "/pmwiki/pmwiki.php/Wrestling/ChrisJericho", "https://www.youtube.com/watch?v=oQQiZUJiPTc", "/pmwiki/pmwiki.php/Main/PerformanceVideo", "/pmwiki/pmwiki.php/Main/CulturePolice", "/pmwiki/pmwiki.php/Main/SurrealMusicVideo", "/pmwiki/pmwiki.php/Main/MemeticMutation", "/pmwiki/pmwiki.php/Main/BadassBiker", "/pmwiki/pmwiki.php/Main/DrivingADesk", "/pmwiki/pmwiki.php/Main/PlayedForLaughs", "https://www.youtube.com/watch?v=TBS6N1k4FsQ", "https://www.youtube.com/watch?v=44jRUTKDLYI", "https://www.youtube.com/watch?v=09dFfqdVDi0"]}