{"title": "Our Acts Are Different", "content": "Most modern theatrical pieces are written in two acts. There is one set point (sometimes at a Cliffhanger) at which the audience takes an Intermission, and when they come back, the action finishes.\n\nThis, however, is pretty much solely a modern convention; older plays generally had three or five acts (with some sort of climax before each intermission, in order to make audiences excited to return). Even after the two-act structure became more popular (around the Victorian period), three- and five-act plays were not uncommon, and continue to be written to this day.\n\nLikewise, there is also a tradition of shorter, one-act plays, in part dating from a time where a night at the theatre was meant to be an entire night at the theatre, so what would now be considered a full-length (or even rather long) play was often bookended with a couple shorter one-act plays, which the audience could skip if they wanted to arrive late or go home early.\n\nModern performances may change things about a bit, ignoring some of the gaps between acts, or finding a new point for an intermission nearer the half-way point, though how well these redivisions work depends on the director and the play in question. Also, sometimes, the word \"Act\" is used to replace the word \"Scene\" when a play has very few scenes, or each scene is extensive. Sometimes more than one of the above apply. It differs wildly.\n\nOh, yes, and some genres of theatre keep to older conventions: Operas generally have between three and five acts, though a few use the two-act structure. The Gilbert and Sullivan operas are probably the most important of these, given they're still very widely performed, and since their major role in the birth of the musical is probably the main reason musicals follow the two-act convention.\n\nNote: As said above, some productions can change things around a bit; generally, the plays listed below should be categorised based on how the author divided them up.\n\nOne-act plays are of two types: Short plays, generally meant to be played with a few other short plays to fill out an evening, and full-length plays which the author has specifically designed to be played without intermissions.\n• Trial by Jury, a one-act Gilbert and Sullivan opera, originally written to be performed before Offenbach's La Perichole, though, in the end, it proved more popular. Today, it is often performed before one of their shorter two-act pieces (it was first revived at the Savoy in 1884 with a revised version of The Sorcerer), or alongside one or more of the one-act operas Sullivan wrote with other librettists, Cox and Box and The Zoo.\n• Trouble in Tahiti by Leonard Bernstein, which was later incorporated into the second act of its full-length sequel, A Quiet Place.\n• American expressionist plays tended to be one-act dramas. Eugene O'Neill's The Hairy Ape, Elmer Rice's The Adding Machine and Sophie Treadwell's Machinal each presented 7-9 scenes without intermission. The Musical of Adding Machine is also in one act.\n• The Last Five Years\n• The Drowsy Chaperone is meant to be performed without an intermission, despite the Show Within a Show that it is about being a two-act musical. However, some productions do choose to add an intermission anyway, usually after the song \"Toledo Surprise\".\n• Follies was originally presented in one act because an intermission would probably make an awkward interruption in the action. The awkward interruption (after \"Too Many Mornings\") is now usual.\n• Pippin was originally written in one act, but most regional productions insert an intermission.\n• Assassins by Stephen Sondheim has no intermission, as it has no real plot.\n• The 25th Annual Putnam County Spelling Bee ...usually. Many productions add an intermission before \"Chip's Lament.\"\n• Cirque du Soleil tours are usually two act affairs (two-and-a-half hours with intermission), but their non-touring productions (the various Las Vegas shows, La Nouba, etc.) usually have runtimes of 90 to 105 minutes with no intermission. This allows for two performances a night/ten performances a week and doesn't try the patience of audiences who would also like to gamble, etc. When the tours Nouvelle Experience and Alegría were adapted for casinos, they lost their intermissions and at least one acrobatic setpiece in order to achieve a 90-minute runtime. In fact, editing \"legit\" shows has long been common practice in Las Vegas; The Phantom of the Opera, Avenue Q, Spamalot, and The Producers were all cut to 90-or-so minutes either when they opened or later in the run, dropping their intermissions among other things.\n• Road Show was originally written with an intermission after Mama dies and Wilson and Addison part ways acrimoniously, but finally became a one-act musical.\n• The 1970s revival of Candide, with a new book by Hugh Wheeler, compressed the action into one act. The \"Opera House Version\" expanded it back into two acts.\n• A View from the Bridge premiered in 1955 as a one-act drama, with many passages in verse. The definitive 1956 revision expanded the play slightly and added an intermission.\n• A Streetcar Named Desire has eleven scenes with no act breaks in the script. However, the original production featured two intermissions.\n• Native Son was adapted into a play in ten scenes with no designated intermission, even though the original novel has a three-part division.\n• J.B. by Archibald MacLeish was written to be performed without interruption, or with optional breaks after the Godmask/Satanmask exchanges that end scenes 2 and 7.\n\nPartially due to the addition of much more elaborate sets, the former standard of five-act plays gradually reduced to three acts. This formed its own long-standing convention until finally being largely replaced by two-act plays. Three-act musicals were fairly common until the 1920s, when multiple sets in each act started to become the rule. However, a three-act play generally doesn't have any good way to make do with only one intermission, and an extra half-hour intermission tends to draw out the performance time, which is probably one of the reasons they aren't as common any more.\n• The Importance of Being Earnest, Oscar Wilde's most famous play, is in three acts (though it was originally in four), with breaks usually taken between each.\n• The three-act Our Town usually follows the same format as Earnest, as does Thorton Wilder's other famous work The Skin of Our Teeth. However, The Matchmaker (which is based on an older play) is in four acts, and its much better-known adaptation, Hello, Dolly!, is in two.\n• Both Moises Kaufman's The Laramie Project and Gross Indecency are in three acts.\n• George Bernard Shaw's Arms and the Man is in three acts, but as the third is reasonably longer than either of the first two, the break usually comes after the second act.\n• The musical adaptation of Giant by Michael John LaChiusa and Sybille Pearson is one of very few musicals to be in three acts.\n• Most of Gilbert and Sullivan's operas use the basic two-act structure. Princess Ida does not, and since the second act is the longest one by a good bit, there's no good way to use a single intermission.\n• Gilbert and Sullivan tend to plot things so that each act begins relatively sedately (in order to bring the audience back in gently), then builds to a climax at the end (to excite the audience before the break). Since the first act is very short, it's hard to avoid a mood breaker through going directly from the high energy of the end of Act I to the calm academic scenes at the start of Act II.\n• Many Kaufman and Hart plays, including You Can't Take It with You and Once in a Lifetime.\n• \"Millenium Approaches\", the first part of Tony Kushner's Angels in America is divided into three acts, and as \"Millenium Approaches\" is three hours long, it's not unreasonable to assume most productions take an intermission after each act.\n• Of course, part II, \"Perestroika\", is divided into SEVEN acts, so whatever, Tony Kushner.\n• The play of The Odd Couple is written in three acts, mainly to facilitate a massive set change when Felix joins Oscar's household and cleans the place up.\n• Puccini's opera Madama Butterfly was originally supposed to be in two acts, with a long stage silence in the middle of the second act. (The Belasco play it was based on was in only one act, but was considerably shorter, starting at the point where the opera's second act begins.) After the premiere, many changes were made, including the division of the second act into two parts, with the curtain is lowered in between; the second part is sometimes billed as the third act.\n• Porgy and Bess is in three acts, though some productions have reduced it to two. The source play Porgy was in four acts, the middle two of which were simply put together.\n• Rosencrantz and Guildenstern Are Dead is written in three acts: traveling to Elsinore (though they arrive just before the end of the act), Elsinore itself (where most of the direct overlap with Hamlet lies), and the boat to England.\n• Anyone Can Whistle is a three-act musical, which doesn't make its action much more coherent.\n• The Most Happy Fella was one of the few three-act musicals produced in the 1950s.\n• Many stage versions of Cinderella are in three acts, with the second act taking place at the ball (which is also true of Die Fledermaus).\n• Most of Richard Wagner's operas are in three acts, though the acts tend to run rather long at times. Götterdämmerung also has a rather lengthy prologue which segues into the first act without intermission.\n• Hansel and Gretel is a three-act opera, with an option to omit the first intermission and segue to the prelude to the second act without interruption.\n• Street Scene is a typical three-act drama with no scene changes, adapted into a two-act opera by striking the second intermission.\n• No, No, Nanette, an adaptation of a three-act farce, has always been a three-act musical.\n• Giuseppe Verdi's Falstaff is a comic opera in three acts, with each act divided into two through-composed scenes of roughly equal length.\n\nWhile never a particularly standard number of acts except in 19th-century opera, authors have often found it convenient to divide up the standard three-act structure into four equal scenes, or have failed to find a real use for the fifth act in a five-act structure, and so have chosen a four-act play instead. Unless the acts are particularly long, modern performances generally give an intermission after Act II, basically treating it as a two-act play with each act having two fairly self-contained scenes.\n• The Crucible by Arthur Miller is in four acts. While it normally has an intermission after Act II, there is an additional (sometimes cut) scene, \"Act 2, Scene 2\", much shorter in length and only including Proctor and Abigail. When included, it often follows the intermission.\n• Lady Windermere's Fan is in four acts, with an intermission usually placed between Acts 2 and 3.\n• Anton Chekhov's The Seagull and The Three Sisters, both of which usually break after Act 2.\n• Chehov's major plays were all written in four acts of continuous action, with scene changes at the intermissions.\n• Eugene O'Neill's Long Day's Journey Into Night is four acts.\n• George Bernard Shaw's play Man and Superman (which has nothing to do with the DC Comics character) is an odd case. It consists of four acts, but the third act, \"Don Juan in Hell\", is essentially an entirely separate one-act play stuck in the middle of a standard three-act play. Performances of Man and Superman frequently skip it, and \"Don Juan in Hell\" is often performed as a play in its own right.\n• The Girl Of The Golden West was originally a four-act play. The operatic version removes the last act, which is really just a brief epilogue to an already-concluded story.\n• The Vagabond King is in four acts, being based on a four-act play. The second intermission is supposed to be longer than the others.\n• The Student Prince is a four-act operetta. The play it was based on, Old Heidelberg, had five acts; it's obvious that the scene change from Karlsberg to Heidelberg in the operetta's first act was originally the first act break.\n\nFrom Renaissance to Neoclassical this was the standard. Theatre at this time was based off of Aristotle's and Horace's works (as they were understood at the time) since Classical theatre was considered ideal. The five act structure was incredibly strict (especially in the Neoclassical period), it wasn't until Romanticism and Melodrama that this structure fell out of fashion. Few modern productions have a full-length intermission between every act (though they may give a couple minutes to stretch while the scenery is changed), although this wouldn't have been done at the time either. The older five act plays tend to be fairly long, and are often somewhat abridged in modern performances.\n\nNow might be a good time to discuss scenes: The modern convention, and also that used by a lot of older writers, is that a scene change is only marked when there's a change in location, or the time frame moves forwards a significant amount. However, particularly around 1700, during the period known as the Restoration, you get plays such as William Congreve's five-act The Way of the World, where each act takes place in a single location, but every time a character joins or leaves a conversation, a new scene is declared and numbered. This can be very, very confusing if you're used to the more standard model. This is referred to nowadays as \"French Scenes.\"\n\nAlso, Elizabethan theatre, including Shakespeare, Jonson, Dekker, Marlowe, and so on, used very little scenery, so they have a tendency to switch very rapidly between different locations, whereas more recent five act plays actually do have scenery, and thus have to keep the number of locations down, generally to five or less, though one or two acts might have multiple scenes placed in different sets.\n• William Shakespeare wrote his plays in five acts, as was the convention; most of them were probably meant to be performed straight through without ANY intermissions. The earliest printed editions tend to have clear act divisions; the scene divisions, however, are often the work of editors. Modern productions often choose a point (rarely more than one point) in the script to take an intermission break.\n• Some plays do have a more obvious five-act structure. For instance, in Henry V, each act is preceded by narration from the Chorus. It's also often suggested that plays written for the indoor Blackfriars theater, which Shakespeare's company used as a winter playhouse starting in 1608 and which catered to a more upscale audience than the Globe, had music at the act breaks.\n• George Bernard Shaw's Pygmalion is in five acts, each one a twenty-minute-or-so scene, although some productions include little vignettes in between. Intermission is usually taken after the third act.\n• \"Perestroika\", the second part of Tony Kushner's Angels in America, is in five acts. It is worth noting that, uncut, \"Perestroika\" is even longer than \"Millenium Approaches\", but it is virtually always cut down slightly, and Kushner wrote notes in the published script as to what could reasonably be cut.\n• All Neoclassical plays. Strict rules and regulations were put into place to mimic the ideal Greek/Roman theatre, including the five act structure that Aristotle outlined in his Poetics. Any work that did not fit these guidelines was considered to be a horrible play, even if it was wildly popular among play-goers (as was the case with Corneille's The Cid). These rules were not absolved in France until Hugo's Hernani and elsewhere until counter movements (like the German Romantic movement) began.\n\nMore Than Five Acts\n• Eugene O'Neill's Strange Interlude is in nine acts, and runs twice as long as most plays.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/OurActsAreDifferent", "media_links": ["/pmwiki/pmwiki.php/Creator/GilbertAndSullivan", "/pmwiki/pmwiki.php/Theatre/TrialByJury", "/pmwiki/pmwiki.php/Creator/GilbertAndSullivan", "/pmwiki/pmwiki.php/Theatre/TheSorcerer", "/pmwiki/pmwiki.php/Theatre/CoxAndBox", "/pmwiki/pmwiki.php/Music/LeonardBernstein", "/pmwiki/pmwiki.php/Theatre/ANewBrain", "/pmwiki/pmwiki.php/Theatre/Edmond", "/pmwiki/pmwiki.php/Theatre/ManOfLaMancha", "/pmwiki/pmwiki.php/Creator/EugeneONeill", "/pmwiki/pmwiki.php/Theatre/TheLastFiveYears", "/pmwiki/pmwiki.php/Theatre/TheDrowsyChaperone", "/pmwiki/pmwiki.php/Theatre/MasterHaroldAndTheBoys", "/pmwiki/pmwiki.php/Theatre/Follies", "/pmwiki/pmwiki.php/Theatre/AChorusLine", "/pmwiki/pmwiki.php/Theatre/Pippin", "/pmwiki/pmwiki.php/Theatre/Assassins", "/pmwiki/pmwiki.php/Music/StephenSondheim", "/pmwiki/pmwiki.php/Theatre/SeventeenSeventySix", "/pmwiki/pmwiki.php/Theatre/NoExit", "/pmwiki/pmwiki.php/Theatre/TheTwentyFifthAnnualPutnamCountySpellingBee", "/pmwiki/pmwiki.php/Creator/CirqueDuSoleil", "/pmwiki/pmwiki.php/Theatre/LaNouba", "/pmwiki/pmwiki.php/Theatre/NouvelleExperience", "/pmwiki/pmwiki.php/Theatre/Alegria", "/pmwiki/pmwiki.php/Theatre/ThePhantomOfTheOpera", "/pmwiki/pmwiki.php/Theatre/AvenueQ", "/pmwiki/pmwiki.php/Theatre/Spamalot", "/pmwiki/pmwiki.php/Film/TheProducers", "/pmwiki/pmwiki.php/Theatre/AmericanIdiot", "/pmwiki/pmwiki.php/Theatre/Candide", "/pmwiki/pmwiki.php/Theatre/AViewFromTheBridge", "/pmwiki/pmwiki.php/Theatre/AStreetcarNamedDesire", "/pmwiki/pmwiki.php/Literature/NativeSon", "/pmwiki/pmwiki.php/Theatre/JB", "/pmwiki/pmwiki.php/Theatre/TheImportanceOfBeingEarnest", "/pmwiki/pmwiki.php/Theatre/OurTown", "/pmwiki/pmwiki.php/Theatre/TheSkinOfOurTeeth", "/pmwiki/pmwiki.php/Theatre/TheMatchmaker", "/pmwiki/pmwiki.php/Theatre/HelloDolly", "/pmwiki/pmwiki.php/Theatre/TheLaramieProject", "/pmwiki/pmwiki.php/Creator/GeorgeBernardShaw", "/pmwiki/pmwiki.php/Theatre/ArmsAndTheMan", "/pmwiki/pmwiki.php/Film/Giant", "/pmwiki/pmwiki.php/Creator/GilbertAndSullivan", "/pmwiki/pmwiki.php/Theatre/PrincessIda", "/pmwiki/pmwiki.php/Theatre/YouCantTakeItWithYou", "/pmwiki/pmwiki.php/Theatre/OnceInALifetime", "/pmwiki/pmwiki.php/Theatre/AngelsInAmerica", "/pmwiki/pmwiki.php/Theatre/TheOddCouple", "/pmwiki/pmwiki.php/Theatre/MadamaButterfly", "/pmwiki/pmwiki.php/Theatre/PorgyAndBess", "/pmwiki/pmwiki.php/Theatre/RosencrantzAndGuildensternAreDead", "/pmwiki/pmwiki.php/Theatre/Hamlet", "/pmwiki/pmwiki.php/Theatre/AnyoneCanWhistle", "/pmwiki/pmwiki.php/Theatre/PeterPan1954", "/pmwiki/pmwiki.php/Theatre/TheMostHappyFella", "/pmwiki/pmwiki.php/Theatre/DieFledermaus", "/pmwiki/pmwiki.php/Music/RichardWagner", "/pmwiki/pmwiki.php/Theatre/TheRingOfTheNibelung", "/pmwiki/pmwiki.php/Theatre/HanselAndGretel", "/pmwiki/pmwiki.php/Theatre/StreetScene", "/pmwiki/pmwiki.php/Music/GiuseppeVerdi", "/pmwiki/pmwiki.php/Theatre/TheMerryWivesOfWindsor", "/pmwiki/pmwiki.php/Theatre/TheCrucible", "/pmwiki/pmwiki.php/Theatre/LadyWindermeresFan", "/pmwiki/pmwiki.php/Theatre/TheSeagull", "/pmwiki/pmwiki.php/Theatre/LongDaysJourneyIntoNight", "/pmwiki/pmwiki.php/Creator/GeorgeBernardShaw", "/pmwiki/pmwiki.php/Theatre/TheGirlOfTheGoldenWest", "/pmwiki/pmwiki.php/Creator/WilliamShakespeare", "/pmwiki/pmwiki.php/Theatre/HenryV", "/pmwiki/pmwiki.php/Creator/GeorgeBernardShaw", "/pmwiki/pmwiki.php/Theatre/Pygmalion", "/pmwiki/pmwiki.php/Theatre/AngelsInAmerica", "/pmwiki/pmwiki.php/Theatre/StrangeInterlude"], "non_media_links": ["/pmwiki/pmwiki.php/Main/Cliffhanger", "/pmwiki/pmwiki.php/Main/Intermission", "/pmwiki/pmwiki.php/Main/ActBreak", "/pmwiki/pmwiki.php/Main/TwoActStructure", "/pmwiki/pmwiki.php/Main/TheMusical", "/pmwiki/pmwiki.php/Main/ShowWithinAShow", "/pmwiki/pmwiki.php/Main/ExecutiveMeddling", "/pmwiki/pmwiki.php/Main/AdaptationDisplacement", "/pmwiki/pmwiki.php/Main/SmallReferencePools", "/pmwiki/pmwiki.php/Main/SubvertedTrope"]}