{"title": "Science Is Useless", "content": "In a competition of science and technology versus simple hard work, science and technology will almost invariably lose. Since science usually finds an easier, faster way to achieve something, it is therefore \"cheating\" and far less honorable than honest sweat and effort. Thus, no matter how much a scientist researches, experiments and innovates, he will never achieve what someone else can with good old practice and hard work.\n\nThis trope arises because of two main reasons:\n• Hardly anyone in the audience knows much about Real Life science, and\n• People are always eager to believe that anything they don't understand couldn't possibly be important.\n\nIf there's any fair justification for this, it's when the scientist is operating only on booksmarts and theory, or using an untested prototype, and thus lacks the experience necessary to win. Perhaps after lessons learned the first time, a series of rematches would actually go in the scientist's favour from then on. Because of the attitude behind this trope, this rarely happens. The scientists concede defeat to the \"superior\" people who have bested them and disappear from the story for good, unless their wounded pride convinces them to later return as a villain.\n\nThis is not the quite the opposite of Hard Work Hardly Works, because The Gift beats both hard work and science, and science may actually be given a fair shake by being represented as the hard work it is. But for hard-workers, science is the lowest spot on the tropic totem pole.\n\nNote that this trope applies equally to scientific or technological methods that are explicitly cheating or explicitly allowed. It doesn't matter if the \"scientific\" competitor is illegally using steroids, or legitimately pitting man against machine as the whole point of the competition.\n\nWhenever this trope shows up, the ideological basis for the conflict is usually Romanticism Versus Enlightenment, with the Romanticist good guys taking on the Enlightened scientists.\n\nFurther, there are two different flavors of this trope. If the point is to stress the importance of hard work, then the technological/scientific opponent is presented as an intimidating Goliath that the plucky underdog must struggle to overcome. This can be done fairly enough - after all, hard work IS very important.\n\nBut if the point is, instead, to deride technology or science as unworthy of human effort and manly men, the opponent is presented as a total joke and the hard worker wins easily. In this version, science is little more than a strawman, forgetting that science is hard work, requiring considerable intelligence as well as lengthy and difficult procedures to create anything useful. Not to mention all of the dirty, unglamorous, dangerous, and sometimes gross field work involved. See also Linear Warriors, Quadratic Wizards for a comparison between hard work (warrior) and science (wizard): yes physical hard work works for you personally, but in the end science (with a lot of educative hard work) makes Human Civilization achieve incomprehensible feats such as dropping nukes on your head. Yet rarely if ever is the hard work of the science-user shown on screen, making them seem like arrogant know-it-alls who may have read a book or two, but never got their hands dirty.\n\nRelated to Magic Versus Science. May involve Squishy Scientist, Dumb Is Good, and Rock Beats Laser. May be related to Reed Richards Is Useless. See also the physical equivalents Technician vs. Performer (where The Gift overcomes intense training) and Good Old Fisticuffs (where simple fists beats flashy kicks). Often the logical result of Science Cannot Comprehend Phlebotinum or even Science Is Wrong.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/ScienceIsUseless", "media_links": ["/pmwiki/pmwiki.php/Music/JohnnyCash", "/pmwiki/pmwiki.php/Anime/CrushGearTurbo", "/pmwiki/pmwiki.php/Manga/Eyeshield21", "/pmwiki/pmwiki.php/Manga/HunterXHunter", "/pmwiki/pmwiki.php/Anime/Pokemon", "/pmwiki/pmwiki.php/WesternAnimation/RobotechTheShadowChronicles", "/pmwiki/pmwiki.php/Manga/YakitateJapan", "/pmwiki/pmwiki.php/Film/RockyIV", "/pmwiki/pmwiki.php/Film/ShaolinSoccer", "/pmwiki/pmwiki.php/Film/Soldier", "/pmwiki/pmwiki.php/Creator/KurtRussell", "/pmwiki/pmwiki.php/Film/Twister", "/pmwiki/pmwiki.php/Literature/LeftBehind", "/pmwiki/pmwiki.php/WesternAnimation/JackieChanAdventures", "/pmwiki/pmwiki.php/WesternAnimation/PaulBunyan"], "non_media_links": ["/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/Main/DumbIsGood", "/pmwiki/pmwiki.php/Main/MotiveDecay", "/pmwiki/pmwiki.php/Main/HardWorkHardlyWorks", "/pmwiki/pmwiki.php/Main/TheGift", "/pmwiki/pmwiki.php/Main/RomanticismVersusEnlightenment", "/pmwiki/pmwiki.php/Main/DavidVersusGoliath", "/pmwiki/pmwiki.php/Main/SomeAnvilsNeedToBeDropped", "/pmwiki/pmwiki.php/Main/ScienceIsBad", "/pmwiki/pmwiki.php/Main/Squick", "/pmwiki/pmwiki.php/Main/LinearWarriorsQuadraticWizards", "/pmwiki/pmwiki.php/Main/CurbStompBattle", "/pmwiki/pmwiki.php/Main/InsufferableGenius", "/pmwiki/pmwiki.php/Main/MagicVersusScience", "/pmwiki/pmwiki.php/Main/SquishyWizard", "/pmwiki/pmwiki.php/Main/DumbIsGood", "/pmwiki/pmwiki.php/Main/RockBeatsLaser", "/pmwiki/pmwiki.php/Main/ReedRichardsIsUseless", "/pmwiki/pmwiki.php/Main/TechnicianVersusPerformer", "/pmwiki/pmwiki.php/Main/TheGift", "/pmwiki/pmwiki.php/Main/GoodOldFisticuffs", "/pmwiki/pmwiki.php/Main/ScienceCannotComprehendPhlebotinum", "/pmwiki/pmwiki.php/Main/ScienceIsWrong", "/pmwiki/pmwiki.php/Main/TrainingFromHell", "/pmwiki/pmwiki.php/Main/SuperiorLifeForm", "/pmwiki/pmwiki.php/Main/ReadingsAreOffTheScale", "/pmwiki/pmwiki.php/Main/InsufferableGenius", "/pmwiki/pmwiki.php/Main/GeniusDitz", "/pmwiki/pmwiki.php/Main/ScienceMarchesOn", "/pmwiki/pmwiki.php/Main/ChekhovsGun", "/pmwiki/pmwiki.php/Main/GeneralRipper", "/pmwiki/pmwiki.php/Main/TheRival", "/pmwiki/pmwiki.php/Main/OlderThanRadio", "/pmwiki/pmwiki.php/Main/MarkOfTheBeast", "/pmwiki/pmwiki.php/Main/TheMenInBlack", "/pmwiki/pmwiki.php/Main/WrongGenreSavvy", "/pmwiki/pmwiki.php/Main/OutsideGenreFoe", "/pmwiki/pmwiki.php/Main/UrbanFantasy", "/pmwiki/pmwiki.php/Main/MagicVersusScience", "/pmwiki/pmwiki.php/Main/RedshirtArmy", "/pmwiki/pmwiki.php/Main/WitchDoctor", "/pmwiki/pmwiki.php/Main/TakesOneToKillOne", "/pmwiki/pmwiki.php/Main/ScienceMarchesOn"]}