{"title": "Tag Team", "content": "Derived from a common professional wrestling gimmick match, a tag team is a group of characters that take turns fighting, usually one-on-one. A common rule is that, in order to switch, the character must leave the stage and \"tag\" their partner so they can hop in.\n\nIn Video Games, this typically means a group of characters that the player switches control between. Whether or not the characters have separate HP meters is an important consideration — sometimes the HP meters are shared, and other times they are distinct. A Switch-Out Move may be present, as might a Combination Attack. Mostly seen in Fighting Games when the player controls two or three characters and change them between fights or during them, as well using one of teammates as an Assist Character during the fight.\n\nTag Team Twins and Ricky Morton are sub tropes. Compare Swiss Army Hero, where one character has multiple forms they can switch between.\n\nNot to be confused with the 1990's rap group who wrote \"(Whoomp!) There It Is\" and \"Pig Power In the House.\"\n• Tag-team matches occur frequently in Kinnikuman, most commonly in the American Tour and Dream Tag Tournament arcs.\n• In Sword Art Online, monsters only aggro on one player at a time. As such, players in parties take turns attacking a monster and \"Switch\" with teammates to recover, taking turns until the battle is concluded.\n• In Yu-Gi-Oh!, one of the most popular and powerful card archetypes of their time were the Gladiator Beasts, each of which have the ability to swap themselves out on the field for another one after they've battled that turn. This allows the user of such a deck to have enormous, previously unheard-of flexibility. The ability of the Gladiator Beasts is unanimously called \"Tagging Out\" by the fans.\n• One of the Cars shorts, \"Mater's Tall Tales,\" involves Mater spinning a yarn about once being a monster truck wrestler. When McQueen interrupts him, he merely brushes it aside with a \"Don't you remember nuthin? We was a tag team!\"\n• Top Secret!. A Resistance fighter is battling a Nazi soldier in a tag team match inside a wrestling ring (don't ask). The fighter gets in trouble and tags his comrade outside the ring, who then enters and takes out the Nazi.\n• The Gamers: Done as a parody, because the male player switches between his testosterone guided \"sorceress\" into the actual attractive female actress for his character.\n• At the end of Toy Story 3, two of the toys are shown tagging out of the little kids' play area.\n• Owen's Velociraptor pack from Jurassic World fight the Indominus Rex head-on while Owen stands a bit away from them, shooting at the behemoth. The second part of the final battle has Blue and Rexy the Tyrannosaurus rex fighting the I. Rex, Blue often jumping from Rexy's back to launch herself at their foe .\n• In Yu-Gi-Oh! East Academy, Caramon and Peter are part of a two-on-one duel against the Constellar cultist.\n• Denero and Marcus do this in order to face\n• Both the Penultimate duel and the Grand Finale have all of the duelists teaming up against Haine and Apophis respectively.\n• Power Instinct is probably the Trope Maker for Fighting Games, first with Gogetsuji Legends in 1995 (a year before X-Men vs. Street Fighter) and Groove On Fight in 1997.\n• Donkey Kong Country: This is how the player switches between Kongs in all games; two-player co-op specifically assigns one player to each respective Kong.\n• Mortal Kombat\n• Mortal Kombat: Deception does this with Noob-Smoke, who share the same life bar.\n• Every Marvel vs. Capcom game, starting from X-Men vs. Street Fighter all the way up to Marvel vs. Capcom: Infinite. Same goes for the SNK vs. Capcom fighting games (barring SVC Chaos), Tatsunoko vs. Capcom and Street Fighter X Tekken.\n• The Naruto: Clash of Ninja fighting games feature \"Two-Man Squad\" battles where each side fights in a tag-team manner, with the characters on standby regenerating their lost chakra and (some of their) lost HP. Story-based missions which require a particular finishing move means We Cannot Go On Without You if that character is knocked out.\n• Naruto Shippuden: Ultimate Ninja Storm 4 is first of the Storm franchise to implement this, replacing the Assist mechanic with 3-men squads similar to the above Marvel vs. Capcom series.\n• In Paper Mario and Paper Mario: The Thousand-Year Door, the player could switch Mario's partner at any time, but doing so typically required one turn.\n• In regular Pokémon battles you can have a team of up to six Pokémon but only one Pokémon is present in battle at a time; switching Pokemon requires a full turn (allowing the opponent a free strike). Later generations introduce a small number of two-on-two and three-on-three battles to mix things up.\n• The fifth generation also introduces \"rotational \" battles, three-on-three battles where only one Pokémon on each team can participate at a time, but switching between them is a free action.\n• Skullgirls, much in the same way that it works in Marvel vs. Capcom.\n• Soul series:\n• Soulcalibur II has a Team Battle mode where you fight with multiple characters, but you only switch when your current fighter is defeated.\n• Certain single-player battles in the Story and Tower of Lost Souls modes of Soulcalibur IV utilize what is known as \"Active Matching Battle\" (AMB). Players control a team of 2-3 fighters (pit against a CPU team of 2-4 fighters) and can switch to the next character on standby, even mid-combo, so long as at least one node in a three-tier gauge is available. When one combatant is defeated, the succeeding character in the lineup will simply run in to continue the battle (unless they're considered important enough to toggle a round intro beforehand).\n• The F2P spin-off game Lost Swords uses a Partner system similar to the above AMB, with the player being able to choose their \"second\" character from a list of allies prior to each mission. In battle, the Partner Gauge would slowly fill up over time and once it reached maximum capacity, the player could then switch out to their ally and control them until the gauge emptied, with any damage taken during that time only expediting the rate at which the Partner Gauge decreased.\n• Super Smash Bros.:\n• The Pokémon Trainer in Super Smash Bros. Brawl doesn't do all the fighting himself, but can switch between each of his three Pokemon during combat, including Squirtle, Ivysaur, and Charizard (in that order). However, all three of the trainer's Pokemon share the same damage meter, meaning that switching Pokémon doesn't change the meter's damage percentage.\n• Captain Olimar of Pikmin fame can utilize his army of Pikmin for various attacks, much like in his own game franchise, but his Pikmin are still at risk of dying. Thankfully, though, Olimar can just pluck new Pikmin any time the player controlling him pressed B to do so. The last used one will usually go to the back of the \"line\" so another can be used.\n• While Zelda and Shiek are actually the same character (up until the fourth game, at least), they can still be switched between during each match to access one of two different ability sets. Despite their lightweight, Zelda's magic possesses more damage capacity, while Sheik's physical attacks are much faster and combo-friendly.\n• Tekken Tag Tournament and Tekken Tag Tournament 2 have this as the basis of the game.\n• Viewtiful Joe 2: Joe and Silvia share the same HP meter and have to physically tag in and out. Holding down the tag button results in a damaging Combination Attack, which grows more powerful depending on the length of their VFX Gauge and the duration of their charge.\n• In Kizuna Encounter: Super Tag Battle, both characters have separate HP meters, and the round ends when one is depleted, no matter how much HP the partner has left.\n• Dead or Alive, starting from the second game, has a Tag Mode.\n• Some entries in The King of Fighters series have modes where characters can be swapped in and out of battle. 2003 and XI implement a Multi-Shift system in the vein of the Marvel vs. Capcom games as the default form of battle.\n• In the Warriors Orochi series, you form a team of three fighters, and while each of them has their own life meter, the game is over if any one of them is defeated by the enemy.\n• \"Dramatic Change\" mode in the Wii version of Castle of Shikigami III. One player controls two characters who share a life meter but can be switched in and out at any time.\n• Added to the Sengoku Basara series in the Expansion Pack of the third game. Rather than having a bodyguard, the player can bring in another playable character who they can swap with.\n• Starting from Mega Man X7, the Mega Man X series uses what is known as the \"Dual Hero\" system, allowing you to bring 2 characters (of three — and later, six — available ones) into a stage, with each character having separate health bars. Their different abilities lets them tackle different parts of the stages easier. Mega Man X8 would greatly expand upon the mechanic: Players can call upon their partner to free them with a Tag Assist/Rescue Change when trapped by certain enemy attacks and once the Attack Gauge is full, they can perform a Double Attack that demolishes everything on screen and does heavy damage to bosses/mini-bosses. Additionally, when a character takes critical damage (even from spikes with the right equipment), they'll immediately switch out to their partner and slowly recover a set portion of their health. However, the player will be unable to use them again until the Attack Gauge is refilled.\n• Maribato! is a Fighting Game featuring the characters from Maria-sama ga Miteru as playables: You can pick a team of two soeurs, and go all-out against another team of two. In a similar fashion to the Marvel vs. Capcom series, you can switch characters in the midst of battle.\n• Dragon Ball FighterZ features a tag system evocative of Marvel vs. Capcom 2 and Marvel vs. Capcom 3, with a squad of three characters.\n• Touhou Hyouibana ~ Antinomy of Common Flowers goes to unusual lengths to justify why this mechanic is present when it wasn't in previous Fighting Games in the Touhou series. The plot revolves around a technique called Perfect Possession, wherein a \"master\" invites a \"slave\" into their body and can transform into them to use their powers. In mechanical terms the team has a single life bar, and the \"slave\" character can only remain out temporarily but also has Regenerating Health (capped at the amount they had when they were summoned).\n• Blazblue Cross Tag Battle features a 2v2 system where characters can switch each other out, use their partner to call in one of multiple assist attacks on command, or use powerful Combination Attacks. Players can also drain their entire Tag Gauge to use the second character for unlimited assists one after another for a period, in the manner of a Puppet Fighter. The game will feature an original episodic story, with one plotline for each of the four featured franchises (Blazblue, Persona 4, Under Night In-Birth and RWBY), which revolves around the characters being whisked away into another dimension by a mysterious cosmic entity, with a single spoken instruction: the side that gathers the \"Keystones\" gets to return home.\n• Power Rangers: Battle for the Grid uses a three-character tag system like Marvel vs. Capcom 2/3 and Dragon Ball FighterZ.\n• When Ménage à 3 dips into the world of professional wrestling, it features at least two tag teams — \"Roxxy and Moxxy\" (Roxie and Brandy) and \"The Tempests\" (Maura and Tess).\n• The Simpsons go to Japan and attend a Sumo wrestling match; Homer gets in a scuffle with one of the sumo wrestlers, then Bart tags in and uses a folding chair on the sumo wrestler.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/TAGTEAM", "media_links": ["/pmwiki/pmwiki.php/Film/Gordy", "/pmwiki/pmwiki.php/Manga/Kinnikuman", "/pmwiki/pmwiki.php/Anime/SwordArtOnline", "/pmwiki/pmwiki.php/TabletopGame/YuGiOh", "/pmwiki/pmwiki.php/WesternAnimation/Cars", "/pmwiki/pmwiki.php/Film/TopSecret", "/pmwiki/pmwiki.php/Film/TheGamers", "/pmwiki/pmwiki.php/WesternAnimation/ToyStory3", "/pmwiki/pmwiki.php/Film/JurassicWorld", "/pmwiki/pmwiki.php/VideoGame/PowerInstinct", "/pmwiki/pmwiki.php/VideoGame/XMenVsStreetFighter", "/pmwiki/pmwiki.php/VideoGame/DonkeyKongCountry", "/pmwiki/pmwiki.php/Franchise/MortalKombat", "/pmwiki/pmwiki.php/VideoGame/MortalKombatDeception", "/pmwiki/pmwiki.php/VideoGame/MortalKombat9", "/pmwiki/pmwiki.php/VideoGame/MarvelVsCapcom", "/pmwiki/pmwiki.php/VideoGame/XMenVsStreetFighter", "/pmwiki/pmwiki.php/VideoGame/MarvelVsCapcomInfinite", "/pmwiki/pmwiki.php/VideoGame/SNKVsCapcom", "/pmwiki/pmwiki.php/VideoGame/TatsunokoVsCapcom", "/pmwiki/pmwiki.php/VideoGame/StreetFighterXTekken", "/pmwiki/pmwiki.php/VideoGame/NarutoClashOfNinja", "/pmwiki/pmwiki.php/VideoGame/NarutoShippudenUltimateNinjaStorm4", "/pmwiki/pmwiki.php/VideoGame/MarvelVsCapcom", "/pmwiki/pmwiki.php/VideoGame/PaperMario", "/pmwiki/pmwiki.php/VideoGame/PaperMarioTheThousandYearDoor", "/pmwiki/pmwiki.php/Franchise/Pokemon", "/pmwiki/pmwiki.php/VideoGame/Skullgirls", "/pmwiki/pmwiki.php/VideoGame/MarvelVsCapcom", "/pmwiki/pmwiki.php/VideoGame/SoulSeries", "/pmwiki/pmwiki.php/VideoGame/SuperSmashBros", "/pmwiki/pmwiki.php/VideoGame/Pikmin", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaOcarinaOfTime", "/pmwiki/pmwiki.php/VideoGame/Tekken", "/pmwiki/pmwiki.php/VideoGame/ViewtifulJoe", "/pmwiki/pmwiki.php/VideoGame/FuunSeries", "/pmwiki/pmwiki.php/VideoGame/DeadOrAlive", "/pmwiki/pmwiki.php/VideoGame/TheKingOfFighters", "/pmwiki/pmwiki.php/VideoGame/MarvelVsCapcom", "/pmwiki/pmwiki.php/VideoGame/WarriorsOrochi", "/pmwiki/pmwiki.php/VideoGame/CastleOfShikigami", "/pmwiki/pmwiki.php/VideoGame/SengokuBasara", "/pmwiki/pmwiki.php/VideoGame/MegaManX7", "/pmwiki/pmwiki.php/VideoGame/MegaManX", "/pmwiki/pmwiki.php/VideoGame/MegaManX8", "/pmwiki/pmwiki.php/VideoGame/MegaManX8", "/pmwiki/pmwiki.php/VideoGame/Maribato", "/pmwiki/pmwiki.php/LightNovel/MariaSamaGaMiteru", "/pmwiki/pmwiki.php/VideoGame/MarvelVsCapcom", "/pmwiki/pmwiki.php/VideoGame/DragonBallFighterZ", "/pmwiki/pmwiki.php/VideoGame/Touhou", "/pmwiki/pmwiki.php/VideoGame/BlazblueCrossTagBattle", "/pmwiki/pmwiki.php/Franchise/Blazblue", "/pmwiki/pmwiki.php/VideoGame/Persona4", "/pmwiki/pmwiki.php/VideoGame/UnderNightInBirth", "/pmwiki/pmwiki.php/VideoGame/PowerRangersBattleForTheGrid", "/pmwiki/pmwiki.php/Webcomic/MenageA3", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons"], "non_media_links": ["/pmwiki/pmwiki.php/Main/TropeMaker", "/pmwiki/pmwiki.php/Main/ProfessionalWrestling", "/pmwiki/pmwiki.php/Main/GimmickMatches", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/SwitchOutMove", "/pmwiki/pmwiki.php/Main/CombinationAttack", "/pmwiki/pmwiki.php/Main/FightingGame", "/pmwiki/pmwiki.php/Main/AssistCharacter", "/pmwiki/pmwiki.php/Main/TagTeamTwins", "/pmwiki/pmwiki.php/Main/RickyMorton", "/pmwiki/pmwiki.php/Main/SubTrope", "/pmwiki/pmwiki.php/Main/SwissArmyHero", "/pmwiki/pmwiki.php/TagTeam/ProfessionalWrestling", "/pmwiki/pmwiki.php/Main/Anime", "/pmwiki/pmwiki.php/Main/Manga", "/pmwiki/pmwiki.php/Main/CardGames", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/LampshadeHanging", "/pmwiki/pmwiki.php/Main/AllMenArePerverts", "/pmwiki/pmwiki.php/Main/TyrannosaurusRex", "/pmwiki/pmwiki.php/Roleplay/YuGiOhEastAcademy", "/pmwiki/pmwiki.php/Main/RivalsTeamUp", "/pmwiki/pmwiki.php/Main/GrandFinale", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/TropeMaker", "/pmwiki/pmwiki.php/Main/FightingGame", "/pmwiki/pmwiki.php/Main/UpdatedRerelease", "/pmwiki/pmwiki.php/Main/DistantFinale", "/pmwiki/pmwiki.php/Videogame/SNKVsCapcomSVCChaos", "/pmwiki/pmwiki.php/Main/WeCannotGoOnWithoutYou", "/pmwiki/pmwiki.php/Main/AssistCharacter", "http://bulbapedia.bulbagarden.net/wiki/Rotational_battle", "/pmwiki/pmwiki.php/Main/SetSwordsToStun", "/pmwiki/pmwiki.php/Main/MyRulesAreNotYourRules", "/pmwiki/pmwiki.php/Main/DecompositeCharacter", "/pmwiki/pmwiki.php/Main/CombinationAttack", "/pmwiki/pmwiki.php/Main/EvolvingAttack", "/pmwiki/pmwiki.php/UsefulNotes/Wii", "/pmwiki/pmwiki.php/Main/ExpansionPack", "/pmwiki/pmwiki.php/Main/DivergentCharacterEvolution", "/pmwiki/pmwiki.php/Main/CombinationAttack", "/pmwiki/pmwiki.php/Main/OneHitKill", "/pmwiki/pmwiki.php/Main/FightingGame", "/pmwiki/pmwiki.php/Main/GameplayAndStoryIntegration", "/pmwiki/pmwiki.php/Main/FightingGame", "/pmwiki/pmwiki.php/Main/PowersViaPossession", "/pmwiki/pmwiki.php/Main/RegeneratingHealth", "/pmwiki/pmwiki.php/Main/CombinationAttack", "/pmwiki/pmwiki.php/Main/PuppetFighter", "/pmwiki/pmwiki.php/WebAnimation/RWBY", "/pmwiki/pmwiki.php/Main/Webcomics", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/ChairmanOfTheBrawl"]}