{"title": "Timber!", "content": "A Stock Phrase used after a tree, or a tall object, is felled. Common in cartoons where the tree falls on a character or causes considerable damage to something, or both.\n\nAnother gag is to have characters wonder who this Tim(othy) Ber person is, and why everybody's calling for him.\n• In a dubbed version of Digimon Adventure 02, one of Digmon's one liners when knocking down a Control Spire was \"Sorry, I forgot to 'Timber'!\".\n• Happens in a Teen Titans comic where Mammoth is knocked out. For a few moments, he just stands there looking dazed but then he starts to fall (landing on Gizmo). Changeling calls out \"Timber!\" as he falls.\n• Often used in a Canada, Eh? setting, as in Daltons in the Blizzard: the Daltons are wandering through the forest, when suddenly they hear \"Timber!\" and huddle around trying to understand what it means. One gets as far as \"I think it's something lumberjacks yell whenever they're cutting down a-\" before being interrupted by the tree nearly falling on them.\n• Breakfast at Tiffany's: Holly shouts \"Timber!\" as a woman at her party passes out and falls face first to the floor.\n• In the Steerswoman series, one of the hints about the Outskirters' origins is that, although they live (and believe they have always lived) in a place with no trees, they shout \"Timber\" when felling a tall object.\n• Used in metaphorical forest of \"Timber \" by FaLnX: But when I take my chainsaw — Get out of my waaaaay! Timbeeeeer!\n• Employed as a dirty metaphor in the Pitbull\\ Kesha song \"Timber\" — I'm yelling 'Timber'... It's going down — I'm yelling 'Timber'...\n• In Punch-Out!!, lumberjack Bear Hugger says \"Timbeeeer!\" when knocked down.\n• In Tales of Monkey Island Chapter 2: The Siege of Spinner Cay, with help from Trenchfoot, Guybrush manages to push the rubber tree down to the ground while shouting out, \"Timmmm-boing?\"\n• \"Timber!\" is the name of one of the achievements in Terraria, which you get upon chopping down a tree for the first time.\n• Chuck Jones produced an internet cartoon series about a timberwolf who had a tree fall on him everytime he said \"Timber\".\n• A typical Tex Avery gag: a character chops down a tree, usually so that it falls on another character. He runs the opposite direction its falling shouts \"TIMMMMMMM...\" when the tree falls on him. \"..ber.\"\n• In one Barney Bear cartoon where he took a beaver community's wood supply for firewood, they retaliated by knocking down his cabin, with the leader yelling this when the supports gave way.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/Timber", "media_links": ["/pmwiki/pmwiki.php/Anime/DigimonAdventure02", "/pmwiki/pmwiki.php/ComicBook/TeenTitans", "/pmwiki/pmwiki.php/ComicBook/LuckyLuke", "/pmwiki/pmwiki.php/Film/BreakfastAtTiffanys", "/pmwiki/pmwiki.php/Literature/TheSteerswoman", "/pmwiki/pmwiki.php/Music/Kesha", "/pmwiki/pmwiki.php/VideoGame/PunchOut", "/pmwiki/pmwiki.php/VideoGame/TalesOfMonkeyIsland", "/pmwiki/pmwiki.php/VideoGame/Terraria", "/pmwiki/pmwiki.php/Creator/ChuckJones", "/pmwiki/pmwiki.php/Creator/TexAvery", "/pmwiki/pmwiki.php/WesternAnimation/BarneyBear"], "non_media_links": ["/pmwiki/pmwiki.php/Main/StockPhrases", "/pmwiki/pmwiki.php/Main/AnimeAndManga", "/pmwiki/pmwiki.php/Main/ComicBooks", "/pmwiki/pmwiki.php/Main/CanadaEh", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/FaceFault", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/Music", "http://www.jamendo.com/en/track/137968", "/pmwiki/pmwiki.php/Main/ChainsawGood", "/pmwiki/pmwiki.php/Main/IntercouseWithYou", "/pmwiki/pmwiki.php/Main/DoubleEntendre", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/WesternAnimation"]}