{"title": "Cue O'Clock", "content": "Oh crud, it's quarter past zeppelin already!?\n\nType 1: In comedies, clock dials are occasionally seen with one or more of the numbers replaced by a non-numerical word or picture telling what will happen on the hour.\n\nType 2: A slight variation of this is when a character creates a fictional time based upon the actions of one or more other characters.\n• Skalman from Bamse got an alarm clock like this. And he always follows it (there has been only one exception).\n• Harry Potter: The Weasley family has a clock that has nine hands and doesn't tell time at all. It just shows where each of the family members currently are. (\"home,\" \"school,\" \"work,\" \"travelling,\" \"lost,\" \"hospital,\" \"prison,\" and \"mortal peril.\") Molly also has one to tell her to do things like \"Time to make tea\", \"Time to feed the chickens\" and \"You're running late\".\n• The title character of the Classic Disney Short \"Donald's Cousin Gus\" has a watch that tells mealtimes.\n• Question 18 of The Impossible Quiz has a clock with some of the numbers replaced with pictures of a bucket, a banana, a house and a hammer.\n• This clock, dividing up the day for Panty & Stocking with Garterbelt.\n• In the My Little Pony: Friendship Is Magic episode \"Baby Cakes\", Pinkie Pie glances at a wristwatch with a picture of her face at the top while waiting for her chance to play with the Cakes' newborn twins some more.\n• One Russ Abbot sketch parodies High Noon. Just in case the audience weren't sure about this, the number 12 on the bar clock is replaced by the words \"High Noon\".\n• The pocket watch of the conductor in \"The Polar Express\" states whether or not the train is late.\n• In School's Out! The Musical, a Made-for-TV Movie for The Fairly OddParents!, Timmy Turner has a watch with eight \"hours\", seven of them being \"play\" and one of them being \"work\".\n• The Goofy Goober clock seen in The Spongebob Squarepants Movie has the 12 numbers, but in scrambled order.\n• The Ratwork Watch in Fallen London: The -ping- of the cash-register almost drowns out a single tiny chime from the watch. The 'Purchase Interval' hand has just reached the end of its arc.\n• In the deeply odd silent short film The Mystery of the Leaping Fish, the main character, a detective who really, really enjoys cocaine and heroin, has a clock on his wall with the words EATS, SLEEPS, DRINKS, DOPE.\n• A running joke in the Overwatch fandom has replacing the 12 o'clock position (or every position) with the words \"High Noon\" when in reference to McCree and his ultimate ability, during which he (rather loudly) announced that it was \"High Noon\". A similar joke eventually made it into the game, when one of McCree's voice lines to announce his ultimate was \"oh, you know what time it is\".\n• Unshaved Mouse, a comedic review blog, tends to lampshade when a character is about to pull a Let's Get Dangerous! by declaring that it's \"Not Fucking Around O'Clock\", complete with picture of a clock displaying this time.\n• On Blue's Clues, Tickety Tock, who is a sentient alarm clock, has the ability to display a symbol related to whatever's happening in the episode in the 12 position.\n• In the House episode 'Simple Explanation' Kutner does not turn up for work and Taub puts forward an obviously fictitious cover story for him, saying that his dog is sick and he will be there by lunch. At lunchtime House looks at his watch and says \"Look at the time. It's half past Taub-was-lying-about-Kutner.\"\n• The Adventures of Dr. McNinja: \"We are on Eastern Pain Time, and it is Dan O' Clock.\"\n• From Dan O'Clock to Dan Thirty, all mixed drinks are half-priced.\n• In the song \"Party on Fountain\": What time's it at?\n• A magazine article from the 1920s said that it was \"Sex O'Clock in America\".\n• Good heavens, just look at the time!\n• An ATC Tower relaying local time to an inbound aircraft, \"...If you're a civilian, it's 3:00; if you're Air Force, it's 1500; if you're Navy, it's Six-Bells, if you're Army, the big hand is on '3' and little hand is on '12'; if you're Marine, it's 2 hours until the bar opens!\n• Variant from the 1980s: If you're American airlines, it's 3:15 pm, if you're Pan Am, it's 1515 hours, and if you're Delta, it's Tuesday.\n• The description for one of the watches you can put on your Rock Band character claims it to be \"rock o'clock\".\n• In Kingdom of Loathing, one of the hit messages when being bitten by a \"toothy pirate\" combines this with a pun: \"What time is it? Tooth hurty.\"\n• Military personnel often gripe about exercises scheduled for \"oh-dark-thirty.\"\n• Borderlands 2: \"AT THE SOUND OF THE EXPLOSION IT WILL NOW BE TORGUE O'CLOCK\" *makes explosion sounds* Face McShooty: \"AT THE SOUND OF THE BELL IT WILL BE FACESHOOTING O'CLOCK! BONGGGGG!!!\"\n• An almost standard joke when asked the time when not wearing a watch at all is to say \"It's about a hair past.\"\n• On That '70s Show, the employees of a cheesy amusement park (at least, this particular feature is cheesy) will answer the question \"What time is it?\" by announcing that \"It's always fun o'clock.\" And breaking into song.\n• In the poem/picture book \"I Like You\" by Sandol Stoddard Warburg, \"time to stop being silly\" is \"a quarter past silly\".\n• On Corner Gas, Oscar and Emma quickly make a bet that, if Oscar can't start their car so they can get to the hockey game on time, Emma will choke him with an extension cord, but if he can, she has to shut up about it. After a tense situation, Oscar gets the car to start. Emma tells him to go, so he glances at his watch and smugly says \"Oh that's right, it's almost... Shut-Up-O'Clock.\"", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/CueOClock", "media_links": ["/pmwiki/pmwiki.php/Webcomic/Xkcd", "/pmwiki/pmwiki.php/Webcomic/Xkcd", "/pmwiki/pmwiki.php/ComicBook/Bamse", "/pmwiki/pmwiki.php/Literature/HarryPotter", "/pmwiki/pmwiki.php/WesternAnimation/ClassicDisneyShorts", "/pmwiki/pmwiki.php/VideoGame/TheImpossibleQuiz", "/pmwiki/pmwiki.php/Anime/PantyAndStockingWithGarterbelt", "/pmwiki/pmwiki.php/WesternAnimation/MyLittlePonyFriendshipIsMagic", "/pmwiki/pmwiki.php/Film/HighNoon", "/pmwiki/pmwiki.php/WesternAnimation/SchoolsOutTheMusical", "/pmwiki/pmwiki.php/WesternAnimation/TheFairlyOddParents", "/pmwiki/pmwiki.php/WesternAnimation/TheSpongebobSquarepantsMovie", "/pmwiki/pmwiki.php/VideoGame/FallenLondon", "/pmwiki/pmwiki.php/Film/TheMysteryOfTheLeapingFish", "/pmwiki/pmwiki.php/VideoGame/Overwatch", "/pmwiki/pmwiki.php/WesternAnimation/BluesClues", "/pmwiki/pmwiki.php/Series/House", "/pmwiki/pmwiki.php/Webcomic/TheAdventuresOfDrMcNinja", "/pmwiki/pmwiki.php/Webcomic/MacHall", "/pmwiki/pmwiki.php/Website/FourChan", "/pmwiki/pmwiki.php/VideoGame/RockBand", "/pmwiki/pmwiki.php/VideoGame/KingdomOfLoathing", "/pmwiki/pmwiki.php/VideoGame/Borderlands2", "/pmwiki/pmwiki.php/Series/That70sShow", "/pmwiki/pmwiki.php/Series/CornerGas"], "non_media_links": ["http://xkcd.com/73/", "/pmwiki/pmwiki.php/Main/ZeppelinsFromAnotherWorld", "/pmwiki/pmwiki.php/Main/OtakuOClock", "http://myfigurecollection.net/pics/figure/big/65773.jpg?t=1300da792941", "/pmwiki/pmwiki.php/Main/MadeForTVMovie", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Main/CatchPhrase", "/pmwiki/pmwiki.php/Blog/UnshavedMouse", "/pmwiki/pmwiki.php/Main/LetsGetDangerous", "/pmwiki/pmwiki.php/Main/Commercials", "/pmwiki/pmwiki.php/Main/MemeticMutation", "/pmwiki/pmwiki.php/Main/PreAssKickingOneLiner", "/pmwiki/pmwiki.php/Main/AltText", "http://i17.photobucket.com/albums/b85/NiteRabbit/Rapeclock.jpg", "http://i17.photobucket.com/albums/b85/NiteRabbit/1275071956205.jpg", "http://www.urbandictionary.com/define.php?term=beer%20thirty&defid=1245344", "/pmwiki/pmwiki.php/Main/SuckECheeses", "/pmwiki/pmwiki.php/Main/TheAllegedCar", "/pmwiki/pmwiki.php/Main/SeriousBusiness"]}