{"title": "Camera Sniper", "content": "Camera Sniper is primarily a Film and Television trope, although it does occur in other media.\n\nThe Government, or the spies, or the Private Detective, or the Intrepid Reporter is watching his target.\n\nThe target is seldom aware at this point that there's a camera scope on him, but the audience gets to see an indication of the watchful character(s) because we see a Follow Shot of him walking, sleeping or just eating breakfast — in short, just living his day-to-day life.\n\nThe shot goes into Freeze Frame (and may also switch from color to black and white), and is accompanied by a camera shutter sound and a blink or iris in shot to indicate that whoever was watching has just taken a photograph of the person targeted. The scene then resumes otherwise unchanged as the target goes about his or her business. This may happen two or three times in the same scene, indicating that there may later be a stack (or email) of photos presented to the watching entity's boss.\n\nExpect the follow shot to be accompanied by a camera's viewfinder reticule. Bonus Points if it's the old-style microprism viewfinder (usually either a split circle or a circle-within-a-circle, with the two parts shaded differently) that few under the age of 30 are likely to have ever actually seen in Real Life.\n\nBlack-and-white photography these days is rather rare in the age of digital cameras... but the sight and sound are pretty much iconic now, so it endures even as technology and the trope march forward.\n• This happens at the beginning of the fourth episode of Sherlock Hound, as Moriarty spies on Holmes to find out his weakness.\n• Golgo 13. In the opening of the anime episode \"Cross Angle\", a paparazzi in a helicopter captures a royal having sex on the deck of a yacht, with the subsequent shots showing her fleeing into the cabin. His next target is an actual sniper — the world's greatest assassin at the moment he fires his shot.\n• Commonplace for Spider-Man, but it's a subversion of the trope most of the time because it's Peter Parker's own camera on auto-shutter taking the pics of Spidey in action. But not always. Especially common in the animated fare featuring the Wallcrawler.\n• Seen in The '80s movie Gotcha.\n• The 2008 film WarGames: The Dead Code has a scene wherein the shot of Amy freezes into a photograph.\n• In Grindhouse: Death Proof, there's a scene of Stuntman Mike watching the second group girls from his car. They walk in slow motion as Stuntman Mike adjusts the camera focus to follow them.\n• In the film There's Something About Mary, there's a scene like this after the main character hires a private detective to track down Mary.\n• Vicki Vale, an intrepid reporter, does this to Bruce Wayne as he visits the spot where his parents died in Batman (1989).\n• Played with in The Tall Blond Man with One Black Shoe - an ordinary violinist is marked as a spy as he arrives at an airport, and several real spies secretly take his picture. He'd popped a large piece of chewy candy in his mouth, and every shutter click/freeze frame catches him in a goofy facial contortion as it gets stuck in his teeth.\n• Jumpin' Jack Flash. Whoopi Goldberg's character delivers Jack's message to the British Embassy, but they claim not to understand it, telling her she must have been the victim of a practical joke. As she leaves, someone takes her photograph.\n• Act of Valor. A CIA operative meeting with her contact is photographed. A short time later armed men burst into her house, kill the contact and abduct her.\n• Chuck: As Sarah makes a drop giving a bogus chip to a medium bad, we have a POV shot of someone taking pictures. Turns out it's an operative for the CIA, who believe that Sarah has had a Face Heel Turn and is selling the real chip. Super huge spoiler: Except it's really an operation to justify her going double in the Big Bad's employ in order to take him down and rescue Chuck's mother .\n• Happens a lot on The Wire, particularly in season one. For instance, the scene where Bubbles is doing his red hat trick and Kima is on the roof photographing the heroes.\n• Happens in Torchwood: Miracle Day - Gwen is in Venice Beach, and we see that someone's watching her through the shutter of the camera they're using to photograph her. The shot even pulls back to show the person with the long range lens.\n• Veronica Mars: At least half the episodes have this, though that's unsurprising considering the character is a private eye.\n• Hunter. The episode \"Avenging Angel\" opens with this trope, as an unseen person is shown taking photographs of Hunter going about his everyday business, in a montage to the song \"Every Breath You Take\" (I'll Be Watching You) by the Police. He's then shown developing the photographs and putting them up on his wall.\n• Happens a lot in Person of Interest, given that each POI has to be put under surveillance by the protagonists, either for protection or to expose their criminal activities. However in \"Firewall\" they're on the receiving end. Finch warns Reese not to reveal too much to the POI, as it's important that no-one find out about them. The next scene has Alicia Corwin taking Finch's photograph as he walks down the street.\n• The Professionals. In \"Hunter/Hunted\", Bodie and Doyle think they're being followed by a black Porsche on the highway. After some vehicular maneuvering the Porsche drives past with the unseen driver waving at them, so they assume it's the usual road rage Cock Fight. Then the Porsche turns up unnoticed at their destination, a telephoto lens extends out the car window and takes several photographs of Bodie and Doyle.\n• Project Blue Book. At the end of the pilot episode, Dr Hynek and his wife Mimi think they hear a prowler, but decide It's Probably Nothing. Just before Hyneck goes back inside the house, someone takes his photograph; not a mysterious Man In Black but\n• This happens briefly in the music video for Rod Stewart's \"Infatuation\".\n• In the game Dead Rising, this is used in cutscenes, and is also implemented into gameplay.\n• The opening to Beyond Good & Evil has this.\n• Team Fortress Comics #3 ends this way, using an actual sniper rifle (obviously from the Sniper).\n• As mentioned above, Spider-Man: The Animated Series, The Spectacular Spider-Man and other animated versions of the Webslinger tend to show this trope by dint of Peter Parker catching Spidey in action for the Daily Bugle.\n• On The Looney Tunes Show The Flashback to Granny's days as a WAC has her camera sniping some German soldiers as they try to steal art from the Louvre.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/CameraSniper", "media_links": ["/pmwiki/pmwiki.php/Film/TheTallBlondManWithOneBlackShoe", "/pmwiki/pmwiki.php/Anime/SherlockHound", "/pmwiki/pmwiki.php/Manga/Golgo13", "/pmwiki/pmwiki.php/ComicBook/SpiderMan", "/pmwiki/pmwiki.php/Film/WarGames", "/pmwiki/pmwiki.php/Film/Grindhouse", "/pmwiki/pmwiki.php/Film/DeathProof", "/pmwiki/pmwiki.php/Film/TheresSomethingAboutMary", "/pmwiki/pmwiki.php/Film/Batman1989", "/pmwiki/pmwiki.php/Film/TheTallBlondManWithOneBlackShoe", "/pmwiki/pmwiki.php/Film/JumpinJackFlash", "/pmwiki/pmwiki.php/Film/ActOfValor", "/pmwiki/pmwiki.php/Series/Chuck", "/pmwiki/pmwiki.php/Series/TheWire", "/pmwiki/pmwiki.php/Series/TorchwoodMiracleDay", "/pmwiki/pmwiki.php/Series/VeronicaMars", "/pmwiki/pmwiki.php/Series/Hunter", "/pmwiki/pmwiki.php/Series/PersonOfInterest", "/pmwiki/pmwiki.php/Series/TheProfessionals", "/pmwiki/pmwiki.php/Series/ProjectBlueBook", "/pmwiki/pmwiki.php/Music/RodStewart", "/pmwiki/pmwiki.php/VideoGame/DeadRising", "/pmwiki/pmwiki.php/VideoGame/BeyondGoodAndEvil", "/pmwiki/pmwiki.php/WesternAnimation/SpiderManTheAnimatedSeries", "/pmwiki/pmwiki.php/WesternAnimation/TheSpectacularSpiderMan", "/pmwiki/pmwiki.php/WesternAnimation/TheLooneyTunesShow"], "non_media_links": ["/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/UsefulNotes/Television", "/pmwiki/pmwiki.php/Main/TheGovernment", "/pmwiki/pmwiki.php/Main/CloakAndDagger", "/pmwiki/pmwiki.php/Main/PrivateDetective", "/pmwiki/pmwiki.php/Main/IntrepidReporter", "/pmwiki/pmwiki.php/Main/Anime", "/pmwiki/pmwiki.php/Main/Manga", "/pmwiki/pmwiki.php/Main/ComicBooks", "/pmwiki/pmwiki.php/Main/SuperheroSobriquets", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/TheEighties", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/StalkerShrine", "/pmwiki/pmwiki.php/Main/TemptingFate", "/pmwiki/pmwiki.php/Main/CockFight", "/pmwiki/pmwiki.php/Main/ItsProbablyNothing", "/pmwiki/pmwiki.php/Main/TheMenInBlack", "/pmwiki/pmwiki.php/Main/FemmeFataleSpy", "/pmwiki/pmwiki.php/Main/Music", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/SupplementalMaterial/TeamFortress2", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/Flashback"]}