{"title": "Stock Trailer Music", "content": "So you're leaning back in your comfy theater chair, next to your significant other, munching on overpriced lobby snacks, when the previews come on. The first opens with some dramatic In a World... narration about the Earth That Was...but wait a minute. That music sure sounds familiar. \"Requiem for a Tower\", again? The next trailer is for some run-of-the-mill PG-rated Eddie Murphy Toilet Humor kiddy comedy. It's \"I Feel Good\" by James Brown! Again!\n\nThis is a common movie trailer trope. Simply put, many editors of trailers find it easy to use famous songs to elicit a specific mood within a two- or three-minute duration.\n\nSee also Standard Snippet. Recycled Trailer Music is a close sister trope, but for film scores instead of songs.\n• \"Bishop's Countdown\" from Aliens (also an example of Recycled Trailer Music) has been seen in many action-oriented films that were released over the last three decades. This includes its sequel (Alien³), The Abyss, The Hitchhiker's Guide to the Galaxy, From Dusk Till Dawn, XXX, Dante's Peak and many more. According to Soundtrack.net , it is the fifth most-commonly used cue for a trailer.\n• Listen to enough music from companies like Two Steps From Hell, Audiomachine, Epic Score, and Globus, and you'll start recognizing a LOT of the songs used in previews, both on TV and on the big screen.\n• America's Got Talent is particularly fond of using Two Steps From Hell, particularly Heart of Courage.\n• As mentioned above, James Brown's \"I Feel Good\" is the go-to song for inane kids' comedies based around Toilet Humor and Eddie Murphy playing all the characters. In fact, its status as a cliché was lampshaded in Tropic Thunder.\n• And for kids' comedies that are less gross and more heartwarming, \"Walking on Sunshine\" by Katrina and the Waves is a popular choice.\n• As also mentioned above, \"Requiem for a Tower\" is pretty popular for overwrought Sci-Fi/Action epics, ever since it was created for the trailers of The Lord of the Rings. Hell, even The Da Vinci Code used it. It's an orchestral remix of the song \"Lux Aeterna\", which was written (by Clint Mansell) as the main theme for Requiem for a Dream. It's become the default action/sci-fi/epic/drama/pretty-much-any-genre music for trailers, despite the original being a depressing music for a depressing movie.\n• \"What's This?\" from The Nightmare Before Christmas has made Danny Elfman enough royalties for him to live on all by itself.\n• It's a little known fact, but U.S. law requires that a minimum of 75% of all Romantic Comedy trailers every year use \"Are You Gonna Be My Girl\" by Jet. The answer to that question is inevitably yes.\n• Gary Jules' cover of Tears for Fears' \"Mad World\" is becoming popular for Horror/Action trailers during fast-paced montages of violence and/or desolation, as evidenced by its use in commercials for Gears of War and The Crazies.\n• Up until the mid-2000s, a handful of tracks (\"Name of the Game\", for example) by The Crystal Method and The Prodigy were very popular in ads for everything from energy drinks to action movies. The use of big beat has become a Dead Horse Trope in advertising now, and has contributed the death of classic, Fatboy Slim-style big beat.\n• blink-182's \"All the Small Things\" is a popular choice for teen comedies starring actors in their late 20s. Also, any comedy where something is small (e.g., Alvin and the Chipmunks).\n• Saliva's \"Click Click Boom\" is there for the prospective trailer editor who wants an X-Treme atmosphere for chugging Mountain Dew.\n• From 1999 until a few years into the Turn of the Millennium, \"All Star\" by Smashmouth was in every ad for everything ever. Those ads included the trailers for the Digimon movie, the Inspector Gadget movie, and Shrek.\n• \"Song 2\" by Blur - also a Standard Snippet in action scenes, particularly extreme sports.\n• Want music for the trailer of your TV show? Is this week's episode particularly dramatic? \"You've Got the Love\". Done.\n• Also \"Set Fire to the Rain\", especially on Lifetime.\n• For a while around 2005-2006, any song by The Fray (\"Over My Head\", \"How to Save a Life\") was common in trailers for dramatic shows like Grey's Anatomy.\n• \"Firework\" by Katy Perry was used in the trailers for both Prom and Soul Surfer, two films released within months of each other, making for some amusing moments when both trailers were played back to back.\n• When it first came out, \"Tik Tok\" by Kesha was popular in trailers for kids movies. A rather peculiar choice considering the song is about hardcore partying and drinking.\n• A slew of films have used the David Bowie/Queen collaboration \"Under Pressure\" in their trailers — namely Stepmom (also used in the film's opening sequence), The Girl Next Door, the Arthur remake (that trailer also used Bowie's \"Rebel Rebel\"), and Minions. Never mind that the pressure the song is discussing is that of dealing with a world gone mad, rather than raising stepkids or romantic travails.\n• \"Solsbury Hill\" by Peter Gabriel seems to be the go-to song for \"feel good movie\" trailers. Odd, since it's a rather bitter song about Gabriel leaving Genesis.\n• KT Tunstall's \"Suddenly I See\" was used in The Devil Wears Prada, and ever since has been used in various trailers for movies, TV, and commercials, usually in scenes where women are empowered. It was even parodied by Best Week Ever in 2008, which played it with scenes of women working in sweatshops.\n• Films with a comedic existential theme to them seem to favor \"Once in a Lifetime\" by Talking Heads.\n• It seems now of days if you want some Epic, thematic music to go along with your Action / Sci-Fi trailer, just use a track from Nine Inch Nails' The Fragile. Most notably, the track Just Like You Imagined was used for the Trailer to 300.\n• Recently, Danny Cocke's \"Sinister Intent\" is getting some mileage. Being used in the Dredd and XCOM: Enemy Unknown trailers, the song is now appearing in promos for Season 3 of The Walking Dead.\n• Imagine Dragons' song \"Radioactive\" has started showing up in a great deal of advertisements, such as things for Defiance, Graceland, and other media.\n• Since Inception popularized it, a lot of Movie trailers now use the BWONG noise. It's even popped up in a few soundtracks here and there.\n• Sleigh Bells' \"Crown on The Ground\" —- among many other tracks of theirs —- seem to pop up in various movie trailers these days.\n• Ellie Goulding's \"Explosions\" was used as ITV's soundtrack to their \"Where Drama Lives\" series of adverts, and even starting charting highly on the UK Singles Chart as a result.\n• The Heavy's \"How You Like Me Now\" has been used in many trailers, particularly a favorite for comedies.\n• Nero's \"Doomsday \" is used for a high action trailer that needs some dubstep to add hipstar gravitas.\n• Since its use in the Fantastic Four (2015) Trailer #2, Immediate Music's piece \"Apocalypse \" has been reused in TV spots and trailers for Jurassic World, The Hunger Games: Mockingjay, Gods of Egypt and The Jungle Book (2016).\n• \"Runaway Baby\" by Bruno Mars is incredibly popular for fast-paced trailers. An example that comes to mind is Escape from Planet Earth, which heavily featured the song in its promotional packaging.\n• The trailers for ''Toy Story 3'' , the English dub of ''Ponyo'' , and ''Furry Vengeance'' all feature the same piece of background music. Considering these were all released around the same time (late-2009 to mid-2010), maybe that piece was a popular and easy option to use.\n• \"Fireball\" by Pitbull has been used in trailers and TV spots for Shaun the Sheep: The Movie, TV spots for Zootopia and the international trailer for The Emoji Movie.\n• Practically every childrens' movie trailer will feature \"The Walker\" by Fitz & the Tantrums.\n• The trailer for Jumanji: Welcome to the Jungle uses... well, the title is pretty self-explanatory. That song was also used in the trailers for The Sponge Bob Movie Sponge Out Of Water (which teased an appearance by Slash that never appeared in the final film).\n• The trailer for Toy Story featured Thin Lizzy's \"The Boys Are Back in Town\". Nowhere to be found in the film, though. It's sung in the on-ice version. \"The Boys Are Back in Town\" would become the trilogy's signature trailer song, being reused to promote Toy Story 2 and 3.\n• Guaranteed, if there is a zany comedy or a light hearted fantasy movie, you will hear The Cancan Song from Orpheus in the Underworld.\n• Trailers for The Emperor's New Groove utilized \"Let's Groove\" by Earth, Wind & Fire.\n• Beethoven's \"Ode to Joy\" is common in movie trailers such as those for the Die Hard and Hot Tub Time Machine films, and is sometimes used when a film is financially and/or critically successful.\n• Rag N Bone Man's \"Human\" is slowly becoming this, already having been used in trailers for Inhumans, SS-GB, Thank You For Your Service, Mass Effect: Andromeda, Cars 3 and Jack Ryan.\n• Iggy Pop's \"Real Wild Child (Wild One)\" was a particularly popular choice for 80s-90s family films and/or other films with \"rambunctious\" kids/teens as the protagonists, including Adventures in Babysitting, Harriet the Spy and Problem Child.\n• The Cranberries were everywhere on film and TV , mostly in Gen-X-centric fare. \"Dreams\" takes the cake, having been in trailers for Chungking Express, Milk Money, You've Got Mail, and Mission: Impossible, as well as episodes of My So-Called Life, Beverly Hills, 90210, Gossip Girl, and JAG. Patrice O'Neal poked fun at it on an Opie & Anthony appearance, while improving a crummy romcom trailer.\n• DJ Shadow\u0092s \u0093Nobody Speak\u0094 became a standard stock track for R-rated and raunchy comedies in the late 2010s, notably being featured in the trailers for Suburbicon, Booksmart and Good Boys in the latter two examples, it also appeared in the actual movies . Booksmart and Good Boys opened in the same summer season, which meant it wasn\u0092t uncommon to get the trailers for both films at the same screening - or even back-to-back.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/StockTrailerMusic", "media_links": ["/pmwiki/pmwiki.php/Film/RequiemForADream", "/pmwiki/pmwiki.php/Film/TheLordOfTheRingsTheTwoTowers", "/pmwiki/pmwiki.php/Creator/EddieMurphy", "/pmwiki/pmwiki.php/Film/Aliens", "/pmwiki/pmwiki.php/Film/Alien3", "/pmwiki/pmwiki.php/Film/TheAbyss", "/pmwiki/pmwiki.php/Film/TheHitchhikersGuideToTheGalaxy", "/pmwiki/pmwiki.php/Film/FromDuskTillDawn", "/pmwiki/pmwiki.php/Film/XXX", "/pmwiki/pmwiki.php/Film/DantesPeak", "/pmwiki/pmwiki.php/Series/AmericasGotTalent", "/pmwiki/pmwiki.php/Music/JamesBrown", "/pmwiki/pmwiki.php/Creator/EddieMurphy", "/pmwiki/pmwiki.php/Film/TropicThunder", "/pmwiki/pmwiki.php/Film/TheLordOfTheRings", "/pmwiki/pmwiki.php/Film/TheDaVinciCode", "/pmwiki/pmwiki.php/Film/RequiemForADream", "/pmwiki/pmwiki.php/WesternAnimation/TheNightmareBeforeChristmas", "/pmwiki/pmwiki.php/Creator/DannyElfman", "/pmwiki/pmwiki.php/VideoGame/GearsOfWar", "/pmwiki/pmwiki.php/Film/TheCrazies", "/pmwiki/pmwiki.php/Music/TheCrystalMethod", "/pmwiki/pmwiki.php/Music/TheProdigy", "/pmwiki/pmwiki.php/Music/FatboySlim", "/pmwiki/pmwiki.php/Music/Blink182", "/pmwiki/pmwiki.php/Film/AlvinAndTheChipmunks", "/pmwiki/pmwiki.php/Franchise/Digimon", "/pmwiki/pmwiki.php/Film/InspectorGadget", "/pmwiki/pmwiki.php/WesternAnimation/Shrek", "/pmwiki/pmwiki.php/Music/Blur", "/pmwiki/pmwiki.php/Music/FlorenceAndTheMachine", "/pmwiki/pmwiki.php/Music/Adele", "/pmwiki/pmwiki.php/Series/GreysAnatomy", "/pmwiki/pmwiki.php/Music/KatyPerry", "/pmwiki/pmwiki.php/Film/Prom", "/pmwiki/pmwiki.php/Film/SoulSurfer", "/pmwiki/pmwiki.php/Music/Kesha", "/pmwiki/pmwiki.php/Music/DavidBowie", "/pmwiki/pmwiki.php/Music/Queen", "/pmwiki/pmwiki.php/Film/Stepmom", "/pmwiki/pmwiki.php/Film/TheGirlNextDoor2004", "/pmwiki/pmwiki.php/Film/Arthur", "/pmwiki/pmwiki.php/WesternAnimation/Minions", "/pmwiki/pmwiki.php/Music/PeterGabriel", "/pmwiki/pmwiki.php/Music/Genesis", "/pmwiki/pmwiki.php/Music/KTTunstall", "/pmwiki/pmwiki.php/Literature/TheDevilWearsPrada", "/pmwiki/pmwiki.php/Music/TalkingHeads", "/pmwiki/pmwiki.php/Music/NineInchNails", "/pmwiki/pmwiki.php/Music/TheFragile", "/pmwiki/pmwiki.php/Film/ThreeHundred", "/pmwiki/pmwiki.php/Film/Dredd", "/pmwiki/pmwiki.php/VideoGame/XCOMEnemyUnknown", "/pmwiki/pmwiki.php/VideoGame/Defiance", "/pmwiki/pmwiki.php/Series/Graceland", "/pmwiki/pmwiki.php/Film/Inception", "/pmwiki/pmwiki.php/Music/SleighBells", "/pmwiki/pmwiki.php/Music/EllieGoulding", "/pmwiki/pmwiki.php/Creator/ITV", "/pmwiki/pmwiki.php/Music/TheHeavy", "/pmwiki/pmwiki.php/Film/FantasticFour2015", "/pmwiki/pmwiki.php/Film/JurassicWorld", "/pmwiki/pmwiki.php/Film/TheHungerGamesMockingjay", "/pmwiki/pmwiki.php/Film/GodsOfEgypt", "/pmwiki/pmwiki.php/Film/TheJungleBook2016", "/pmwiki/pmwiki.php/Music/BrunoMars", "/pmwiki/pmwiki.php/WesternAnimation/EscapeFromPlanetEarth", "/pmwiki/pmwiki.php/Music/Pitbull", "/pmwiki/pmwiki.php/WesternAnimation/ShaunTheSheep", "/pmwiki/pmwiki.php/Disney/Zootopia", "/pmwiki/pmwiki.php/WesternAnimation/TheEmojiMovie", "/pmwiki/pmwiki.php/Film/JumanjiWelcomeToTheJungle", "/pmwiki/pmwiki.php/Music/GunsNRoses", "/pmwiki/pmwiki.php/WesternAnimation/TheSpongeBobMovieSpongeOutOfWater", "/pmwiki/pmwiki.php/Music/Slash", "/pmwiki/pmwiki.php/WesternAnimation/ToyStory", "/pmwiki/pmwiki.php/Music/ThinLizzy", "/pmwiki/pmwiki.php/WesternAnimation/ToyStory2", "/pmwiki/pmwiki.php/WesternAnimation/ToyStory3", "/pmwiki/pmwiki.php/Music/TheCancanSong", "/pmwiki/pmwiki.php/Disney/TheEmperorsNewGroove", "/pmwiki/pmwiki.php/Music/EarthWindAndFire", "/pmwiki/pmwiki.php/Music/RagNBoneMan", "/pmwiki/pmwiki.php/Series/Inhumans", "/pmwiki/pmwiki.php/Series/SSGB", "/pmwiki/pmwiki.php/Film/ThankYouForYourService", "/pmwiki/pmwiki.php/VideoGame/MassEffectAndromeda", "/pmwiki/pmwiki.php/WesternAnimation/Cars3", "/pmwiki/pmwiki.php/Series/JackRyan", "/pmwiki/pmwiki.php/Music/IggyPop", "/pmwiki/pmwiki.php/Film/AdventuresInBabysitting", "/pmwiki/pmwiki.php/Literature/HarrietTheSpy", "/pmwiki/pmwiki.php/Film/ProblemChild", "/pmwiki/pmwiki.php/Music/TheCranberries", "/pmwiki/pmwiki.php/Film/ChungkingExpress", "/pmwiki/pmwiki.php/Film/MilkMoney", "/pmwiki/pmwiki.php/Film/YouveGotMail", "/pmwiki/pmwiki.php/Film/MissionImpossible", "/pmwiki/pmwiki.php/Series/MySoCalledLife", "/pmwiki/pmwiki.php/Series/BeverlyHills90210", "/pmwiki/pmwiki.php/Series/GossipGirl", "/pmwiki/pmwiki.php/Series/JAG", "/pmwiki/pmwiki.php/Radio/OpieAndAnthony", "/pmwiki/pmwiki.php/Creator/ReneeZellweger", "/pmwiki/pmwiki.php/Creator/JohnCusack", "/pmwiki/pmwiki.php/Film/Suburbicon", "/pmwiki/pmwiki.php/Film/Booksmart", "/pmwiki/pmwiki.php/Film/GoodBoys"], "non_media_links": ["/pmwiki/pmwiki.php/Main/ComingAttractions", "/pmwiki/pmwiki.php/Main/InAWorld", "/pmwiki/pmwiki.php/Main/EarthThatWas", "/pmwiki/pmwiki.php/Main/ToiletHumor", "/pmwiki/pmwiki.php/Main/StandardSnippet", "/pmwiki/pmwiki.php/Main/RecycledTrailerMusic", "/pmwiki/pmwiki.php/Main/RecycledTrailerMusic", "http://www.soundtrack.net/trailers/frequent", "/pmwiki/pmwiki.php/Main/EpicScore", "/pmwiki/pmwiki.php/Main/ToiletHumor", "/pmwiki/pmwiki.php/Main/ActingForTwo", "/pmwiki/pmwiki.php/Main/LampshadeHanging", "/pmwiki/pmwiki.php/Main/RomanticComedy", "/pmwiki/pmwiki.php/Main/StrictlyFormula", "/pmwiki/pmwiki.php/Main/SoundtrackDissonance", "/pmwiki/pmwiki.php/Main/DeadHorseTrope", "/pmwiki/pmwiki.php/Main/GenreKiller", "/pmwiki/pmwiki.php/Main/DawsonCasting", "/pmwiki/pmwiki.php/Main/TotallyRadical", "/pmwiki/pmwiki.php/Main/TurnOfTheMillennium", "https://www.youtube.com/watch?v=WlAHZURxRjY", "/pmwiki/pmwiki.php/Main/StandardSnippet", "/pmwiki/pmwiki.php/Main/PreviewsPulse", "https://www.youtube.com/watch?v=1QqY-8mohxo", "https://www.youtube.com/watch?v=6vvJdr0McXk", "https://www.youtube.com/watch?v=JcpWXaA2qeg", "https://www.youtube.com/watch?v=bskgNOXbdiE", "https://www.youtube.com/watch?v=p9vRrYrgjAk", "/pmwiki/pmwiki.php/Main/MissingTrailerScene", "/pmwiki/pmwiki.php/Main/RecycledInSpace", "https://www.bustle.com/articles/42519-the-cranberries-ruled-90s-movie-soundtracks-from-empire-records-to-youve-got-mail", "https://www.youtube.com/watch?v=Yam5uK6e-bQ", "https://www.youtube.com/watch?v=8vvHeKUK-9g", "https://www.youtube.com/watch?v=O-GNgV32Cu4"]}