{"title": "Retrospective Determinism", "content": "Alice: Hey Bob, how's the knee? \n\nBob: After I went out for a walk, I was bound to trip and break my knee.\n• This is a major problem in the history discipline, although it's usually not quite so explicit. Because we all view events from our present-day vantage point, it's often natural to assume that a past set of events must have inevitably led to the present set of circumstances. If left unchecked this can lead to things like describing historical actors as if they knew in advance what would happen or that they were deliberately crafting the future. See here . For instance, Abraham Lincoln was an abolitionist who recognized slavery as an inhuman and antiquated institution, but also held views that would be quite racist today, such as preferring that all freed blacks in the United States migrate back to Africa because he thought blacks and whites living together in peace was impossible. Many portrayals of the man in popular culture will forget this and instead make it seem like he was in favor of total equality because that was the ultimate outcome.\n• The philosophical Anthropic Principle (not to be confused with the narrative Anthropic Principle) has a common misinterpretation rooted in this fallacy: While the actual concept holds that we live on a planet and in a universe that seems astoundingly well suited to the existence of human life because humans live on Earth in such a universe, many people incorrectly invert this into things like \"The rules of the universe we live in are the only ones possible because our form of life could not live in universes with alternate laws of physics.\" and \"Intelligent life can only exist as carbon-based life on Earth-like planets because humans live on Earth and are carbon-based life\".", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/RetrospectiveDeterminism", "media_links": [], "non_media_links": ["http://en.wikipedia.org/wiki/Retrospective_determinism", "/pmwiki/pmwiki.php/Main/HitlersTimeTravelExemptionAct", "/pmwiki/pmwiki.php/Main/PlanetOfHats", "/pmwiki/pmwiki.php/Main/FalseCause", "/pmwiki/pmwiki.php/Main/AlternateHistory", "https://en.wikipedia.org/wiki/Teleology", "/pmwiki/pmwiki.php/UsefulNotes/AbrahamLincoln", "/pmwiki/pmwiki.php/Main/FairForItsDay", "/pmwiki/pmwiki.php/Main/HistoricalHeroUpgrade", "https://en.wikipedia.org/wiki/Anthropic_principle", "/pmwiki/pmwiki.php/Main/AnthropicPrinciple"]}