{"title": "Bar Sinister", "content": "The Bar Sinister is the single most famous element of Hollywood Heraldry, a diagonal line on a coat of arms that indicates illegitimacy. \"Sinister\" just means that the line starts at the top left, but the connotations of the word may have something to do with the trope's persistence (to avoid embarrassment, it's important to remember that \"left\" in heraldry means the shield-bearer's left, which is \"right\" from the point of view of the person looking at the coat of arms).\n\nIn reality, there are three things wrong with this:\n• In heraldry, a bar is actually a horizontal line. The term for a diagonal line is bend (in French heraldry, barre). A small diagonal line that doesn't reach the edges of the shield is a baton.\n• There is no standard heraldic symbol for illegitimacy. The baton or bend sinister was used in this way in some places and times, but in other places and times it was completely innocent, and some other indicator was used — or, depending on the cultural norms, no indicator at all. For instance, in Scottish heraldry, the arms of a bastard were marked by a border around the shield, usually a pattern of alternating white and some other colour, while the French rules varied from region to region, and the Germans rarely ever bothered differencing arms at all.\n• In English heraldry, there were (and are) very strict rules about how a coat of arms was inherited and even stricter and more complicated rules about how they could be used by members of the family of the person to whom the arms were originally granted. In general, though, an illegitimate child would have no right to bear or inherit the arms of either of their parents at all, no matter how they differenced it (however, an illegitimate child may apply for a grant of arms — or, if a minor, the parent may do so for him — and may request that it be based on the parental arms; but the rest is up to the Heralds' College).\n\nIn modern English heraldry, the most common indicator is a particular type of border around the edge of the shield, borrowed from the Scottish system.\n\nBestselling historical novelist Walter Scott is the trope creator: his works stuck popular culture with both the idea of the barre sinister as a sign of illegitimacy and the misspelling of \"barre\". Although completely bogus in terms of heraldry, the concept lives on in the unit badges of some military organizations, as a pictorial way of Getting Crap Past the Radar. A baton sinister is used to imply that members of that unit are, well, bastards. Notably, this use can be seen in the unit patch of the US Marine fighter squadron VMA-214 \"Black Sheep\" , whose Second World War exploits formed the basis for a popular TV series, Baa Baa Black Sheep.\n\nNot to be confused with Bad-Guy Bar.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/BarSinister", "media_links": ["/pmwiki/pmwiki.php/Literature/ADanceWithDragons", "/pmwiki/pmwiki.php/Creator/WalterScott", "/pmwiki/pmwiki.php/Series/BlackSheepSquadron", "/pmwiki/pmwiki.php/ComicBook/SecretWars2015", "/pmwiki/pmwiki.php/Literature/ASongOfIceAndFire", "/pmwiki/pmwiki.php/Creator/RobinHobb", "/pmwiki/pmwiki.php/Literature/Farseer", "/pmwiki/pmwiki.php/Creator/RobertAHeinlein", "/pmwiki/pmwiki.php/Literature/TheMoonIsAHarshMistress", "/pmwiki/pmwiki.php/Literature/PrinceRoger", "/pmwiki/pmwiki.php/Literature/VillageTales", "/pmwiki/pmwiki.php/VideoGame/CrusaderKings", "/pmwiki/pmwiki.php/WesternAnimation/Underdog"], "non_media_links": ["/pmwiki/pmwiki.php/Main/AStormIsComing", "/pmwiki/pmwiki.php/Main/YourOtherLeft", "/pmwiki/pmwiki.php/Main/GettingCrapPastTheRadar", "/pmwiki/pmwiki.php/Main/VisualPun", "http://en.wikipedia.org/wiki/VMA-214", "/pmwiki/pmwiki.php/Main/BadGuyBar", "/pmwiki/pmwiki.php/UsefulNotes/AustralianRulesFootball", "/pmwiki/pmwiki.php/Main/ViewersAreGeniuses", "/pmwiki/pmwiki.php/UsefulNotes/JewishRevolts", "/pmwiki/pmwiki.php/Main/GettingCrapPastTheRadar", "http://www.cookylamoo.com/boringlikeadrill/2006/07/euston-bend-sinister.html"]}