{"title": "Non Voyage Party", "content": "Misunderstandings are a big part of comedy. People hear part of a conversation, or hear it without context, and, well, Hilarity Ensues.\n\nNon Voyage Party is another trope from the comic misunderstandings family. Alice is throwing a party for Bob to celebrate some accomplishment or special occasion of Bob's. Of course Alice and company want it to be a happy surprise, so their circle of friends keeps it on the hushhush. Unfortunately Bob, overhearing part of the plans or seeing his friends sneak around without context, ends up with the mistaken idea that Alice is really trying to get rid of him and is throwing a party to celebrate his imminent departure.\n\nOf course the trope usually resolves with the confused party getting the story straight and being embarrassed and/or amused that they could have been so far off from the truth of the matter, and Everybody Laughs Ending closes it out as the silly misunderstanding is put to rest.\n\nEven in scenarios where commonplace technology would usually prevent this sort of thing from happening, malfunction or human error can be expected to keep the trope on track. If Alice sends a group text to the circle of friends about their plans, except for Bob, one of the friends will reply to it but forget to omit Bob's name so he gets one mysterious text, and no response from the friend who sent it and now realizes their mistake.\n\nNot to be confused with It's a Costume Party, I Swear!. Subtrope of Not What It Looks Like.\n• An inversion in one of the Ace Ventura films: the monastery Ace is staying at learns he's leaving and throws a massive party to celebrate getting rid of him. Of course, he thinks it's a going-away party.\n• One 5 Second Films has a group of friends react so excitedly to the news a friend is coming, he looks through the window and turns around, sadly remarking \"it looks like they don't need me anymore\".\n• Inverted in Scrooge: The \"Thank You Very Much\" scene: All these people owe me money. They all loved me and I never knew!...What did I do? What did I do? Whatever it was, it has made me truly happy that I am the cause. My friends, I thank you from the bottom of my heart. I shall remember this moment until my dying day . Unseen by Scrooge, his casket is taken out of the building.\n• Inverted in Frasier. The Cheers gang holds a going-away party for Cliff, who's set to retire to a tropical locale. But Cliff, so touched by the things said about him during the party, instead decides to stay in Boston, much to Carla's chagrin.\n• When Eleanor visits in Three's Company, Jack thinks the party Janet and Chrissy are throwing is to celebrate her return (and thus, his departure.) He doesn't know it's really a party congratulating him for passing his cooking exam.\n• A particularly paranoid soldier on Dromund Kaas in Star Wars: The Old Republic mistook a birthday party for an attempt on his life... and responded accordingly.\n• In Futurama, the cast decides to hold a birthday party for Prof Farnsworth. Farnworth initially thinks it's a disciplinary hearing.\n• My Little Pony: Friendship Is Magic. In \"Party of One\", Pinkie misapprehends the other ponies blowing off her after-birthday party for Gummy and after seeing them sneak around, avoid her, and give her obvious, feeble lies to explain why they can't come to Gummy's afterparty, jumps to the conclusion that they no longer want to be her friends. This upsets her greatly, and she's surprised when her friends explain that the truth is they were throwing her a surprise birthday party.\n• The Powerpuff Girls. \"Little Miss Interpret\". Bubbles and her sisters overhear the professor's plans for a party for the three of them, but misinterpret what they hear. They end up thinking he plans to destroy them and create a new set of girls.\n• Strawberry Shortcake Berry Bitty Adventures. The going away party for Raspberry Torte. Raspberry's big city diva fashion designer worked out to separate Raspberry from her bumpkin friends, so Raspberry blows off the party altogether never knowing it was a celebration of her success.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/NonVoyageParty", "media_links": ["/pmwiki/pmwiki.php/Film/AceVentura", "/pmwiki/pmwiki.php/Film/Scrooge1970", "/pmwiki/pmwiki.php/Series/Frasier", "/pmwiki/pmwiki.php/Series/Cheers", "/pmwiki/pmwiki.php/Series/ThreesCompany", "/pmwiki/pmwiki.php/VideoGame/StarWarsTheOldRepublic", "/pmwiki/pmwiki.php/WesternAnimation/Futurama", "/pmwiki/pmwiki.php/WesternAnimation/MyLittlePonyFriendshipIsMagic", "/pmwiki/pmwiki.php/WesternAnimation/ThePowerpuffGirls", "/pmwiki/pmwiki.php/WesternAnimation/StrawberryShortcake"], "non_media_links": ["/pmwiki/pmwiki.php/Main/HilarityEnsues", "/pmwiki/pmwiki.php/Main/OutOfContextEavesdropping", "/pmwiki/pmwiki.php/Main/EverybodyLaughsEnding", "/pmwiki/pmwiki.php/Main/ItsACostumePartyISwear", "/pmwiki/pmwiki.php/Main/NotWhatItLooksLike", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/WebVideo/FiveSecondFilms", "/pmwiki/pmwiki.php/Main/Irony", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/BerserkButton", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/RuleOfThree"]}