{"title": "With or Without You", "content": "Bob is looking over Alice's plan to infiltrate the enemy base and notices that it will cause a lot of casualties. He feels uncomfortable about this and talks to her about it. She starts with how it will be worth it in the long run, and may let something slip about a later plan.\n\nAs Bob gets more and more worried, and Alice gets more and more defensive, she finally reaches her tipping point and declares:\n\n\"Too bad! I'm doing this With or Without You!\"\n\nA Stock Phrase cementing that Alice is done with Bob's opinion, because she believes she doesn't need him. This rarely ends well. Can also be \"We're doing this with or without you,\" in which case some of the 'we' may walk off with Bob, or be clearly staying only out of terror. It needn't be this dramatic.\n\nAlice can also be heroic, in which case Bob is probably just scared and may come back at an appropriate moment. This also makes it much more likely Bob will stay, happily or not.\n\nPlease be careful with examples. A character saying something like Can't Live With Them, Can't Live Without Them may sound very similar to this trope if the phrase is out of context.\n• The Brave Little Toaster. After their master leaves them, a group of appliances must decide what to do. Toaster: Well, I'm going, with or without you.\n• Up - \"Now whether you assist me or not, I am going to Paradise Falls, if it kills me!\"\n• Once Upon a Time in America. Max plans to pull a Bank Robbery. Carol: All he thinks about is this job: tear gas, hostages... Now he's gonna do this, and he's gonna do it with or without you!\n• The Insider. Lowell Bergman has refused to edit the film of an interview. Lawyer: We're doing this with or without you, Lowell. If you like, I can sign another producer to edit your show.\n• The Mexican. Samantha wants Jerry to go to Las Vegas but he doesn't want to, leading to the page quote.\n• The Stepford Wives (2004). Joanna has realized that something is rotten in Stepford. Joanna Eberhart: It's... It's not our world. It's not us. And I'm picking up our kids from camp right now, and we're getting out of here. With or without you.\n• Kelly's Heroes. In the beginning after they're done at the farmhouse, Kelly gives this line to Big Joe when Big Joe tells him to not tell the others about the gold. Kelly: Right well, you better fix up some transport papers for me, because I'm going. With ya, or without ya.\n• In Jurassic World, this is what Hoskins says to Owen re the plan to use his Velociraptors to help take down the Indominus. \"This is happening, with or without you.\"\n• In Tenacious D in The Pick of Destiny, Jables forces Kage to choose between 'tits or destiny', when the latter is tempted to stay and entertain a group of attractive women instead of continuing the search with the former for the eponymous pick.\n• Prison Break episode \"Under & Out\" Michael Scofield: As soon as the lights go out, I'm gone. With or without you.\n• Angel episode \"Redefinition\" Wesley Wyndam-Pryce: I thought you'd like to know that we're keeping the agency open. With or without you.\n• The Outcasts episode \"The Outcasts\" Jemal: With or without you, I'm going down there tonight.\n• The line is never explicitly used, but is strongly implied in Sister Wives during the conversation about Christine is against it, but Kody says that he has decided they have to do it and the other wives note that Christine has a choice about whether or not to join them.\n• Avril Lavigne's 'Nobody's Fool' is all about how the person being sung to is trying to hold the singer back. It gives us this line: If it's with or without you, I don't need you doubtin' me.\n• The A-Teens With Or Without You With or without you, \n\nI carry on... [snip] \n\nWith or without you, \n\nI'm moving on\n• U2's \"With or Without You\" uses the phrase and inverts the message. \"See the stone set in your eyes...see the thorn twist in your side... \"\n• Wicked has a heroic example in \"Defying Gravity\". Elphaba doesn't use the exact phrase, but she makes it clear to Glinda that she's going up against the Wizard, with or without her best friend.\n• In Ace Combat: Assault Horizon, when General Stagleishov objects to the operation that Warwolf squadron has formulated, William Bishop responds in kind. Stagleishov: Russian planes will not attack these ruins. This would be an international outrage! \n\nBishop: We can do it with, or without the \n\nStagleishov storms off. \n\nGutierrez: ...Guess that's without. : Russian planes will not attack these ruins. This would be an international outrage!: We can do it with, or without the Mi Gs ! Your call, General.Stagleishov storms off.: ...Guess that's without.\n• In an episode of The Simpsons, Homer says that he is going to try to get a celebrity couple back together with or without Marge. (From memory) Marge: Fine then, do it without me. \n\nHomer: [sputters] : Fine then, do it without me.: [sputters] But I wanted to do it with you!", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/WithOrWithoutYou", "media_links": ["/pmwiki/pmwiki.php/Film/TheMexican", "/pmwiki/pmwiki.php/WesternAnimation/TheBraveLittleToaster", "/pmwiki/pmwiki.php/WesternAnimation/Up", "/pmwiki/pmwiki.php/Film/OnceUponATimeInAmerica", "/pmwiki/pmwiki.php/Film/TheInsider", "/pmwiki/pmwiki.php/Film/TheMexican", "/pmwiki/pmwiki.php/Film/TheStepfordWives", "/pmwiki/pmwiki.php/Film/KellysHeroes", "/pmwiki/pmwiki.php/Film/JurassicWorld", "/pmwiki/pmwiki.php/Film/TenaciousDInThePickOfDestiny", "/pmwiki/pmwiki.php/Series/PrisonBreak", "/pmwiki/pmwiki.php/Series/Angel", "/pmwiki/pmwiki.php/Music/AvrilLavigne", "/pmwiki/pmwiki.php/Music/ATeens", "/pmwiki/pmwiki.php/Music/U2", "/pmwiki/pmwiki.php/Theatre/Wicked", "/pmwiki/pmwiki.php/VideoGame/AceCombatAssaultHorizon", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons"], "non_media_links": ["/pmwiki/pmwiki.php/Main/TheHeart", "/pmwiki/pmwiki.php/Main/WhatMeasureIsAMook", "/pmwiki/pmwiki.php/Main/UtopiaJustifiesTheMeans", "/pmwiki/pmwiki.php/Main/JumpingOffTheSlipperySlope", "/pmwiki/pmwiki.php/Main/TitleDrop", "/pmwiki/pmwiki.php/Main/StockPhrase", "/pmwiki/pmwiki.php/Main/TheDogBitesBack", "/pmwiki/pmwiki.php/Main/HoistByHisOwnPetard", "/pmwiki/pmwiki.php/Main/KarmicDeath", "/pmwiki/pmwiki.php/Main/SlidingScaleOfSillinessVersusSeriousness", "/pmwiki/pmwiki.php/Main/ChangedMyMindKid", "/pmwiki/pmwiki.php/Main/SourSupporter", "/pmwiki/pmwiki.php/Main/CantLiveWithThemCantLiveWithoutThem", "/pmwiki/pmwiki.php/Main/BankRobbery", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/Music", "/pmwiki/pmwiki.php/Main/ExactlyWhatItSaysOnTheTin", "https://www.youtube.com/watch?v=XmSdTa9kaiQ&ob=av3em", "/pmwiki/pmwiki.php/Main/MiGs", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/CloserToEarth", "/pmwiki/pmwiki.php/Main/SubvertedTrope"]}