{"title": "Power Cord Tail", "content": "One way of representing a mechanical or electric being is it having a power cord for a tail or a tail that can function like a power cord. Like a regular power cord, this tail can be plugged into an outlet, or any sort of suitable electrical source, to draw energy. Usually does not have the issue of Cut the Juice (at least depending on the amount of energy the being has and can hold), although Achilles' Power Cord may come into play.\n• Miss Kobayashi's Dragon Maid: Kanna Kamui can use her tail to plug into an outlet to get energy. She also can generate electricity.\n• Pokémon\n• Dedenne can use its tail to absorb electricity from power plants and electrical outlets.\n• Electivire has two tails that resemble electric wires.\n• Xurkitree is a collection of walking power cords, including its tail. It is known to plug itself to the ground to absorb energy.\n• Meltan is a blob of liquid metal with a hex nut for a head and an electric wire for a tail. Strangely enough it's not an Electric-type like the others here, instead being pure Steel. Its evolution Melmetal has the same type of tail, if less visible.\n• Raichu\u0092s tail is visually based on electrical cable, and Pokédex entries state it likes to use the tail as a grounding or to discharge excess electricity.\n• Plug-Oink from the unofficial Pokémon Quartz. They can also plug their tails into their noses (which are shaped like outlets).\n• BlazBlue: In a variant, Minerva, Celica's Robot Buddy, has a power cord as her \"ponytail\". It gets \"plugged\" to the ground whenever she's doing her stronger attacks.\n• Chibi-Robo! has an electrical plug tail he has to carry and plug into outlets to keep himself charged.\n• In Villainous Nights, Andi's Syndicate outfit includes a cat tail that functions as a data transfer cord. She plugs it into computers to steal data.\n• In The Brave Little Toaster, the main characters are household electric devices that are Animate Inanimate Objects seeking to reunite with their owner. The toaster has a power cord tail, as do his companions Blanky, Radio, Lampy and Kirby. They power themselves with an automotive battery, though how 120-volt appliances can run on 12 volts is unexplained. Lampy uses his power cord tail during a lightning storm in a Heroic Sacrifice to recharge this battery.\n• OK K.O.! Let's Be Heroes: Mikayla has a electric cord tail that she can she as a weapon.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/PowerCordTail", "media_links": ["/pmwiki/pmwiki.php/Manga/MissKobayashisDragonMaid", "/pmwiki/pmwiki.php/Franchise/Pokemon", "/pmwiki/pmwiki.php/VideoGame/PokemonQuartz", "/pmwiki/pmwiki.php/VideoGame/ChibiRobo", "/pmwiki/pmwiki.php/VisualNovel/VillainousNights", "/pmwiki/pmwiki.php/WesternAnimation/TheBraveLittleToaster", "/pmwiki/pmwiki.php/WesternAnimation/OKKOLetsBeHeroes"], "non_media_links": ["/pmwiki/pmwiki.php/Main/CutTheJuice", "/pmwiki/pmwiki.php/Main/AchillesPowerCord", "/pmwiki/pmwiki.php/Main/ShockAndAwe", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/MultipleTailedBeast", "/pmwiki/pmwiki.php/Videogame/BlazBlue", "/pmwiki/pmwiki.php/Main/RobotBuddy", "/pmwiki/pmwiki.php/Main/VisualNovels", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/AnimateInanimateObject", "/pmwiki/pmwiki.php/Main/HeroicSacrifice", "/pmwiki/pmwiki.php/Main/BewareMyStingerTail"]}