{"title": "Lazy Neutered Pet", "content": "It's an old myth that neutering your dog or cat will make it fat and lazy. This isn't true. While altering a pet can cause metabolism issuesnote This has even shown up in humans, as eunuchs were historically known to gain weight more easily., it's not always a major enough difference as this trope makes it seem. Overfeeding and not enough exercise are other common reasons for a pet gaining excessive weight.\n\nAlso, the obesity and lethargy that neutering can cause in real life is not to confused to the inaccurate lazy portrayal of castrated or companion animals in fiction.\n\nOne of the metabolic issues that castration and spaying causes is lethargy, which is an unnatural sort of low energy. Lethargy should not be confused with laziness however. Obesity is another effect of this endocrine disrupting procedure. In cats, this gonadal divestation (what spaying and neutering is) not only lowers metabolism, it increases appetite, which can result in them either having a hard time regulating their appetite or having an insatiable appetite. However, being fat doesn't equate to being lazy.\n\nIn fiction, however, spayed and neutered animals (but especially neutered ones) will usually end up chubby, lethargic, and lazy after the surgery. A previously energetic pet will suddenly just want to sit around all day. This trope is one of the top reasons why Animals Fear Neutering; they don't want to become lazy, fat, and lethargic like the others they've seen.\n\nSub-trope to Artistic License \u0096 Biology. Often the reason behind a Fat Cat and sometimes goes hand-in-hand with Cats Are Lazy.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/LazyNeuteredPet", "media_links": ["/pmwiki/pmwiki.php/Literature/TailchasersSong", "/pmwiki/pmwiki.php/Literature/WarriorCats", "/pmwiki/pmwiki.php/Literature/PetSematary", "/pmwiki/pmwiki.php/WesternAnimation/FamilyGuy", "/pmwiki/pmwiki.php/WesternAnimation/TheFairlyOddparents"], "non_media_links": ["/pmwiki/pmwiki.php/Main/AnimalsFearNeutering", "/pmwiki/pmwiki.php/Main/ArtisticLicenseBiology", "/pmwiki/pmwiki.php/Main/FatCat", "/pmwiki/pmwiki.php/Main/CatsAreLazy", "/pmwiki/pmwiki.php/Main/ProperLady", "/pmwiki/pmwiki.php/Main/FormerlyFit", "/pmwiki/pmwiki.php/Main/BigBeautifulWoman", "/pmwiki/pmwiki.php/Main/DidNotGetTheGirl", "/pmwiki/pmwiki.php/Main/FatCat", "http://smbc-comics.com/index.php?db=comics&id=2207#comic", "/pmwiki/pmwiki.php/WebComic/SaturdayMorningBreakfastCereal", "/pmwiki/pmwiki.php/UsefulNotes/CharlesDarwin", "/pmwiki/pmwiki.php/Main/CutawayGag", "/pmwiki/pmwiki.php/Recap/FamilyGuyS3E13ScrewedThePooch", "/pmwiki/pmwiki.php/Main/FreakyFridayFlip", "/pmwiki/pmwiki.php/Main/EmptyShell", "/pmwiki/pmwiki.php/Main/AnimalsFearNeutering"]}