{"title": "Alternate DVD Commentary", "content": "Apparently, Mystery Science Theater 3000 is really popular. With the advent of the DVD Commentary, many, many groups have sprung up to offer their insight onto some of the movies they love, or hate, or love to hate, or hate to love. Some do it much like the original... snarky commentary on bad movies. Some take their favorite movies and add snarky commentary. And some even do snarky commentary on television shows. Whatever the reason, they provide commentaries for your download and enjoyment.\n• RiffTrax (created by Mystery Science Theater 3000's Mike Nelson and co-starring fellow MST3K alumni Kevin Murphy and Bill Corbett, with guest riffers including Mary Jo Pehl [before Cinematic Titanic], Bridget Nelson and occasional celebrities) focuses on newer films and sells mp3s on iTunes and elsewhere to be played alongside the movie.\n• Cinematic Titanic (created by MST3K's Joel Hodgson and MST3K alumni Trace Beaulieu, J. Elvis Weinstein, Frank Conniff and Mary Jo Pehl) did this in live shows until they disbanded in 2013. However, DVDs are available.\n• Sharecrow, a program that synched up alternate commentaries to your DVD, was popular during the first few years of the alternate-commentary fad, but after a while it stopped being updated, then the domain registration expired.\n• Zarban.com , a database of Alternate DVD Commentaries. Most of the individual commentating groups on this page are linked to by Zarban, including many fan-submitted Rifftrax (you still have to pay for them).\n• Hey, Want To Watch A Movie? By a rotating group of podcasters and Podiobook authors.\n• Down In Front , a podcast which has less to do with snark and more to do with intelligent conversation about whatever film is the subject of that particular week, along with plenty of laughs and tidbits along the way. The creators and hosts are big fans of TV Tropes, and reference various tropes on nearly every episode.\n• The Worst Idea of All Time does a commentary for Grown Ups 2, in the guise of the films directors.\n• Back Row Chatter! commentary tracks go from snarky to analytical to tangential, depending on the film. During their Soul Plane episode, the commentators resort to talking about health foods in an attempt to avoid actually having to talk about the movie. The commentators repeatedly state that the podcast is meant to work just as well whether or not you're actually watching the movie.\n• A regular event at the Transformers convention Botcon is MSTF , where a trio of Big Name Fans riff on old Transformers episodes.\n• Most anime conventions have the \"Bad Anime, Bad!\" Panel where a few guests (and the entire audience) team up to rip the worst animation Japan has to offer to hilarious, bloody shreds. These panels are notoriously hard to get in to as they tend to fill up quickly.\n• Incognito Cinema Warriors XP is a series of these, with season one being full-length riffs on movies released to DVD and season two being riffs on short films being released online (with a feature-length season finale.)\n• Cinematic For The People A former local tv show, they post several episodes - complete movies with riffing and host segments - each year to their YouTube channel. They also apparently do live riffing at conventions, both scifi and anime.\n• You Got HaruhiRolled! has a short story where Fujiwara does this to a recruitment video made by Haruhi Suzumiya's SOS Brigade, where every character acts the opposite of how they do in the rest of the fic, let alone canon. It's a parody of Character Derailment.\n• A fan-made commentary track for The Castle of Cagliostro, and a second one is packaged with the Discotek Media DVD.\n• Patreon contributors to the '80s All Over podcast get access to bonus episodes of the show in the weeks between regular episodes. These include full-length commentaries from hosts Scott Weinberg and Drew McWeeney for particular favorite '80s films of theirs. So far, The Fog, Flash Gordon, Used Cars, Popeye, Time Bandits, Strange Brew, and The Dead Zone have been covered, allowing them to go into much more detail on the histories of the films and why they enjoy them than they can afford to give in regular episodes.\n• Broken Saints Chapter 19 Act 1 features a hidden audio track that basically consists of the creators goofing around making jokes about the episode and saying the lines in funny voices.\n• The DVD of The Incredibles includes Mr. Incredible and Pals, a spoof cheapo Clutch Cargo-esque cartoon with an optional commentary track by the \"real\" Mr. Incredible and Frozone, who are aghast at how bad it is.\n• The Pixar short \"Mike's New Car\" has a commentary track by a bunch of kindergarteners on the Pixar Shorts collection and a Monsters, Inc. DVD release.\n• Several films have commentaries from the actors... as their characters.\n• The DVD release of Bubba Ho Tep includes a commentary track from Bruce Campbell... as Elvis Presley.\n• The commentary track for Tropic Thunder had Robert Downey Jr..... AS Kirk Lazarus AS Lincoln Osiris (his character from the movie)... doubly hilarious, since Osiris!Lazarus himself claims in the movie proper that he doesn't drop character until after he's recorded the DVD commentary. Apparently he wasn't kidding.\n• The MGM versions of This Is Spın̈al Tap have commentary from Christopher Guest, Harry Shearer and Michael McKean as the band members they play, attacking director Marty DiBergi for the \"hatchet job\" he made of them.\n• Some releases of Space Jam have character commentary by Bugs Bunny and Daffy Duck.\n• The Matrix DVDs have commentaries from philosophers and movie critics instead of the cast and crew.\n• The first season of South Park was released without the already recorded commentary tracks due to issues that Warner Bros., the distributor, had with comments Trey Parker and Matt Stone made about WB properties. Comedy Central had CDs made as part of a mail-in offer as well as for those who ordered the set directly from them. The Blu-ray release by Paramount the Season 1 DVD came out when Comedy Central was a joint venture between Time Warner and Viacom, with WB handling home video for all CC programming. The former sold their stake to the latter in 2003, with Paramount taking the home video rights includes them.\n• During the Russell T. Davies era of Doctor Who episodes were accompanied by two different commentaries. One was a podcast available after the episode aired and the other being a regular DVD commentary. Sadly they stopped making the podcast commentaries and even the DVD commentaries aren't on every episode any more.\n• One of the commentaries on the Brother Bear DVD is by the moose brothers Rutt & Tuke, played by Rick Moranis and Dave Thomas. You even get MST-like silhouettes when they get up to answer the door for their pizza. Said pizza man then joins the commentary.\n• The DVD issues of the pre-1989 Doctor Who stories have a couple of examples. \"The Five Doctors\" had an Promoted Fanboy (and Fangirl) commentary by David Tennant, producer Phil Collinson, and writer Helen Raynor, and \"Survival\" had an alternate commentary on the final episode only by some fans who won a competition in Doctor Who Magazine.\n• Muppets from Space has commentary from the director, Gonzo, and Rizzo (with brief appearances by Kermit) complete with MST3K silhouettes. Comments run from the mundane to dream sequences being shot entirely inside someone's head.\n• One episode of The Boondocks TV show has commentary by Uncle Ruckus, a self-hating racist character.\n• One DVD release of Christmas Evil has a commentary track by John Waters.\n• The Deluxe Edition of Friday the 13th: The Final Chapter includes a fan commentary by Adam Green (Hatchet) and Joe Lynch (Wrong Turn 2: Dead End).\n• The Ghostbusters (1984) commentary track with Harold Ramis, Ivan Reitman and Joe Medjuk use an MST3K-style Shadowrama as well.\n• A bonus feature on the DVD of Mickey Donald Goofy The Three Musketeers has Mickey, Donald, Goofy and Pete doing commentary over a scene.\n• The commentary for Dungeons & Dragons: Wrath of the Dragon God is MST3K-style by three of the production team acting as three iconic D&D characters Jozan (Cleric), Lidda (Rogue), and Krusk (Barbarian).\n• The Rules of Attraction features a commentary track by Carrot Top, who has never seen the film before and cracks jokes throughout. This was intended as a meta-joke by the director.\n• The commentaries for My Little Pony: Equestria Girls \u0096 Rainbow Rocks and My Little Pony: Equestria Girls \u0096 Friendship Games are full of RiffTrax-like comments intended for the show's Periphery Demographic. Rainbow Rocks in particular has a Toilet Humor comment about some mystical green smoke (representing the \"negative energy\" the Sirens feed on) in the cafeteria, some Gag Dubs, Epileptic Trees, and suggestions for fan-made spinoffs.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/AlternateDVDCommentary", "media_links": ["/pmwiki/pmwiki.php/Series/MysteryScienceTheater3000", "/pmwiki/pmwiki.php/Series/MysteryScienceTheater3000", "/pmwiki/pmwiki.php/Film/HarryPotter", "/pmwiki/pmwiki.php/Film/SoulPlane", "/pmwiki/pmwiki.php/Franchise/Transformers", "/pmwiki/pmwiki.php/Website/YouTube", "/pmwiki/pmwiki.php/LightNovel/HaruhiSuzumiya", "/pmwiki/pmwiki.php/Anime/TheCastleOfCagliostro", "/pmwiki/pmwiki.php/Creator/DiscotekMedia", "/pmwiki/pmwiki.php/Film/TheFog", "/pmwiki/pmwiki.php/Film/FlashGordon", "/pmwiki/pmwiki.php/Film/Popeye", "/pmwiki/pmwiki.php/Film/TimeBandits", "/pmwiki/pmwiki.php/Film/StrangeBrew", "/pmwiki/pmwiki.php/Film/TheDeadZone", "/pmwiki/pmwiki.php/WesternAnimation/TheIncredibles", "/pmwiki/pmwiki.php/WesternAnimation/MrIncredibleAndPals", "/pmwiki/pmwiki.php/WesternAnimation/ClutchCargo", "/pmwiki/pmwiki.php/Creator/Pixar", "/pmwiki/pmwiki.php/WesternAnimation/MikesNewCar", "/pmwiki/pmwiki.php/WesternAnimation/MonstersInc", "/pmwiki/pmwiki.php/Film/BubbaHoTep", "/pmwiki/pmwiki.php/Creator/BruceCampbell", "/pmwiki/pmwiki.php/Music/ElvisPresley", "/pmwiki/pmwiki.php/Film/TropicThunder", "/pmwiki/pmwiki.php/Creator/RobertDowneyJr", "/pmwiki/pmwiki.php/Creator/MGM", "/pmwiki/pmwiki.php/Film/ThisIsSpinalTap", "/pmwiki/pmwiki.php/Creator/ChristopherGuest", "/pmwiki/pmwiki.php/Creator/HarryShearer", "/pmwiki/pmwiki.php/Film/SpaceJam", "/pmwiki/pmwiki.php/WesternAnimation/BugsBunny", "/pmwiki/pmwiki.php/WesternAnimation/DaffyDuck", "/pmwiki/pmwiki.php/Film/TheMatrix", "/pmwiki/pmwiki.php/WesternAnimation/SouthPark", "/pmwiki/pmwiki.php/Creator/WarnerBros", "/pmwiki/pmwiki.php/Creator/TreyParkerAndMattStone", "/pmwiki/pmwiki.php/Creator/ComedyCentral", "/pmwiki/pmwiki.php/Creator/RussellTDavies", "/pmwiki/pmwiki.php/Series/DoctorWho", "/pmwiki/pmwiki.php/Disney/BrotherBear", "/pmwiki/pmwiki.php/Creator/RickMoranis", "/pmwiki/pmwiki.php/Creator/DavidTennant", "/pmwiki/pmwiki.php/Film/MuppetsFromSpace", "/pmwiki/pmwiki.php/WesternAnimation/TheBoondocks", "/pmwiki/pmwiki.php/Film/ChristmasEvil", "/pmwiki/pmwiki.php/Creator/JohnWaters", "/pmwiki/pmwiki.php/Film/FridayThe13thTheFinalChapter", "/pmwiki/pmwiki.php/Film/Hatchet", "/pmwiki/pmwiki.php/Film/WrongTurn2DeadEnd", "/pmwiki/pmwiki.php/Film/Ghostbusters1984", "/pmwiki/pmwiki.php/Disney/MickeyDonaldGoofyTheThreeMusketeers", "/pmwiki/pmwiki.php/Film/DungeonsAndDragonsWrathOfTheDragonGod", "/pmwiki/pmwiki.php/Film/TheRulesOfAttraction", "/pmwiki/pmwiki.php/Creator/CarrotTop", "/pmwiki/pmwiki.php/WesternAnimation/MyLittlePonyEquestriaGirlsRainbowRocks", "/pmwiki/pmwiki.php/WesternAnimation/MyLittlePonyEquestriaGirlsFriendshipGames"], "non_media_links": ["/pmwiki/pmwiki.php/Main/DVDCommentary", "/pmwiki/pmwiki.php/SugarWiki/GushingAboutShowsYouLike", "/pmwiki/pmwiki.php/Administrivia/ComplainingAboutShowsYouDontLike", "/pmwiki/pmwiki.php/Main/Hatedom", "/pmwiki/pmwiki.php/Main/GuiltyPleasures", "/pmwiki/pmwiki.php/Main/LetsPlay", "/pmwiki/pmwiki.php/Podcast/RiffTrax", "/pmwiki/pmwiki.php/WebVideo/CinematicTitanic", "/pmwiki/pmwiki.php/WebVideo/CinematicTitanic", "http://www.filmpigs.com", "http://www.spoilerspodcast.com", "http://www.zarban.com", "http://www.illegal-art.org/video/wizard.html", "http://watchamovie.libsyn.com/", "http://downinfront.net/", "/pmwiki/pmwiki.php/Wiki/TVTropes", "/pmwiki/pmwiki.php/Podcast/TheWorstIdeaOfAllTime", "https://itun.es/i6625Tn", "http://tfwiki.net/wiki/MSTF", "/pmwiki/pmwiki.php/Main/BigNameFan", "/pmwiki/pmwiki.php/WebVideo/IncognitoCinemaWarriorsXP", "/pmwiki/pmwiki.php/Podcast/DVDPodblast", "http://www.cftp.us/", "/pmwiki/pmwiki.php/FanFic/YouGotHaruhiRolled", "/pmwiki/pmwiki.php/Main/CharacterDerailment", "https://terrania.us/2017/06/15/cagliostro-redux/", "/pmwiki/pmwiki.php/Podcast/EightiesAllOver", "/pmwiki/pmwiki.php/WebVideo/CommentaryTheMusical", "/pmwiki/pmwiki.php/WebVideo/DoctorHorriblesSingALongBlog", "/pmwiki/pmwiki.php/WebAnimation/BrokenSaints", "/pmwiki/pmwiki.php/Main/PromotedFanboy", "/pmwiki/pmwiki.php/Magazine/DoctorWhoMagazine", "/pmwiki/pmwiki.php/Podcast/RiffTrax", "/pmwiki/pmwiki.php/Main/PeripheryDemographic", "/pmwiki/pmwiki.php/Main/ToiletHumor", "/pmwiki/pmwiki.php/Main/GagDub", "/pmwiki/pmwiki.php/Main/EpilepticTrees"]}