{"title": "Revealing Skill", "content": "A Disguise Trope. The Secret Identity of a character is revealed when the character carelessly exhibits a rare skill that they are known to possess.\n\nThe skill in question is not necessarily exclusive to the character, just rare enough to set them apart from the crowd.\n\nThe distinct characteristic of this trope is that there is no moral dilemma; the character is just acting carelessly. If, on the other hand, the character must risk drawing attention to themselves in order to achieve an important goal, like getting out of a dangerous situation, it's a Cover-Blowing Superpower. If the character in question is a doctor, it's Inconvenient Hippocratic Oath. If the skill is part of their fighting style, see Fighting Fingerprint. If the character is unaware of the revealed identity, see Amnesiac Resonance.\n\nBonus if the character is thought, by the characters or the audience, to be powerless or even dead. In this case, the revealing skill is a preamble for a \"He\u0092s Back\" moment.\n\nCompare and contrast I Never Said It Was Poison, where the character's identity is revealed when he inadvertently reveals he has specific knowledge only he would have access to.\n\nSee also Something Only They Would Say where a particular character trait gives the person's identity away instead of a unique skill. I Am Not Left-Handed is when their level of skill is being hidden due to an intentional handicap.\n• Attack on Titan: Ymir casually reads the labels on some canned food, even though nobody else understands the language. This outs her as not being native to the Walls.\n• A Running Gag in early Kyle Rayner Green Lantern was that pretty much anyone who was familiar with Kyle's artwork instantly recognised the design ethos of the new Lantern's costume.\n• In the backstory of the third Robin (Tim Drake), this is how he learned the secret identities of Batman and Robin (Dick Grayson): by watching news coverage of B&R's escapades, during which Robin performed a complicated gymnastics move — which it had been established could be performed only a handful of people around the world - out of whom the only one local to Gotham was orphaned circus artist Dick Grayson.\n• Similarly, in \"Under the Hood\" and the animated film based on it, Batman: Under the Red Hood, the identity of the eponymous Red Hood is revealed to Batman when he performs a certain maneuver he'd previously seen performed by .\n• In the Miraculous Ladybug fic , the class plays dodgeball, and suddenly, without even realising it, Marinette and Adrien switch to their practiced Back-to-Back Badasses routine, obliterating everyone else as a result. Luckily, they are the only ones to put two and two together... until Alya finds them suddenly being cozy with each other suspicious, and looks up footage from a recent battle.\n• In , members of the Vale Secret Service or Atlas Special Forces are trained to fight with different weapons than their civilian identities to avoid being identified by their fighting style. For similar reasons, any flashy Semblances, particularly unusual ones, aren't to be used. Jaune slips up during a spar when he uses one of his opponent's daggers far more skillfully than his own sword and shield.\n• In Crouching Tiger, Hidden Dragon, Shu Lien suspected that the governor's daughter Jen was more than she claimed to be, and had martial arts training. Shu Lien confirmed these suspicions by deliberately dropping a tea cup—Jen caught it in midair and returned it to the table, without spilling a single drop.\n• In The Long Kiss Goodnight, the protagonist is a sweet innocent soccer mom with a memory loss - she hurt her head five years ago, and her entire life before that is forgotten. Shortly after the start of the movie, she has an auto accident, hits her head, and is suddenly creepily good with daggers. She says that she must have been a chef before the accident, but it's undeniable that she as well as her family have received the first clue that she was really an assassin.\n• An Invoked Trope in the Burt Reynolds movie Malone (1987). Suspecting that Malone is a Professional Killer, the villains give a gun to the brother of a man he beat up and send him to confront Malone to see what will happen.\n• Invoked Trope in The Man from U.N.C.L.E. (2015). Two thugs are sent to rob Gaby Teller and her 'fiance' Illya Kuryakin to see if he really is a harmless civilian. After they goad him for a bit, Illya beats one of them up. When called on this, Illya retorts that any Russian would have done the same, and it would be more suspicious if he didn't. They'd expect a KBG agent to kill the guy.\n• After RoboCop outperforms everyone at the firing range in RoboCop (1987), Lewis notices him twirl his Auto-9 before holstering it. Alex Murphy had been doing that in imitation of a TV hero his son watched.\n• Two examples in the stinger of The Wolverine. The metal stuff flying to the air announces, for those who realize things quickly, that Magneto is back and with his power restored. The people frozen in their tracks, a stunt from X Men 2 , announce that Xavier is alive again.\n• Justice League (2017). Bruce Wayne turns up in Barry Allen's secret hideout to recruit him for the League. Barry is giving some Blatant Lies that he's not a superhero (his heat and abrasion-resistant costume is for competitive ice skating) so Bruce just chucks a batarang at his face, fulfiling the dual purpose of making The Flash reveal his powers while revealing his own Secret Identity as Batman.\n• Once tempted into the belly of the beast(s) by virtue of an archery contest with a kiss by his beloved as first prize, Robin Hood can't resist being a little too good for his own good...\n• In Pirates of the Caribbean: On Stranger Tides, Jack Sparrow recognizes Angelica due to a particular sword fighting technique she uses that's apparently unique to her.\n• Able Team. While traveling with a truckload of drunken soldiers in Guatemala, an equally drunk Carl Lyons is handed a Galil assault rifle and invited to shoot a stray dog. Instead of snap aiming and jerking the trigger, Lyons flips up the tritium night sights, aims carefully and kills the dog with a single shot, then puts on the safety before handing back the weapon. The soldier's commander comments that Lyons is not the innocent American tourist he's claiming to be.\n• The Fourth Protocol. A man being followed by MI-5 gives himself away as an (incompetent) intelligence agent when he runs across the road and checks to see who's following him. No-one is, because one of the MI-5 Watchers is already on his side of the street.\n• A variation in Harry Potter and the Order of the Phoenix; Sirius Black accidentally reveals his presence in London when he accompanies Harry to the train station at the beginning of the year. He just wanted to get out of the house and have fun, but unfortunately the Malfoys know that he is an animagus who turns into a big, black shaggy dog...\n• In Harry Potter and the Deathly Hallows book, Harry is revealed when he uses the Disarming Charm — his signature move — against Stan Shunpike, an innocent victim being mind-controlled into aiding the Death Eaters. (Which is, of course, why he used the Disarming Charm rather than something more deadly.)\n• In the Inheritance Cycle, Eragon recognizes a Rider he's fighting as when he flourishes his sword in a certain way.\n• In Les Misérables, Valjean makes Javert suspicious when he exhibits a feat of strength similar to one he performed before he became a wanted fugitive.\n• In The Lord of the Rings, Frodo accidentally gives himself away at the Prancing Pony by using his ring to turn invisible.\n• In the seventh volume of The Unexplored Summon://Blood-Sign, Aoi plays with some children in a river, during which she squirts some water with her hands. Kyousuke notes to himself that there are multiple ways of doing that, with different regions having different variations of the technique. The one \"Aoi\" used is the same one Kyousuke taught to the White Queen . However, the end of the volume also reveals that the White Queen was planning on losing to Kyousuke the entire time, suggesting that she may have done this on purpose to reveal her identity .\n• In Kaizoku Sentai Gokaiger, Joe sees Barizorg perform a sword attack that his friend and mentor Sid Bammick had taught him years ago.\n• Person of Interest.\n• An Invoked Trope in \"Prisoner's Dilemma\". Agent Donnelly puts John Reese in with the other prisoners at Rikers Island, hoping that his military skills will be revealed when the other prisoners attack him. Reese has to take a beating just to maintain his cover identity (fortunately a Friendly Enemy is on hand to interrupt before things get fatal).\n• In Season 4, Reese has a fake identity as an NYPD detective. When called on to work as a tactical instructor, a woman working for Internal Affairs notices that he uses military tactics, despite not showing a military background in his file. Reese claims his first instructor was in the Gulf War, so he must have picked it up there.\n• Wiseguy. A woman Vinnie Terranova is dating realises he's an undercover fed because, among other clues, he remembered the license plate of their rental car. Police officers have good reason to memorize license plates, but not the professional criminal Vinnie is pretending to be.\n• In most versions of Robin Hood, his identity is revealed when he exhibits Improbable Aiming Skills at an archery contest.\n• As the myth goes, when Daedalus was in hiding, his identity was finally revealed when he solved the problem of passing a string through a sea shell, showing his rare intellect.\n• The Pokémon Zorua and Zoroark, both possessing an ability which disguises them as another of the trainer's Pokémon, can be recognized when they use moves that their disguise could not possibly learn. Optionally, you could just hit them. In addition to that, their Dark typing does not change, so their illusion can be revealed but not broken when this apparently not-Dark-type is left totally unaffected by a Psychic-type move.\n• The Mythic Dawn sleeper agents in The Elder Scrolls IV: Oblivion don't hesitate to summon up their distinctive magic armour whenever a fight breaks out.\n• When the Handmaidens inform the Exile that they noticed Atton Rand drop automatically into an Echani fighting stance, this gives the Exile the first hint that Atton is not the fool he pretends to be.\n• In Final Fantasy XIV, during the second expansion Stormblood, famed Kugane mercenary Yojimbo against the player during his first appearance in Kugane Castle. While it is easy to write off as the game designers just reusing old mechanics for a new fight, it actually foreshadows Yojimbo being none other Gilgamesh, the other boss known for using this skill .\n• Girl Genius. Gilgamesh Wulfenbach suspects that Agatha Heterodyne is a Spark, so puts her in a flying machine he hasn't got working yet and drops them out a trapdoor from a zeppelin. Faced with certain death, Agatha redesigns the entire engine on the spot. They nearly get killed twice, but hey...For Science!\n• Daughter of the Lilies: Teased at when Lyra asks Thistle how she can be reading a book in a dark cave. It's because and therefore has she's a cave elf and therefore has Innate Night Vision , but she avoids the question and the others don't make the connection.\n• Aang from Avatar: The Last Airbender inverts this with respect to Korra: while Korra usually reveals herself as the Avatar by bending more than one element, Aang most often blows his cover by reflexively airbending when he really shouldn't. As the last airbender, this immediately identifies him as the Avatar to both friends and foes. Of particular note is when he airbends in Fire Nation territory - they were the ones responsible for the genocide of his people in the first place, and they did it to get to him.\n• In one episode, he uses his airbending skill so Katara can pretend to be an earthbender. \"Conveniently\", she just happens to do this in front of Fire Nation soldiers who promptly arrest her and take her to the prison for earthbenders. Which is on a ship. In the middle of the ocean. And since Katara's a waterbender...\n• In The Waterbending Master, Zhao sees Zuko's dual dao swords, the weapon of the Blue Spirit. Zuko tries to claim that the swords are just a decoration and he doesn't know how to use them, but Zhao makes the connection, and attempts to have Zuko assassinated because of it.\n• In The Legend of Korra, the title character joins a pro-bending team, the Fire Ferrets, as their waterbender. During her first match though, she accidentally reveals herself to be the Avatar when she earthbends to block an opponent's attack.\n• Star Wars Rebels: \"Breaking Ranks\" reveals the Empire takes note of cadets who perform exceptionally well, and has them tested for potential Force-sensitivity so that they can be made into Inquisitors or made to serve the Empire in other ways. Notably, this is testing for a Revealing Skill that the tested don't even know they have.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/RevealingSkill", "media_links": ["/pmwiki/pmwiki.php/Manga/AttackOnTitan", "/pmwiki/pmwiki.php/ComicBook/Batman", "/pmwiki/pmwiki.php/ComicBook/Nightwing", "/pmwiki/pmwiki.php/WesternAnimation/BatmanUnderTheRedHood", "/pmwiki/pmwiki.php/WesternAnimation/MiraculousLadybug", "/pmwiki/pmwiki.php/Film/CrouchingTigerHiddenDragon", "/pmwiki/pmwiki.php/Film/TheLongKissGoodnight", "/pmwiki/pmwiki.php/Film/TheManFromUNCLE2015", "/pmwiki/pmwiki.php/Franchise/RoboCop", "/pmwiki/pmwiki.php/Film/RoboCop1987", "/pmwiki/pmwiki.php/Film/TheWolverine", "/pmwiki/pmwiki.php/Film/XMen2", "/pmwiki/pmwiki.php/Film/JusticeLeague2017", "/pmwiki/pmwiki.php/Franchise/TheFlash", "/pmwiki/pmwiki.php/Franchise/Batman", "/pmwiki/pmwiki.php/Disney/RobinHood", "/pmwiki/pmwiki.php/Film/PiratesOfTheCaribbeanOnStrangerTides", "/pmwiki/pmwiki.php/Literature/AbleTeam", "/pmwiki/pmwiki.php/Literature/TheFourthProtocol", "/pmwiki/pmwiki.php/Literature/HarryPotterAndTheOrderOfThePhoenix", "/pmwiki/pmwiki.php/Literature/HarryPotterAndTheDeathlyHallows", "/pmwiki/pmwiki.php/Literature/InheritanceCycle", "/pmwiki/pmwiki.php/Literature/LesMiserables", "/pmwiki/pmwiki.php/Literature/TheLordOfTheRings", "/pmwiki/pmwiki.php/LightNovel/TheUnexploredSummonBloodSign", "/pmwiki/pmwiki.php/Series/KaizokuSentaiGokaiger", "/pmwiki/pmwiki.php/Series/PersonOfInterest", "/pmwiki/pmwiki.php/Series/Wiseguy", "/pmwiki/pmwiki.php/Franchise/Pokemon", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsIVOblivion", "/pmwiki/pmwiki.php/VideoGame/KnightsOfTheOldRepublic", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyXIV", "/pmwiki/pmwiki.php/Webcomic/GirlGenius", "/pmwiki/pmwiki.php/Webcomic/DaughterOfTheLilies", "/pmwiki/pmwiki.php/WesternAnimation/AvatarTheLastAirbender", "/pmwiki/pmwiki.php/WesternAnimation/TheLegendOfKorra", "/pmwiki/pmwiki.php/WesternAnimation/StarWarsRebels"], "non_media_links": ["/pmwiki/pmwiki.php/Main/DisguiseTropes", "/pmwiki/pmwiki.php/Main/SecretIdentity", "/pmwiki/pmwiki.php/Main/CoverBlowingSuperpower", "/pmwiki/pmwiki.php/Main/InconvenientHippocraticOath", "/pmwiki/pmwiki.php/Main/FightingFingerprint", "/pmwiki/pmwiki.php/Main/AmnesiacResonance", "/pmwiki/pmwiki.php/Main/HesBack", "/pmwiki/pmwiki.php/Main/INeverSaidItWasPoison", "/pmwiki/pmwiki.php/Main/SomethingOnlyTheyWouldSay", "/pmwiki/pmwiki.php/Main/IAmNotLeftHanded", "/pmwiki/pmwiki.php/Main/ComicBooks", "/pmwiki/pmwiki.php/Main/RunningGag", "/pmwiki/pmwiki.php/Comicbook/GreenLantern", "/pmwiki/pmwiki.php/Comicbook/RobinSeries", "/pmwiki/pmwiki.php/Main/Fanfic", "https://archiveofourown.org/works/5462420/chapters/12627611", "/pmwiki/pmwiki.php/Main/BackToBackBadasses", "https://www.fanfiction.net/s/12574905/1/In-the-Kingdom-s-Service", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/InvokedTrope", "/pmwiki/pmwiki.php/Main/ProfessionalKiller", "/pmwiki/pmwiki.php/Main/InvokedTrope", "/pmwiki/pmwiki.php/Main/UndercoverAsLovers", "/pmwiki/pmwiki.php/Main/MotherRussiaMakesYouStrong", "/pmwiki/pmwiki.php/Main/TrespassingToTalk", "/pmwiki/pmwiki.php/Main/BlatantLies", "/pmwiki/pmwiki.php/Main/SecretIdentity", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/InvokedTrope", "/pmwiki/pmwiki.php/Main/FriendlyEnemy", "/pmwiki/pmwiki.php/Main/CoverIdentityAnomaly", "/pmwiki/pmwiki.php/Main/RobinHood", "/pmwiki/pmwiki.php/Main/ImprobableAimingSkills", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/PaperThinDisguise", "/pmwiki/pmwiki.php/Main/MadScientist", "/pmwiki/pmwiki.php/Main/GadgeteerGenius", "/pmwiki/pmwiki.php/Main/ForScience", "http://www.daughterofthelilies.com/dotl/821", "/pmwiki/pmwiki.php/Main/TokenHeroicOrc", "/pmwiki/pmwiki.php/Main/InnateNightVision", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/LastOfHisKind", "/pmwiki/pmwiki.php/Main/GenocideBackfire", "/pmwiki/pmwiki.php/Recap/StarWarsRebelsS1E04BreakingRanks"]}