{"title": "HA HA HA\u0097 No", "content": "\n• The Simpsons\n• The episode \"The Bart Wants What it Wants\" has this: Ranier: Bart, your little tie makes me smile. \n\nBart: Excuse me, but you don't sound as tough as you do in the movies. \n\nRanier: [threatening] If you don't shut your big yap, I will rip off your face and use it as a napkin. \n\n[pause, and then everyone laughs] \n\nRanier: [serious again] Laughing time is over. Homer: OK son, just remember to have fun out there today. And if you lose, I'll kill you! \n\n[everyone laughs] \n\nBart: [good-humored] Oh, Dad. \n\nHomer: [looks menacingly at Bart] \n\nBart: [cringes]\n• Also from the episode where Homer becomes sanitation commissioner, and has to deal with (actually, ignore) the garbage crisis: Homer is about to leave Moe's Tavern. When Moe asks him to pay for his drinks, Homer says his campaign catchphrase: \"Can't someone else do it?.\" Moe laughs, amused. Homer starts to walk out. Moe cocks his shotgun: \"Seriously, give me the money.\"\n• Inverted in the episode The Springfield Connection: Marge tells Chief Wiggum that she wants to join the police force. He answers with roaring laughter, seemingly implying that the concept of a female police officer is just ridiculous for him - then his laughing abruptly stops and he welcomes her to the team. And at the end if the episode, this scene gets a reprise, but now with Marge's request to quit her police job.\n• In the Cold Opening to one of the Halloween episodes, a Fox censor is going over the episode's script, erasing the parts he considers inappropiate. At one point, he laughs at a particularly funny part - before censoring with a \"No\".\n• In the last episode of Titan Maximum, Jodi is held captive by extremely sarcastic guards. Jodi: Please, you have to let me go! Guard 1: (chipper) Yeah, we could do that, but (dead serious) yeah, we're not gonna do that.\n• At the end of the first episode of Teenage Mutant Ninja Turtles (2012) cartoon, in answer to Leonardo's confusion over why he was so sure in choosing him as the team's leader, Master Splinter asserts that as leader, he will learn that there are no right and wrong answers, only \"choices\". Leonardo: So you could have chosen any of us? Splinter: No-ho-ho-ho... that would have been wrong.\n• Code Lyoko: Odd: Oh, come on, relax, Yumi. After all, you gotta admit, the photo thing was funny, wasn\u0092t it? Yumi: (angry about an embarrassing picture being posted in the paper) Hahaha, no!\n• Star Wars Rebels: Hera: So, what's in it for you two? \n\nHondo: Riches untold. That sort of thing. \n\nZeb: So, we'll split the treasure? \n\nHondo: Ho ho ho ho ho ho ho ho ho ho ho ho! Split the treasure, that's a classic.\n• On Care Bears & Cousins, in \"Beastly Bungalow,\" after Beastly agrees to come back and work Harmony's Share Shack, he asks if he can be in charge and they can change the name to the Beastly Bungalow. Share: (giggles) ...No. But you get to hang out with everybody and make delicious treats. Okay?\n• SpongeBob SquarePants:\n• In \"Plankton!\", Squidward does this on SpongeBob's french preparation of the krabby patty and pulling it out from his nose. SpongeBob: (pulling the Krabby Patty under Squidward's nose) It's under your nose! (he laughs and gives the patty to Squidward) \n\nSquidward: Ha, ha, ha, ha, ha. You're killing me SpongeBob! Ha ha ha ha. (he changes back to his frown expression) (pulling the Krabby Patty under Squidward's nose) It's under your nose! (he laughs and gives the patty to Squidward)Ha, ha, ha, ha, ha. You're killing me SpongeBob! Ha ha ha ha. (he changes back to his frown expression) You really are.\n• In \"Wishing You Well\", Mrs. Puff wishes for a new snazzy boat to drive. When she does get it, SpongeBob compliments her new boat. SpongeBob How's about you let me take her for a little spin?\n• The Amazing World of Gumball: During The Uploads, one of the videos watched is Tobias playing a prank on his father at 5 AM that made his family think they were being robbed. This is the reaction when he reveals it was all a prank: Harold: ...Of course! Well, this makes this terrible ordeal funny all of a sudden, hahahahah! I thought my family was in mortal danger, but it wasn't! Hahahahaha-you're grounded.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/HahahaNo", "media_links": ["/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/WesternAnimation/Futurama", "/pmwiki/pmwiki.php/WesternAnimation/ThePowerpuffGirls", "/pmwiki/pmwiki.php/WesternAnimation/SamuraiJack", "/pmwiki/pmwiki.php/WesternAnimation/AquaTeenHungerForce", "/pmwiki/pmwiki.php/WesternAnimation/AdventureTime", "/pmwiki/pmwiki.php/WesternAnimation/ScoobyDooMysteryIncorporated", "/pmwiki/pmwiki.php/WesternAnimation/RockosModernLife", "/pmwiki/pmwiki.php/WesternAnimation/TheGrimAdventuresOfBillyAndMandy", "/pmwiki/pmwiki.php/WesternAnimation/RegularShow", "/pmwiki/pmwiki.php/WesternAnimation/TitanMaximum", "/pmwiki/pmwiki.php/WesternAnimation/TeenageMutantNinjaTurtles2012", "/pmwiki/pmwiki.php/WesternAnimation/CodeLyoko", "/pmwiki/pmwiki.php/WesternAnimation/StarWarsRebels", "/pmwiki/pmwiki.php/WesternAnimation/CareBearsAndCousins", "/pmwiki/pmwiki.php/WesternAnimation/SpongeBobSquarePants", "/pmwiki/pmwiki.php/WesternAnimation/TheAmazingWorldOfGumball", "/pmwiki/pmwiki.php/WesternAnimation/JohnnyBravo", "/pmwiki/pmwiki.php/WesternAnimation/BatmanTheAnimatedSeries"], "non_media_links": ["/pmwiki/pmwiki.php/Main/ColdOpening", "/pmwiki/pmwiki.php/Main/BitingTheHandHumor", "/pmwiki/pmwiki.php/Main/Beat", "/pmwiki/pmwiki.php/Main/EasyImpersonation", "/pmwiki/pmwiki.php/Main/SoOnceAgainTheDayIsSaved", "/pmwiki/pmwiki.php/Main/NoGoodDeedGoesUnpunished", "/pmwiki/pmwiki.php/Main/NoIndoorVoice", "/pmwiki/pmwiki.php/Main/LaughingMad", "https://www.youtube.com/watch?v=l8GafboRjmI", "/pmwiki/pmwiki.php/Main/SuperHero", "/pmwiki/pmwiki.php/Main/MerchandiseDriven", "/pmwiki/pmwiki.php/Main/SociopathicHero", "/pmwiki/pmwiki.php/Main/AnAesop", "/pmwiki/pmwiki.php/Main/CloudCuckoolander", "/pmwiki/pmwiki.php/Main/DeadpanSnarker", "/pmwiki/pmwiki.php/Main/OverlyLongGag", "/pmwiki/pmwiki.php/Main/EvilLaughter"]}