{"title": "Just Pennies a Day", "content": "An advertiser's gimmick, designed to make expensive items or services seem cheap.\n\nThe beauty of this method is that it can make expensive items seem inexpensive while meeting Truth in Advertising Laws. \"You can feed a child in Darkest Africa for less than a can of soda a day!\" And it's true. But the charity wants the payments a month at a time; and $1.50 per day just goes by so much more quietly than $46.50 all at once. (In the UK, the Darkest Africa example is famously and memetically \"just two pounds a month\", and such appeals are often parodied).\n\nOften used with items such as computers, charitable donations, or PBS stations. Popular with the charities because, even if you do realize this'll add up, a few pennies a day isn't much, and you'll likely spend them anyway - why not on something that'll make the world a better place?\n\nAlso popular with objects that are supposed to save more in the long run than the extra initial cost.\n\nGym payment plans are often structured around this kind of thing, but in reverse. $365 a year sounds so much better as \"a dollar a workout\" (if you even go to the gym every day — and they don't suddenly charge you any less if you don't).\n\nOften seen in similar contexts to Four Equal Payments of. In some ways, this is crueler than advertising the installment plan.\n\nAlso compare and contrast Crack Is Cheaper. Despite the name, it's not actually paying for it in pennies.\n• This is especially prevalent in charity advertising. For sixty cents a day (less than you pay for your coffee, you heartless bastard!) you could save the life of this child/puppy/mentally challenged panda. It sounds like a pittance until you realize that you're agreeing to have thirty dollars taken out of your account every month. Of course, unless you literally have zero income, that is still a pittance, they just made it more digestible.\n• On this very site, an ad for Doctors Without Borders: \"25 cents a day can help Doctors Without Borders give emergency care to those who need it most.\" Of course, you need to pay for at least a month at a time. Though it might be argued that $90.50 a year ($90.75 in a leap year) is still a pretty good bargain if it achieves what it claims, when a single coffee a day will probably set you back over $700 during that time!\n• Parodied in a letter to British comic Viz - \"A donation of just £2 a month supplies an African village with water says my water company, yet they charge me £10 a week, the robbing sods\"\n• ThermoSpa hottubs say that you can own a hottub for about $1.50 a day. That may be true, but there's still the big upfront fee associated with buying the hottub (especially one with all the bells and whistles), no matter how low-maintenance it might be.\n• The UK's television licensing authority likes to use this one as well.\n• Played with in an episode of The Office. Michael Scott buys an insurance policy that is \"...only a cup of coffee an hour.\"\n• The flip side of \"Save hundreds a year!\" When the advertised product costs money, the sum is divided into the smallest possible units, even when it cannot be paid for that way. (Pennies a day, billed monthly.) When the product saves money, the sum is totaled for an entire year— again, even when the payment cannot be annual. (Save hundreds a year on your monthly bill.)\n• Politicians are fond of this one. Some change they are proposing will generate revenue or savings of X billions of dollars — over 10 years.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/JustPenniesADay", "media_links": ["/pmwiki/pmwiki.php/ComicBook/Viz"], "non_media_links": ["/pmwiki/pmwiki.php/Main/DarkestAfrica", "/pmwiki/pmwiki.php/Main/DarkestAfrica", "/pmwiki/pmwiki.php/Main/ViewersLikeYou", "/pmwiki/pmwiki.php/Main/FourEqualPaymentsOf", "/pmwiki/pmwiki.php/Main/CrackIsCheaper", "/pmwiki/pmwiki.php/JustForFun/IThoughtItMeant", "/pmwiki/pmwiki.php/Main/PayingInCoins", "/pmwiki/pmwiki.php/Main/InspirationallyDisadvantaged", "/pmwiki/pmwiki.php/Main/TropesAreNotBad"]}