{"title": "Gangsta Rap", "content": "\"Mama I aint going to school today wearing these same old clothes, Do you remember the look in her eye when she made you a meal and you didn't eat it, and all them tears she shed beside your bed over things that you needed, I still remember the way that I felt when I picked up a gun, I still remember the tears that I shed when my cousin was blasted with one, Do you remember the way that you felt when you walked out of prison, Or do you remember the pain that you felt from them sending you back for no reason\"\n\nOne of the most controversial genres of music, if not the most controversial, to ever hit the mainstream. To detractors, it's nothing but gratuitous profanity, glorification of violence, glorification of drug dealing and usage, homophobia, misogyny and grammatical inaccuracy. To fans and proprietors, it's catharsis.\n\nThe term Gangsta Rap actually came from the media not the artists themselves, though some have called the genre \"Reality Rap\", or prime time news in the form of rap music. The genre in its infancy even had shades of Conscious Hip Hop, and Political Rap. There's also a lot of issues with mislabeling. Quite a few rappers who didn't fall into the Alt rap, or indie scene were automatically placed under the umbrella term Gangsta rap. Usually cynically and unfairly. There's also debate going on about whether the genre is still alive and well in the mainstream, or is it deader than a horse. Some proponents feels that it died a long time ago, while opponents (usually alt/indie rap fans) think a watered down version is still very much active, and continuing the Uncle Tom Foolery, and the dumbing down of the genre.\n\nGangsta rap tends to appear in four flavors:\n• Blue Collar: The more down-to-earth, blue collar type. Usually raps about Real Life struggles, problems and horrors of their gang, poverty, and crime ridden inner city neighborhood in a realistic way. Topics generally fall in the Justified Criminal territory. Could also have urban morality tales, with socio-economic and political undertones. Sometimes told from an observer point of view. Is also usually anti-establishment and anti-authoritarian.\n• Commercial: The more commercial type, basically a polished, pseudo-hardcore, toned down version of Blue Collar and Hardcore. Keep in mind they still wanna sell records. Usually Overlaps with Glam Rap, and some music critics call this form Post Gangsta.\n• Hardcore: The darker, unapologetic, exaggerated, no-holds-barred, hardcore, drug pushing, psycho gangsta rap, sometimes bordering on Horrorcore. A Flanderization of Blue Collar in many cases. When Moral Guardians are talking about the immorality of the Gangsta Rap genre, this is usually the type they have in mind.\n• Mafioso: Mafioso rap, gangsta rap which is more akin to romanticized mafioso films and organized crime, than typical gang violence.\n\nSee Trap Music where gangsta is stripped to the bare essentials of just a good beat and gangsta cliches.\n\nSee Horrorcore, which is when you take gangsta rap and add gory lyrics akin to Death Metal.\n\nAfter the genre had been around for two decades, many of the rappers who were making hard-hitting Blue Collar albums have softened as they reached their 30s and 40s. Many of them became parents, dramatically changing their opinions on violence and profanity, with many taking up Rated G for Gangsta projects (looking at you, Ice Cube). There are, however, exceptions (Tech N9ne, for example).\n• 2pac: Blue Collar, with shades of Commercial and Hardcore.\n• Me Against the World (1995)\n• All Eyez On Me (1996)\n• Above the Law: Blue Collar, with elements of Political Rap\n• Bone Thugs-n-Harmony: Their lyrics are definitely Blue Collar and Hardcore. As of recent mostly Blue Collar. But as far as tone goes their music varied though.\n• Clipse: Has elements of Blue Collar, Commercial, and Mafioso.\n• Cypress Hill: Hardcore, with an emphasis on their favorite plant.\n• Dizzee Rascal: A rudeboy take on Blue Collar. Some of his Boastful Rap tracks are Commercial.\n• Geto Boys: Blue Collar and Hardcore.\n• Scarface is purely Blue Collar nowadays, although he ventured into Hardcore early on (especially with his debut, Mr. Scarface Is Back).\n• Greyson And Jasun: Hardcore.Their debut album \"Sweatin' Me Wet\" was one of the many examples of violent East Coast hardcore/gangsta rap. What makes it more uncomfortable to listen to, is their apparent lack of remorse for their crimes described, although \"Livin like a Troopa\" was a morality tale.\n• Jay-Z: Mafioso in the beginning, but then delved into Commercial with shades of Blue Collar during the late-90's. In the early-2000's, he more-or-less moved away from Gangsta Rap in favor of traditional Glam Rap but briefly returned to it six years later on his concept album, American Gangster, where his style is Blue Collar and eventually a disillusioned version of Commercial.\n• Kendrick Lamar: Blue Collar in the most unglamorous sense on the first two thirds or so of good kid, m.A.A.d city.\n• Kool G Rap and DJ Polo: Blue Collar.\n• Kool G Rap on his own was pretty much the precursor for many of Mafioso gangsta rappers like AZ and Raekwon. Check his 1995 solo debut album \"4, 5, 6\", then the 1998 follow-up quasi-concept album \"Roots Of Evil\". Still an active artist, his rhymes now incorporate elements of Blue Collar, Hardcore, and Mafioso with Blue Collar being the most predominant.\n• Kool Moe Dee, arguably the originator of Blue Collar hardcore hip hop. his post How Ya Like Me Now albums took a Commercial approach while retaining his Blue Collar style.\n• MF Grimm: Blue Collar most of the time with a little bit of Hardcore. Mostly found in his concept album about a gangster gingerbread man.\n• Mobb Deep: Primarily Hardcore and Mafioso, with occasional touches of Commercial.\n• M.O.P: Purely Hardcore. In fact, one of their most popular songs is called: \"How about some Hardcore?\"\n• Nas is Blue Collar, although his second album is more Mafioso.\n• No Limit Records- The record label had artists that ran the gamut of all four types. Mostly Blue Collar and Hardcore though.\n• Master P himself was Blue Collar, Mafioso and Hardcore until he had a kid, then slid into Commercial, and eventually Glam Rap (along with the company). Some blamed this on the success of the more polished Cashmoney Records and that No-Limit was trying to copy them.\n• N.W.A.: Blue Collar (when Ice Cube was with them) and Hardcore.\n• Schoolly D: One of the pioneers of the genre. Ice-T credits his song \"P.S.K. (What The Hell Does That Mean\") as the first Gangsta Rap song.\n• Slick Rick: Hovers between Blue Collar and Commercial, though he's largely Blue Collar, as most of his songs tend to be fairly realistic.\n• Three 6 Mafia: Firmly in Hardcore early on. Later works lean towards Commercial.\n• Tweety Bird Loc: Hardcore. However, a lot of his songs are comical in nature more than about violence.\n• Vince Staples: Strictly Blue Collar, although he doesn't classify himself as a gangsta rapper.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/GangstaRap", "media_links": ["/pmwiki/pmwiki.php/Music/FiftyCent", "/pmwiki/pmwiki.php/Music/DaytonFamily", "/pmwiki/pmwiki.php/Film/AreWeThereYet", "/pmwiki/pmwiki.php/Music/IceCube", "/pmwiki/pmwiki.php/Music/TechN9ne", "/pmwiki/pmwiki.php/Music/TupacShakur", "/pmwiki/pmwiki.php/Music/TupacalypseNow", "/pmwiki/pmwiki.php/Music/Strictly4MyNiggaz", "/pmwiki/pmwiki.php/Music/MeAgainstTheWorld", "/pmwiki/pmwiki.php/Music/AllEyezOnMe", "/pmwiki/pmwiki.php/Music/AboveTheLaw", "/pmwiki/pmwiki.php/Music/AnybodyKilla", "/pmwiki/pmwiki.php/Music/BigL", "/pmwiki/pmwiki.php/Music/BlazeYaDeadHomie", "/pmwiki/pmwiki.php/Music/BoneThugsNHarmony", "/pmwiki/pmwiki.php/Music/BrothaLynchHung", "/pmwiki/pmwiki.php/Music/ChiefKeef", "/pmwiki/pmwiki.php/Music/CypressHill", "/pmwiki/pmwiki.php/Music/BlackSundayAlbum", "/pmwiki/pmwiki.php/Music/DaytonFamily", "/pmwiki/pmwiki.php/Music/Dice", "/pmwiki/pmwiki.php/Music/DJQuik", "/pmwiki/pmwiki.php/Music/DrDre", "/pmwiki/pmwiki.php/Music/EazyE", "/pmwiki/pmwiki.php/Music/Esham", "/pmwiki/pmwiki.php/Music/GetoBoys", "/pmwiki/pmwiki.php/Music/GreysonAndJasun", "/pmwiki/pmwiki.php/Music/Gravediggaz", "/pmwiki/pmwiki.php/Music/IceCube", "/pmwiki/pmwiki.php/Music/IceT", "/pmwiki/pmwiki.php/Music/JayZ", "/pmwiki/pmwiki.php/Music/KendrickLamar", "/pmwiki/pmwiki.php/Music/GoodKidMAADCity", "/pmwiki/pmwiki.php/Music/KoolMoeDee", "/pmwiki/pmwiki.php/Music/KRSOne", "/pmwiki/pmwiki.php/Music/MFGrimm", "/pmwiki/pmwiki.php/Music/Nas", "/pmwiki/pmwiki.php/Music/MasterP", "/pmwiki/pmwiki.php/Music/TheNotoriousBIG", "/pmwiki/pmwiki.php/Music/ReadyToDie", "/pmwiki/pmwiki.php/Music/LifeAfterDeath", "/pmwiki/pmwiki.php/Music/NWA", "/pmwiki/pmwiki.php/Music/IceCube", "/pmwiki/pmwiki.php/Music/StraightOuttaCompton", "/pmwiki/pmwiki.php/Music/ProjectBorn", "/pmwiki/pmwiki.php/Music/PsychopathicRydas", "/pmwiki/pmwiki.php/Music/SchoolboyQ", "/pmwiki/pmwiki.php/Music/SchoollyD", "/pmwiki/pmwiki.php/Music/SchoollyDAlbum", "/pmwiki/pmwiki.php/Music/SaturdayNightTheAlbum", "/pmwiki/pmwiki.php/Music/SlickRick", "/pmwiki/pmwiki.php/Music/TheGreatAdventuresOfSlickRick", "/pmwiki/pmwiki.php/Music/SnoopDogg", "/pmwiki/pmwiki.php/Music/ThreeSixMafia", "/pmwiki/pmwiki.php/Music/WuTangClan"], "non_media_links": ["/pmwiki/pmwiki.php/Main/ClusterFBomb", "/pmwiki/pmwiki.php/Main/NWordPrivileges", "/pmwiki/pmwiki.php/Main/ArsonMurderAndJaywalking", "/pmwiki/pmwiki.php/Main/CatharsisFactor", "/pmwiki/pmwiki.php/Main/ConsciousHipHop", "/pmwiki/pmwiki.php/Main/PoliticalRap", "/pmwiki/pmwiki.php/Main/DeadHorseGenre", "/pmwiki/pmwiki.php/Main/UncleTomFoolery", "/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/Main/WretchedHive", "/pmwiki/pmwiki.php/Main/ViceCity", "/pmwiki/pmwiki.php/Main/JustifiedCriminal", "/pmwiki/pmwiki.php/Main/MysteriousWatcher", "/pmwiki/pmwiki.php/Main/LighterAndSofter", "/pmwiki/pmwiki.php/Main/GlamRap", "/pmwiki/pmwiki.php/Main/DarkerAndEdgier", "/pmwiki/pmwiki.php/Main/Horrorcore", "/pmwiki/pmwiki.php/Main/Flanderization", "/pmwiki/pmwiki.php/Main/MoralGuardians", "/pmwiki/pmwiki.php/Main/TrapMusic", "/pmwiki/pmwiki.php/Main/Horrorcore", "/pmwiki/pmwiki.php/Main/DeathMetal", "/pmwiki/pmwiki.php/Main/FormerTeenRebel", "/pmwiki/pmwiki.php/Main/RatedGForGangsta", "/pmwiki/pmwiki.php/Main/PoliticalRap", "/pmwiki/pmwiki.php/UsefulNotes/Marijuana", "/pmwiki/pmwiki.php/Main/BoastfulRap", "/pmwiki/pmwiki.php/Main/WantingIsBetterThanHaving", "/pmwiki/pmwiki.php/Main/SoMyKidsCanWatch", "/pmwiki/pmwiki.php/Main/GlamRap"]}