{"title": "Point of No Continues", "content": "So you're playing through a game, and let's face it — you haven't been doing great. Good thing you can continue — except during this part; usually this is near the end of the game. Here you can't continue nor can more players join in for you to bypass the inability to continue in the case of cooperative multiplayer titles, unfortunately.note You can tell this by the HUD instead of flashing \"INSERT COINS\" or \"PRESS START\" where applicable, \"GAME OVER\" would flash on that portion(s) of the screen. Instead, when you lose the game will be entirely over and all the progress you have made so far will be completely lost!\n\nMostly seen in Arcade Games where Continuing Is Painful by having any scores reset to 0, to stop players with lots of coins in their pockets from bribing their ways to victory by credit-feeding (and something of a Scrappy Mechanic for cabinet owners who would have liked to earn that extra revenue, apparently a way of gaming strongly hated by some development and publishing companiesnote more specifically Taito); in console games it simply makes them more serious business in their final stages. In all cases, it can also show up when facing the True Final Boss. If there's a long leg at the end of the game where you can continue, but doing so takes you all the way back to the start of the leg, that's just a form of Checkpoint Starvation.\n\nCompare Out of Continues, which can be invoked via this trope. But if a game has a Mode of No Continues, that falls under Final Death Mode.\n• Toe Jam And Earl: Once ToeJam and Earl run out of lives, the game is over. If the surviving character has at least two lives, he can put the other back in the game by giving up one of his.\n• Streets of Rage would disable player 2 from joining the game if player 1 reaches the final level. This was done to prevent solo players from cheating by continuing as player 2 if they used up all their continues as player 1.\n• Bloody Roar series:\n• In Bloody Roar 3, the player can continue as often as needed, up to the end boss, Xion. But if you manage to clear Arcade Mode without continuing, no rounds lost, and a total score of 750,000 or higher, you'll face the game's secret boss, Uranus, immediately after your bout with Xion. You only get one shot because losing to Uranus results in an automatic Game Over. So if you want a rematch, you'll have to start over from the beginning!\n• The final boss of Bloody Roar 4 will also cause your game to be over on a loss and is an even bigger SNK Boss than Uranus, unless you're using Uriko.\n• Guilty Gear XX:\n• Dizzy's story mode route diverges depending on whether the player wins or loses against one opponent: Boss Mode I-No.\n• In later updates starting with Slash, hidden boss Order-Sol gives you only one shot and you can't continue against him. Your game will be permanently over if you lose! (Though this actually doesn't count as a strike against the player; the game will merely progress to the staff roll that normally plays upon defeating I-No. It is also possible to make use of a second controller and interrupt the match if things are about to go south.)\n• Street Fighter series:\n• The original Street Fighter can place this anywhere, allow you to continue/be challenged by another human player even in Thailand (the final country) or entirely disable such abilities altogether through the machine's DIP switch settings.\n• The ability to continue is disabled when you get to face the final boss in Street Fighter Alpha 3; you even get a cutscene of Bison using your fighter to power the Psycho Drive should you lose against him (incidentally, it's also Bison's ending). If you're playing as Bison, you'll face Ryu instead, and losing will give you his ending.\n• In Street Fighter IV, losing to Akuma or Gouken in Arcade Mode causes your character's ending to play without offering a chance to retry. This extends to their Shin forms in Super, and to Evil Ryu and Oni (and their Shin forms) in Arcade Edition.\n• Cannon Dancer has a less severe example of this: normally continuing revives you right where you died with a full set of lives, but doing so in the final level which is a Boss Rush sends you back to the beginning of the level.\n• ESWAT in the Arcade silently disables continues and 2nd player join-ins in the Final Stage.\n• The Fairyland Story (the Ur-Example) does not begin to offer continues until you get past its first 7 Rounds... but once you reach that title's final 3 Rounds, it stops continues completely!\n• The arcade version of Shinobi denies you continuous play once the Final Mission begins.\n• You can't continue in Rastan once you reach its 6th and final Round.\n• Rainbow Islands only permits continuing past certain points (island 7 on the arcade original, island 5 on the PC version) if you collect the big brown book from the secret room on said island.\n• In the final segment of SegaSonic the Hedgehog's final level , continuing and having any more players join in is impossible.\n• Downplayed in Tiny Toon Adventures: Buster's Hidden Treasure, where continuing normally puts the player back at the map screen, with Buster's icon on the level they were in. During the final factory stages, if the player has to continue, then they are instead put back at the first factory, with any of the other three factories made unavailable again.\n• The arcade versions of Wonder Boy and its sequels disable continuing in their final stages. Worse, the second game's Sega Master System port removes continues entirely.\n• Downplayed in Toki. Regardless of how many quarters do you have handy; once you reach the final stage, the game limits the number of times you can continue to five before you finally lose the ability to credit-feed.\n• Once you reach World 9 in the original FDS version of Super Mario Bros.: The Lost Levels, you get reduced to only 1 life and you can no longer use the ability to continue should you lose! Downplayed in that you can still earn extra lives.\n• In RoadBlasters by Atari Games (not to be confused with \"Road Blaster\" by Data East ), if you can make it to the final rally, it simply tells you \"one chance\", indicating that you can't use continues at that point.\n• The original DJMax Technika allows you to continue from the beginning of the stage you failed if your Life Meter empties out... unless you're playing the last stage of Technical Mixing or are playing Platinum Crew mode, in which case you're immediately greeted with the Game Over screen. Later games prohibit continuing at all.\n• Touhou series:\n• Stage Final-B of Imperishable Night does this. Given that this is the True Final Boss' stage that can only be reached by not using any continues, this is both better (it only makes sense) and worse (good luck getting any practice) than usual. Exaggerated in that (instead of being given a chance to use a continue) you'll be given the Bad Ending if you lose all your lives after reaching that true final stage!\n• Extra Stages prevent continuing completely. Flandre in Embodiment of Scarlet Devil even breaks the fourth wall to lampshade this if you're playing as Marisa. This does mean that anyone who says they've cleared an Extra Stage did so on one credit, but it also means you can't use continues to practice, making learning Extra Stages and their bosses more difficult.\n• You can't continue nor can a second player join in once you get to one of the Final Zones in the original Darius, the Trope Codifier.\n• In the NES version of Ikari Warriors, players can resurrect themselves by pressing A-B-B-A. That cheat code is rendered unusable at the end of level 3.\n• The same cheat code can be used in the NES port of Ikari Warriors II: Victory Road, except that instead stops working once the final boss is reached.\n• The last level of Thunder Cross and its sequel do not allow any continues.\n• In Hellsinker, you have one continue; but you lose it after visiting the Shrine of Farewell.\n• After assembling the legendary Golden Warpship in Solar Jetman, you only get one chance to escape the last planet with the ship intact. If it gets shot down or crashes, your game will be over!\n• R-Type Final takes this Up to Eleven - You are given only one life and no continues at clearing Stage F-C. Be careful not to get hit, or your ship will explode and... Game Over!\n• Zigzagged in Salamander 2, which locks you out from continuing once you reach the second loop; a second player can still join in... up to until you clear the final stage again or lose all your lives, of course!\n• Forbidden Forest restarts the game completely if you lose against the Demogorgon at the end.\n• In Metal Gear Solid, if you die during the torture sequence, you can't continue. Ocelot even tells you \"there are no continues, my friend.\"\n• In Super Adventure Rockman, losing to Shadow Man and Gemini Man gives you no chance to continue.\n• The original Arkanoid is the Trope Maker.\n• You can't continue anymore once you reach Round 33, which houses DoH (the Final Boss); should you lose all your lives there, your game will be over instantly and for real even if there are credits available!\n• Odin is responsible for the battle-retrial function in SaGa 2. Once you defeat Odin, the battle-retrial function will be lost!\n• A downplayed variant occurs in Genpei Touma Den. Once you reach the halfway point where the path branches a second time, continuing, which previously allowed you to restart at the stage you died in, brings you back to the halfway point.\n• Pro Heists in PAYDAY 2 can't be retried or restarted. If your crew fails the heist, you go back to the lobby to choose a new contract.\n• Additionally, several heists have a \"Point of No Return\" near the end, which triggers an infinite police assault until you escape. Since you can't trade hostages to respawn in the middle of an assault, if you go into custody, you're there for good (unless you happen to have Stockholm Syndrome).\n• Tower stages in Elemental Story have no continues. Instead, players can access them again (for free after 24 hours) at the highest level which has been cleared before.\n• Dying while in the penultimate dungeon of Shin Megami Tensei IV: Apocalypse prevents you from continuing like in the rest of the game. Downplayed in that you can still save and load freely within the dungeon, so it becomes a matter of being diligent with saving.\n• Exaggerated in NAM-1975, which doesn't allow you to continue nor allows a 2nd player to join in once you reach the Final Boss and gives you the bad ending should you lose all your lives by that point!\n• In Target Terror, the last leg of the Hijacking mission warns you that you can't continue, though you can use credits to replenish your life meter.\n• The original Steel Gunner stops continues and second player join-ins completely once you reach the Final Boss; if you die against him, it'll be an instant and real Game Over for you!\n• NieR: Automata has two of these points, one at the very beginning of the game. Dying before defeating the first boss results in a Non-Standard Game Over and having to restart the entire game from the very beginning. After you defeat the first boss, however, you're finally given the chance to save, and allowed to resume play without reloading a save when you die, since the ability to do so is justified in-game by 2B and 9S uploading themselves into a spare body using their AI backup at the Bunker. This allows the player to retain their money and items, though they have to return to their corpse to retrieve their chips. Once the Bunker is destroyed early on in Route C/D, this option is no longer available, and dying results in a flat game-over and having to restore a previous save.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/PointOfNoContinues", "media_links": ["/pmwiki/pmwiki.php/Creator/Taito", "/pmwiki/pmwiki.php/VideoGame/ToeJamAndEarl", "/pmwiki/pmwiki.php/VideoGame/StreetsOfRage", "/pmwiki/pmwiki.php/VideoGame/BloodyRoar", "/pmwiki/pmwiki.php/VideoGame/GuiltyGear", "/pmwiki/pmwiki.php/Franchise/StreetFighter", "/pmwiki/pmwiki.php/VideoGame/StreetFighterI", "/pmwiki/pmwiki.php/VideoGame/StreetFighterI", "/pmwiki/pmwiki.php/VideoGame/StreetFighterAlpha", "/pmwiki/pmwiki.php/VideoGame/StreetFighterIV", "/pmwiki/pmwiki.php/VideoGame/CannonDancer", "/pmwiki/pmwiki.php/VideoGame/ESWAT", "/pmwiki/pmwiki.php/VideoGame/TheFairylandStory", "/pmwiki/pmwiki.php/VideoGame/Shinobi", "/pmwiki/pmwiki.php/VideoGame/RainbowIslands", "/pmwiki/pmwiki.php/VideoGame/SegaSonicTheHedgehog", "/pmwiki/pmwiki.php/VideoGame/TinyToonAdventuresBustersHiddenTreasure", "/pmwiki/pmwiki.php/VideoGame/WonderBoy1", "/pmwiki/pmwiki.php/VideoGame/WonderBoyInMonsterLand", "/pmwiki/pmwiki.php/VideoGame/WonderBoyIIIMonsterLair", "/pmwiki/pmwiki.php/VideoGame/Toki", "/pmwiki/pmwiki.php/VideoGame/SuperMarioBrosTheLostLevels", "/pmwiki/pmwiki.php/VideoGame/DJMAXTechnika", "/pmwiki/pmwiki.php/VideoGame/Touhou", "/pmwiki/pmwiki.php/VideoGame/Darius", "/pmwiki/pmwiki.php/VideoGame/IkariWarriors", "/pmwiki/pmwiki.php/VideoGame/ThunderCross", "/pmwiki/pmwiki.php/VideoGame/Hellsinker", "/pmwiki/pmwiki.php/VideoGame/SolarJetman", "/pmwiki/pmwiki.php/VideoGame/RType", "/pmwiki/pmwiki.php/VideoGame/Gradius", "/pmwiki/pmwiki.php/VideoGame/ForbiddenForest", "/pmwiki/pmwiki.php/VideoGame/MetalGearSolid", "/pmwiki/pmwiki.php/VideoGame/SuperAdventureRockman", "/pmwiki/pmwiki.php/VideoGame/Arkanoid", "/pmwiki/pmwiki.php/VideoGame/SaGa2", "/pmwiki/pmwiki.php/VideoGame/GenpeiToumaDen", "/pmwiki/pmwiki.php/VideoGame/PAYDAY2", "/pmwiki/pmwiki.php/VideoGame/ElementalStory", "/pmwiki/pmwiki.php/VideoGame/ShinMegamiTenseiIVApocalypse", "/pmwiki/pmwiki.php/VideoGame/NAM1975", "/pmwiki/pmwiki.php/VideoGame/TargetTerror", "/pmwiki/pmwiki.php/VideoGame/NierAutomata"], "non_media_links": ["/pmwiki/pmwiki.php/Main/EnforcedTrope", "/pmwiki/pmwiki.php/UsefulNotes/ArcadeGame", "/pmwiki/pmwiki.php/Main/ContinuingIsPainful", "/pmwiki/pmwiki.php/Main/BribingYourWayToVictory", "/pmwiki/pmwiki.php/Main/ScrappyMechanic", "/pmwiki/pmwiki.php/Main/TrueFinalBoss", "/pmwiki/pmwiki.php/Main/CheckpointStarvation", "/pmwiki/pmwiki.php/Main/OutOfContinues", "/pmwiki/pmwiki.php/Main/FinalDeathMode", "/pmwiki/pmwiki.php/Main/ActionAdventure", "/pmwiki/pmwiki.php/Main/BeatEmUp", "/pmwiki/pmwiki.php/Main/FightingGame", "/pmwiki/pmwiki.php/Main/TrueFinalBoss", "/pmwiki/pmwiki.php/Main/SNKBoss", "/pmwiki/pmwiki.php/Main/SNKBoss", "/pmwiki/pmwiki.php/Main/WeaksauceWeakness", "/pmwiki/pmwiki.php/Main/MultipleEndings", "/pmwiki/pmwiki.php/Main/CapcomSequelStagnation", "/pmwiki/pmwiki.php/Main/SNKBoss", "/pmwiki/pmwiki.php/Main/ItsAWonderfulFailure", "/pmwiki/pmwiki.php/Main/BonusBoss", "/pmwiki/pmwiki.php/Main/PlatformGame", "/pmwiki/pmwiki.php/Main/BossRush", "/pmwiki/pmwiki.php/Main/UrExample", "/pmwiki/pmwiki.php/Main/FinalDeathMode", "/pmwiki/pmwiki.php/Main/BrutalBonusLevel", "/pmwiki/pmwiki.php/Main/RacingGame", "/pmwiki/pmwiki.php/Main/SimilarlyNamedWorks", "/pmwiki/pmwiki.php/UsefulNotes/LaserDisc", "/pmwiki/pmwiki.php/Main/RhythmGame", "/pmwiki/pmwiki.php/Main/LifeMeter", "/pmwiki/pmwiki.php/Main/ShootEmUp", "/pmwiki/pmwiki.php/Main/TrueFinalBoss", "/pmwiki/pmwiki.php/Main/BadEnding", "/pmwiki/pmwiki.php/Main/BreakingTheFourthWall", "/pmwiki/pmwiki.php/Main/TropeCodifier", "/pmwiki/pmwiki.php/Main/CheatCode", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Main/OneHitPointWonder", "/pmwiki/pmwiki.php/Main/GameOver", "/pmwiki/pmwiki.php/Main/ThirdPersonShooter", "/pmwiki/pmwiki.php/Main/TropeMaker", "/pmwiki/pmwiki.php/Main/FinalBoss", "/pmwiki/pmwiki.php/Main/KarmaHoudini", "/pmwiki/pmwiki.php/Main/FinalBoss", "http://www.vgmuseum.com/end/neogeo/a/nambad.htm", "/pmwiki/pmwiki.php/Main/TheVeryDefinitelyFinalDungeon", "/pmwiki/pmwiki.php/Main/FinalBoss", "/pmwiki/pmwiki.php/Main/GameOver", "/pmwiki/pmwiki.php/Main/NonStandardGameOver"]}