{"title": "Mixed Metaphor", "content": "Adam : I have no idea what any of that stuff meant. Am I Pixar?\n\nDers : Steve Jobs, right? Created Apple. Great company. But then he left and created Pixar, which is way better, then he came back to Apple, made that way better. We got iPads, iPhones, all sorts of stuff. Let me go create my Pixar. Then I'll come back and we'll drop iPhones, okay?\n\nAdam : I thought you wanted to be like Steve Jobs and do a bunch of acid with us.\n\nDers : Guys, come on! I'm like Steve Martin in that John Candy movie.\n\nJim Hacker: If I can pull this off, it will be a feather in my cap.\n\nBernard: If you pull it off, it won't be in your cap any more.\n• There was a clusterbomb of mixed metaphors in episode 4 of season 2:\n\nSir Desmond: If you spill the beans, you open up a whole can of worms. How can you let sleeping dogs lie, if you let the cat out of the bag? Bring in a new broom, and if you're not careful, you'll find you've thrown the baby out with the bath water. If you change horses in the middle of the stream, next thing you know you're up the creek without a paddle.\n\nJim Hacker: And then the balloon goes up.\n• And from the sequel, Yes, Prime Minister:\n\nJim Hacker: \"So they insult me and then expect me to give them more money?\"\n\nSir Humphrey: \"Yes, I must say it's a rather undignified posture. But it is what artists always do: crawling towards the government on their knees, shaking their fists.\"\n\nJim Hacker: \"Beating me over the head with their begging bowls.\"\n\nBernard Woolley: \"Oh, I am sorry to be pedantic, Prime Minister, but they can't beat you over the head if they're on their knees. Unless of course they've got very long arms.\"\n• One in which Bernard goes to a lot of trouble to point out the implausibilities of the metaphor:\n\nJim Hacker: Furthermore, Sir Mark thinks there may be votes in it, and if so, I don't intend to look a gift horse in the mouth.\n\nSir Humphrey: I put it to you, you are looking at a Trojan Horse in the mouth.\n\nJim Hacker: You mean, if I looked inside the Trojan Horse, I would find Trojans inside?\n\nBernard Woolley: If you had looked inside the Trojan Horse, you would have found Greeks inside.\n\nJim Hacker: What do you mean, Bernard?\n\nBernard Woolley: Well, the Greeks gave the Trojan Horse to the Trojans, so technically, it wasn't a Trojan Horse at all, it was a Greek Horse. Hence the phrase timeo Danaos et dona ferentes which as you would recall, is usually and inaccurately translated as Beware of Greeks bearing gifts. : Well, the Greeks gave the Trojan Horse to the Trojans, so technically, it wasn't a Trojan Horse at all, it was a Greek Horse. Hence the phrase timeo Danaos et dona ferentes which as you would recall, is usually and inaccurately translated as Beware of Greeks bearing gifts. Or doubtless, you would have recalled, had you not attended the LSE.\n\nJim Hacker: I suppose Greek tags are all right in their own way, but can we stick to the point, please?\n\nJim Hacker: Beware of Greeks bearing gifts. I suppose the EEC equivalent would be Beware of Greeks bearing an olive oil surplus!!\n\nBernard Woolley: Um, just as the Trojan Horse was in fact Greek, what you described as a Greek tag is in fact Latin. It's obvious, really: the Greeks wouldn't suggest bewaring of themselves, if we could use such a participle, bewaring, that is. And it's clearly Latin, not because timeo ends in -o, because the Greek first person also ends in -o. Although, there is a Greek word τιμαω, which means 'I honour'. : Um, just as the Trojan Horse was in fact Greek, what you described as a Greek tag is in fact Latin. It's obvious, really: the Greeks wouldn't suggest bewaring of themselves, if we could use such a participle, bewaring, that is. And it's clearly Latin, not because timeo ends in -o, because the Greek first person also ends in -o. Although, there is a Greek word τιμαω, which means 'I honour'. And the -os ending is the singular nominative termination of the second declension in Greek, while it is the accusative plural in Latin. And 'Danaos' is not only the Greek for Greek, its also the Latin for Greek, it's quite interesting really...", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/MixedMetaphor", "media_links": ["/pmwiki/pmwiki.php/Series/YesMinister"], "non_media_links": ["/pmwiki/pmwiki.php/Main/TakeThat", "/pmwiki/pmwiki.php/Main/OverlyLongGag"]}