{"title": "Plea of Personal Necessity", "content": "After a long and desperate struggle, our hero stands triumphant. The evil tyrant has been cast down from his throne and our hero\u0092s swordpoint is at his throat. As our hero gets ready to make that fateful swing, the villain tells him, \"No, you can\u0092t do this. You need me!\"\n\nThe nature of this plea can vary greatly. It may just refer to the hero(es) personally (such as villain being the only thing keeping their lair intact), or it may involve the world as a whole (when removing the villain will result in an Evil Power Vacuum, for example). The reality of the claim varies as well; it may just be a villainous ploy to throw the hero off his game. In any case, these pleas are rarely successful.\n\nIf the villain really is directly responsible in some sense for the well-being of the world, he is a Load-Bearing Boss. If, after he is cast down, worse forces arise, it may be a case of Better the Devil You Know, or the chaos of an Evil Power Vacuum. Whatever the reason, if he's telling the truth, killing him would be a clear case of Nice Job Breaking It, Hero!.\n\nCompare Can't Kill You, Still Need You, a role reversal where a villainous character realizes that they actually do require the continued existence of their victim (for whatever reason), and refrains from killing them as a result.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/PleaOfPersonalNecessity", "media_links": ["/pmwiki/pmwiki.php/Manga/DragonBallZ", "/pmwiki/pmwiki.php/ComicBook/Superman", "/pmwiki/pmwiki.php/ComicBook/SpiderMan", "/pmwiki/pmwiki.php/Literature/TheElricSaga", "/pmwiki/pmwiki.php/Literature/Mistborn", "/pmwiki/pmwiki.php/Literature/TheManualOfDetection", "/pmwiki/pmwiki.php/VideoGame/FalloutNewVegas", "/pmwiki/pmwiki.php/VideoGame/HalfLife2", "/pmwiki/pmwiki.php/VideoGame/Portal", "/pmwiki/pmwiki.php/VideoGame/ResidentEvil6", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons"], "non_media_links": ["/pmwiki/pmwiki.php/Main/LoadBearingBoss", "/pmwiki/pmwiki.php/Main/EvilPowerVacuum", "/pmwiki/pmwiki.php/Main/LoadBearingBoss", "/pmwiki/pmwiki.php/Main/BetterTheDevilYouKnow", "/pmwiki/pmwiki.php/Main/EvilPowerVacuum", "/pmwiki/pmwiki.php/Main/NiceJobBreakingItHero", "/pmwiki/pmwiki.php/Main/CantKillYouStillNeedYou", "/pmwiki/pmwiki.php/Main/AncientConspiracy", "/pmwiki/pmwiki.php/Main/ShutUpHannibal", "/pmwiki/pmwiki.php/Main/EngineeredPublicConfession", "/pmwiki/pmwiki.php/Main/RantInducingSlight"]}