{"title": "Breakfast Club", "content": "A gang of misfits whom no one likes and/or don't like themselves (and perhaps each other by extension) get together or an elder, often a Zen Survivor, brings them together. A circle of True Companions forms out of everyone's lives sucking so much they ended up stuck with each other. If they actually want to stick together because otherwise they would be alone, they are Lonely Together.\n\nVery common in superhero teams who, while, fighting evil, tend not to have flashy headquarters or get a lot of public support or respect. Also could be used for villains, when they're not qualified to be a Quirky Miniboss Squad. The villain version is usually led by a Straw Nihilist.\n\nA concise way of saying it: most, if not all of the cast, in the group count as The Woobie (or at least have a lot of Angst) in their own individual way, even if it may not seem so at first.\n\nNamed after the classic teen film The Breakfast Club.\n• Villainous example: The Seven from Yu Yu Hakusho. They're all pretty troubled people...\n• The main characters themselves. Yusuke and Kuwabara are two juvenile delinquents who aren't liked or trusted all that much by authority figures or their fellow classmates, and Hiei and Kurama are a pair of demon criminals forced to work for the spirit world as punishment for their crimes.\n• The Sinners from Chrono Crusade. Disowned by their people, and dwindled down to frighteningly small numbers, this group of demons formed together around Aion to carry out his plans, while becoming an odd sort of family.\n• The Kyoto Animation adaptation of Kanon, thanks to its refusal to just toss the haremettes after their story arcs were over, seems to have the harem grow into something like this in the end.\n• Boku wa Tomodachi ga Sukunai is a comical take on the trope, featuring seven friendless, attractive-looking teens with not-so-attractive quirks and personalities Lonely Together under the banner of the \"Neighbors Club\", whose ostensible goal is to help its members make friends: Kodaka — a boy who happens to be the sanest of the lot, whose solitude stems mostly from his intimidating appearance; Yozora — an abrasive loner with a hobby of talking to Imaginary Friends; Sena — the ridiculously hot daughter of their school's chairman with a snobby attitude; Yukimura — a highly-effeminate, gullible Wholesome Crossdresser ; Rika — a Teen Genius with an incredibly dirty mind; Kobato — Kodaka's little sister under a constant self-delusion of being a vampire-loli; and Maria — a ten-year-old Hollywood Nun with severe reality-testing issues.\n• The Culture Club from Kokoro Connect is a group of five students who, for various reasons, didn't fit in with Yamahoshi Academy's available clubs. Taichi, Aoki, and Yui wanted to join clubs that didn't exist, Inaba left the Computer Club because she didn't like the president, and Iori let her homeroom teacher choose for her.\n• In Brave10, the Braves are a bunch of lonely misfits with Dark and Troubled Pasts slowly recruited by Yukimura who end up forming a Family of Choice.\n• The Elysium Project has the group of escaped test subjects that the story centers around. They've all been lied to and experimented on for years and now they're constantly running for their lives, but their shared trauma has brought them together.\n• DC Comics:\n• The Teen Titans, both the original team (through ret-cons and Character Development) and especially the New Teen Titans.\n• For a villainous version \u0097 most of The Flash's Rogues Gallery have formed a tight little group (actually referred to as \"the Rogues\"), and they come off this way.\n• Marvel Comics:\n• The Defenders, especially in the Steve Gerber era.\n• The X-Men started out this way, but it's softened tremendously in recent years.\n• Runaways, to the power of ten.\n• The Breakfast Club is the Trope Namer and are seen in the above image.\n• John Ford's acclaimed Western film Stagecoach did this trope way back in 1939, making the trope Older Than Television. The seven passengers on the stage to Lordsburg, New Mexico, include an outlaw, a prostitute, an alcoholic, and an ex-Confederate who isn't shy about expressing his political views. The \"alienation from society\" theme, while not overt, is certainly there: the alcoholic refers to himself and the prostitute as \"victims of social prejudice\" - and they are, although the prostitute has a little more self-respect. In the end, however, they have all developed respect for each other, largely as a result of cooperating to fight off a war party of Apaches - except for the ex-Confederate, who is killed by the Apaches .\n• The Faculty is basically The Breakfast Club as a sci-fi horror movie with parasitic aliens, with the protagonists' personalities and roles mapping fairly closely to their counterparts in that film. (Stan —> Andy, Delilah —> Claire, Casey —> Brian, Zeke —> Bender, and Stokely —> Allison.) The fact that Marybeth doesn't have an obvious counterpart from The Breakfast Club is, in fact, a pretty early clue that she's actually the Big Bad\n• The characters in The Boys in the Band are a Breakfast Club of dysfunctional gay men.\n• Michael Mann's early action flick Band of the Hand is about turning the Breakfast Club into a bunch of badasses.\n• The characters in Unaccompanied Minors are young versions of this.\n• The main characters who become a herd in the Original Ice Age are a form of this.\n• Lemonade Mouth is The Breakfast Club except a musical.\n• Two Lemonade Mouth stars were in other Breakfast Club movies. Naomi Scott was in The Breakfast Club with superheroes and Hayley Kiyoko was in The Breakfast Club with Scooby-Doo!\n• The Sun Also Rises is about a Breakfast Club of American expatriates living in France in The Roaring '20s. The group consists of a World War I veteran (who is impotent due to an injury sustained during the war), a jaded Christmas Cake party girl, and a shy guy who just wants everyone to get along. However, the book deconstructs the trope, showing how each person's problems actually annoys and alienates the others to where many of them can't stand each other. If anything, everybody (save Bill) ends up more miserable than they started out.\n• The book Clean even lampshades this, with Chris saying, \"We're kind of like a fucked-up version of that movie The Breakfast Club.\"\n• The victors in The Hunger Games lean towards this. At least, the ones who aren't trying to kill each other. Katniss, Peeta, Finnick and sort of Johanna, for the most part, and also Wiress and Beetee at first and Annie later. They're implied to have been more like this before the twist of the Quarter Quell (i.e., that they'd be competing to kill each other now) was announced. Katniss notes they (both competing victors and the victors mentoring them) are much more social than the usual pack of brand-new scared kids are every year. Haymitch in particular is seriously bothered by the whole thing, at one point telling Katniss and Peeta that he didn't want to be responsible for them getting his friends killed off.\n• The Losers Club in It are a particularly messed up version of this, as they are a group of youths (later adults) who are brought together by an omnipresent being known as the other to battle shapeshifting Monster Clown Pennywise. For two brief periods of time they rely on each other only to move away and forget about each other. The casting of a girl who looks a little like Molly Ringwald in It (2017) only makes it more obvious.\n• Billy Joel's \"Piano Man\". The bar is full of lonely, sad people drowning their sorrows \"sharing a drink they call Loneliness, but it's better than drinking alone\".\n• Dead Like Me. The main cast regularly eat breakfast together at a Greasy Spoon, as well, making them a literal example of the trope name.\n• Most definitely the cast of Lexx, though the robot head guy would not qualify as The Woobie.\n• The members of the 4077th M* A* S* H. It's not so much that no one liked them at home (except maybe for Frank Burns) and more like they all happen to be stuck in a war zone together (they hate it). In one episode Hawkeye compares it to people who crowd under building overhangs during a rain storm.\n• Cheers . Even the theme song is about this.\n• Misfits, oh so much. Five low-grade criminal teens find themselves united by social alienation, superpowers, and the accidental murder of their rampaging Ax-Crazy zombie probation worker.\n• Deconstructed on 3rd Rock from the Sun. Harry goes to night classes to get his GED. He takes advice from Tommy on how to act like the Big Man on Campus, but eventually comes to realize everyone there is from disparate age groups and backgrounds and that trying to act cool is completely pointless. Eventually, he finds a study group like this.\n• The four mains of Gossip Girl, Nate, Chuck, Blair and Serena, call themselves the Non-Judging Breakfast Club. The foursome grew close as kids when none of them had reliable parents and it's been mentioned that they more or less raised each other.\n• The Inbetweeners: The four friends at times seem like they have little reason to be friends due to their contrasting personalities. At the same time, their misfit status in school means that they're the only people who can stand each other.\n• Chickens: Cecil, George, and Bert. The only similarity they have is that they're the only men left in their after WWI has started. As a result, they end up being forced to bond.\n• Red Band Society: A group of kids who have nothing in common except for being in hospital together? Big tick.\n• Leverage: Five self-proclaimed loners discover that their whole is more than the sum of their parts, at first professionally, but increasingly emotionally as the series progresses.\n• This is how Daigo created his gang of delinquents in Dawn of a New Age: Oldport Blues, by gathering together fellow teenagers who were ostracized or bullied by their peers. While they were originally eager to follow Daigo in his rebellion against those who put them down, some of the members grew increasingly wary as Daigo experienced a huge uptick in violence after gaining superpowers, to the point that a couple of them broke ties with the gang completely.\n• The companions of Dragon Age II could be called the Breakfast Club of RPGs without being much of a stretch. Suffice it to say they all have massive issues, shaky self-worth, questionable social skills at best, and no-one looking out for them but each other. The glue holding this motley crew together is a Fight Magnet refugee who can be anything from diplomat to Sad Clown to highwayman. They stay together for six years (although a lot of that's covered by time-jumps), and meet up for drinks and card games when they're not out killing people. Unlike the average Ragtag Bunch of Misfits, there's no overriding mission that keeps them all together - they all have their personal ambitions, and stick together out of choice.\n• Hell, any BioWare game is going to end up with a crew like this.\n• Shepard's crew includes a thousand year old mercenary, an archaeologist, a Cowboy Cop, a Wrench Wench, a gruff soldier with a spiritual side and a gentle soldier who went through a special kind of Training from Hell... and that's just the first game.\n• The Spirit Monk ends up with a childhood friend , a former Lotus Assassin, a thief, a Creepy Child possessed by two demons, a Rebellious Princess, a former arena fighter who's willing to do anything to avoid his wife, a nutcase mercenary, and at least two minor deities.\n• The Ebon Hawk? Star Padawan of the Jedi Order, Properly Paranoid (and possibly Force Sensitive) Republic soldier, a Mandalorian mercenary fallen on hard times, Twi'lek street kid and her big Wookiee BFF, Cathar Jedi with anger management issues, Cranky ex-Jedi who was slumming it in the Kashyyyk shadowlands, troublemaking astromech droid, gleefully homicidal assassin droid with a long string of dead masters...Oh, and .\n• Of all the protagonist ensembles in the series, the cast of Persona 3 fits this trope best.\n• Last Res0rt. What else did you expect to happen when you throw a bunch of condemned criminals into a Reality Show together?\n• The main cast of Miracles Of Neksenzi Point end up hanging out mainly because everyone else is scared of them.\n• A lot of the main group in Questionable Content come from Friendless Backgrounds or deep-seated emotional issues before fitting in with each other. It happens often enough that Marten jokes about \"adopting another one\". Marten: You befriended me via bullying and stalking, respectively. If we extrapolate from there, Marigold is going to stab me in the face. two befriended me via bullying and stalking, respectively. If we extrapolate from there, Marigold is going to stab me in the face.\n• Team Kimba in the Whateley Universe. They get together because they are put together on their first day since they all have a secret that makes them outsiders. They are all transgender, most of them against their will. Subversion: they rapidly become well-liked and considered heroic, after they happen to defeat a band of superpowered ninjas before the first day of school.\n• Outcast Corner takes this Up to Eleven: It's as though the only reason they haven't demolished the school yet is because they have each other. Everyone on the team is either a rager, a devisor, insane or all of the above, and even Diamondback and Jericho, the most sane of the bunch, have some major issues.\n• The Crimebusters of the Global Guardians PBEM Universe. Unappreciated, possessing superpowers that fall squarely into the What Kind of Lame Power Is Heart, Anyway? territory (one of their members is a dog that talks... that's his power; he's a dog, and he talks). But they're not disheartened, and somehow save the day anyway.\n• The Planet Express Crew is composed entirely of individuals who don't fit into their future society, particularly the main characters, Fish out of Temporal Water Fry, Robotic Psychopath Bender, who was programmed to bend girders, and Leela, a one-eyed Doorstop Baby who for most of the original run doesn't even know her own species and then turns out to be part of an ostracized race forced to dwell in Earth's sewers . It's acknowledged several times, most memorably by Fry in \"The Cyber House Rules,\" after Leela gets surgery to appear \"normal\" and begins dating her aggressively normal plastic surgeon: Fry: What's so wonderful about Leela being normal? The rest of us aren't normal, and that's what makes us great. Like He's a weird monster who smells like he eats garbage, and does! What's so wonderful about Leela being normal? The rest of us aren't normal, and that's what makes us great. Like Dr. Zoidberg! Farnsworth: And Fry, you've got And Fry, you've got that brain thing Fry: ! So Leela\u0097do you wanna be like us, or do you wanna be like Adelai...with no severe mental or social problems whatsoever? I already did ! So Leela\u0097do you wanna be like us, or do you wanna be like Adelai...with no severe mental or social problems whatsoever?", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/BreakfastClub", "media_links": ["/pmwiki/pmwiki.php/Film/TheBreakfastClub", "/pmwiki/pmwiki.php/Film/TheBreakfastClub", "/pmwiki/pmwiki.php/Manga/YuYuHakusho", "/pmwiki/pmwiki.php/Manga/ChronoCrusade", "/pmwiki/pmwiki.php/Creator/KyotoAnimation", "/pmwiki/pmwiki.php/VisualNovel/Kanon", "/pmwiki/pmwiki.php/LightNovel/BokuWaTomodachiGaSukunai", "/pmwiki/pmwiki.php/LightNovel/KokoroConnect", "/pmwiki/pmwiki.php/Manga/Brave10", "/pmwiki/pmwiki.php/Creator/DCComics", "/pmwiki/pmwiki.php/ComicBook/MetalMen", "/pmwiki/pmwiki.php/ComicBook/TeenTitans", "/pmwiki/pmwiki.php/Franchise/TheFlash", "/pmwiki/pmwiki.php/Creator/MarvelComics", "/pmwiki/pmwiki.php/ComicBook/TheDefenders", "/pmwiki/pmwiki.php/Film/TheBreakfastClub", "/pmwiki/pmwiki.php/Creator/JohnFord", "/pmwiki/pmwiki.php/Film/Stagecoach", "/pmwiki/pmwiki.php/Creator/JohnWayne", "/pmwiki/pmwiki.php/Film/TheFaculty", "/pmwiki/pmwiki.php/Film/TheBoysInTheBand", "/pmwiki/pmwiki.php/Film/BandOfTheHand", "/pmwiki/pmwiki.php/WesternAnimation/IceAge", "/pmwiki/pmwiki.php/Film/LemonadeMouth", "/pmwiki/pmwiki.php/Creator/NaomiScott", "/pmwiki/pmwiki.php/Film/PowerRangers2017", "/pmwiki/pmwiki.php/Music/HayleyKiyoko", "/pmwiki/pmwiki.php/Film/ScoobyDooTheMysteryBegins", "/pmwiki/pmwiki.php/Franchise/ScoobyDoo", "/pmwiki/pmwiki.php/Literature/TheSunAlsoRises", "/pmwiki/pmwiki.php/Literature/TheHungerGames", "/pmwiki/pmwiki.php/Literature/It", "/pmwiki/pmwiki.php/Creator/MollyRingwald", "/pmwiki/pmwiki.php/Film/It2017", "/pmwiki/pmwiki.php/Music/BillyJoel", "/pmwiki/pmwiki.php/Series/DeadLikeMe", "/pmwiki/pmwiki.php/Series/Lexx", "/pmwiki/pmwiki.php/Series/MASH", "/pmwiki/pmwiki.php/Series/Cheers", "/pmwiki/pmwiki.php/Series/Misfits", "/pmwiki/pmwiki.php/Series/Community", "/pmwiki/pmwiki.php/Series/ThirdRockFromTheSun", "/pmwiki/pmwiki.php/Series/GossipGirl", "/pmwiki/pmwiki.php/Series/TheInbetweeners", "/pmwiki/pmwiki.php/Series/Leverage", "/pmwiki/pmwiki.php/VideoGame/DragonAgeII", "/pmwiki/pmwiki.php/Creator/BioWare", "/pmwiki/pmwiki.php/Franchise/MassEffect", "/pmwiki/pmwiki.php/VideoGame/JadeEmpire", "/pmwiki/pmwiki.php/VideoGame/KnightsOfTheOldRepublic", "/pmwiki/pmwiki.php/VideoGame/Persona3", "/pmwiki/pmwiki.php/Webcomic/LastRes0rt", "/pmwiki/pmwiki.php/Webcomic/MiraclesOfNeksenziPoint", "/pmwiki/pmwiki.php/Webcomic/QuestionableContent", "/pmwiki/pmwiki.php/Literature/WhateleyUniverse", "/pmwiki/pmwiki.php/WesternAnimation/Futurama"], "non_media_links": ["/pmwiki/pmwiki.php/Main/TropeNamer", "/pmwiki/pmwiki.php/Main/ZenSurvivor", "/pmwiki/pmwiki.php/Main/TrueCompanions", "/pmwiki/pmwiki.php/Main/LonelyTogether", "/pmwiki/pmwiki.php/Main/QuirkyMinibossSquad", "/pmwiki/pmwiki.php/Main/StrawNihilist", "/pmwiki/pmwiki.php/Main/TheWoobie", "/pmwiki/pmwiki.php/Main/Angst", "/pmwiki/pmwiki.php/Main/RagtagBunchOfMisfits", "/pmwiki/pmwiki.php/Main/Anime", "/pmwiki/pmwiki.php/Main/Manga", "/pmwiki/pmwiki.php/Main/TrueCompanions", "/pmwiki/pmwiki.php/Main/DysfunctionJunction", "/pmwiki/pmwiki.php/Main/LonelyTogether", "/pmwiki/pmwiki.php/Main/OnlySaneMan", "/pmwiki/pmwiki.php/Main/FaceOfAThug", "/pmwiki/pmwiki.php/Main/ByronicHero", "/pmwiki/pmwiki.php/Main/ImaginaryFriend", "/pmwiki/pmwiki.php/Main/MsFanservice", "/pmwiki/pmwiki.php/Main/RichBitch", "/pmwiki/pmwiki.php/Main/WholesomeCrossdresser", "/pmwiki/pmwiki.php/Main/RecursiveCrossdressing", "/pmwiki/pmwiki.php/Main/TeenGenius", "/pmwiki/pmwiki.php/Main/LovableSexManiac", "/pmwiki/pmwiki.php/Main/ElegantGothicLolita", "/pmwiki/pmwiki.php/Main/HollywoodNuns", "/pmwiki/pmwiki.php/Main/CloudCuckoolander", "/pmwiki/pmwiki.php/Main/RagtagBunchOfMisfits", "/pmwiki/pmwiki.php/Main/DarkAndTroubledPast", "/pmwiki/pmwiki.php/Main/MysteriousEmployer", "/pmwiki/pmwiki.php/Main/FamilyOfChoice", "/pmwiki/pmwiki.php/Main/AudioPlay", "/pmwiki/pmwiki.php/AudioPlay/TheElysiumProject", "/pmwiki/pmwiki.php/Main/ComicBooks", "/pmwiki/pmwiki.php/Comicbook/DoomPatrol", "/pmwiki/pmwiki.php/Main/CharacterDevelopment", "/pmwiki/pmwiki.php/Main/RoguesGallery", "/pmwiki/pmwiki.php/Comicbook/XMen", "/pmwiki/pmwiki.php/Comicbook/Runaways", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/TropeNamer", "/pmwiki/pmwiki.php/Main/OlderThanTelevision", "/pmwiki/pmwiki.php/Main/StillFightingTheCivilWar", "/pmwiki/pmwiki.php/Main/FireForgedFriends", "/pmwiki/pmwiki.php/Main/PuppeteerParasite", "/pmwiki/pmwiki.php/Main/TheLastOfTheseIsNotLikeTheOthers", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/DysfunctionJunction", "/pmwiki/pmwiki.php/Main/CastFullOfGay", "/pmwiki/pmwiki.php/Main/TookALevelInBadass", "/pmwiki/pmwiki.php/Main/RecycledInSpace", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/TheRoaringTwenties", "/pmwiki/pmwiki.php/UsefulNotes/WorldWarI", "/pmwiki/pmwiki.php/Main/ChristmasCake", "/pmwiki/pmwiki.php/Main/LadyDrunk", "/pmwiki/pmwiki.php/Main/Deconstruction", "/pmwiki/pmwiki.php/Main/TheFriendNobodyLikes", "/pmwiki/pmwiki.php/Main/OnlySaneMan", "/pmwiki/pmwiki.php/Main/MonsterClown", "/pmwiki/pmwiki.php/Main/DrowningMySorrows", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/GreasySpoon", "/pmwiki/pmwiki.php/Main/TheWoobie", "/pmwiki/pmwiki.php/Main/Jerkass", "/pmwiki/pmwiki.php/Main/ButtMonkey", "/pmwiki/pmwiki.php/Main/AxCrazy", "/pmwiki/pmwiki.php/Main/BigManOnCampus", "/pmwiki/pmwiki.php/Main/Chickens", "/pmwiki/pmwiki.php/Main/RedBandSociety", "/pmwiki/pmwiki.php/Roleplay/DawnOfANewAgeOldportBlues", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/FightMagnet", "/pmwiki/pmwiki.php/Main/SadClown", "/pmwiki/pmwiki.php/Main/RagtagBunchOfMisfits", "/pmwiki/pmwiki.php/Main/CowboyCop", "/pmwiki/pmwiki.php/Main/WrenchWench", "/pmwiki/pmwiki.php/Main/TrainingFromHell", "/pmwiki/pmwiki.php/Main/CreepyChild", "/pmwiki/pmwiki.php/Main/RebelliousPrincess", "/pmwiki/pmwiki.php/Main/ProperlyParanoid", "/pmwiki/pmwiki.php/Main/WebComics", "/pmwiki/pmwiki.php/Main/RealityShow", "/pmwiki/pmwiki.php/Main/FriendlessBackground", "/pmwiki/pmwiki.php/Main/StepfordSmiler", "http://questionablecontent.net/view.php?comic=2298", "/pmwiki/pmwiki.php/Main/BrokenBird", "/pmwiki/pmwiki.php/Main/SuperOCD", "/pmwiki/pmwiki.php/Main/WebOriginal", "/pmwiki/pmwiki.php/Main/ItWasHisSled", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Roleplay/GlobalGuardiansPBEMUniverse", "/pmwiki/pmwiki.php/Main/WhatKindOfLamePowerIsHeartAnyway", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/FishOutOfTemporalWater", "/pmwiki/pmwiki.php/Main/RoboticPsychopath", "/pmwiki/pmwiki.php/Main/GrewBeyondTheirProgramming", "/pmwiki/pmwiki.php/Main/DoorstopBaby", "/pmwiki/pmwiki.php/Main/ButtMonkey", "/pmwiki/pmwiki.php/Main/AmusingAlien", "/pmwiki/pmwiki.php/Main/TheProfessor", "/pmwiki/pmwiki.php/Main/MadScientist", "/pmwiki/pmwiki.php/Main/CuteClumsyGirl", "/pmwiki/pmwiki.php/Main/FutureSlang", "/pmwiki/pmwiki.php/Main/CloudCuckoolander", "/pmwiki/pmwiki.php/Main/TheDitz"]}