{"title": "The Lethal Connotation of Guns and Others", "content": "In media in general, and media with children in the demographic in particular, nothing is more dangerous or deadly than an old-fashioned gun. Guns have Instant Death Bullets, and those are the only things likely to cause instant death.\n\nKnives, swords, arrows, and Noodle Implements can hit square-on but leave flesh wounds that cause little more trouble than paper cuts. Blunt weapons may just bruise, if that, even when they hit. Lasers are often Family-Friendly Firearms that just stun, or leave burns with little more effect than a burn from a hot stove. Bombs sometimes leave just a soot layer on their targets; more realistic works will still let a character Outrun the Fireball. If a building falls on top of a character, he may crawl out of the rubble with nothing more than a layer of gray dust — yes, even in works that are superficially realistic. Tornadoes will just fling a character aside even if he does touch the funnel cloud, and Convection Schmonvection gives enough protection from fire that almost anyone can escape it. Poisonous gas has antidotes, and the worst effects can be escaped if you hold your breath as soon as you know it's there. Even the radiation from a nuclear bomb, the other scariest weapon a character is likely to run into, sometimes causes beneficial mutations; even when it doesn't, it often leaves few side effects between the radiation poisoning and death.\n\nBut old-fashioned guns? If a bullet hits, even the overly minor flesh wounds are gonna hurt like mad. No one just shrugs off bullets. And if a bullet hits in a place that looks deadly, then it will kill, painfully. There may be time for a Final Speech, but usually not for an ambulance.\n\nIt is also easier to protect yourself from other weapons than from bullets. If armor blocks a physical blow, melee weapon, or arrow, there often will be no damage; in the case of the melee weapons, the character protected may be impacted so little that it violates Newton's Third Law. Gas masks let in all the oxygen and none of the gas. Bomb shelters protect against bombs so well that they never even lose their shape; tornado shelters never lose more than the entry door when the tornado passes over them. But, even given that Bulletproof Vests are more effective in fiction than in Real Life, if it stops the bullet, then the bullet will still knock the character off his feet or even knock him out.\n\nThe characters are aware at some level that guns are the most dangerous weapons they can face. Punch! Punch! Punch! Uh Oh... can be played for laughs; but if a character is Immune to Bullets, then only the Weaksauce Weakness will hurt him, and the opposing side will react accordingly. Only the best at their arts can deflect a bullet. And characters only willingly take bullets if they are invulnerable to them, willing to die, or wearing a bulletproof vest.\n\nFortunately, in series where guns are common and are like this, there are usually few people good at aiming them.\n\nThis trope happens for several reasons. For one thing, guns are extremely common in America, and not infrequently used here/there; even in Real Life, they can be dangerous. For another, should a child ever find an unattended gun, it's easier for them to inadvertently hurt someone with it than most other types of weapon. This trope takes the Real Life danger of guns and pushes it Up to Eleven. Whether this effort to make guns scarier does what the Moral Guardians think it does is dubious, but hey...\n\nThere is Truth in Television to this, though, as anyone with a good working knowledge of firearms and ballistics can tell you that there is no such thing as \"shooting to wound\" in real life. Even a flesh wound can easily turn fatal, as the recipient can still bleed to death without prompt medical attention or the wound can become infected.\n\nCounterintuitively, Bloodless Carnage can make the impression more effective. In old movies, and some newer shows that retain the trope, it often appears that guns fire death itself rather than speedy bits of metal.\n\nAverting this trope may be one reason to enforce Fantasy Gun Control, even though hand-held guns were significantly less effective weapons than bows in the Middle Ages and the Age of Discovery.\n\nKinetic Weapons Are Just Better can be a subtrope of this. Contrast Guns Are Worthless. See also Non-Fatal Explosions.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/TheLethalConnotationOfGunsAndOthers", "media_links": ["/pmwiki/pmwiki.php/VideoGame/Xenogears", "/pmwiki/pmwiki.php/Anime/Pokemon", "/pmwiki/pmwiki.php/ComicBook/Wanted", "/pmwiki/pmwiki.php/Anime/Pokemon", "/pmwiki/pmwiki.php/Literature/Discworld", "/pmwiki/pmwiki.php/Toys/Bionicle", "/pmwiki/pmwiki.php/Franchise/LEGO", "/pmwiki/pmwiki.php/TabletopGame/TheDresdenFiles", "/pmwiki/pmwiki.php/VideoGame/SuperSmashBrosBrawl", "/pmwiki/pmwiki.php/VideoGame/MetalGear", "/pmwiki/pmwiki.php/VideoGame/Persona3", "/pmwiki/pmwiki.php/VideoGame/SilentHill", "/pmwiki/pmwiki.php/VideoGame/SilentHill2", "/pmwiki/pmwiki.php/VideoGame/SilentHill1", "/pmwiki/pmwiki.php/VideoGame/SilentHill2", "/pmwiki/pmwiki.php/VideoGame/SilentHill3", "/pmwiki/pmwiki.php/Webcomic/TheAdventuresOfDrMcNinja"], "non_media_links": ["/pmwiki/pmwiki.php/Main/WeaponOfChoice", "/pmwiki/pmwiki.php/Main/InstantDeathBullet", "/pmwiki/pmwiki.php/Main/NoodleImplements", "/pmwiki/pmwiki.php/Main/OnlyAFleshWound", "/pmwiki/pmwiki.php/Main/FamilyFriendlyFirearms", "/pmwiki/pmwiki.php/Main/OutrunTheFireball", "/pmwiki/pmwiki.php/Main/DoNotTouchTheFunnelCloud", "/pmwiki/pmwiki.php/Main/ConvectionSchmonvection", "/pmwiki/pmwiki.php/Main/ILoveNuclearPower", "/pmwiki/pmwiki.php/Main/FinalSpeech", "/pmwiki/pmwiki.php/Main/BulletproofVest", "/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/Main/PunchPunchPunchUhOh", "/pmwiki/pmwiki.php/Main/ImmuneToBullets", "/pmwiki/pmwiki.php/Main/WeaksauceWeakness", "/pmwiki/pmwiki.php/Main/TakingTheBullet", "/pmwiki/pmwiki.php/Main/ImmuneToBullets", "/pmwiki/pmwiki.php/Main/InverseLawOfSharpnessAndAccuracy", "/pmwiki/pmwiki.php/Main/ImperialStormtrooperMarksmanshipAcademy", "/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Main/ScareEmStraight", "/pmwiki/pmwiki.php/Main/MoralGuardians", "/pmwiki/pmwiki.php/Main/TruthInTelevision", "/pmwiki/pmwiki.php/JustForFun/TelevisionIsTryingToKillUs", "/pmwiki/pmwiki.php/Main/OnlyAFleshWound", "/pmwiki/pmwiki.php/Main/BloodlessCarnage", "/pmwiki/pmwiki.php/Main/FantasyGunControl", "/pmwiki/pmwiki.php/Main/KineticWeaponsAreJustBetter", "/pmwiki/pmwiki.php/Main/GunsAreWorthless", "/pmwiki/pmwiki.php/Main/NonFatalExplosions", "/pmwiki/pmwiki.php/Main/TeamRocket", "/pmwiki/pmwiki.php/Main/ATwinkleInTheSky", "/pmwiki/pmwiki.php/Main/Mons", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/AntiHero", "/pmwiki/pmwiki.php/ComicStrip/ThePhantom", "/pmwiki/pmwiki.php/Main/TheBaroness", "/pmwiki/pmwiki.php/Main/OurGhostsAreDifferent", "/pmwiki/pmwiki.php/Fanfic/PokeWars", "/pmwiki/pmwiki.php/Discworld/MenAtArms", "/pmwiki/pmwiki.php/Main/DrunkWithPower", "/pmwiki/pmwiki.php/Main/UniquenessValue", "/pmwiki/pmwiki.php/Main/InUniverse", "/pmwiki/pmwiki.php/Main/AllTrollsAreDifferent", "/pmwiki/pmwiki.php/Main/ArsonMurderAndJaywalking", "/pmwiki/pmwiki.php/Main/StunGuns", "/pmwiki/pmwiki.php/Main/WordOfGod", "/pmwiki/pmwiki.php/Main/RuleOfCool", "/pmwiki/pmwiki.php/Main/RuleOfFunny", "/pmwiki/pmwiki.php/Main/PocketProtector", "/pmwiki/pmwiki.php/Main/UpdatedRerelease", "/pmwiki/pmwiki.php/Main/HandCannon", "/pmwiki/pmwiki.php/Main/GameplayAndStorySegregation", "/pmwiki/pmwiki.php/Main/BFS", "/pmwiki/pmwiki.php/Main/PuppeteerParasite", "/pmwiki/pmwiki.php/Main/AxCrazy", "/pmwiki/pmwiki.php/Main/MirrorMatch", "/pmwiki/pmwiki.php/Main/AprilFoolsDay"]}