{"title": "Dawn of the Wild West", "content": "Sub-trope of The Western, Dawn of the Wild West involves stories set in the western part of North America between the late 1700s and the 1840s which was a time of continental exploration (e.g., Lewis and Clark), fur trapping, trailblazing, and westward expansion.\n\nIn stories covered by this trope, you'll usually encounter bold explorers, mountain men, missionaries, and Native Americans. The latter's depiction will vary considerably and be often colored by the attitudes from the time the work was produced.\n\nThere are also stories about pioneers under this trope but their efforts to settle and civilize the \"savage\" land often involve wilderness that's east of the Mississippi. Stories about pioneers moving into the Far West (i.e., the North American Great Plains and territory west of the Rockies) signify the end of the time period covered under Dawn of the Wild West trope (i.e., the early 1840s).\n\nIn addition, this trope covers works about the Battle of the Alamo and the Texas War for Independence.\n\nAs indicated in the title, this trope covers the beginning of the period covered in the Wild West and represents the Dawn of an Era. It's the opposite of Twilight of the Old West which covers the End of an Age for the Wild West.\n• DC Comics Hawk, Son of Tomahawk was about the half-Indian son of the Revolutionary War hero Tomahawk and was set in the early years of the 19th Century in the American midwest.\n• Tejano was a back-up feature that ran in Jonah Hex about the exploits of a band of Texas Rangers during the days of the Texas Republic.\n• Writer René Goscinny and artist Albert Uderzo launched a year before they started working on Asterix. It is a comedy series about Oumpah-Pah, a warrior of the tribe of the Shavashavas in New France (modern Canada) in the 18th century.\n• The massive French historical adventure series Les Sept Vies de l'Épervier (\"The Seven Lives of the Sparrowhawk\") takes is set during the 17th century, and a number of its albums take the heroes and heroines across the Atlantic to the wilds of New France.\n• Across The Wide Missouri is a 1951 film starring Clark Gable as a fur trapper in the Rocky Mountains during the 1820s.\n• Almost Heroes is set in the early 1800s and depicts the attempt of an inept pair of Lewis and Clark rivals (Chris Farley and Matthew Perry) to explore the western half of North America.\n• Drums Along the Mohawk, directed by John Ford and starring Henry Fonda, is about settlers in the wilderness of Western New York contending with the threats posed by the Mohawks and the British during The American Revolution.\n• The Far Horizons is a 1955 film depicting (very inaccurately) the Lewis and Clark expedition that starred Fred MacMurray as Lewis, Charlton Heston as Clark, and Donna Reed as Sacagawea.\n• How the West Was Won: The first part of the movie involves the migration of the Prescott family through the wild lands of Illinois country during the 1830s.\n• Jeremiah Johnson featured Robert Redford as a trapper in the Rocky Mountains during the 1840s.\n• The Last of the Mohicans: This adaptation of one of James Fenimore Cooper's The Leatherstocking Tales is set in colonial New York during the French-Indian War and has been filmed several times with the most recent version being the one from 1992 starring Daniel Day-Lewis.\n• The East German DEFA Westerns included the Cooper adaptation Chingachgook, die große Schlange (1966, based on The Deerslayer) and two biopics about famous chiefs, Tecumseh (1972, mainly set in the War of 1812) and Osceola (1973, Second Seminole War in Florida during the 1830s).\n• Both The Revenant (2015) starring Leonardo DiCaprio and Man in the Wilderness (1971) starring Richard Harris are film adaptations of the story of trapper and scout Hugh Glass who was mauled by a bear and left for dead by an expedition exploring the northern Great Plains and Rocky Mountains in the 1820s.\n• Movies about the Battle of the Alamo and the Texas War for Independence fall under this trope and include 1960's The Alamo starring John Wayne, 2004's The Alamo, and the 1939 Sam Houston biopic Man Of Conquest.\n• The duology consisting of The Mask of Zorro and The Legend of Zorro spans three decades of this era, beginning during the closing days of the Mexican War of Independence and ending with California statehood in the U.S.A. The world it's set in gradually loses its Old World trappings and begins to look more and more like the Wild West.\n• Northwest Passage is about two men joining Rogers' Rangers in a raid on the Abenakis in a pre-independence America.\n• James Fenimore Cooper's The Leatherstocking Tales take place in the \"wild west\" of colonial America (i.e., western New York). As does his pessimistic trilogy The Littlepage Manuscripts (Satanstoe, The Chainbearer, and The Redskins). Cooper goes even further east with The Wept of Wish-ton-Wish, a frontier story set in 17th century Connecticut.\n• One of the earliest German Western novelists, Friedrich Gerstäcker, became successful with Die Regulatoren in Arkansas (1846, \"The Regulators in Arkansas\") and Die Flußpiraten des Mississippi (1847, \"The River-Pirates of the Mississippi\"). In the 20th century there was Fritz Steuben (real name: Erhard Wittek), who wrote a cycle of eight novels about the Shawnee chief Tecumseh and a few other books, including Mississippi-Saga about the 17th-century French explorer Sieur de la Salle.\n• J.T. Edson's Ole Devil novels are set during the Texas War of Independence (1835-37).\n• The four novels that make up Larry McMurtry's Berrybender Narratives take place in the American West of the 1830s.\n• Johnston McCully's Zorro stories (and the movies and TV series they're based on) take place in California when it still belonged to Spain and Mexico so they would fall under this trope.\n• The American Girls character Josefina lives in what was then Mexico, but is now New Mexico, in the 1820s.\n• The mini-series based on the James Michener novel, Centennial, is set in Colorado, and details much of the early history of the North Platte River plains. Beginning in 1795, the first five episodes follow the coming of traders and settlers until a town is formed in 1868.\n• Daniel Boone is set in Kentucky during the late 18th century.\n• The Disney version of Davy Crockett takes place in the early part of the 19th century beginning in newly-settled Tennessee and ending in 1836 in Texas at the Battle of the Alamo.\n• Assassin's Creed III is set during the Revolutionary War, with the large untamed frontier west of the Alleghenies to explore.\n• The Lewis and Clark level of Where in Time Is Carmen Sandiego? takes place here, of course.\n• A generation of Americans who were schoolchildren in the 1980s and early 1990s learned about hunting buffalo, floating their covered wagons across rivers, and dying of dysentery in 1848 on The Oregon Trail.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/DawnOfTheWildWest", "media_links": ["/pmwiki/pmwiki.php/Creator/DCComics", "/pmwiki/pmwiki.php/ComicBook/Tomahawk", "/pmwiki/pmwiki.php/ComicBook/JonahHex", "/pmwiki/pmwiki.php/Creator/ReneGoscinny", "/pmwiki/pmwiki.php/Franchise/Asterix", "/pmwiki/pmwiki.php/Film/AcrossTheWideMissouri", "/pmwiki/pmwiki.php/Creator/ClarkGable", "/pmwiki/pmwiki.php/Film/AlmostHeroes", "/pmwiki/pmwiki.php/Creator/ChrisFarley", "/pmwiki/pmwiki.php/Creator/MatthewPerry", "/pmwiki/pmwiki.php/Film/DrumsAlongTheMohawk", "/pmwiki/pmwiki.php/Creator/JohnFord", "/pmwiki/pmwiki.php/Creator/HenryFonda", "/pmwiki/pmwiki.php/Film/TheFarHorizons", "/pmwiki/pmwiki.php/Creator/FredMacMurray", "/pmwiki/pmwiki.php/Creator/CharltonHeston", "/pmwiki/pmwiki.php/Creator/DonnaReed", "/pmwiki/pmwiki.php/Film/HowTheWestWasWon", "/pmwiki/pmwiki.php/Film/JeremiahJohnson", "/pmwiki/pmwiki.php/Creator/RobertRedford", "/pmwiki/pmwiki.php/Film/TheLastOfTheMohicans", "/pmwiki/pmwiki.php/Literature/TheLeatherstockingTales", "/pmwiki/pmwiki.php/Creator/DanielDayLewis", "/pmwiki/pmwiki.php/Film/DEFAWesterns", "/pmwiki/pmwiki.php/Literature/TheLeatherstockingTales", "/pmwiki/pmwiki.php/Film/TheRevenant", "/pmwiki/pmwiki.php/Creator/LeonardoDiCaprio", "/pmwiki/pmwiki.php/Film/ManInTheWilderness", "/pmwiki/pmwiki.php/Creator/RichardHarris", "/pmwiki/pmwiki.php/Film/TheAlamo1960", "/pmwiki/pmwiki.php/Creator/JohnWayne", "/pmwiki/pmwiki.php/Film/TheAlamo2004", "/pmwiki/pmwiki.php/Film/ManOfConquest", "/pmwiki/pmwiki.php/Film/TheMaskOfZorro", "/pmwiki/pmwiki.php/Film/TheLegendOfZorro", "/pmwiki/pmwiki.php/Film/NorthwestPassage", "/pmwiki/pmwiki.php/Literature/TheLeatherstockingTales", "/pmwiki/pmwiki.php/Creator/JTEdson", "/pmwiki/pmwiki.php/Creator/LarryMcMurtry", "/pmwiki/pmwiki.php/Franchise/Zorro", "/pmwiki/pmwiki.php/Literature/AmericanGirlsCollection", "/pmwiki/pmwiki.php/Series/Centennial", "/pmwiki/pmwiki.php/Series/DanielBoone", "/pmwiki/pmwiki.php/VideoGame/AssassinsCreedIII", "/pmwiki/pmwiki.php/VideoGame/WhereInTimeIsCarmenSandiego1997", "/pmwiki/pmwiki.php/VideoGame/TheOregonTrail"], "non_media_links": ["/pmwiki/pmwiki.php/Main/TheWestern", "/pmwiki/pmwiki.php/Main/HunterTrapper", "/pmwiki/pmwiki.php/UsefulNotes/ManifestDestiny", "/pmwiki/pmwiki.php/Main/BoldExplorer", "/pmwiki/pmwiki.php/Main/MountainMan", "/pmwiki/pmwiki.php/Main/TheMissionary", "/pmwiki/pmwiki.php/UsefulNotes/NativeAmericans", "/pmwiki/pmwiki.php/Main/DependingOnTheWriter", "/pmwiki/pmwiki.php/Main/ValuesDissonance", "/pmwiki/pmwiki.php/Main/ThePioneer", "/pmwiki/pmwiki.php/Main/SettlingTheFrontier", "/pmwiki/pmwiki.php/Main/WildWest", "/pmwiki/pmwiki.php/Main/DawnOfAnEra", "/pmwiki/pmwiki.php/Main/TwilightOfTheOldWest", "/pmwiki/pmwiki.php/Main/EndOfAnAge", "/pmwiki/pmwiki.php/Main/WildWest", "https://en.wikipedia.org/wiki/Oumpah-pah", "/pmwiki/pmwiki.php/Main/FrancoBelgianComics", "/pmwiki/pmwiki.php/UsefulNotes/TheAmericanRevolution", "/pmwiki/pmwiki.php/Main/WhatTheHellCastingAgency", "/pmwiki/pmwiki.php/UsefulNotes/WarOf1812", "/pmwiki/pmwiki.php/UsefulNotes/HughGlass", "/pmwiki/pmwiki.php/Main/BearsAreBadNews", "/pmwiki/pmwiki.php/Main/WildWest", "/pmwiki/pmwiki.php/Main/PunnyTitle", "/pmwiki/pmwiki.php/Main/TheWestern", "/pmwiki/pmwiki.php/UsefulNotes/DavyCrockett", "/pmwiki/pmwiki.php/Main/VideoGames"]}