{"title": "Slime, Snails, and Mutant Tails", "content": "Various cartoons and toy lines, especially in the late 1980s and early 1990s, used repulsive slimy creatures and ooze to appeal to kids, especially boys (hence the trope name pun). Keywords were \"gross\", \"slime\" (or if you're British \"gunge\") and \"ooze\".\n\nToys often focused on some gimmick based around some goopy liquid, and most of these franchises had an obsession with the toxic waste theme. That meant lots of villains, and sometimes heroes, based on mutant abilities, bizarre chimeras, and distorted bodies. The ooze often appeared with a brightly unnatural Sickly Green Glow.\n\nThe theme gradually went away when more conventional comic book heroes started getting their own cartoon adaptations. Slime made a comeback in kids toys in The New '10s, though in addition to the traditional gross-out ooze aimed at boys, sparkly, rainbow, or \"unicorn poop\" themed slime toys aimed at girls also started to become popular.\n\nSee also Boys Like Creepy Critters, which uses the same idea of \"gross\" being cool to boys.\n• Creepy Crawlers was also spawned from a toyline, this time without the stylish look upgrade for the cartoon.\n• Early Digimon designs such as Numemon, Raremon and Sukamon very much took this trope to heart, but as the series went on Digimon started to focus more on badass, cool, and cute looking mons, though slimy gross-out mons are still quite prominent, even if they're mainly treated like jokes nowadays.\n• Goosebumps is not far from that.\n• Mattel's line of \"Mad Scientist\" toys, which included a \"Dissect-An-Alien\" kit (complete with phosphorescent slime for \"Alien Blood') and a \"Monster Maker\" kit that featured an acid bath that would dissolve the \"monster flesh\" from their bones.\n• One curious piece of merchandise for the Harry Potter films was the Slime Chamber , which doesn't exist in either the films or the books. The sole reason for this toy's existence seems to be \"kids love toys with slime\".\n• Doctor Dreadful is a toy line first introduced by Tyco, currently produced by Umagine. It makes candy and other treats with slime and other creepy themes.\n• The Masters of the Universe villains, the Evil Horde, got an entire playset based around this concept, the Horde Slime Pit. A claw would reach up to ensnare an action hero, and then a dinosaur skull would open its jaw to drop the official \"slime,\" a green semisolid that came in a canister, similar to the Ghostbusters goo.\n• Mighty Max was created as a toyline specifically to cash on that trend, although its animated version was toned down with a graphic style closer to Batman: The Animated Series.\n• Initially, Mighty Morphin' Power Rangers cashed that cow too, with many of their adversaries looking like Otto Mann's acid dreams (Rita Repulsa probably took lessons from Rob Zombie himself).\n• The villain of the 90s movie is a Blob Monster named Ivan Ooze who invokes this trope in-universe, selling children slime that brainwashes their parents.\n• While the decision to adopt the show in the 90s probably came from this, the original Japanese Super Sentai series has a long history of really bizarre, disgusting monster designs. While the first few shows mostly had thugs in ridiculous costumes, Denshi Sentai Denziman's Vader Monsters entire gimmick was that they came from a planet where people had entirely different ideas of beauty and ugliness and were made by the designers to be as grotesque as a TV budget would allow. The franchise has never really looked back since.\n• The Mutant League games are a nice example; they even spawned a cartoon that lasted more than one season.\n• The Real Ghostbusters got that directly from the movies. Its toy line sold all sorts of ugly ghost creatures that looked closer to extreme mutants than spirits. It also included synthetic \"ectoplasm\".\n• Similarly Swamp Thing; both were kid-washed animated versions of violent comics. The latter succeeded only as a toyline, since only five episodes were made. Toxic Crusaders, of The Toxic Avenger fame, got a slightly better deal with 13 episodes.\n• Tales from the Crypt and its animated series were kind of the sophisticated version of that.\n• The formula was copy-pasted for the Teenage Mutant Ninja Turtles, which included \"ooze\" and featured humanoid creatures covered with garbage and insects.\n• Green slime was a Running Gag on kids' series You Can't Do That on Television.\n• Ooze in general became an emblem of Nickelodeon, and the \"main\" form for their logo was a splat. Toys they produced pased on this had names like \"Gak\", \"Floam\", and \"Smud\".\n• A Spear Counterpart to the class EZ Bake Oven was called \"Queasy Bake\" and ran with this trope.\n• Mixels has the Glorp Corp, a Mixels tribe that is based around goo and slime. Their figurines use transparent green pieces to invoke their slime.\n• The playfield for Scared Stiff is covered with dripping green goo.\n• The Trash Pack is designed around disgusting creatures and rotten food, dripping with slime and named with synonyms for \"gross\". This would continue into their successor, The Grossery Gang.\n• Nickelodeon produced the Thingmaker Chill-A-Tron Lab, which was like a cross between Doctor Dreadful and Creepy Crawlers; like Doctor Dreadful, it had a mad scientist theme to it, but, like Creepy Crawlers, you couldn't eat what you made. It worked using ice rather than heat.\n• Flush Force is a whole toyline of blind-bagged mutant creatures inside toilets, which have water poured into them to break them out.\n• Parodied in the Strong Bad Email \"Action Figure\", one of the features Strong Bad lists his hypothetical action figure having is oozing radioactive goo.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/SlimeSnailsAndMutantTails", "media_links": ["/pmwiki/pmwiki.php/WesternAnimation/CreepyCrawlers", "/pmwiki/pmwiki.php/Franchise/Digimon", "/pmwiki/pmwiki.php/Literature/Goosebumps", "/pmwiki/pmwiki.php/Creator/Mattel", "/pmwiki/pmwiki.php/Franchise/HarryPotter", "/pmwiki/pmwiki.php/Creator/Tyco", "/pmwiki/pmwiki.php/Franchise/MastersOfTheUniverse", "/pmwiki/pmwiki.php/WesternAnimation/MightyMax", "/pmwiki/pmwiki.php/WesternAnimation/BatmanTheAnimatedSeries", "/pmwiki/pmwiki.php/Series/MightyMorphinPowerRangers", "/pmwiki/pmwiki.php/Film/MightyMorphinPowerRangersThemovie", "/pmwiki/pmwiki.php/Franchise/SuperSentai", "/pmwiki/pmwiki.php/Series/DenshiSentaiDenziman", "/pmwiki/pmwiki.php/WesternAnimation/MutantLeague", "/pmwiki/pmwiki.php/WesternAnimation/TheRealGhostbusters", "/pmwiki/pmwiki.php/WesternAnimation/SwampThing", "/pmwiki/pmwiki.php/WesternAnimation/ToxicCrusaders", "/pmwiki/pmwiki.php/Film/TheToxicAvenger", "/pmwiki/pmwiki.php/Series/TalesFromTheCrypt", "/pmwiki/pmwiki.php/WesternAnimation/TeenageMutantNinjaTurtles1987", "/pmwiki/pmwiki.php/Series/YouCantDoThatOnTelevision", "/pmwiki/pmwiki.php/Creator/Nickelodeon", "/pmwiki/pmwiki.php/WesternAnimation/Mixels", "/pmwiki/pmwiki.php/Toys/TheTrashPack", "/pmwiki/pmwiki.php/Toys/TheGrosseryGang", "/pmwiki/pmwiki.php/Creator/Nickelodeon", "/pmwiki/pmwiki.php/Toys/FlushForce"], "non_media_links": ["/pmwiki/pmwiki.php/Main/SicklyGreenGlow", "/pmwiki/pmwiki.php/Main/PopularityPolynomial", "/pmwiki/pmwiki.php/Main/TheNewTens", "/pmwiki/pmwiki.php/Main/EverythingsBetterWithSparkles", "/pmwiki/pmwiki.php/Main/EverythingsBetterWithRainbows", "/pmwiki/pmwiki.php/Main/Unicorn", "/pmwiki/pmwiki.php/Main/ToiletHumor", "/pmwiki/pmwiki.php/Main/BoysLikeCreepyCritters", "/pmwiki/pmwiki.php/Main/RidiculouslyCuteCritter", "/pmwiki/pmwiki.php/Main/Mons", "https://www.youtube.com/watch?v=f-TBcCQu_D4", "/pmwiki/pmwiki.php/Main/BlobMonster", "/pmwiki/pmwiki.php/Main/MayContainEvil", "/pmwiki/pmwiki.php/Main/RunningGag", "/pmwiki/pmwiki.php/Main/SpearCounterpart", "/pmwiki/pmwiki.php/Pinball/ScaredStiff", "/pmwiki/pmwiki.php/WebAnimation/StrongBadEmail"]}