{"title": "Good Doc, Bad Doc", "content": "In any given medical drama, the conflict is rarely restricted to doctors vs. diseases. Very often, there will be doctors that attempt to assert on their fellow healers one of two diametrically opposed ideologies. It is practically a given that there will be at least two doctors on opposite sides of the issue who are constantly at odds with each other.\n\nOne doctor (\"Good Doc\") holds her role as a medical practitioner in the highest esteem. She is equally likely to be a jaded expert physician or a young idealist. The other doctor (\"Bad Doc\") insists that making money is an important part of the medical profession. He is often a senior or higher-promoted doctor.\n\nUsually, \"Good Doc\" will insist that \"Bad Doc\" is a heartless greedy bastard who sees patients as walking (or rolling or comatose) piggy banks in need of a good MRI-hammer or two, regardless of whether it's true. \"Bad Doc\" will usually insist that he is a pragmatist who understands that the hospital must help itself in order to help others, despite any evidence to the contrary.\n\nCommon sources of head-butting between Good Doc and Bad Doc are:\n• Handling of uninsured patients: Good Doc will treat them anyway and take the loss, Bad Doc will say, \"Get them stable and send them off to the state hospital.\"\n• Distribution of transplant organs or slots in medical trials: Good Doc will usually try to steer them to poor, unconnected patients, while Bad Doc will give them to wealthy patients who could potentially afford alternative, but less pleasant/effective, treatments. Bad Doc will often justify this by detailing exactly what program their endowment will be funding.\n• Buying new hospital equipment: Good Doc thinks they need the best they can afford, Bad Doc will opt for a cheaper version.\n\nNot really common in medical dramas set outside the USA, but... let's not go there, huh?", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/GoodDocBadDoc", "media_links": ["/pmwiki/pmwiki.php/Manga/BlackJack", "/pmwiki/pmwiki.php/Manga/SayHelloToBlackJack", "/pmwiki/pmwiki.php/Anime/Monster", "/pmwiki/pmwiki.php/Film/PatchAdams", "/pmwiki/pmwiki.php/Creator/RobinWilliams", "/pmwiki/pmwiki.php/Film/TheCitadel", "/pmwiki/pmwiki.php/Film/JohnQ", "/pmwiki/pmwiki.php/Literature/CircleOfMagic", "/pmwiki/pmwiki.php/Series/Scrubs", "/pmwiki/pmwiki.php/Series/House", "/pmwiki/pmwiki.php/Series/BabylonFive", "/pmwiki/pmwiki.php/Series/TheGoodDoctor", "/pmwiki/pmwiki.php/VideoGame/TraumaCenter"], "non_media_links": ["/pmwiki/pmwiki.php/Main/DrJerk", "/pmwiki/pmwiki.php/Main/WideEyedIdealist", "/pmwiki/pmwiki.php/Administrivia/RuleOfCautiousEditingJudgment", "/pmwiki/pmwiki.php/Main/JerkWithAHeartOfGold", "/pmwiki/pmwiki.php/Main/GreenThumb", "/pmwiki/pmwiki.php/Main/JerkassHasAPoint", "/pmwiki/pmwiki.php/Main/JerkassHasAPoint", "/pmwiki/pmwiki.php/Main/OnlyInItForTheMoney", "/pmwiki/pmwiki.php/Recap/BabylonFiveS01E10Believers", "/pmwiki/pmwiki.php/Main/HandicappedBadass", "/pmwiki/pmwiki.php/Main/NiceGirl", "/pmwiki/pmwiki.php/Main/ReasonableAuthorityFigure", "/pmwiki/pmwiki.php/Main/TheAce", "/pmwiki/pmwiki.php/Main/AmbitionIsEvil", "/pmwiki/pmwiki.php/Main/BitchInSheepsClothing", "/pmwiki/pmwiki.php/Main/FridgeBrilliance"]}