{"title": "Rancher", "content": "A rancher is the owner of a ranch, a spread of land where animals are raised. In The Western, usually this is cattle, but sheep, chicken and (in the modern day) ostriches are all potential ranches.\n\nThe Rancher employs the Cowboy, Camp Cook and other ranch workers. He (or sometimes she) is the equivalent of a business owner in a more urban setting. They generally will dress a little better than their employees, but not too much—most ranchers are hands-on to some degree, and need to be able to do anything an ordinary cowboy could. Indeed, many a cowboy has the ambition of gaining a ranch of his very own.\n\nIn fiction, the larger the ranch is, the more likely the rancher is to be the bad guy of the story. This is not a hard and fast rule (the Cartwrights of Bonanza have an immense spread, but are salt of the earth types), but that's the way to bet. If the rancher owns several ranches, or one big enough to count as its own feudal country, they become a Cattle Baron.\n\n\"Saving the ranch\" is a common plotline for Westerns, especially in B-movies, as a couple of bad years could put a small rancher on the verge of bankruptcy.\n• Wonder Woman: Etta's parents Hard and Sugar Candy are ranchers in Texas. Most of their ranch hands are originally from Mexico and Hard is always dressed much nicer—though still in western duds with a cowboy hat—than his workers. They also have a couple of oil wells on the property and the ranch borders an oil field.\n• The plaas where sisters Johanna and Mariella Smith-Rhodes were brought up in the Discworld of A.A. Pessimal is pretty much a ranch: quite a few square miles of Rimwards Howondaland belonging to their father, Barbarossa Smith-Rhodes. It sets the scene for how two Boer girls had the strength and aptitude to become career Assassins. And how a sort of \"South African\" came to add to the interesting and volatile ethnic mix in Ankh-Morpork.\n• The ranch owner who needs the Cattle Drive done in City Slickers\n• Joe Bannock in A Town Like Alice. Though he didn't own it til the end, if memory serves.\n• The Cowboys: Wil Andersen has to hire young boys when his cattle drivers head for the gold fields.\n• Big Jake: The McCandles ranch is run over by a gang of cutthroats.\n• Chisum: Very loosly based on the Lincoln Country War.\n• The Man Who Shot Liberty Valance: Tom Doniphon had a small ranch.\n• Dan Evans in 3:10 to Yuma (2007), who takes a job escorting a criminal so he can help support his ranch.\n• Beans in Rango owns a ranch that the mayor of town wants to purchase from.\n• Homer Bannon, the family patriarch in Hud (1963), which is set in the New Old West (i.e., the modern day). Homer's catttle ranch is put in dire peril when the specter of foot-and-mouth disease raises the possibility that the whole herd will have to be put down.\n• In The Man from Kangaroo, Greythorn owns a large cattle station near Kalmaroo. He initially invites John to become The Vicar in Kalmaroo, and then gives him a job as a jackaroo when John has a crisis of faith and quits the ministry.\n• 'Ole Devil' Hardin in the Western novels of J.T. Edson.\n• The Sci-Fi novel Malevil has an interesting example. Before World War III, the main character is a rural French rancher who expands his property to include an old castle. He keeps the usual livestock and grazing land but also stables some his animals in a cave under the keep. He also runs a vineyard, produces wine, and had plans to reopen the castle to tourists.\n• Luke Fletcher in Shane is an example of the Big Bad Rancher.\n• Star Wars: Kenobi: Orrin Gault owns the largest spread of land in the Pika Oasis, and as the organizer of the Settlers' Call posse, is the unofficial leader of the local moisture farmers. His impression of genial first-among-equals wealth is a front; he's heavily in debt and is embezzling from the Call to stave off his creditors .\n• The titular Martín Fierro owned his own spread of land, while he worked for el patrón (a Cattle Baron), so he was a relatively rich guy before all these misfortunes fell on him.\n• In River of Teeth, Houndstooth's Dark and Troubled Past includes having been a hippo rancher, the most talented at breeding hippos in all of the United States. It had taken him fifteen years to safe up for his own ranch and then several more to build it up to its eventual size and reputation. The ranch was then burned down by Cal Hotchkiss who had run over to Travers.\n• The Cartwright family of Bonanza, as mentioned above, provided that Ben doesn't slip into outright Cattle Baron territory.\n• In one Magnum, P.I. episode there is a teenage rancher who needs our heroes' help.\n• The Kents' farm in Smallville is an important element.\n• In order, Judge Garth, the Grainger brothers, and Col. Mac Kenzie, owners of the Shiloh Ranch in The Virginian (later The Men From Shiloh).\n• The Ranch. Exactly What It Says on the Tin, Beau Bennett and his sons own a failing ranch.\n• Black Saddle: In \"Client: McQueen\", Clay's client is a retired senator who owns the biggest ranch in Texas and who is being bilked out of his property by his daughter and his adopted son.\n• Traveller: The ideal Aslan noble family owns a ranch. As Aslan are a Proud Warrior Race the male is supposed to hold it by virtue of his status as a Real Man.\n• Peggy's dad in King of the Hill is a cattle rancher who lives in Montana.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/Rancher", "media_links": ["/pmwiki/pmwiki.php/Series/Bonanza", "/pmwiki/pmwiki.php/Franchise/WonderWoman", "/pmwiki/pmwiki.php/Literature/Discworld", "/pmwiki/pmwiki.php/Creator/AAPessimal", "/pmwiki/pmwiki.php/Film/CitySlickers", "/pmwiki/pmwiki.php/Film/NightOfTheWolf", "/pmwiki/pmwiki.php/Film/TheJourneyOfNattyGann", "/pmwiki/pmwiki.php/Literature/ATownLikeAlice", "/pmwiki/pmwiki.php/Film/TheCowboys", "/pmwiki/pmwiki.php/Film/BigJake", "/pmwiki/pmwiki.php/Film/Chisum", "/pmwiki/pmwiki.php/Film/McLintock", "/pmwiki/pmwiki.php/Film/TheManWhoShotLibertyValance", "/pmwiki/pmwiki.php/Film/ThreeTenToYuma2007", "/pmwiki/pmwiki.php/WesternAnimation/Rango", "/pmwiki/pmwiki.php/Film/Giant", "/pmwiki/pmwiki.php/Film/Hud", "/pmwiki/pmwiki.php/Film/TheManFromKangaroo", "/pmwiki/pmwiki.php/Creator/JTEdson", "/pmwiki/pmwiki.php/Literature/Malevil", "/pmwiki/pmwiki.php/Literature/Shane", "/pmwiki/pmwiki.php/Literature/StarWarsKenobi", "/pmwiki/pmwiki.php/Literature/MartinFierro", "/pmwiki/pmwiki.php/Literature/RiverOfTeeth", "/pmwiki/pmwiki.php/Series/Bonanza", "/pmwiki/pmwiki.php/Series/MagnumPI", "/pmwiki/pmwiki.php/Series/Smallville", "/pmwiki/pmwiki.php/Series/TheVirginian", "/pmwiki/pmwiki.php/Series/Firefly", "/pmwiki/pmwiki.php/Series/TheRanch", "/pmwiki/pmwiki.php/Series/BlackSaddle", "/pmwiki/pmwiki.php/TabletopGame/Traveller", "/pmwiki/pmwiki.php/WesternAnimation/KingOfTheHill"], "non_media_links": ["/pmwiki/pmwiki.php/Main/TheWestern", "/pmwiki/pmwiki.php/Main/Rancher", "/pmwiki/pmwiki.php/Main/Cowboy", "/pmwiki/pmwiki.php/Main/CampCook", "/pmwiki/pmwiki.php/Main/CattleBaron", "/pmwiki/pmwiki.php/Main/ComicBooks", "/pmwiki/pmwiki.php/UsefulNotes/SouthAfrica", "/pmwiki/pmwiki.php/Main/NamesToRunAwayFromReallyFast", "/pmwiki/pmwiki.php/Main/PapaWolf", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/CattleDrive", "/pmwiki/pmwiki.php/Main/DeterminedWidow", "/pmwiki/pmwiki.php/Main/NewOldWest", "/pmwiki/pmwiki.php/Main/TheVicar", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/SciFi", "/pmwiki/pmwiki.php/Main/WorldWarIII", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/Posse", "/pmwiki/pmwiki.php/Main/CattleBaron", "/pmwiki/pmwiki.php/Main/DarkAndTroubledPast", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/CattleBaron", "/pmwiki/pmwiki.php/Main/MacKenzie", "/pmwiki/pmwiki.php/Main/TheMenFromShiloh", "/pmwiki/pmwiki.php/Main/ExactlyWhatItSaysOnTheTin", "/pmwiki/pmwiki.php/Main/TabletopGames", "/pmwiki/pmwiki.php/Main/ProudWarriorRace", "/pmwiki/pmwiki.php/Main/ARealManIsAKiller", "/pmwiki/pmwiki.php/Main/WesternAnimation"]}