{"title": "Animal Facial Hair", "content": "This is when an animal, often an anthropomorphic animal, has facial hair, whether in the form of a mustache or beard. Sometimes, the facial hair is in the form of whiskers slicked into a moustache. Sometimes, the facial hair, moustache or goatee is a marking, smudge, or localized area of individual hairs that look like a moustache or goatee.\n\nFictional examples can apply to pretty much any animal as long as it's not a natural feature of their species; or in the case of dogs, a default characteristic of the breed.\n\nCompare Furry Baldness, Furry Female Mane, Weird Beard, and Nonmammalian Hair. See also Clothing Appendage.\n• Dogmatix in Asterix has a mustache, like all the Gaulish men.\n• Disney Ducks Comic Universe:\n• The Funny Animal duck Flintheart Glomgold, a major antagonist to Scrooge McDuck, has a big bushy beard.\n• And of course Scrooge himself has his sideburns.\n• In Muppets King Arthur, Rowlf plays Merlin with a Wizard Beard, as on The Jim Henson Hour, below.\n• Alice in Wonderland: Justified, but also Exaggerated, with the Walrus' yellow moustache, which is longer than that of a real walrus.\n• Ratty from The Adventures of Ichabod and Mr. Toad has a mustache and Angus MacBadger has a white beard.\n• In An American Tail Papa Mousekewitz has a beard, and several background characters have beards or mustaches.\n• In Gay Purr-ee, Big Bad Meowrice has his whiskers slicked into a mustache.\n• The Great Mouse Detective: Dr. Dawson and Hiram Flaversham both have mustaches.\n• In The Lion King, the part of lions' manes under their chin looks beardlike; Scar in particular has a leonine Beard of Evil.\n• Open Season: Roger, the skinny cat in the two sequels, looks like he has an off-center variant of a toothbrush moustache.\n• The Rescuers: Rufus the cat has a mustache, as do some of the mice in the Rescue Aid Society.\n• The Secret of NIMH: Mr. Ages has both eyebrows and a mustache, while Nicodemus and the Great Owl have especially long ones. Jenner has Big Ol' Eyebrows and an evil goatee.\n• Shrek 2:\n• Harold keeps his goatee even when he turns into a frog.\n• Puss in Boots and Donkey have goatees, and Puss has his whiskers slicked into a moustache.\n• Merlin in The Sword in the Stone usually keeps his facial hair when morphing into various animals (justified in walrus and goat form, not so much in squirrel, rabbit, mouse, crab or caterpillar forms...)\n• Played with in The Muppets films:\n• In The Muppet Movie; one scene shows Kermit shaving, but then he comments \"I wish I had whiskers. Of course, then I'd have to use a blade.\"\n• In The Muppets Take Manhattan he claims to be growing a moustache, which Jenny \"helps along\" with makeup.\n• Who Framed Roger Rabbit: Roger Rabbit wears an orange Hitler-style toothbrush moustache on a Wartime Cartoon poster featuring Baby Herman.\n• In the Chanur Novels the lion-like Hani have beards and moustaches, along with manes. Both genders.\n• Redwall: Older mice in the animated adaptations have beards made of whiskers. Younger mice look more \"clean-shaven\", and a few officer hares have mustaches.\n• In The Jim Henson Hour, Rowlf plays Merlin in a sketch, and has a Wizard Beard.\n• Disney Theme Parks: The kitten pictured on the picture of Horace Horsecollar helping with Disney California Adventure's expansion has a nose that looks like a toothbrush moustache. Here is a bigger picture .\n• Angry Birds: One of the pigs has a brushlike orange moustache.\n• Skylanders: Ramses the dragon has a white beard and bushy eyebrows because he is very old.\n• Star Fox:\n• Fox himself grows a goatee after becoming a father in one of the (non-canonical) Starfox Command endings.\n• Touhou: Genjii from the PC-98 games had a beard. Note that Genjii was a non-anthropomorphic turtle.\n• In World of Warcraft the little boy Pandaren will sometimes say when clicked on that he's growing a beard. Pandaren are, of course, anthropomorphic pandas and some do indeed have beards, putting them into this trope.\n• Lackadaisy: Many of the male characters have patterns in their fur that look like facial hair (Victor's snout/face is brighter and looks like a goatee + mustache, for instance.)\n• Twokinds: Many of the Keidran and Bastitins (particularly the older males) have various kinds of facial hair. One of the main characters, a bastian named Keith eventually grows a small goatee.\n• The website Cats That Look Like Hitler , features cats and kittens that look like Adolf Hitler, or at least have toothbrush moustaches.\n• The Annoying Orange: In a vegetable example, Professor Plum has a moustache and a beard.\n• Blitz Wolf: Adolf Wolf has a black ribbon-shaped moustache that is similar to Adolf Hitler's infamous toothbrush moustache.\n• Chip 'n Dale Rescue Rangers: Monterey Jack had a very thick moustache as well as whiskers. It would twirl itself when he smells cheese.\n• In Dog City, Mayor Kickbark and Rusty MacCracken in the animated sections have moustaches, as does McCracken's puppet inspiration Mr MacTaggart.\n• Littlest Pet Shop (2012): Some pets have this, including Digby (\"Trading Places\") and Sam U.L. (\"Terriers and Tiaras\"), who have mustaches/beards. They are portrayed as somewhat masculine (Zoe has an unspoken crush on Digby, while Sam U.L. is a hard training Bruxellois).\n• Looney Tunes:\n• In \"The Old Gray Hare\", after a Flash Forward to the year 2000, a 70-or-so-year-old Bugs Bunny is shown with white chin whiskers.\n• The Adolf Hitler caricature duck from the Wartime Cartoon \"Ducktators\" has a toothbrush moustache on his bill tip.\n• El Supremo the Mexican cat from \"Daffy's Diner\" has whiskers that curve upward reminiscent of a classic Mexican moustache.\n• In MAD:\n• One skit parodying Duck Dynasty, \"McDuck Dynasty\", features Scrooge, Donald, Huey, Dewey, and Louie. Donald and Scrooge have beards made of feathers.\n• In another skit, there is a light grey dog dressed up as his owner Rick who has a slightly lighter grey moustache of this type.\n• In My Little Pony: Friendship Is Magic, beards and mustaches show up sometimes on stallions and vary between being the same colour(s) as their mane and tail or being a generic black.\n• Wakko's Wish: The Warner\u0092s father, King William the Good has a moustache that looks like catfish whiskers, but more curved.\n• SWAT Kats: Commander Feral has what appear to be waxed whiskers styled like a mustache, Professor Hackle has the \"muzzle beard\" kind, wrapping around to encompass his jawline and cheek fur, and is colored white like his hair (his actual fur is kind of grayish tan) and several other characters either have face fur suggestive of a beard or mustache (and, in Tiger Conklin's case, stripes), or actual, separate beards and mustaches.\n• The bearded vulture or lammergeier has facial feathers that look like a beard.\n• The mustache of the walrus makes it quite easy to anthropomorphize this animal.\n• Goats are so well-known for their beards they even named a kind of beard after them.\n• Some tabby cats and white spotted cats appear to have moustaches.\n• The schnauzer (a breed of terrier) is named after a German term for mustache, because it looks like it's wearing one. For that matter, many other terrier breeds have a similar appearance.\n• Many dogs have a dark skin pigment marking on their upper lip right under their nose that can look like a toothbrush moustache due to said dark upper pigment showing under the light, lighter, or white fur.\n• The patas monkey has a white, twirly mustache. This and its red fur, resembling a Hungarian Hussar's uniform, gave the animal its alternative name \"Hussar monkey\".\n• The emperor tamarin has a large, white mustache, resembling that of German emperor Wilhelm II.\n• The male moustached kingfisher has orange and blue feathers and blue feathers trailing from the outer corners of his beak that look like a moustache.\n• Horses can sometimes grow something very much like a moustache as part of their winter coats.\n• Bearded Dragons have a collection of spines underneath their chins which resemble a large reptilian beard, when they feel threatened they puff up and darken it to look more dangerous.\n• A certain domestic rabbit pattern is called a Charlie (an extreme high grade type of white or broken pattern) after Chaplin, because they sometimes have an abbreviated toothbrush moustache that resembles his.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/AnimalFacialHair", "media_links": ["/pmwiki/pmwiki.php/WesternAnimation/LittlestPetShop2012", "/pmwiki/pmwiki.php/ComicBook/Asterix", "/pmwiki/pmwiki.php/ComicBook/DisneyDucksComicUniverse", "/pmwiki/pmwiki.php/Series/TheJimHensonHour", "/pmwiki/pmwiki.php/Disney/AliceInWonderland", "/pmwiki/pmwiki.php/Disney/TheAdventuresOfIchabodAndMrToad", "/pmwiki/pmwiki.php/WesternAnimation/AnAmericanTail", "/pmwiki/pmwiki.php/WesternAnimation/GayPurree", "/pmwiki/pmwiki.php/Disney/TheGreatMouseDetective", "/pmwiki/pmwiki.php/Disney/TheLionKing", "/pmwiki/pmwiki.php/WesternAnimation/KungFuPanda", "/pmwiki/pmwiki.php/WesternAnimation/OpenSeason", "/pmwiki/pmwiki.php/Disney/TheRescuers", "/pmwiki/pmwiki.php/WesternAnimation/TheSecretOfNIMH", "/pmwiki/pmwiki.php/WesternAnimation/Shrek2", "/pmwiki/pmwiki.php/Disney/TheSwordInTheStone", "/pmwiki/pmwiki.php/Film/TheMuppets", "/pmwiki/pmwiki.php/Film/TheMuppetMovie", "/pmwiki/pmwiki.php/Film/TheMuppetsTakeManhattan", "/pmwiki/pmwiki.php/Film/WhoFramedRogerRabbit", "/pmwiki/pmwiki.php/Literature/ChanurNovels", "/pmwiki/pmwiki.php/Literature/Redwall", "/pmwiki/pmwiki.php/Series/TheJimHensonHour", "/pmwiki/pmwiki.php/Theatre/Wicked", "/pmwiki/pmwiki.php/Ride/DisneyThemeParks", "/pmwiki/pmwiki.php/VideoGame/AngryBirds", "/pmwiki/pmwiki.php/VideoGame/Skylanders", "/pmwiki/pmwiki.php/VideoGame/StarFox", "/pmwiki/pmwiki.php/VideoGame/Touhou", "/pmwiki/pmwiki.php/VideoGame/WorldOfWarcraft", "/pmwiki/pmwiki.php/Webcomic/Lackadaisy", "/pmwiki/pmwiki.php/Webcomic/Twokinds", "/pmwiki/pmwiki.php/WesternAnimation/BlitzWolf", "/pmwiki/pmwiki.php/WesternAnimation/ChipNDaleRescueRangers", "/pmwiki/pmwiki.php/WesternAnimation/DogCity", "/pmwiki/pmwiki.php/WesternAnimation/LittlestPetShop2012", "/pmwiki/pmwiki.php/WesternAnimation/LooneyTunes", "/pmwiki/pmwiki.php/WesternAnimation/BugsBunny", "/pmwiki/pmwiki.php/WesternAnimation/MAD", "/pmwiki/pmwiki.php/Series/DuckDynasty", "/pmwiki/pmwiki.php/WesternAnimation/MyLittlePonyFriendshipIsMagic", "/pmwiki/pmwiki.php/WesternAnimation/SonicSatAM", "/pmwiki/pmwiki.php/WesternAnimation/WakkosWish", "/pmwiki/pmwiki.php/WesternAnimation/SwatKats"], "non_media_links": ["/pmwiki/pmwiki.php/Main/FurryBaldness", "/pmwiki/pmwiki.php/Main/FurryFemaleMane", "/pmwiki/pmwiki.php/Main/WeirdBeard", "/pmwiki/pmwiki.php/Main/NonmammalianHair", "/pmwiki/pmwiki.php/Main/ClothingAppendage", "/pmwiki/pmwiki.php/Main/FunnyAnimal", "/pmwiki/pmwiki.php/Main/WizardBeard", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/BeardOfEvil", "/pmwiki/pmwiki.php/Main/BigOlEyebrows", "/pmwiki/pmwiki.php/Main/BeardOfEvil", "/pmwiki/pmwiki.php/Main/WartimeCartoon", "/pmwiki/pmwiki.php/Main/PuppetShows", "/pmwiki/pmwiki.php/Main/WizardBeard", "https://static.tvtropes.org/pmwiki/pub/images/5347938491_a3bd08fc54_z_1_9088.png", "http://images3.wikia.nocookie.net/__cb20110210033456/disney/images/e/e6/5347938491_a3bd08fc54_z.jpg", "/pmwiki/pmwiki.php/Main/CanonDiscontinuity", "/pmwiki/pmwiki.php/Videogame/StarfoxCommand", "/pmwiki/pmwiki.php/Main/FunnyAnimal", "http://www.catsthatlooklikehitler.com/cgi-bin/seigmiaow.pl?6687", "/pmwiki/pmwiki.php/UsefulNotes/AdolfHitler", "/pmwiki/pmwiki.php/WebVideo/TheAnnoyingOrange", "/pmwiki/pmwiki.php/Main/FlashForward", "/pmwiki/pmwiki.php/UsefulNotes/AdolfHitler", "/pmwiki/pmwiki.php/Main/WartimeCartoon", "/pmwiki/pmwiki.php/Main/MagnificentMoustachesOfMexico", "http://en.wikipedia.org/wiki/Bearded_Vulture", "http://en.wikipedia.org/wiki/Patas_monkey", "http://en.wikipedia.org/wiki/Emperor_tamarin", "/pmwiki/pmwiki.php/Main/DescriptivelyNamedSpecies", "/pmwiki/pmwiki.php/Main/WeirdBeard"]}