{"title": "Visual Novel Shot", "content": "This trope is an Anime Manga exclusive.\n\nIn some scenes with couples, there will be a static background shot of a school facility (usually a hallway or yard) or any home/urban/park area, with a vanishing point (generally centered), representing the protagonist's point of view. In the foreground there's a medium shot of almost always a female character with a shy or gentle expression. This is known as the \"standing image\", in which the character can only be seen in the front usually from the head to the waist.\n\nSimilar to a standard Dating Sim or Visual Novel screen (as well as many Flash games). This shot is commonly used as a device to imply romantic involvement.\n\nMight or not have the menu options and decorative frames (in which case it's a parody).\n• Commonly found in Kyoto Animation's anime adaptations of Key/Visual Arts games, such as Kanon and CLANNAD.\n• In Clannad, some of the jokes were conserved as Tomoya having a random Imagine Spot about what option would he choose if this where a visual novel, and it was shown on screen with an actual scene from another Key game Little Busters!.\n• Excel Saga has an entire episode framed around Il Pallazo playing a dating sim and Excel having to live through the choices he makes. The third choice is always \"Put it in\", not that he ever chooses it.\n• In the final episode, there's a brief return of these shots... and all the options are \"Put It In\".\n• Kimi ni Todoke: Our lovely Sawako shows us how it's done in the picture.\n• There's also a Dating Sim Shot with Saki in the Genshiken manga (and Madarame too).\n• My Little Sister Can't Be This Cute has the male lead introduced to dating sims (against his will), after which he starts seeing menu options whenever he faces a decision. One scene has a shot of his father that matches this trope format.\n• Love Hina: Specifically Motoko's introduction is very much shot using this type of framing.\n• Megatokyo uses it in a panel to show what happens when Piro (the artist, not the character) manages to knock Largo out in creative disputes. In the reverse situation, the comic looks like a First-Person Shooter. (That was before Largo's actual departure)\n• Seen in The World God Only Knows (of course).\n• When the members of Seitokai no Ichizon were discussing Kurimu's bad grades, Sugisaki imagines himself playing the scene out in one of his games. He chooses to save and click the 'hug' option to start a sex scene.\n• Kannagi, episode 11: Takako visualizes Jin's life with Nagi, Tsugumi and Zange as this.\n• Episode 8 of Love, Chunibyo & Other Delusions features this type of shot with Rikka.\n• The anime and manga database site Anilist parodies this trope by putting a rather funny 404 page (only for registered users).", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/VisualNovelShot", "media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/Manga/KimiNiTodoke", "https://tvtropes.org/pmwiki/pmwiki.php/Creator/KyotoAnimation", "https://tvtropes.org/pmwiki/pmwiki.php/Creator/KeyVisualArts", "https://tvtropes.org/pmwiki/pmwiki.php/VisualNovel/Kanon", "https://tvtropes.org/pmwiki/pmwiki.php/VisualNovel/Clannad", "https://tvtropes.org/pmwiki/pmwiki.php/VisualNovel/LittleBusters", "https://tvtropes.org/pmwiki/pmwiki.php/Anime/ExcelSaga", "https://tvtropes.org/pmwiki/pmwiki.php/Manga/KimiNiTodoke", "https://tvtropes.org/pmwiki/pmwiki.php/Manga/Genshiken", "https://tvtropes.org/pmwiki/pmwiki.php/LightNovel/Oreimo", "https://tvtropes.org/pmwiki/pmwiki.php/Manga/LoveHina", "https://tvtropes.org/pmwiki/pmwiki.php/Webcomic/Megatokyo", "https://tvtropes.org/pmwiki/pmwiki.php/Manga/TheWorldGodOnlyKnows", "https://tvtropes.org/pmwiki/pmwiki.php/LightNovel/SeitokaiNoIchizon", "https://tvtropes.org/pmwiki/pmwiki.php/Manga/Kannagi", "https://tvtropes.org/pmwiki/pmwiki.php/LightNovel/LoveChunibyoAndOtherDelusions"], "non_media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/Main/Anime", "https://tvtropes.org/pmwiki/pmwiki.php/Main/Manga", "https://tvtropes.org/pmwiki/pmwiki.php/Main/AlwaysFemale", "https://tvtropes.org/pmwiki/pmwiki.php/Main/DatingSim", "https://tvtropes.org/pmwiki/pmwiki.php/Main/VisualNovel", "https://tvtropes.org/pmwiki/pmwiki.php/Main/ImagineSpot", "https://tvtropes.org/pmwiki/pmwiki.php/Main/FirstPersonShooter", "https://tvtropes.org/pmwiki/pmwiki.php/Main/FunnyAneurysmMoment", "https://static.tvtropes.org/pmwiki/pub/images/i1no6ed.jpg"]}