{"title": "Wretched Hive", "content": "Take the worst, grimmest and darkest side of society, give them a place where all their sins are given free roam to be expressed, collect it into a system that can just barely sustain itself and you get the Wretched Hive.\n\nIt will be a mostly lawless setting, usually (over) populated by criminals. There may be no actual government in this Wild West or Scavenger World because it is miles or light years away from civilization, and if there is it's probably a Dystopia that's corrupt, incompetent, obstructive or perhaps just uncaring enough to not bother to spread its reach to all corners of society. If this hive has any truly good authorities, expect them to be extremely overworked, incapable of controlling the skyrocketing crime everywhere, or just too idealistic to survive. An alternative is to have it as a gang-like system ruled by a mob boss, Big Bad or Evil Overlord who allows evil, but only to a certain standard. It could be truly lawless with no authority other than the big stick you carry with you.\n\nIn many cases, the economy is no better. If this is true, facilities are usually falling apart, and the subways and buses are often full of crooks and junkies. And they're always late. Any schools in this place will almost inevitably be impoverished or sadistic. The roads may be cracked and broken, with a Trashcan Bonfire every fifty feet or so. Many buildings have been abandoned, to be occupied by vermin, hobos, or criminals. Decent jobs are few and far between. Housing (if you can get it) is unsafe, filthy, and overcrowded. In short, poverty is the norm, not the exception.\n\nHowever, prosperous and affluent settings can also qualify as this trope. While people are more likely to be in decent financial shape, don't expect things to be any better in terms of morality. At most, there's a pleasant façade to conceal the rot within. Sleazy, immoral decadence is frequently rife, and may not even be particularly hidden—if it is at all. Non-impoverished examples are arguably worse, ethically and morally speaking, since the inhabitants don't have deprivation as an explanation for the things they do.\n\nThis lawless setting is often wonderful for allowing all varieties of creativity, ideas and/or tropes to flow in, be played and interact in interesting ways, and many plot conveniences that the protagonists need to get away with doing active work rather than just handing problems over to the police or running into Fridge Logic when they don't get arrested for taking the law into their own hands, while there are several takes on all sorts of unlawful or devious acts. Gangs, cons, gambling, underground fighting, rampant prostitution, a thriving black market (ranging from one guy with some watches under his coat to a literal market), jaywalking and many more. This can be portrayed as anything from guilty fun or the inevitable underbelly of humanity to constant danger. The heroes can always find some misdeed around them to solve and the villains will have little problem finding a safe hideout or Bad-Guy Bar to get together and plot schemes.\n\nThe Wretched Hive has a few Sub Tropes in increasing size:\n• Den of Iniquity: A room in the Big Bad's lair where the mooks get to indulge in various forms of debauchery.\n• Bad-Guy Bar: A tavern of ill repute where the crooks get together to scheme or get a drink. The tenuous peace is only held together by The Bartender and his Bouncers. Bar room brawls and aggressive drunks optional.\n• The City Narrows: The back alley to the entire town; a small section of a city that has a bad name for a good reason and gets avoided by decent folk with any sense.\n• Red Light District: A street, block, or even complete district of a city devoted to prostitution and other illicit trades.\n• Outlaw Town: A settlement run by criminals, for the benefit of criminals.\n• Dying Town: A town or city whose reason for existence disappeared a long time ago and left behind those who couldn't get out; when you have a lot of poor, desperate people in the same place, some of them will inevitably turn to crime, and that same desperation will also bring plenty of other social problems.\n• Not-So-Safe Harbor: A port, harbour or coastal town that has fallen into wretchedness due to the flux of sailors and pirates and the sort of rough entertainment they desire.\n• Totalitarian Gangsterism: When criminals ruling over said area abuse civilians in every way like a dictatorship would.\n• Vice City: An entire urban sprawl that has fallen to wretchedness including its authorities which provide little sense of escape but also little constraint. Often overlaps with City Noir.\n• Soiled City on a Hill: A city so far gone it is beyond saving. Wipe it off the map and start again.\n• Urban Hellscape: A glimpse 20 Minutes into the Future where violent crime rules the streets and police are either incompetent or have to be even more brutal to stop it.\n\nSee also Gangster Land, City Noir or Industrial Ghetto. When Real Life New York City is portrayed this way, it's The Big Rotten Apple. Has nothing to do with bees.\n\nOften paired with Crapsack World, but differs in that while the setting is less than ideal, the people in it need not be unhappy or universally sociopathic, nor is the worst result the most likely to happen.\n\nOpposite of the Sugar Bowl and Utopia in general, and Shining City more specifically. If the Wretched Hive improves over time, then it becomes a Heel-Face Town.\n\nIf an example fits into one of the more specific subtropes better, please list it there, rather than on this page.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/WretchedHive?from=Main.WretchedHiveOfScumAndVillainy", "media_links": ["/pmwiki/pmwiki.php/Film/ANewHope", "/pmwiki/pmwiki.php/Literature/FightingFantasy", "/pmwiki/pmwiki.php/Literature/LoneWolf", "/pmwiki/pmwiki.php/Music/Space", "/pmwiki/pmwiki.php/Music/Savatage", "/pmwiki/pmwiki.php/Music/StreetsARockOpera", "/pmwiki/pmwiki.php/Music/MotleyCrue", "/pmwiki/pmwiki.php/Music/Suede", "/pmwiki/pmwiki.php/Music/GunsNRoses", "/pmwiki/pmwiki.php/Music/WarrenZevon", "/pmwiki/pmwiki.php/Music/DeathGrips", "/pmwiki/pmwiki.php/Literature/TheBible", "/pmwiki/pmwiki.php/Literature/TheBible", "/pmwiki/pmwiki.php/TabletopGame/Warhammer40K", "/pmwiki/pmwiki.php/TabletopGame/Necromunda", "/pmwiki/pmwiki.php/Creator/BertoltBrecht", "/pmwiki/pmwiki.php/Theatre/TheRiseAndFallOfTheCityOfMahagonny", "/pmwiki/pmwiki.php/Theatre/ThrillMe", "/pmwiki/pmwiki.php/Theatre/LesMiserables", "/pmwiki/pmwiki.php/Literature/Worm"], "non_media_links": ["/pmwiki/pmwiki.php/Main/SevenDeadlySins", "/pmwiki/pmwiki.php/Main/CrapsackWorld", "/pmwiki/pmwiki.php/Main/AnarchyIsChaos", "/pmwiki/pmwiki.php/Main/MoreCriminalsThanTargets", "/pmwiki/pmwiki.php/Main/WildWest", "/pmwiki/pmwiki.php/Main/ScavengerWorld", "/pmwiki/pmwiki.php/Main/Dystopia", "/pmwiki/pmwiki.php/Main/BadCopIncompetentCop", "/pmwiki/pmwiki.php/Main/ObstructiveBureaucrat", "/pmwiki/pmwiki.php/Main/PoliceAreUseless", "/pmwiki/pmwiki.php/Main/BeleagueredBureaucrat", "/pmwiki/pmwiki.php/Main/WideEyedIdealist", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/EvilOverlord", "/pmwiki/pmwiki.php/Main/EvenEvilHasStandards", "/pmwiki/pmwiki.php/Main/MightMakesRight", "/pmwiki/pmwiki.php/Main/ArsonMurderAndJaywalking", "/pmwiki/pmwiki.php/Main/InnerCitySchool", "/pmwiki/pmwiki.php/Main/SuckySchool", "/pmwiki/pmwiki.php/Main/TrashcanBonfire", "/pmwiki/pmwiki.php/Main/CrapsaccharineWorld", "/pmwiki/pmwiki.php/Main/WideOpenSandbox", "/pmwiki/pmwiki.php/Main/FridgeLogic", "/pmwiki/pmwiki.php/Main/HeroInsurance", "/pmwiki/pmwiki.php/Main/TheBarnum", "/pmwiki/pmwiki.php/Main/ArsonMurderAndJaywalking", "/pmwiki/pmwiki.php/Main/BadGuyBar", "/pmwiki/pmwiki.php/Main/SubTrope", "/pmwiki/pmwiki.php/Main/DenOfIniquity", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/BadGuyBar", "/pmwiki/pmwiki.php/Main/TheBartender", "/pmwiki/pmwiki.php/Main/Bouncer", "/pmwiki/pmwiki.php/Main/TheCityNarrows", "/pmwiki/pmwiki.php/Main/RedLightDistrict", "/pmwiki/pmwiki.php/Main/OutlawTown", "/pmwiki/pmwiki.php/Main/DyingTown", "/pmwiki/pmwiki.php/Main/NotSoSafeHarbor", "/pmwiki/pmwiki.php/Main/TotalitarianGangsterism", "/pmwiki/pmwiki.php/Main/ViceCity", "/pmwiki/pmwiki.php/Main/WideOpenSandbox", "/pmwiki/pmwiki.php/Main/CityNoir", "/pmwiki/pmwiki.php/Main/SoiledCityOnAHill", "/pmwiki/pmwiki.php/Main/ItIsBeyondSaving", "/pmwiki/pmwiki.php/Main/UrbanHellscape", "/pmwiki/pmwiki.php/Main/TwentyMinutesIntoTheFuture", "/pmwiki/pmwiki.php/Main/GangsterLand", "/pmwiki/pmwiki.php/Main/CityNoir", "/pmwiki/pmwiki.php/Main/IndustrialGhetto", "/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/UsefulNotes/NewYorkCity", "/pmwiki/pmwiki.php/Main/TheBigRottenApple", "/pmwiki/pmwiki.php/Main/BeeAfraid", "/pmwiki/pmwiki.php/Main/CrapsackWorld", "/pmwiki/pmwiki.php/Main/BeingGoodSucks", "/pmwiki/pmwiki.php/Main/BeingEvilSucks", "/pmwiki/pmwiki.php/Main/YankTheDogsChain", "/pmwiki/pmwiki.php/Main/StatusQuoIsGod", "/pmwiki/pmwiki.php/Main/SugarBowl", "/pmwiki/pmwiki.php/Main/Utopia", "/pmwiki/pmwiki.php/Main/ShiningCity", "/pmwiki/pmwiki.php/Main/HeelFaceTown", "/pmwiki/pmwiki.php/WretchedHive/AnimeAndManga", "/pmwiki/pmwiki.php/WretchedHive/ComicBooks", "/pmwiki/pmwiki.php/WretchedHive/FanWorks", "/pmwiki/pmwiki.php/WretchedHive/Film", "/pmwiki/pmwiki.php/WretchedHive/Literature", "/pmwiki/pmwiki.php/WretchedHive/LiveActionTV", "/pmwiki/pmwiki.php/WretchedHive/TabletopGames", "/pmwiki/pmwiki.php/WretchedHive/VideoGames", "/pmwiki/pmwiki.php/WretchedHive/WebComics", "/pmwiki/pmwiki.php/WretchedHive/WesternAnimation", "/pmwiki/pmwiki.php/WretchedHive/RealLife", "/pmwiki/pmwiki.php/Main/SecretPolice", "/pmwiki/pmwiki.php/Main/OmnicidalManiac", "/pmwiki/pmwiki.php/Main/AxCrazy", "/pmwiki/pmwiki.php/Main/ApatheticCitizens", "/pmwiki/pmwiki.php/Main/FireAndBrimstoneHell", "/pmwiki/pmwiki.php/Main/TheReasonYouSuckSpeech", "/pmwiki/pmwiki.php/Main/FromBadToWorse", "/pmwiki/pmwiki.php/Main/GodEmperor", "/pmwiki/pmwiki.php/Main/GaidenGame", "/pmwiki/pmwiki.php/Main/MobWar", "/pmwiki/pmwiki.php/Main/PlanetOfHats", "/pmwiki/pmwiki.php/Main/ColdBloodedTorture", "/pmwiki/pmwiki.php/Main/CrapsackWorld", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Main/TheHammerTrinity", "/pmwiki/pmwiki.php/Roleplay/NexusGate", "/pmwiki/pmwiki.php/Roleplay/SurvivalOfTheFittest", "/pmwiki/pmwiki.php/Main/FromBadToWorse", "/pmwiki/pmwiki.php/Wiki/RationalWiki", "/pmwiki/pmwiki.php/Main/TropeNamer"]}