{"title": "Subdued Section", "content": "So you're listening to a song, and as it hits the last chorus (or sometimes verse) the guitar (and often bass guitar too), will drop out, leaving just the vocals and drumbeat, giving the lyrics a little more weight until the rest of the instruments return.\n\nOr something like that. While which instruments drop out varies (and when), generally only one or two accompany the vocals during this section.\n\nThis trope can even apply in sections where vocal parts are dropped away too, depending on how it's done; the only reason vocals and rhythm instruments seemed to used for this so often is their sheer ubiquity.\n\nRegardless of the specifics, this is a technique used to control song pace. It is very common, but that doesn't make it any less effective.\n\nOverlaps with many other techniques, and rather often, including Last Chorus Slow-Down (since this section is often at a slower tempo). May be followed by any sort of ending tropes, or may end the song itself. It can just as easily open the song too.\n\nToo many of these can make the uncut song less suitable for Rhythm Games.\n\nCompare Stop and Go, which is also a lull in the song but one that's more like someone hit the pause button.\n\nTry not to overdo it on embedded links.\n• In old-fashioned hymnody, the organist will often play a softer, simpler accompaniment to the next-to-last stanza so that the last will sound thunderous by comparison.\n• Classical and operatic music was almost always written for very full orchestras. Let's just say the \"rest\" symbol in musical notation is used often.\n• \"Oh, Pretty Woman \" by Roy Orbison (for short bit near the end)\n• \"God Willing \" By the Dropkick Murphys (the last iteration of the chorus)\n• \"Can't Stand Losing You \" by The Police uses it to powerful effect near the middle of the song, making all the Lyrical Dissonance much more noticeable.\n• \"Devil's Dance Floor \" by Flogging Molly does this all throughout the song.\n• \"Float On\" by Modest Mouse, right at the end of the song.\n• \"Seven\" and \"FTK\" by VAGIANT\n• In \"Crazy Little Thing Called Love\" by Queen, near the end all the instruments drop out and it's just vocals and clapping.\n• \"Somebody To Love\" does this as well (you know where).\n• As does \"We Will Rock You\" (but you knew that one)\n• \"Dragon Attack\" and \"Dancer\" both pull the trick of cutting to super Queen choir vocals and percussion.\n• Bon Jovi's \"You Give Love A Bad Name\" is another good example.\n• \"Make Me Lose Control\" by Eric Carmen goes a capella near the end.\n• I keep coming across anime themes that do this for very short periods of time and still make it sound good. \"Wild Challenger\" does it for one measure. \"Give a Reason,\" two beats.\n• Both verses of Switchfoot's \"Meant to Live.\"\n• \"Time Bomb\" by the Old 97's.\n• \"Black Betty\" both the Ram Jam and Spiderbait versions.\n• \"Don't Stop Believin'\" by Journey.\n• Also \"Any Way You Want It.\"\n• \"Let There Be Rock\" by AC/DC\n• Also \"Jailbreak,\" \"Soul Stripper,\" and quite a bit of Bon Scott-era AC/DC...\n• \"Give It Away\" by the Red Hot Chili Peppers.\n• \"Runaway\" by the Yeah Yeah Yeahs (among others)\n• The White Stripes do this often - their two-person band structure seems to lend itself to this.\n• \"Ballroom Blitz\" by Sweet could be said to have this as its default state. The chorus has full instrumentation, and the verses only have vocals and drums.\n• \"Achy Breaky Heart\" by Billy Ray Cyrus features only drum accompaniment on the next-to-last chorus.\n• So does \"Wild at Heart\" by Gloriana.\n• Zac Brown Band loves this trope:\n• The last verse of \"Chicken Fried\" has only nylon-string guitar.\n• The end of \"Colder Weather\" goes from a cappella to only a piano backing.\n• The midsection of \"Keep Me in Mind\" is at a slower tempo with just piano and synthesized strings.\n• The last verse of \"All Alright\" is a slow smooth waltz before the tempo picks back up.\n• \"Chains and Leather\" and \"Prisoners of Our Time\" by Running Wild both have a part where only drums are heard in the background of the chorus.\n• Inverted with Billy Idol's \"Eyes Without a Face\": the subdued song has one sped-up section with heavy guitars.\n• Similarly inverted with Tori Amos's \"Pretty Good Year\": a quiet piano ballad until the bridge when she raises her voice and the drums kick in for about 15 seconds before reverting back.\n• Green Day's American Idiot has it on both multi-section songs: \"Jesus of Suburbia\" has \"Dearly Beloved,\" and \"Homecoming\" has \"Nobody Likes You\".\n• There's also the piano-and-vocals section towards the end of \"Tales From Another Broken Home\" in \"Jesus of Suburbia.\"\n• Used effectively in the Broadway version of \"Homecoming\", where everything but vocals and the bass drum drops out when\n• The title track is a variant, as the only part where there's singing to full-blown instrumentation is in the chorus. Billie Joe said this format is inspired by Midnight Oil's \"US Forces\".\n• \"You Better You Bet\" (among others) by The Who.\n• Their most famous example is probably \"Won't Get Fooled Again,\" where towards the end everything drops out but the hypnotic synthesized backing track, which is then broken by the most famous Metal Scream ever.\n• \"Old Time Rock and Roll\" by Bob Seger.\n• Dragonforce has done this on occasion, with \"Valley of the Damned\" being the most notable.\n• Disturbed does this quite a bit: qualifying songs include \"Stupify,\" \"Numb,\" \"Want,\" \"Sons of Plunder,\" \"Forgiven,\" \"Pain Redefined,\" \"Perfect Insanity,\" and \"Haunted\".\n• There's a variant on this in \"Opio\" by Heroes del Silencio. In the first couple verses, the guitar notes are low, and there's a second singer pseudo-growling the lyrics in harmony with the lead singer, and those verses are pretty similar, to top it all off. In the third verse, however, the growl drops out, leaving the lead singer's voice a lot clearer, the guitar is played higher and lighter, and the lyrics are noticeably different.\n• This is played with by Fair to Midland. They often have a verse/chorus contrast in their songs, but obvious examples are \"Dance of the Manatee,\" \"Kyla Cries Cologne,\" \"Vice/Versa,\" \"Walls of Jericho,\" and \"A Wolf Descends Upon The Spanish Sahara.\" Generally, these Subdued Sections are after a heavier portion of the song, and in \"Kyla Cries Cologne\" and \"Wolf Descends\" the Subdued Section is a softer iteration of the bridge.\n• \"Help!\" by The Beatles.\n• \"Lighten Up McGraw\" by Crack The Sky drops everything but the piano and vocals for the ending chorus.\n• \"Nine in the Afternoon\" by Panic! at the Disco. The coda gradually decreases in volume and instrumentation.\n• \"Vale Decem,\" a track used over the Tenth Doctor's regeneration in Doctor Who, drops the Latin vocals and the instruments to just the Chorus holding a note so that Ten can say \" I don't want to go. \"\n• \"Rime Of The Ancient Mariner\" by Iron Maiden has the spoken bridge and the start of the following verse.\n• The first part of \"Powerslave\"'s bridge, before the speedup and solo.\n• The interlude of Type O Negative's \"Haunted,\" which also has spoken-word lyrics.\n• \"Pushit\" by Tool builds until about halfway through when it cuts to a much more mellow section.\n• Many Tool songs have this trope, especially on Lateralus.\n• Found in several songs by The Smashing Pumpkins, including \"Mayonaise\" and \"Bodies.\"\n• Seen in more than a few Breaking Benjamin songs, notably \"Sooner or Later,\" which combines this trope with Last Chorus Slowdown.\n• Nearly every single song by Xera features these.\n• The Voices of East Harlem's \"Sisters and Brothers\" has this after the bridge, then suddenly crescendos into the Truck Driver's Gear Change and final chorus.\n• The lengthy coda of The Slip's \"Even Rats\".\n• After two normal-tempo verses and choruses, the third verse of \"Macarthur Park\" is a subdued section, followed by a faster instrumental break (which is then repeated) and a Last Chorus Slowdown.\n• In iamamiwhoami's single \"y.\" In the video, the Subdued Section corresponds with the Mandragora seeing the mysterious child.\n• Nine Inch Nails. They have so many songs with this, a few examples will suffice: \"Mr. Self Destruct,\" \"Heresy,\" \"Ruiner,\" \"No You Don't,\" \"Starfuckers Inc.,\" \"With Teeth...\" The Downward Spiral time period had a lot of this in particular.\n• \"Taking Over Me,\" \"Sick,\" \"Imaginary,\" \"My Heart Is Broken,\" and \"The Other Side\" by Evanescence.\n• \"I Don't Love You\" by My Chemical Romance is already subdued compared to the other songs on The Black Parade, (in fact, this and \"Cancer\" might be considered the Subdued Section for the album as a whole) but right after the guitar solo all of the instrumentals drop out except for some quiet piano. Then everything explodes for the final lines.\n• Instrumental version from Metallica's \"To Live is to Die.\" The song suddenly gets very quiet in the middle, and it's one of the biggest tear jerkers in the band's history, as it (and the whole song) is to memorialize Cliff Burton.\n• \"Little Lion Man\" by Mumford & Sons, the end of the song, follows a pretty loud, and faster, section where every instrument is playing, the band are stamping on the floor along with the percussion, suddenly, only vocals (and one last guitar strum). Fantastic.\n• Video game example: \"Raisin' Me Up\" from Sonic Rush does this toward the end, with only the drums and vocals playing.\n• Deep Purple \"Strange Kind of Woman\" in its live versions. There is a long, long section where Ian Gillan, Ritchie Blackmore and Ian Paice hold the fort. To a steady drum-beat, Blackmore and Gillan play a game where Blackmore sounds a riff, and Gillan sings it back to him note for note (and vice versa). Bass and Keyboards are nowhere to be seen for anything up to five minutes — maybe they're round the back having a sly smoke with the roadies.\n• Florence + the Machine's \"Dog Days Are Over\" and \"Cosmic Love\", both with dramatic drops in volume and instrumentals during the bridge.\n• Towards the end of \"Hate Me\" by Blue October.\n• In Radiohead's \"Creep\", the last chorus omits the distorted guitar that's in the previous ones and brings in subdued piano chords instead.\n• Bach's recitative and aria combo in the cantata Herr Jesu Christ, wahr\u0092 Mensch und Gott (BWV 127) is famed because of its multiple Subdued Sections. This movement, the 4th of the cantata, has been called a century ahead of its time - no other work of the Baroque era has such an interesting combination of loud and soft sections.\n• The ending of \"Two Lips, Two Lungs, and One Tongue\" by Nomeansno . As they repeat the chorus and slow the tempo, an instrument is dropped on each repetition until the final chorus is a cappella.\n• \"The South\" by The Cadillac Three is mostly a rowdy Southern rock song, but it has a break about 3/4 of the way through that is just Florida Georgia Line, Dierks Bentley, and Eli Young Band lead singer Mike Eli repeating \"This is where I was born and this is I will die\" a cappella.\n• \"Doctor Worm\" by They Might Be Giants.\n• Machine Head do this during \"Davidian\" (LET FREEDOM RING WITH THE SHOTGUN BLAST!)\n• Cult of Luna does this a lot as a post-metal band to build atmosphere. \"Ghost Trail\" for example drops out to repeat the main melody on soft and clean guitars before bursting into a massive breakdown.\n• Poets of the Fall\n• \"The Ultimate Fling ,\" a hypercombative Break-Up Song, shifts into a sparer, less agitated mode when, instead of provoking conflict, the singer honestly asks what the reason for the breakup is, in hopes of getting closure.\n• \"Revolution Roulette ,\" a song fatalistically musing on Full-Circle Revolution, has a lulling, meditative piano bit both between verses, and backing a quieter verse before the final, yelled chorus.\n• Several Blue Öyster Cult songs have this- \"Career of Evil\" and 'The Vigil are two of the more notable examples. \"Career of Evil\" has a LONG, jam-like one in the middle, while \"The Vigil\" has one just before its guitar solo that's more-or-less a repeat of the intro.\n• In the video game Rhythm Heaven Fever, the stage \"Exhibition Match\" consists of one phrase repeated twelve times, each with a Truck Driver's Gear Change, and this trope is the gameplay gimmick behind it: The Player Character is a batter, and you have to press A at the thirteenth beat in the phrase to swing the bat and hit the ball. However, only the first and last phrases are complete: The other ones have instruments cutting out bit by bit, and earlier and earlier, forcing you to count out the beats in your head without complete musical accompaniment. By the tenth one, the music is gone entirely, making it a case of Stop and Go.\n• Dire Straits: \"Tunnel of Love\" has a section toward the end where Mark Knopfler sings the lyrics very softly, accompanied by his own guitar playing more gently as well, and nothing else. The rest of the instruments come back in for the ending.\n• In the Robbie Fulks song \"Fountains of Wayne Hotline\" the singer does one \"broken-down\" verse, then calls the eponymous hotline to figure out where to go next. \"Gerald\" suggests the Radical Dynamic Shift, explaining \"You know: full band entry, fortissimo, while maintaining apparent volume on the vocal track.\" The singer hangs up and with a squeal of feedback the entire band joins in.\n• Fountains of Wayne songs\n• \"Mexican Wine\": The first verse has only a guitar and the first chorus only a keyboard. Then feedback as the singer says \"yup\" and the full band enters.\n• Everclear song \"Santa Monica (Watch the World Die)\": the first verse and chorus feature only a guitar with a drum coming in after a few bars. After the first chorus the guitar gets crazier and the vocals screamier.\n\nStarting off with a quiet verse and then bringing in the full band.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/SubduedSection", "media_links": ["/pmwiki/pmwiki.php/Music/RoyOrbison", "/pmwiki/pmwiki.php/Music/DropkickMurphys", "/pmwiki/pmwiki.php/Music/ThePolice", "/pmwiki/pmwiki.php/Music/FloggingMolly", "/pmwiki/pmwiki.php/Music/ModestMouse", "/pmwiki/pmwiki.php/Music/HollywoodUndead", "/pmwiki/pmwiki.php/Music/Queen", "/pmwiki/pmwiki.php/Music/BonJovi", "/pmwiki/pmwiki.php/Music/EricCarmen", "/pmwiki/pmwiki.php/Manga/BoboboboBobobo", "/pmwiki/pmwiki.php/LightNovel/Slayers", "/pmwiki/pmwiki.php/Music/Switchfoot", "/pmwiki/pmwiki.php/Music/Journey", "/pmwiki/pmwiki.php/Music/ACDC", "/pmwiki/pmwiki.php/Music/RedHotChiliPeppers", "/pmwiki/pmwiki.php/Music/YeahYeahYeahs", "/pmwiki/pmwiki.php/Music/TheWhiteStripes", "/pmwiki/pmwiki.php/Music/Sweet", "/pmwiki/pmwiki.php/Music/ZacBrownBand", "/pmwiki/pmwiki.php/Music/RunningWild", "/pmwiki/pmwiki.php/Music/BillyIdol", "/pmwiki/pmwiki.php/Music/ToriAmos", "/pmwiki/pmwiki.php/Music/LimpBizkit", "/pmwiki/pmwiki.php/Music/GreenDay", "/pmwiki/pmwiki.php/Music/AmericanIdiot", "/pmwiki/pmwiki.php/Music/MidnightOil", "/pmwiki/pmwiki.php/Music/FatboySlim", "/pmwiki/pmwiki.php/Music/TheWho", "/pmwiki/pmwiki.php/Music/BobSeger", "/pmwiki/pmwiki.php/Music/Dragonforce", "/pmwiki/pmwiki.php/Music/KnightsOfCydonia", "/pmwiki/pmwiki.php/Music/Muse", "/pmwiki/pmwiki.php/Music/Disturbed", "/pmwiki/pmwiki.php/Music/FairToMidland", "/pmwiki/pmwiki.php/Music/TheBeatles", "/pmwiki/pmwiki.php/Music/PanicAtTheDisco", "/pmwiki/pmwiki.php/Series/DoctorWho", "/pmwiki/pmwiki.php/Literature/RimeOfTheAncientMariner", "/pmwiki/pmwiki.php/Music/IronMaiden", "/pmwiki/pmwiki.php/Music/TypeONegative", "/pmwiki/pmwiki.php/Music/Tool", "/pmwiki/pmwiki.php/Music/TheSmashingPumpkins", "/pmwiki/pmwiki.php/Music/BreakingBenjamin", "/pmwiki/pmwiki.php/Music/Xera", "/pmwiki/pmwiki.php/Music/Iamamiwhoami", "/pmwiki/pmwiki.php/Music/NineInchNails", "/pmwiki/pmwiki.php/Music/Evanescence", "/pmwiki/pmwiki.php/Music/TheRamones", "/pmwiki/pmwiki.php/Music/MyChemicalRomance", "/pmwiki/pmwiki.php/Music/TheBlackParade", "/pmwiki/pmwiki.php/Music/Metallica", "/pmwiki/pmwiki.php/VideoGame/SonicRush", "/pmwiki/pmwiki.php/Music/FlorenceAndTheMachine", "/pmwiki/pmwiki.php/Music/Radiohead", "/pmwiki/pmwiki.php/Music/FloridaGeorgiaLine", "/pmwiki/pmwiki.php/Music/DierksBentley", "/pmwiki/pmwiki.php/Music/TheyMightBeGiants", "/pmwiki/pmwiki.php/Music/MachineHead", "/pmwiki/pmwiki.php/Music/CultOfLuna", "/pmwiki/pmwiki.php/Music/PoetsOfTheFall", "/pmwiki/pmwiki.php/Music/BlueOysterCult", "/pmwiki/pmwiki.php/VideoGame/RhythmHeaven", "/pmwiki/pmwiki.php/Music/DireStraits", "/pmwiki/pmwiki.php/Music/RobbieFulks", "/pmwiki/pmwiki.php/Music/FountainsOfWayne", "/pmwiki/pmwiki.php/Music/Everclear", "/pmwiki/pmwiki.php/Music/DragonForce", "/pmwiki/pmwiki.php/Music/JohnMellencamp", "/pmwiki/pmwiki.php/Music/Oasis"], "non_media_links": ["/pmwiki/pmwiki.php/Administrivia/TropesAreTools", "/pmwiki/pmwiki.php/Main/LastChorusSlowDown", "/pmwiki/pmwiki.php/Main/RhythmGame", "/pmwiki/pmwiki.php/Main/StopAndGo", "https://www.youtube.com/watch?v=mBrbpWwWafQ", "https://www.youtube.com/watch?v=KcxM3Xhho78", "https://www.youtube.com/watch?v=9bXMi3PSyW8", "/pmwiki/pmwiki.php/Main/LyricalDissonance", "https://www.youtube.com/watch?v=EwtuUbMBffw", "/pmwiki/pmwiki.php/Main/MetalScream", "/pmwiki/pmwiki.php/Main/SubduedSection", "/pmwiki/pmwiki.php/Main/SubduedSection", "/pmwiki/pmwiki.php/Main/GratuitousLatin", "/pmwiki/pmwiki.php/Main/SpokenWordInMusic", "/pmwiki/pmwiki.php/Main/SpokenWordInMusic", "https://www.youtube.com/watch?v=UokTE-njLRA", "/pmwiki/pmwiki.php/Main/LastChorusSlowdown", "/pmwiki/pmwiki.php/Main/NightmareFuel", "/pmwiki/pmwiki.php/Main/TruckDriversGearChange", "/pmwiki/pmwiki.php/Main/EndingFatigue", "/pmwiki/pmwiki.php/Main/LastChorusSlowdown", "https://www.youtube.com/watch?v=LEoGQU_k78k", "/pmwiki/pmwiki.php/Main/SubduedSection", "/pmwiki/pmwiki.php/Main/SubduedSection", "/pmwiki/pmwiki.php/Main/TearJerker", "/pmwiki/pmwiki.php/Main/LeadBassist", "https://www.youtube.com/watch?v=X7bHe--mp1g", "https://www.youtube.com/watch?v=aQ9YUyBkoYg", "https://www.youtube.com/watch?v=SIUmApXqJAk", "/pmwiki/pmwiki.php/Main/LastChorusSlowdown", "https://www.youtube.com/watch?v=S2LFbiNY2_s", "https://www.youtube.com/watch?v=y3rYhyIk8jM&list=PLjACqN5i5sDV1jkUkrNCzytFOlYdQN8rM", "/pmwiki/pmwiki.php/Main/BreakupSong", "https://youtu.be/v7v8ZwWtNXY?list=PLjACqN5i5sDWU8BGL5afu1ynDxAMPX2rH", "/pmwiki/pmwiki.php/Main/FullCircleRevolution", "/pmwiki/pmwiki.php/Main/TruckDriversGearChange", "/pmwiki/pmwiki.php/Main/PlayerCharacter", "/pmwiki/pmwiki.php/Main/StopAndGo"]}