{"title": "Sharpshooter Fallacy", "content": "Once again, TheGamerFromMars proves he is illuminati.\n\nThe first three words he says in this video are 'Outside of Mario'\n\n'Outside of Mario' has three O's\n\nA polo mint only has one O\n\nA polo mint has no physical centre of mass.\n\nMidnight Mass is the mass held on Midnight at Christmas Eve.\n\nAnd what day is it today? That's right - Christmas Eve.\n\nBut there's more, EVE and Adam were the supposed first humans on the Earth.\n\nEarth is planet. It is also the THIRD planet in our solar system, note there are three points in the illuminati Triangle.\n\n'Illuminati Triangle' has four I's.\n\nThe fourth planet in our solar system is Mars.\n\nA way of fiddling statistics or other forms of data analysis, this occurs where data is gathered first and then an after-the-fact hypothesis is produced to explain the conclusion drawn from it: in other words, the same data is used to generate both the hypothesis and the conclusion. The prototypical example is of a person shooting a gun at a wall, then painting a target around the bullet-hole, and claiming to have scored a bullseye because that is clearly where he was trying to hit. Obviously, hitting a bullseye is significant if you decided where the bullseye was before you fired, but not so much if you claim you knew where it was after the fact.\n\nAll such \"I Meant to Do That\" justifications are examples of this fallacy, but it also applies to cases where a set of data is analysed with no real methodology, simply in an attempt to find something by any means. When the thing is found, the convoluted method is said to obviously be the intended method of parsing the data. This is a common fallacy in claims of messages in fiction: the writer will find a pattern to the text, then declare this pattern was obviously the author's intention, without any proof this is actually the case.\n\nKarl Popper summed up this fallacy as applied to science with \"A theory that explains everything, explains nothing\". Basically, if any possible outcome could be interpreted as supporting the theory then it is useless. Which is pretty much the same thing as the concept of falsifiability.\n• Displayed by apologists for Joseph McCarthy such as Ann Coulter, who claim that the Venona intercepts declassified in 1995 show that McCarthy was quite right. In fact, the Venona intercepts only mention one of McCarthy's accusees, Mary Jane Keeney, The rest of the intercepts concern Alger Hiss and the atomic spies, Julius and Ethel Rosenberg. Neither case involved \"Tailgunner Joe\". and not even for what McCarthy accused her of. McCarthy said she was a Communist Party member ... which distracted from the fact that she was an actual GRU spy. This is akin to the fallacy insofar as McCarthy's supporters claim that the facts that he accused Keeney and she was guilty of spying (the only person called before McCarthy who was Keeney's husband, Philip, was also a spy, but McCarthy didn't interrogate him. ) show he was right; in fact, it shows he had no idea what he was doing and found Keeney mostly by dumb luck ... and even then he didn't catch her and might have derailed real inquiries into her, since her misdeeds were only found out long after she died. Nice job, \"Tailgunner\"...\n• The so-called \"Bible Codes\" use this fallacy. Rather than saying what they expect to find in a particular book beforehand, the people who produce these simply manipulate the letters until they find something that they can use. Words count regardless of whether they run up, down, right-to-left, left-to-right, diagonally, or even have the letters adjacent at all.\n• This is shot down by a skeptic in a History Channel documentary about such Bible Codes. To prove that such a \"spectacularly rare occurrence\" actually was more likely than people were willing to admit, he applied the principles for finding codes to Moby-Dick, looking for \"predictions\" of the assassination of JFK. He found quite a few. As with the metaphor of Monkeys on a Typewriter, any long-enough stream of data, if looked over using enough different formulae, will produce words or phrases that correlate to some kind of event that occurred after that book was written.\n• John Safran vs God put this argument to the test by feeding the entirety of Vanilla Ice's back catalog (song lyrics and liner notes) into the decoder; even \"Ice Ice Baby\" can turn up 9/11 \"predictions.\" Then they took the 9/11 Commission's report and used the code to find references to the fall of Vanilla Ice's career.\n• Similarly, interpretations of the metaphorical elements of Nostradamus' prophecies may be seen as examples of this fallacy. There have been documentary programs on Nostradamus' prophecies where the proponents of Nostradamus' prescience do things like add and subtract numbers or alter letters in order to interpret things he wrote as referencing WWII. People have also pointed out that it's strange how Nostradamus' prophecies only seem to be understood to apply to something after the event has happened, which is also indicative of how this trope ties into Confirmation Bias. Nostradamus was a genius who was able to predict the future, yet no one predicted WWII from his writings. After WWII, people went back over his works and went to great lengths to prove to themselves that Nostradamus had predicted it. In reality, the passages could be interpreted or twisted to be applicable to anything one desired. Of the future predictions Nostradamus supposedly made, most have proven laughably wrong. One example: The Man Who Saw Tomorrow, a documentary released in 1981, included such \"predictions\" as World War III breaking out in the 1990s. A remake from 1991 \"corrected\" these predictions to reflect then-current events, and wisely dropped most. There are also many predictions supposedly made by Nostradamus that are entirely fake circulating on the Internet. Even worse is the fact that Nostradamus wrote his Quatrains (from which the \"prophecies\" are taken) in an obscure mix of French and Latin that is very hard to translate. This makes just what if anything he actually predicted difficult to say, and allows all kinds of leeway for translations which fit what the translator wants.\n• All claims of various people's names being secret encodings of the Number of the Beast, 666. There are a lot of ways you can assign numbers to letters or words — try enough of them, and you will find one that adds up to \"666\". Examples include:\n• War and Peace, where Pierre plays around with Napoleon Bonaparte's name and titles to make it all add up to the Number of the Beast, then does the same thing to his own name to \"prove\" that he's destined to assassinate the man.\n• Parodied in the Nostalgia Critic's review of End of Days.\n• David Langford once mocked this in Fortean Times by writing a computer program that \"could generate mystic and ancient cipher tables at the rate of several hundred per second.\"\n• Every recent President of the United States, from Ronald Reagan through Donald Trump, has had some crank eschatologists postulate that he was The Beast, complete with the \"proof\" that his name added up to 666 if you selected whatever numerical substitution code it would take to make his name add up to 666.\n• The most common hypothesis outside of fundamentalist circles is that the Number of the Beast is a reference to Nero (Nero Caesar). Since openly criticizing a lunatic like Nero was a good way to be killed (and even if the book was written after his death, there were fears he was not actually dead and would return), anyone with brains would veil it in symbols (\"This requires wisdom; let him who hath understanding...\") The dates are pretty close to right — Nero was killed in 68 CE, while Revelation is dated to about then, it is possible Nero instituted the Roman practice of banning trade unless one possessed a certificate of sacrifice to Caesar (known in the time of Emperor Decius) and the period in which the Beast is given power (3.5 years) is the same length of time that Nero persecuted Christians prior to his death. The ancient numerology lines up pretty well; the number is translated using Hebrew gematria code, with the Greek (Nron Qsr) coming out as 666 and the Latin (Nro Qsr) coming out as 616, which is also sometimes translated as the number of the beast.\n• In the lead-up to the 2012 American Presidential election, there was much to do that a mathematician had found an algorithm that predicted the winner of every Presidential election for the past 50 years. Being on this page, obviously he took the raw data and simply found one that fit it.\n• Malcolm Gladwell's notion of the \"tipping point\"; tipping points are points after which change is perceived to have been inevitable, but since they are only recognizable as such after the fact, you can't predict them in advance, so all they're good for is making the person talking about them look smart (tipping points are observable in natural phenomena; for example, the boiling point of water at sea level is 100C, so you can predict that when water gets to that temperature at sea level, it will boil. Anything more complicated than that and you're getting involved in probability theory).\n• The supposed existence of \"cancer clusters\" is an example. People notice that there are a lot of cancer cases in an area, and immediately assume that there's a causal link, such as electromagnetic radiation, without looking for other possible factors.\n• The fine-tuning argument saying the universe has been designed for life is sometimes criticized as this. For instance, critics note that there appears to be very little life in the universe overall. In fact, one could claim the universe has been designed for other things (such as black holes) that appear to be more numerous, by this logic. Parodied with the \"Puddle argument\" by Douglas Adams in which a puddle expounds on how the hole he finds himself in was perfectly designed for him ... just before it dries up.\n• There's an essay claiming that there are surprisingly many coincidences between Abraham Lincoln and John F. Kennedy that perfectly demonstrates this. It claims that the coincidences are that they were elected President of the US a hundred years apart and first elected to the House of Representatives a hundred years apart. They both were shot on a Friday, have seven letters in their last name, shot in the back of the head, etc. They were succeeded by men named Johnson who were born a hundred years apart and had six letters in each of their respective first names. It completely ignores the lack of coincidences elsewhere (Lincoln was born in 1809 and died in 1865, Kennedy was born in 1917 and died in 1963; Lincoln was born poor, Kennedy rich; etc.). They ignore all the big differences like how Andrew Johnson never won a term in his own right while Lyndon Johnson won a Landslide Election. Lincoln was killed indoors with a handgun at point-blank range. Kennedy was killed with a rifle outdoors hundreds of feet away. They also had a 1 in 12 chance of dying in the same month and we find no coincidence there. Lincoln was killed in April. Kennedy was killed in November. Some of the things in this essay are just plain false, like how it claims Lincoln had a secretary named Kennedy, when there's no evidence of his existence. A wonderfully detailed full rebuttal is here.\n• Used in a Red Bull commercial where William Tell has a shaky hand, so his son gives him Red Bull to sharpen the mind and the body. Tell then realizes he should shoot the apple, then put it on his son's head.\n• Basically, the film The Number 23 runs on this. Once you start looking for 23 (or any other number) in creative enough ways, you'll see it everywhere.\n• Discussed in π, when Sol criticizes Max for obsessing over the number 216 (because that's the amount of digits on the number that his theory has spewed up). He says that Max will soon see 216 everywhere he looks because he wants to see it, lowering himself from mathematician to numerologist. The two groups of antagonists of the story believe that the number will somehow allow them to manipulate (not control, manipulate) the stock market and is the true name of God, respectively—and the film implies that they are either totally crazy, are right about something there, or just happen to be both.\n• In a darkly comical moment from The Beastmaster, a villainous pagan priest employs this kind of argument to legitimize the child sacrifice he was performing, which got interrupted when the hero's hawk swooped in and carried off the child he was about to sacrifice. Pointing after the bird as it flies out of sight, he declares \"See? I was right! Ogg wants your children!\"\n• In O Brother, Where Art Thou?, Everett steals a locket from Pete's cousin, justifying his theft by pointing out that Wash sold them out to the police. Pete responds that there was no way Everett could have predicted that Wash was going to betray them before he stole the locket, to which Everett claims that he merely borrowed in until they knew for sure.\n• Beautifully illustrated in the Principia Discordia with the Discordian Law of Fives: \"All things happen in fives, or are divisible by or are multiples of five, or are somehow directly or indirectly appropriate to five.\" Also in this quote: \"Everything in the universe relates to the number 5, one way or another, given enough ingenuity on the part of the interpreter.\"\n• The Illuminatus! Trilogy, being heavily influenced by Discordianism, further deconstructs this. After playing up the significance of the Law of Fives throughout the book, Hagbard Celine then proceeds to demolish it by explaining it as an example of this trope, reinforced by intellectual pareidolia. He goes even further, explaining how even the number five is merely an accident of nature: \"If humans were born with six fingers instead of five, we'd be talking about a 'Law of Sixes'\".\n• Played literally in an episode of The Benny Hill Show. Camera pans across a bunch of small white circles in a wall, each of which has been shot smack in the middle. As the camera continues to pan it comes across Benny, painting circles around the holes.\n• The fallacy is mentioned in-universe in one episode of NUMB3RS by Charlie after Megan mentions that a school that recently had a playground cave-in also seems to have an unusually high rate of cancer among students; he suggests that the cancer rate only seems significant because they're actively looking for something out of the ordinary. It's Subverted a few moments later when they find evidence suggesting there actually is a connection between the two (which ultimately turns out to be the case).\n• William Shakespeare's works get this treatment. Some who dispute the authorship of his plays claim messages hidden in them reveal the truth when the right cypher is applied.\n• In Planescape: Torment, Morte mentions the \"Rule of Three\", a popular underlying principle of the Multiverse. He then criticizes it and explains that if you ascribe importance to any number, you're bound to find evidence for it. It's also a good example of the Fallacy Fallacy. Planescape is a setting which runs quite literally on Clap Your Hands If You Believe, and the planes themselves warp in response to belief. In one case, it's so strong that a man is convinced he does not exist — and stops existing! As a consequence, many people believing in the Rule of Threes is evidence that the Rule of Threes is real in that setting.\n• Parodied in Phineas and Ferb. OWCA begins to suspect that Phineas is working for Doofenshmirtz because when they took sound bytes of his voice and played them back in a completely random order, they got a few sentences about how he wanted to help Doofenshmirtz take over the tri-state area.\n• Steven Universe has Ronaldo Fryman. He eats, breathes, and sleeps this fallacy. Through it he sees symbolism and messages in everything. He believes in all kinds of strange conspiracies even for the kind of universe he lives in. Doubles as a case of I Just Want to Be Special given that in the earlier episodes, when briefly brought to his senses he sadly remarks that he isn't at the center of anything and takes a 10-Minute Retirement from writing his blog about Paranormal events in Beach City.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/SharpshooterFallacy", "media_links": ["/pmwiki/pmwiki.php/Literature/TheBible", "/pmwiki/pmwiki.php/Creator/TheHistoryChannel", "/pmwiki/pmwiki.php/Literature/MobyDick", "/pmwiki/pmwiki.php/Music/VanillaIce", "/pmwiki/pmwiki.php/Film/TheManWhoSawTomorrow", "/pmwiki/pmwiki.php/Literature/WarAndPeace", "/pmwiki/pmwiki.php/Creator/DavidLangford", "/pmwiki/pmwiki.php/Creator/DouglasAdams", "/pmwiki/pmwiki.php/Film/TheNumber23", "/pmwiki/pmwiki.php/Film/Pi", "/pmwiki/pmwiki.php/Film/TheBeastmaster", "/pmwiki/pmwiki.php/Film/OBrotherWhereArtThou", "/pmwiki/pmwiki.php/Literature/PrincipiaDiscordia", "/pmwiki/pmwiki.php/Literature/TheIlluminatusTrilogy", "/pmwiki/pmwiki.php/Series/TheBennyHillShow", "/pmwiki/pmwiki.php/Series/NUMB3RS", "/pmwiki/pmwiki.php/Creator/WilliamShakespeare", "/pmwiki/pmwiki.php/VideoGame/PlanescapeTorment", "/pmwiki/pmwiki.php/TabletopGame/Planescape", "/pmwiki/pmwiki.php/WesternAnimation/PhineasAndFerb", "/pmwiki/pmwiki.php/WesternAnimation/StevenUniverse"], "non_media_links": ["https://www.youtube.com/user/OcarinaSenpai", "https://www.youtube.com/watch?v=sefx7-xJYc8&spfreload=10", "/pmwiki/pmwiki.php/Main/LiesDamnedLiesAndStatistics", "/pmwiki/pmwiki.php/Main/IMeantToDoThat", "http://en.wikipedia.org/wiki/Falsifability", "/pmwiki/pmwiki.php/UsefulNotes/JosephMcCarthy", "/pmwiki/pmwiki.php/Main/WhoShotJFK", "/pmwiki/pmwiki.php/Main/MonkeysOnATypewriter", "/pmwiki/pmwiki.php/UsefulNotes/Nostradamus", "/pmwiki/pmwiki.php/Main/ConfirmationBias", "/pmwiki/pmwiki.php/Main/WorldWarIII", "/pmwiki/pmwiki.php/Main/NumberOfTheBeast", "/pmwiki/pmwiki.php/UsefulNotes/NapoleonBonaparte", "/pmwiki/pmwiki.php/Main/ParodiedTrope", "http://thatguywiththeglasses.com/videolinks/thatguywiththeglasses/nostalgia-critic/16502-end-of-days", "/pmwiki/pmwiki.php/Magazine/ForteanTimes", "http://www.ansible.co.uk/writing/ft107.html", "/pmwiki/pmwiki.php/UsefulNotes/RonaldReagan", "/pmwiki/pmwiki.php/UsefulNotes/DonaldTrump", "/pmwiki/pmwiki.php/UsefulNotes/Nero", "/pmwiki/pmwiki.php/Main/ParodiedTrope", "/pmwiki/pmwiki.php/UsefulNotes/AbrahamLincoln", "/pmwiki/pmwiki.php/UsefulNotes/JohnFKennedy", "/pmwiki/pmwiki.php/UsefulNotes/AndrewJohnson", "/pmwiki/pmwiki.php/UsefulNotes/LyndonJohnson", "/pmwiki/pmwiki.php/Main/LandslideElection", "https://www.snopes.com/fact-check/linkin-kennedy/", "/pmwiki/pmwiki.php/Main/Advertising", "/pmwiki/pmwiki.php/Main/WilliamTelling", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/Discussed", "/pmwiki/pmwiki.php/Main/MaybeMagicMaybeMundane", "/pmwiki/pmwiki.php/Main/HumanSacrifice", "/pmwiki/pmwiki.php/Main/MovingTheGoalposts", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/UsefulNotes/Discordianism", "/pmwiki/pmwiki.php/UsefulNotes/Discordianism", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/SubvertedTrope", "/pmwiki/pmwiki.php/Main/Theater", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/FallacyFallacy", "/pmwiki/pmwiki.php/Main/ClapYourHandsIfYouBelieve", "/pmwiki/pmwiki.php/Main/RuleOfThree", "/pmwiki/pmwiki.php/Main/RuleOfThree", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/IJustWantToBeSpecial", "/pmwiki/pmwiki.php/Main/TenMinuteRetirement"]}