{"title": "Not-So-Small Role", "content": "A seemingly minor or unimportant character turns out to be much more crucial to the plot than they first appear.\n\nThis is usually, but not always, signalled by the character in question being played by a big-name actor or someone recognisable, who wouldn't normally be wasted on such an insignificant part (unless it's just The Cameo of course). If you recognise the actor in a bit part, it will probably turn out not to be such a small role after all; it will be The Big Bad, or the murderer, or someone else who is a key to whatever mystery the show revolves around. Usually, their true identity is not revealed until the final act. This is often referred to as the Law of Economy of Characters in film criticism.\n\nThis is especially prevalent in dubbed anime series with Loads and Loads of Characters. A seemingly insignificant character will later end up having a large role. Even if Anyone Can Die, a character voiced by Steve Blum will rarely be Killed Off for Real (until the finale).\n\nHowever, sometimes the character will not be played by anyone special, or it will be the Star-Making Role of the actor- the crux of this trope is more to do with relevance of the character to the plot being bigger than expected.\n\nThe converse of this would be Small Role, Big Impact. See also Ascended Extra, where the role originally was small but the character became more important later on.\n• Narrowed It Down to the Guy I Recognize\n\nIf you have an example for the subtrope, put it on those pages. See also: Contractual Immortality, Conspicuously Light Patch, Chekhov's Gun. Contrast Dead Star Walking. May be a Final Girl.\n• Baccano!: A seemingly ordinary guy who works on the train (played by Masakazu Morita) gets killed fairly early on in episode 2. Then came episode 9 and it was revealed that roles. he is actually The Rail Tracer and he gets to play against the seiyuu's known\n• Even before there was a voice actor to indicate it, Fairy Tail had one of these. Sure, Siegrain just acted like a background character who'd comment on the cast's adventures, but the first time he does this is the first page, before the cast even shows up, and even that isn't as telling as the fact that he's given the exact same character design as one of the more popular characters from Hiro Mashima's previous manga.\n• In Equilibrium, William Fichtner's distinctive features are visible in a crowd shot. It's some time before he makes a speaking appearance.\n• In RED, Morgan Freeman gets one scene as an old friend of the protagonist's, before being \"killed off\" offscreen. Yeah, right.\n• In The Hurt Locker, this is surprisingly subverted with major actors three times; Ralph Fiennes, David Morse and Guy Pearce all have less than 10 minutes screen time, and Fiennes' and Pearce's characters are so minor they both die mid-scene.\n• Hail, Caesar! has Channing Tatum popping up an hour in to perform a South Pacific style musical number - as Burt Gurney, a character who has no connection with the rest of the cast. Of course he's The Mole for the Russians, and it's his house Baird Whitlock is being held captive in . Played with when it comes to Jonah Hill's role as Joseph Silverman as it really is just a cameo - but he still marries DeeAnna Moran, meaning that she doesn't have to resort to black market adoption to hide her pregnancy from the public .\n• The Dark Knight Rises features a supporting character called Miranda Tate who has no connection to the comics and whose only function seems to be to provide Bruce with a rich ally. But since she's played by Oscar winner Marion Cotillard she's actually the daughter of the first film's villain and the true mastermind behind the evil plan .\n• Sleepy Hollow casts Miranda Richardson in the seemingly insignificant background role of Lady Van Tassel. She's the one who's been summoning the Headless Horseman .\n• The annoying reporter Debbie Salt in Scream 2 is actually none other than the mother of the first movie's killer looking to take revenge .\n• Disney's Cinderella (2015) would lead you to believe that Helena Bonham Carter is just there to provide a narration as a Celebrity Voice Actor. Then it turns out she's the Fairy Godmother.\n• Eternal Sunshine of the Spotless Mind - you know the secretary at Lacuna Inc is going to have something to do with the plot given that she's played by Kirsten Dunst. She's revealed to have had an affair with Howard, had her own memories erased and then mails everyone their tapes to give them their memories back .\n• Terminator Genisys: Matt Smith, having just come off his role as The Eleventh Doctor, is seen in a pan across John Connor's platoon of Resistance fighters in the opening act. Since such a major actor could not possibly be a bit extra, it's obvious he's going to be important. He's actually the personification of Skynet, there to assimilate Connor and change the past thereby .\n• David Morse makes two fleeting appearances in some early scenes in 12 Monkeys, where he plays a creepily cheery scientist who attends a book signing put on by one of the main characters. In the final scene he turns out to be the terrorist who was actually responsible for starting the plague that put the movie's time-travelling plot in motion .\n• In Sea of Love, the two lead detectives meet with a seemingly insignificant cable guy who throws them a suspect in one of the murders. He's played by Michael Rooker, and though he was a bit less than famous at this point in his career, he wasn't exactly unknown (he was the lead in Henry: Portrait of a Serial Killer and had major roles in JFK and Mississippi Burning).\n• Tru Calling: Jack Harper (played by Jason Priestly) started off a paramedic who would come in, drop off a dead body, and provided the series with what seemed to be some minor flirtation. Then by the beginning of season 2, he's the anti-Tru villain who is the antagonist of nearly every episode.\n• The Pretender: The two-parter \"Bloodlines\" stars Haley Joel Osment. Jarod must identify which one of three children is a genius. Since two of the children are unknown child actors and the last one was the lead in The Sixth Sense the year after appearing on this show, it's not hard for a post-1999 audience to guess which one it is.\n• Lost: For their first appearance, Mark Pellegrino and Titus Welliver were credited as playing \"Man #1\" and \"Man #2\". Turned out, they were in fact cast as Jacob and his nemesis, aka \"The Smoke Monster\" - two cornerstone mythology figures in the show.\n• In the Doctor Who episode \"Utopia\", Sir Derek Jacobi appears in a one-off guest role as the kindly scientist Professor Yana...who's revealed to be the Doctor's nemesis the Master, one of the most iconic villains in the show's history .\n• Charmed:\n• The third season had a featured extra called Abby who worked behind the bar in P3. Then comes the episode \"Sight Unseen\" where Abby turns out to be Prue's stalker.\n• The Season 3 finale also had a minor character called Alice, who seemed to be a token background believer in the sisters' powers. She ends up shooting Piper fatally because she believes the sisters are evil.\n• Sherlock: In The Great Game, Molly's boyfriend Jim has a cute scene in the hospital and then disappears from the plot... until he's revealed as Sherlock's arch-nemesis James \"Jim\" Moriarty in the final scene.\n• Tommy: In the film, Tommy is played by Roger Daltrey, a not-so-subtle clue that he might not be mute for the entire movie.\n• Frequently subverted in South Park, who often have famous guest stars voice acting bit parts; in one case, a turkey. Which gets no lines except to make gobbling noises.\n• Word of God says Trey & Matt received a call from the agent of Jerry Seinfeld, telling them Jerry was a fan of the show and was interested in lending his voice to a bit part. Said Trey: \"Okay, we want him to be Turkey #3.\" \"You don't understand,\" the agent returned, \"this is Jerry Seinfeld.\" \"All right then, how 'bout Turkey #5?\" Seinfeld ended up not doing a guest spot.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/NotSoSmallRole", "media_links": ["/pmwiki/pmwiki.php/Creator/SteveBlum", "/pmwiki/pmwiki.php/LightNovel/Baccano", "/pmwiki/pmwiki.php/Creator/MasakazuMorita", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyX", "/pmwiki/pmwiki.php/Manga/Bleach", "/pmwiki/pmwiki.php/Manga/FairyTail", "/pmwiki/pmwiki.php/Film/Equilibrium", "/pmwiki/pmwiki.php/Creator/WilliamFichtner", "/pmwiki/pmwiki.php/Film/RED", "/pmwiki/pmwiki.php/Creator/MorganFreeman", "/pmwiki/pmwiki.php/Film/TheHurtLocker", "/pmwiki/pmwiki.php/Film/HailCaesar", "/pmwiki/pmwiki.php/Theatre/SouthPacific", "/pmwiki/pmwiki.php/Film/TheDarkKnightRises", "/pmwiki/pmwiki.php/Creator/MarionCotillard", "/pmwiki/pmwiki.php/Film/SleepyHollow", "/pmwiki/pmwiki.php/Film/Scream2", "/pmwiki/pmwiki.php/Film/Cinderella2015", "/pmwiki/pmwiki.php/Film/EternalSunshineOfTheSpotlessMind", "/pmwiki/pmwiki.php/Creator/KirstenDunst", "/pmwiki/pmwiki.php/Film/TerminatorGenisys", "/pmwiki/pmwiki.php/Creator/MattSmith", "/pmwiki/pmwiki.php/Series/DoctorWho", "/pmwiki/pmwiki.php/Film/TwelveMonkeys", "/pmwiki/pmwiki.php/Creator/MichaelRooker", "/pmwiki/pmwiki.php/Film/HenryPortraitOfASerialKiller", "/pmwiki/pmwiki.php/Film/JFK", "/pmwiki/pmwiki.php/Film/MississippiBurning", "/pmwiki/pmwiki.php/Series/TruCalling", "/pmwiki/pmwiki.php/Series/ThePretender", "/pmwiki/pmwiki.php/Film/TheSixthSense", "/pmwiki/pmwiki.php/Series/Lost", "/pmwiki/pmwiki.php/Creator/MarkPellegrino", "/pmwiki/pmwiki.php/Creator/TitusWelliver", "/pmwiki/pmwiki.php/Series/KamenRiderGaim", "/pmwiki/pmwiki.php/Series/DoctorWho", "/pmwiki/pmwiki.php/Creator/DerekJacobi", "/pmwiki/pmwiki.php/Series/Charmed1998", "/pmwiki/pmwiki.php/Series/Sherlock", "/pmwiki/pmwiki.php/Music/Tommy", "/pmwiki/pmwiki.php/Music/TheWho", "/pmwiki/pmwiki.php/WesternAnimation/SouthPark", "/pmwiki/pmwiki.php/Creator/JerrySeinfeld"], "non_media_links": ["/pmwiki/pmwiki.php/Main/TheCameo", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/LoadsAndLoadsOfCharacters", "/pmwiki/pmwiki.php/Main/AnyoneCanDie", "/pmwiki/pmwiki.php/Main/KilledOffForReal", "/pmwiki/pmwiki.php/Main/StarMakingRole", "/pmwiki/pmwiki.php/Main/SmallRoleBigImpact", "/pmwiki/pmwiki.php/Main/AscendedExtra", "/pmwiki/pmwiki.php/Main/NarrowedItDownToTheGuyIRecognize", "/pmwiki/pmwiki.php/Main/ChekhovsGunman", "/pmwiki/pmwiki.php/Main/ContractualImmortality", "/pmwiki/pmwiki.php/Main/ConspicuouslyLightPatch", "/pmwiki/pmwiki.php/Main/ChekhovsGun", "/pmwiki/pmwiki.php/Main/DeadStarWalking", "/pmwiki/pmwiki.php/Main/FinalGirl", "/pmwiki/pmwiki.php/Main/Anime", "/pmwiki/pmwiki.php/Main/Manga", "/pmwiki/pmwiki.php/Main/PlayingAgainstType", "/pmwiki/pmwiki.php/Main/Expy", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/NeverFoundTheBody", "/pmwiki/pmwiki.php/Main/SubvertedTrope", "/pmwiki/pmwiki.php/Main/TheMole", "/pmwiki/pmwiki.php/Main/CelebrityVoiceActor", "/pmwiki/pmwiki.php/Main/FairyGodmother", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/Music", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/WordOfGod"]}