{"title": "Fake Trap", "content": "Spikes, lava, trapdoors, you name it, they are all traps and they are only designed with one thing in mind; to kill you. However, what if these traps actually did nothing? You heard me right. A trap that is completely FAKE! A Fake Trap is a hazard that appears dangerous, but is actually harmless. Sometimes you cannot tell the difference until you take the plunge or have an item/ability that shows the trap is a fake. Other times, the fake may stand out, such as spikes looking very worn down. It can be considered Fake Difficulty if the player is required to plow through fake traps in between real ones in order to progress, which is the basis of Trial-and-Error Gameplay.\n\nSee also Leap of Faith and Guide Dang It!. Contrast with Kaizo Trap. The inverse is a Chest Monster, where something is made to look like a reward, (such as a treasure chest) but is in reality another enemy.\n\nBecause of the nature of this trope, expect minor gameplay-related spoilers.\n• The first Metroid game has many pools of acid and lava that greatly harm Samus, but some are actually fake, thus you fall through. Naturally, you have to make that blind Leap of Faith and hope that killer pool is a fake in order to proceed. (Hint: don't try this in a room that scrolls horizontally.) Super Metroid has fewer traps and the fake ones are spikes that are not animated compared to real spikes. The X-Ray Scope also points this out.\n• Final Fantasy XII has tons of traps all over the game that cause various effects when stepped on. However, sometimes, the same looking traps act as a healer that restores the party's HP.\n• The first area of La-Mulana has a \"spike pit\" full of objects that look identical to real spikes but are actually part of the background and have no effect on Lemeza whatsoever. Jumping into this not-pit unlocks the Shuriken sub-weapon.\n• Marble Garden Zone in Sonic the Hedgehog 3 has enemies that disguise themselves as spikes. The spikes are made of rubber, so they function like springs. The enemies aren't completely harmless, as they shoot at you, and touching them from the side without rolling into them will hurt you just like with most other enemies, but you have to wonder why Dr. Robotnik decided on rubber spikes during the design phase.\n• In Crash Bandicoot 2: Cortex Strikes Back, you normally want to keep a wide berth of green Nitro crates, as even grazing one will cause it to explode. However, halfway through level 20 (\"Bee-having\") is a pile of steel crates and Nitro crates arranged like a small staircase. These Nitro crates do not explode, and in fact climbing to the top step will warp you to a secret area with the Purple Gem, a necessary collectible to reach 100% Completion. The giveaway to this fake trap is that these particular Nitro crates do not wobble and bounce like all the others, implying that their contents are inert.\n• In Crash Bandicoot 3: Warped a secret level is opened by running into an enemy. There is no hints whatsoever that you can or should do this, and the even the secret level's existence isn't even hinted at in the game save for a vague lack of percent if you've gotten everything else. Yep.\n• A number of the traps in Chocobo's Dungeon will heal or buff Chocobo. Some of them can be picked out beforehand, while others are indistinguishable from real traps or invisible.\n• Part of the glitchiness of level 8 of Stinkoman 20X6 is that some of the obstacles (like the lava falls) are totally harmless.\n• Interestingly, the lava falls are completely harmless to Stinkoman normally. They can hurt 1-Up in the Escort Mission level, but that's it. People have discovered, through game hacks, that this is just how the lava falls are. There's no way for a normal player to know that, though.\n• Prince of Persia: The Sands of Time features unstable-looking platforms that begin trembling the moment the Prince steps on them, and which fall into the abyss the moment he steps off. The trick is that they won't fall until the Prince steps off them; they exist to make the player feel he's just barely cheated death without actually making the game any more difficult. Crazy.\n• I Wanna Be the Guy has a spike that doesn't kill you if you shoot it down and land on the back of it, while every other spike kills you instantly if you so much as brush against it.\n• Getting one gem in Jumper Two requires passing through a fake fireball. Jumper Two Editor enables this with a \"fake modifier\", which can be put on top of any object to make it fake. No points in guessing where this is going.\n• You'll meet tons of these in Karoshi. The universe just wants to keep you alive that badly.\n• The frightening things that threaten you in Shivers include pits of bubbling tar, skeletons that fall on you, a hallway with foot-long spikes covering the walls, an electric chair, a guillotine, and a shadow of something just outside your vision. But none of these can hurt you; only the Ixupi can do that.\n• The voice that guides you in Depict1 warns you that spikes will kill you instantly. Given that the voice almost always lies... You can pick the spikes up and throw them.\n• Super Mario Bros.:\n• In Level 8-2 of Super Mario Bros. 3, there is a sand trap that looks like almost every other one in the game. However, if you're patient and let it take Mario (or Luigi) down, it leads to two alternate pathways with extra lives or power-ups, either of which (clearly) beats the overworld you would traverse instead. There are a few other sand traps like this throughout the game, most of them in world 2.\n• Another example in World 8 of SMB3 lies on the \"lavaship\" level. The \"lava\" is actually water and Mario can swim underneath the ships.\n• In many versions of Lemmings, objects with an index number above 15 are inert, so on the really large levels like Fun 8, if you take the time to build to the far end of the decorative terrain, you can watch the lemmmings go through water without drowning (and then die anyway from falling offscreen). Averted in the PC version, which removed the water from all large levels specifically to prevent this.\n• Mega Man 4 had the Wire Upgrade in Dive Man's stage, that was hidden at the bottom of a Not-So-Bottomless Pit. The giveaway is that it's the only such pit in the stage, and the simple logic that it would be rather impossible to fall to your death underwater given how slowly Mega Man sinks.\n• Everything that should logically kill you in Default Dan is actually this: spikes bounce you up and Bottomless Pits drop you from the top of the screen unharmed, while everything that should logically be helpful like coins and platforms make you abruptly explode.\n• Parodied in the fan-game A Super Mario Thing, in a mid-game level titled \"the hardest lvl\"[sic]. The level looks somewhat challenging at first, but it's almost impossible to die in it because just about every hazard is fake.\n• Weaponized in The Bartimaeus Trilogy - there's a spell that creates a perfect hologram of the target on the opposite side of the victim from the actual target. Works very well on fleeing suspects.\n• Red vs. Blue: The Recollection: Agent Washington assumes that Epsilon-Church being left in the middle of a canyon is a classic Freelancer trap set by , and refuses to fall for it. Doc states that it's possible that the trap is really not one, and that the real trap is where they are. Washington says Doc is overthinking it. He isn't.\n• The Leomund's Trap spell in some editions of Dungeons & Dragons serves to create exactly this — merely a harmless specialized illusion of a trap intended to scare people off or at least make them waste time and effort trying to disarm or bypass it.\n• The Yu-Gi-Oh! card actually named \"Fake Trap\" is a subversion since it is actually a decoy that protects the player's real spell and trap cards. If the opponent tries to destroy a spell or trap card belonging to the player, the player can sacrifice this card in its stead.\n• Played straight in some of the early video games like Yu-Gi-Oh! Reshef of Destruction, however, where Fake Trap is just a trap card that does nothing.\n• In the Steven Universe episode \"The Test\", the Gems build an obstacle course for Steven filled to the brim with illusions of pitfalls, a musical puzzle that is impossible to get wrong, and traps rigged to always stop short of hitting Steven. Steven is unamused when he realizes how fake the whole thing is, but upon overhearing the insecurities of the Gems, he decides to play along.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/FakeTrap", "media_links": ["/pmwiki/pmwiki.php/VideoGame/Metroid1", "/pmwiki/pmwiki.php/VideoGame/SuperMetroid", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyXII", "/pmwiki/pmwiki.php/VideoGame/LaMulana", "/pmwiki/pmwiki.php/VideoGame/Sonic3AndKnuckles", "/pmwiki/pmwiki.php/VideoGame/ChocobosDungeon", "/pmwiki/pmwiki.php/VideoGame/Stinkoman20X6", "/pmwiki/pmwiki.php/VideoGame/PrinceOfPersiaTheSandsOfTime", "/pmwiki/pmwiki.php/VideoGame/IWannaBeTheGuy", "/pmwiki/pmwiki.php/VideoGame/Jumper", "/pmwiki/pmwiki.php/VideoGame/Karoshi", "/pmwiki/pmwiki.php/VideoGame/Shivers", "/pmwiki/pmwiki.php/VideoGame/Depict1", "/pmwiki/pmwiki.php/Franchise/SuperMarioBros", "/pmwiki/pmwiki.php/VideoGame/SuperMarioBros3", "/pmwiki/pmwiki.php/VideoGame/Lemmings", "/pmwiki/pmwiki.php/VideoGame/MegaMan4", "/pmwiki/pmwiki.php/VideoGame/DefaultDan", "/pmwiki/pmwiki.php/VideoGame/ASuperMarioThing", "/pmwiki/pmwiki.php/Literature/TheBartimaeusTrilogy", "/pmwiki/pmwiki.php/TabletopGame/DungeonsAndDragons", "/pmwiki/pmwiki.php/Franchise/YuGiOh", "/pmwiki/pmwiki.php/WesternAnimation/StevenUniverse"], "non_media_links": ["/pmwiki/pmwiki.php/Main/EverythingTryingToKillYou", "/pmwiki/pmwiki.php/Main/FakeDifficulty", "/pmwiki/pmwiki.php/Main/TrialAndErrorGameplay", "/pmwiki/pmwiki.php/Main/LeapOfFaith", "/pmwiki/pmwiki.php/Main/GuideDangIt", "/pmwiki/pmwiki.php/Main/KaizoTrap", "/pmwiki/pmwiki.php/Main/ChestMonster", "/pmwiki/pmwiki.php/Main/LeapOfFaith", "/pmwiki/pmwiki.php/Videogame/CrashBandicoot2CortexStrikesBack", "/pmwiki/pmwiki.php/Main/HundredPercentCompletion", "/pmwiki/pmwiki.php/Videogame/CrashBandicoot3Warped", "/pmwiki/pmwiki.php/Main/LastLousyPoint", "/pmwiki/pmwiki.php/Main/GuideDangIt", "/pmwiki/pmwiki.php/Main/EscortMission", "/pmwiki/pmwiki.php/Main/TemporaryPlatform", "/pmwiki/pmwiki.php/Main/EverythingTryingToKillYou", "/pmwiki/pmwiki.php/Main/OneHitPointWonder", "/pmwiki/pmwiki.php/Main/LevelEditor", "/pmwiki/pmwiki.php/Main/SturgeonsLaw", "/pmwiki/pmwiki.php/Main/MissionControlIsOffItsMeds", "/pmwiki/pmwiki.php/Main/BottomlessPit", "/pmwiki/pmwiki.php/Main/BottomlessPits", "/pmwiki/pmwiki.php/Main/YourHeadAsplode", "/pmwiki/pmwiki.php/Main/VideoGame", "/pmwiki/pmwiki.php/Machinima/RedVsBlueTheRecollection", "/pmwiki/pmwiki.php/Main/SuperSoldier", "/pmwiki/pmwiki.php/Main/TheMedic", "/pmwiki/pmwiki.php/Main/KansasCityShuffle", "/pmwiki/pmwiki.php/Main/YouWereTryingTooHard", "/pmwiki/pmwiki.php/Main/TheCuckoolanderWasRight", "/pmwiki/pmwiki.php/Videogame/YuGiOhReshefOfDestruction", "http://i.imgur.com/hYjmT4z.png", "/pmwiki/pmwiki.php/Recap/StevenUniverseS1E38TheTest"]}