{"title": "Bowdlerise", "content": "This page has been deemed Too Inappropriate by the Moral Guardians so they have set up a Family Friendly Substitute.\n\nTo BowdlerisePronunciation \"Bow\" (as in \"port bow\" or \"cow\" minus c) plus \"dler\" (as in Schindler's List) plus \"ise\" (pronounced like eyes). Alternatively, those who know IPA: /ˈbaʊd.lə.ˌɹaɪz/. means to alter existing programs, plays, etc. so they are less rude and/or offensive. Commonly, this takes the form of swapping \"curse\" words for euphemisms. The term is used in a negative sense, by those who think the alterations are often done with a ridiculously high fear of lawsuits and/or need for political correctness. Sometimes it's understandable—different countries have different standards, and sometimes all it takes to change a show from something for teens to suitable for kids is the removal of a few swear words, darn it. Others are fairly reasonable for broadcast (editing out blood splatter, the careful clipping of a scene where a character is riddled by bullet holes).\n\nBut true Bowdlerizing starts when you actually lower the quality of the art or story in some way in the editing, sometimes as little as spoiling jokes or perhaps making villains not look quite as evil, but escalating to damaging the plot, making dialogue confusing, and making heroes look pure and shiny. And at its very \"best\", it can make a situation less acceptable. In many cases (such as the airing of R- and NC-17-rated films on broadcast television or the release of sexual, violent or edgy material in countries where such things are known to be forbidden), the viewer/listener/reader is often left wondering why a release in such a venue was even attempted.\n\nCensorship starts at editing out blood splatter and profanity. But it escalates pretty quickly. Beer may become water even when it's adults drinking—even villainous adults. Cigarettes and cigars might be removed even though it's a bad guy smoking. A six-round revolver can become a water gun or slingshot. Then they start warping entire characters to entire show so that a character is Ambiguously Bi, as if a good guy being gay might encourage kids to be gay—when ironically a good guy being bi might just encourage a kid to experiment. Then when a situation presents itself where death should be a given, it's always avoided or explained away, removing the idea of consequences stemming from dangerous activities. A girl hits a boy because he got her dirty, instead of because he might be groping her. A scene of a parent hitting their child is completely removed, making it look like they are running away over nothing.\n\nIf they really can't remove a death, they might try to remove emotional depth from it, so somebody doesn't seem to grieve that much over their best friend/lover dying — so now you're encouraged to stifle your emotions. Other emotional conversations may be edited, so characters seem to be friends rather than in love. Vital discussions might be removed because they take place in a bar, leaving plotholes. And at its most extreme, there may be the removal of entire episodes, and you might never even get to see the final season of your show because it's Darker and Edgier.\n\nNamed after Thomas Bowdler (1754-1825), who first did it on The Bible and William Shakespeare's plays; for instance, changing Ophelia's drowning from suicide to accident. It's worth noting that Bowdler himself created his \"Family Shakespeare\" versions as a way to introduce Shakespeare's plays to audiences who would otherwise be barred from experiencing them at all, and actively encouraged people to seek out the originals. Sadly, this cannot be said of most modern Bowdlerisers. Before him, the French Duke of Montausier published \"ad usum Delphini\" versions of works for the Dauphin (heir apparent) of France. \"Ad usum Delphini\" is now a synonym of this trope.\n\nCultural Translation can often contain elements of Bowdlerization. See T-Word Euphemism for a mild form of bowdlerization. See also Cut-and-Paste Translation (which specifically refers to Bowdlerization in translated works and refers more to the final product than the process) and Disneyfication (which generally goes further, in not only removing content, but adding new, \"kid-friendly\" content). See Bluenose Bowdlerizer for when it happens here on the wiki.\n\nThe inverse of this trope is American Kirby Is Hardcore. Yet another related trope is Bleached Underpants, where a creator self-censors his work to appeal to a broader audience. There is also a Censored Title, for when a work seems to be Bowdlerized, but only the title is for marketing purposes.\n\nTropes which often or always arise from Bowdlerisation include:\n• Abridged for Children: If works are edited to remove material unsuitable for minors, though it's just one reason why that trope may occur.\n• Adaptational Modesty: An adaptation makes a character's usual dress sense much less revealing than in the original, or tones down or cuts incidents involving characters being naked or partially-clad.\n• Bloodless Carnage: Removing blood and gore altogether from battles and otherwise violent scenes, even if they would do serious damage to living entities involved if they were to occur in real life.\n• Black Blood and Made of Bologna: Covering up extreme gore and blood through digital editing or redrawing the carnage so it's less shocking.\n• The Body Parts That Must Not Be Named: Resorting to euphemisms to avoid any of the common words for, uh, the bathing suit area.\n• Digital Bikini: Using digital editing to add clothes to naked people or to make someone's clothes less revealing. Can be used in conjunction with Family-Friendly Stripper, though it has also been used in conjunction with bath and shower scenes (at least when Cartoon Network aired anime), hot springs episodes, or any scene of half-naked characters in a locker room-type setting (both animated and live-action).\n• Edited for Syndication: Most of the bowdlerization does occur after a TV show is put into syndication or makes its rounds on the international market.\n• Family-Friendly Firearms: Replacing realistic weapons with more fantastic or less lethal (often silly, in the case of One Piece) ones.\n• Family-Friendly Stripper: Strip clubs and other sex establishments have the workers in relatively \"innocent\" skimpy clothes (usually a bikini) rather than being naked, topless, or in some kind of overt fetish costume.\n• Frothy Mugs of Water: Replacing alcohol with non-alcoholic drinks (usually juice, soda, or water) and hand-waving the drunken behavior as \"acting crazy\" or \"being a jerk\".\n• George Lucas Altered Version: The creator of a work making excessive revisions to it since its original release, usually to update and upgrade special effects, but sometimes to bowdlerise too.\n• Gosh Dang It to Heck!: Replacing sensitive words with their \"safer\" variants (\"damn\" to \"darn\", \"hell\" to \"heck\", \"ass\" to \"butt\" or \"rear\", etc). Witch with a Capital B is the same thing, only it focuses on toning down the word \"bitch\".\n• Never Say \"Die\": Characters can't mention anything about death and the afterlife because it may be too upsetting; even ghosts might be seen as too creepy for kids. In many cases, the word \"kill\" can never be used, even if it's in a comedic context.\n• No Smoking: Characters can't enjoy a cigarette (be it tobacco — or, in more extreme cases, cannabis, crack cocaine or meth), lest more impressionable viewers imitate what they see.\n• No Swastikas: Removing offensive imagery (usually swastikas or anything having to do with Adolf Hitler and his Nazi regime).\n• Positive Discrimination: The villain or Butt-Monkey can't be a member of a race, ethnic group, religion, or social class that has historically been persecuted. Even when the group the hated character represents hasn't been persecuted, this trope may still come into play if the group the character represents wields a lot of power in society and threatens a boycott of the work. (However, if a character becomes a villain because of persecution, that's usually okay to show.)\n• She's a Man in Japan, Get Back in the Closet, and Hide Your Lesbians: Changing a homosexual or transgender character into a heterosexual or cisgender character (and turning their gay or lesbian relationships into heterosexual ones) for less tolerant audiences.\n• Spared by the Adaptation: Not necessarily Bowdlerisation, but can be if the result is to make the body count of an originally violent work significantly lower, or zero.\n• Too Soon: Editing, delaying, or banning something (mostly TV shows and movies) due to the plot being similar to a real-life current event that may be considered to be done in poor taste. \"Funny Aneurysm\" Moment is similar, but only applies to past media that somehow \"predicts\" future bad events.\n• Thinly-Veiled Dub Country Change: Sanitizing a work created in a foreign country of any and all references to its country of origin, with references to the destination country shoehorned into their place.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/Bowdlerise?from=Main.Bowdlerised", "media_links": ["/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/Film/SchindlersList", "/pmwiki/pmwiki.php/Literature/TheBible", "/pmwiki/pmwiki.php/Creator/WilliamShakespeare", "/pmwiki/pmwiki.php/Theatre/Hamlet", "/pmwiki/pmwiki.php/Manga/OnePiece", "/pmwiki/pmwiki.php/Animation/PleasantGoatAndBigBigWolf", "/pmwiki/pmwiki.php/Creator/CreativePowerEntertaining"], "non_media_links": ["/pmwiki/pmwiki.php/Art/David", "/pmwiki/pmwiki.php/Main/Irony", "/pmwiki/pmwiki.php/Main/GoofyPrintUnderwear", "/pmwiki/pmwiki.php/Main/MeaningfulName", "/pmwiki/pmwiki.php/Main/MoralGuardians", "/pmwiki/pmwiki.php/SelfDemonstrating/Bowdlerise", "/pmwiki/pmwiki.php/Main/GoshDangItToHeck", "/pmwiki/pmwiki.php/Main/OurLawyersAdvisedThisTrope", "/pmwiki/pmwiki.php/Main/PoliticalCorrectnessGoneMad", "/pmwiki/pmwiki.php/Main/FrothyMugsOfWater", "/pmwiki/pmwiki.php/Main/FamilyFriendlyFirearms", "/pmwiki/pmwiki.php/Main/AmbiguouslyBi", "/pmwiki/pmwiki.php/Main/NobodyCanDie", "/pmwiki/pmwiki.php/Main/DarkerAndEdgier", "/pmwiki/pmwiki.php/Main/MisBlamed", "/pmwiki/pmwiki.php/Main/CulturalTranslation", "/pmwiki/pmwiki.php/Main/TWordEuphemism", "/pmwiki/pmwiki.php/Main/CutAndPasteTranslation", "/pmwiki/pmwiki.php/Main/Disneyfication", "/pmwiki/pmwiki.php/Main/BluenoseBowdlerizer", "/pmwiki/pmwiki.php/Main/AmericanKirbyIsHardcore", "/pmwiki/pmwiki.php/Main/BleachedUnderpants", "/pmwiki/pmwiki.php/Main/CensoredTitle", "/pmwiki/pmwiki.php/Main/AbridgedForChildren", "/pmwiki/pmwiki.php/Main/AdaptationalModesty", "/pmwiki/pmwiki.php/Main/BloodlessCarnage", "/pmwiki/pmwiki.php/Main/Gorn", "/pmwiki/pmwiki.php/Main/BlackBlood", "/pmwiki/pmwiki.php/Main/MadeOfBologna", "/pmwiki/pmwiki.php/Main/TheBodyPartsThatMustNotBeNamed", "/pmwiki/pmwiki.php/Main/CleanDubName", "/pmwiki/pmwiki.php/Main/DigitalBikini", "/pmwiki/pmwiki.php/Main/FamilyFriendlyStripper", "/pmwiki/pmwiki.php/Main/EditedForSyndication", "/pmwiki/pmwiki.php/Main/FamilyFriendlyFirearms", "/pmwiki/pmwiki.php/Main/FamilyFriendlyStripper", "/pmwiki/pmwiki.php/Main/FrothyMugsOfWater", "/pmwiki/pmwiki.php/Main/TookALevelInJerkass", "/pmwiki/pmwiki.php/Main/GeorgeLucasAlteredVersion", "/pmwiki/pmwiki.php/Main/GoshDangItToHeck", "/pmwiki/pmwiki.php/Main/WitchWithACapitalB", "/pmwiki/pmwiki.php/Main/NeverSayDie", "/pmwiki/pmwiki.php/Main/JustJokingJustification", "/pmwiki/pmwiki.php/Main/NoSmoking", "/pmwiki/pmwiki.php/Main/NoSwastikas", "/pmwiki/pmwiki.php/UsefulNotes/AdolfHitler", "/pmwiki/pmwiki.php/Main/OrwellianRetcon", "/pmwiki/pmwiki.php/Main/PositiveDiscrimination", "/pmwiki/pmwiki.php/Main/ButtMonkey", "/pmwiki/pmwiki.php/Main/ThenLetMeBeEvil", "/pmwiki/pmwiki.php/Main/StartOfDarkness", "/pmwiki/pmwiki.php/Main/ShesAManInJapan", "/pmwiki/pmwiki.php/Main/GetBackInTheCloset", "/pmwiki/pmwiki.php/Main/HideYourLesbians", "/pmwiki/pmwiki.php/Main/SparedByTheAdaptation", "/pmwiki/pmwiki.php/Main/TooSoon", "/pmwiki/pmwiki.php/Main/FunnyAneurysmMoment", "/pmwiki/pmwiki.php/Main/TranslationWithAnAgenda", "/pmwiki/pmwiki.php/Main/ThinlyVeiledDubCountryChange", "/pmwiki/pmwiki.php/Bowdlerise/AnimeAndManga", "/pmwiki/pmwiki.php/Bowdlerise/ComicBooks", "/pmwiki/pmwiki.php/Bowdlerise/ComicStrips", "/pmwiki/pmwiki.php/Bowdlerise/Film", "/pmwiki/pmwiki.php/Bowdlerise/Literature", "/pmwiki/pmwiki.php/Bowdlerise/LiveActionTV", "/pmwiki/pmwiki.php/Bowdlerise/Music", "/pmwiki/pmwiki.php/Bowdlerise/MythAndLegend", "/pmwiki/pmwiki.php/Bowdlerise/NewMedia", "/pmwiki/pmwiki.php/Bowdlerise/Pinball", "/pmwiki/pmwiki.php/Bowdlerise/ProfessionalWrestling", "/pmwiki/pmwiki.php/Bowdlerise/Radio", "/pmwiki/pmwiki.php/Bowdlerise/Theatre", "/pmwiki/pmwiki.php/Bowdlerise/VideoGames", "/pmwiki/pmwiki.php/Bowdlerise/WesternAnimation", "/pmwiki/pmwiki.php/Bowdlerise/TheSimpsons", "/pmwiki/pmwiki.php/Bowdlerise/RealLife", "/pmwiki/pmwiki.php/Tabletopgame/Warhammer40K", "/pmwiki/pmwiki.php/Main/MoralGuardians", "/pmwiki/pmwiki.php/Tabletopgame/Warhammer40K", "/pmwiki/pmwiki.php/Art/SistineChapel", "/pmwiki/pmwiki.php/Art/David", "http://www.vam.ac.uk/content/articles/d/davids-fig-leaf/"]}