{"title": "Establishing Character Music", "content": "When working in a visual medium (film, television, or video games), a creator must use every tool at his disposal, to tell his story. And when introducing a new character, there is often little time to establish who they are and what they are like, so music is often used to quickly flesh out their personality. Someone introduced with Heavy Metal is likely to seen as angry, even violent, while someone introduced with triumphant brass will be seen as heroic and mighty. If it's Bad to the Bone, then the character's an all-out badass.\n\nThis is all doubly so when the character is playing the music themselves.\n\nThis is a sub-trope of Establishing Character Moment. Compare to Leit Motif, when a character has a particular song associated with them, or AM/FM Characterization, when the audience learns about a character by their personal choice in music.\n\nNote: this trope only applies when music accompanies a character's introduction. However, introductory music can later be made into their Leit Motif by way of Bootstrapped Theme.\n• 10 Things I Hate About You establishes Kat quite well by having her pull up next to a bunch of poppy popular girls in a 60's beat-up Dodge Dart, glaring, to the tune of Joan Jett's \"Bad Reputation\".\n• The first time we see Marty McFly in Back to the Future, he walks into Doc Brown's laboratory, plugs in his guitar, and begins shredding. This quickly establishes him as a laid back, average teenager.\n• Star Wars:\n• A New Hope: Darth Vader is first seen on the Tantive VI accompanied by an ominous trumpet chord which, combined with his black, skull-like mask and helmet, marks him as the villain. Later when we first see Luke the main theme is heard briefly, marking him as The Hero.\n• Return of the Jedi: The first time we see the Emperor in person we hear first a bombastic Imperial March as his forces are assembled in a grand spectacle as Vader kneels before his master, then as Palpatine descends his shuttle's ramp a low men's chorus takes over with a tune of quiet malice.\n• The Force Awakens: When Rey is first introduced we have about two minutes without dialogue of her just going through her routine while her theme plays, a light feminine piece, but with an inner strength that gets more pronounced as it goes on.\n• Inglourious Basterds: Sgt. Hugo Stiglitz is introduced with an electric guitar riff to cement his badassery.\n• Who Framed Roger Rabbit: Judge Doom is introduced accompanied by an ominous bell tone and a menacing bassoon and bass violin .\n• Ganondorf in The Legend of Zelda: Ocarina of Time is first introduced for real when Link encounters him after returning to Hyrule Castle and witnesses Impa and Zelda fleeing on horseback. The ominous theme that plays when they have their first confrontation (which is later played on an imposing pipe organ much later in the game) is quite expressive of his villainy.\n• Undertale: Each of the central characters is accompanied by music when you first meet them.\n• Toriel saves you from Flowey and is accompanied by a calm, soothing melody, helping establish her motherly, caring nature.\n• Sans plays a prank on you and is accompanied by music that is smooth and chill, establishing his laid back and fun personality.\n• Papyrus is first seen berating his brother for being so lazy, while bemoaning his own inability to catch humans. His Leit Motif Nyeh Heh Heh plays while he is on screen. Its an upbeat, yet outlandish melody that helps define Papyrus as an incompetent but well-meaning guy.\n• Fire Emblem Fates: Azura, the songstress, is introduced when the player character hears someone singing and a cutscene shows Azura singing by the lake (Seen toward the end here ). The song itself, in addition to being her theme, proves to be a key plot point and has strange powers which become more apparent as time goes on.\n• Mass Effect:\n• Mass Effect:\n• On Virmire right after finding the Prothean beacon there, menacing sounding music starts playing as the party goes and converses with Sovereign for the first time.\n• Prior to speaking with Vigil, one of the final remnants of the Prothean race, we hear Vigil's Theme , slow and subdued but hopeful sounding. It's also the first thing we hear when the game starts up.\n• Mass Effect 2 opens with The Illusive Man's Theme , technologically produced and intriguing sounding but with multi-layered textures that make it tricky to hear everything in it, as he and Miranda discuss the state of the galaxy and what they need to do to achieve their goals.\n• Kingdom Hearts:\n• Kingdom Hearts II features an unknown soldier in full armor as a Bonus Boss, who murmurs about his friends before fighting. All there really is to establish his character is his theme, \"Rage Awakened,\" which captures his sense of injustice and establishes a connection to Big Bad Xehanort by reprising one of his Leitmotifs.\n• Kingdom Hearts: Birth by Sleep features a fully cloaked Bonus Boss who's theme combines nearly all of Xehanort's Leitmotifs with no other context to identify him. He reappears in Kingdom Hearts 3D: Dream Drop Distance with the same theme working for Xehanort. Turns out he's a younger Xehanort who's time traveling to unite his many incarnations, hence the reuse of all their themes.\n• Homestuck: \"The Man in the Cairo Overcoat\" reveals the Greater-Scope Villain Lord English while an incredibly distorting and constantly looping to reinforce his role as the Lord of Time.\n• RWBY: The trailers which introduced each member of Team RWBY made excellent use of music to help establish their characters.\n• Ruby's song \"Red Like Roses\" sounds like it's played by a mariachi band, portraying Ruby as a fun-loving character, but the triumphant orchestral music underneath it demonstrates her heroic nature.\n• Weiss's song \"Mirror, Mirror\" is a haunting orchestral piece, accompanied by Weiss' singing. This shows her inner struggle, as she tries to figure out who she is meant to be in life.\n• Blake's song \"From Shadows\" alternates between a somber piano piece and heavy electronic music, showing her double nature and her melancholy outlook on life.\n• Yang's song \"I Burn\" starts as a dance remix of the other girls' songs, before transitioning to a pounding synth beat. This demonstrates her devotion to her teammates and her Blood Knight tendencies.\n• In Spider-Man: Into the Spider-Verse, Miles Morales is introduced listening and half-singing along to Post Malone's \"Sunflower\", establishing him as your normal urban teenager.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/EstablishingCharacterMusic", "media_links": ["/pmwiki/pmwiki.php/Film/TenThingsIHateAboutYou", "/pmwiki/pmwiki.php/Music/JoanJett", "/pmwiki/pmwiki.php/Film/BackToTheFuture", "/pmwiki/pmwiki.php/Franchise/StarWars", "/pmwiki/pmwiki.php/Film/ANewHope", "/pmwiki/pmwiki.php/Film/ReturnOfTheJedi", "/pmwiki/pmwiki.php/Film/TheForceAwakens", "/pmwiki/pmwiki.php/Film/InglouriousBasterds", "/pmwiki/pmwiki.php/Film/WhoFramedRogerRabbit", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaOcarinaOfTime", "/pmwiki/pmwiki.php/VideoGame/Undertale", "/pmwiki/pmwiki.php/VideoGame/FireEmblemFates", "/pmwiki/pmwiki.php/Franchise/MassEffect", "/pmwiki/pmwiki.php/VideoGame/MassEffect1", "/pmwiki/pmwiki.php/VideoGame/MassEffect2", "/pmwiki/pmwiki.php/Franchise/KingdomHearts", "/pmwiki/pmwiki.php/VideoGame/KingdomHeartsII", "/pmwiki/pmwiki.php/VideoGame/KingdomHeartsBirthBySleep", "/pmwiki/pmwiki.php/VideoGame/KingdomHearts3DDreamDropDistance", "/pmwiki/pmwiki.php/WesternAnimation/SpiderManIntoTheSpiderVerse"], "non_media_links": ["/pmwiki/pmwiki.php/Main/HeavyMetal", "/pmwiki/pmwiki.php/Main/BadToTheBone", "/pmwiki/pmwiki.php/Main/EstablishingCharacterMoment", "/pmwiki/pmwiki.php/Main/LeitMotif", "/pmwiki/pmwiki.php/Main/AMFMCharacterization", "/pmwiki/pmwiki.php/Main/LeitMotif", "/pmwiki/pmwiki.php/Main/BootstrappedTheme", "https://www.youtube.com/watch?v=MftSEu4vgg0", "/pmwiki/pmwiki.php/Main/TheHero", "https://www.youtube.com/watch?v=Wkp80PB4PkA", "https://www.youtube.com/watch?v=65As1V0vQDM", "https://www.youtube.com/watch?v=grq0rhtbtAw", "/pmwiki/pmwiki.php/Main/DoomyDoomsOfDoom", "/pmwiki/pmwiki.php/Main/ForDoomTheBellTolls", "https://www.youtube.com/watch?v=Xm9t7b_lRHw&index=22&list=PL84DECB22100712A1", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/LeitMotif", "https://www.youtube.com/watch?v=FKdtstAo6iU", "https://www.youtube.com/watch?v=torno-FT2h8", "/pmwiki/pmwiki.php/Main/MagicMusic", "https://www.youtube.com/watch?v=MEc1OTFaWnI", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/FlingALightIntoTheFuture", "https://www.youtube.com/watch?v=hV1pPgpcAVw", "https://www.youtube.com/watch?v=UBLOvSb56Vc", "/pmwiki/pmwiki.php/Main/BonusBoss", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/Leitmotif", "/pmwiki/pmwiki.php/Main/BonusBoss", "/pmwiki/pmwiki.php/Main/Leitmotif", "/pmwiki/pmwiki.php/Main/WebComic", "/pmwiki/pmwiki.php/WebComic/Homestuck", "/pmwiki/pmwiki.php/Main/GreaterScopeVillain", "/pmwiki/pmwiki.php/Main/WebOriginal", "/pmwiki/pmwiki.php/WebAnimation/RWBY", "/pmwiki/pmwiki.php/Main/DesperatelyLookingForAPurposeInLife", "/pmwiki/pmwiki.php/Main/BloodKnight", "/pmwiki/pmwiki.php/Main/WesternAnimation"]}