{"title": "Tomato in the Mirror", "content": "\n• Nicely done in The Others. Grace Stewart finds herself in the midst of a haunting, only it turns out she and her family are the ghosts; the \"spooks\" they've been seeing are actually the living family who've come to see about buying the house . Particularly unsettling is the publicity clip where the creepy old woman talks to Grace in her daughter Anne's voice — when one realizes Anne's soul is actually possessing the woman, a medium hired by the living family .\n• Fight Club is a masterful example, as Edward Norton's unnamed narrator befriends and starts Fight Club with Brad Pitt's Tyler Durden, anarchist and soap salesman. As Durden begins to raise an army of committed nihilistic followers, the narrator becomes less and less comfortable with the direction of the movement. After Tyler Durden disappears at the kickoff of a coordinated act of domestic terrorism, the narrator hunts desperately for him, only to be told that he is himself Tyler Durden . The revelation changes the tone of previous conversations in the film, notably the inception of Fight Club — what was a brawl between the narrator and Durden that attracted other participants becomes the narrator/Durden beating himself up, rousing the curiosity of others . And Durden's intense sexual relationship with Marla Singer coupled with the narrator's open contempt for her; what were the actions and reactions of two separate characters take on a different light when you know the characters are the same person, and Marla's confusion and hurt at the narrator's scorn makes more sense. In the end, the narrator shoots himself through the cheek, \"killing\" Durden by demonstrating he was willing to kill himself .\n• Subverted, and possibly double-subverted in The Thing (1982). For a while, it really looks like Mac is The Thing. And then he's revealed not to be. But in the final scene, it's starting to look like he could be. If so, he hasn't been for long, though.\n• In Takashi Shimizu's Reincarnation, the story begins with a college professor filming himself as he brutally kills a hotel full of innocent people, including his own children, because of his obsession with reincarnation. Thirty-five years later, some creep decides to make a movie about it, and sets out to cast the killer and his victims. So what? So plenty. He succeeds, managing to cast the reincarnation of everyone involved in the massacre. The main character realizes she ties into all this, but doesn't find out how until the end of the movie, when she sees her true self in her reflection.\n• In Police Academy 6 it soon became clear that someone in the group was leaking information to the mastermind behind the crime wave; as always, Captain Harris figured it was one of the heroes, and started an investigation to find out who. As it turned out, the mastermind was the mayor, whom Harris was communicating with, meaning that Harris was unknowingly the leak, because he thought by giving the mayor information, he was helping oppose the mastermind! (The mayor's charade does not exonerate Harris, however, because everyone on the team was told to specifically tell nobody, a rule which Harris was breaking because he figured - wrongly - there'd be no harm telling the mayor.\n• Shattered follows a man who survives a car accident with amnesia. Along the way he discovers that his wife was having an affair. She explains that she didn't say anything because she didn't want him to remember killing her lover. When he finds her lover's corpse, it's actually his own face. It turns out that he was the lover, and the dead man was the husband. He looks like the husband now because after the car accident, the doctors repaired his face to look like the photos of the husband that they believed he was .\n• In Unknown (2006), several men wake up in a warehouse with toxic-vapor-induced amnesia. They discover that some of them are kidnappers, and at least one of them is a kidnappee, but they don't know who's which. The protagonist hopes he's not one of the villains, and the gradual return of his memories eventually reveals he's an undercover cop. This comes as a great relief ... until, at the end, he catches sight of the kidnapped man's wife, regains his memory of the affair he's been having with her, and realizes that he'd gone to the warehouse to kill her husband so they could get married and the kidnappers would be blamed .\n• In Moon, the protagonist, after spending 3 years on the moon, finds out, that he is the 5th clone to work the station, and all his memories of the time before he was there are implants. Together with the 6th Clone, they also find out that 'their' daughter, who they thought was a newborn, is actually 15 years old, and that they and the other clones are programmed to die at the end of their 3-year contract. The station has hundreds of clones ready to be woken up in a hidden room .\n• Passengers (2008): Claire, a therapist counseling a group of plane crash survivors, grows suspicious when her patients start disappearing, and she suspects that the airline is behind it when a mysterious man starts coming around and insisting that the crash was pilot error. Meanwhile, others insist they heard an explosion beforehand. Claire takes on the mission of finding out what really happened while trying to protect her patients from what she believes is a corrupt airline. It turns out that Claire was actually on the flight also and there were no survivors. The reason the patients are disappearing is because they accepted their deaths and are moving on. The mysterious man is the pilot, also dead, and he blames himself for the crash because he was distracted and tired, hence \"pilot error.\"\n• The original ending of the 2007 version of I Am Legend fits into this trope, at least metaphorically. It had the main character realizing that the infected were actually intelligent and capable of love/compassion/etc., and had only been coming after him because he was kidnapping, experimenting on, harming and killing them in an effort to \"cure\" the disease; the 'leader' of the infected merely wants his mate back, and the various attacks had been acts of self-defence. Will Smith spent the movie believing that they were mindless monsters when, in fact, he was the monstrous one, albeit unknowingly. The title refers to this, as he's the boogey man in the infected's legends — hence, \"I Am Legend\" . This was the ending in the book as well.\n• The Moebius strip of a film known as Triangle does this in numerous ways throughout the movie, which largely consists of a repeated sequence that reveals more of its story every time, each time arriving at a Memento-like \"how we got here\". This story includes Melissa George's character Jess , turning into that killer in an effort to evade her, and trying to warn away doppelgangers of herself and her friends running from a masked killer who turns out to be herself , turning into that killer in an effort to evade her, and trying to warn away doppelgangers of herself and her friends . Then it's revealed that Jess is not the saintly mother to her autistic son that she makes herself up to be, but instead a shamelessly abusive one . This constitutes this trope because Jess is amnesiac when she learns about this , which is why she proceeds to \"rectify\" this by killing her Evil Twin doppelganger, attempting to take her son elsewhere, and getting him killed in the car accident that repeats the timeline all over again .\n• Donnie Darko. The lead character has visions of a man named Frank who wears a large grotesque rabbit suit and claims to be . Following Frank causes Donnie to avoid being killed by a Jet Engine that falls from the sky . Frank instructs Donnie on the actions he must take in order to save the future. The plan involves a metal artifact that will serve as a Deus ex Machina, a resolve to the central conflict of the plot. Donnie locates the artifact in the form of . Donnie uses the artifact to shoot the man who accidentally hit Donnie's girlfriend with his car . The scenes that follow reveal that the man Donnie shot was in fact Frank, that the tragedy of his girlfriend's death was the result of his own actions, and that the artifact that will save everyone is not the gun that Donnie found but the Jet Engine that must fall on Donnie Darko, to avoid the tragedies of what would follow had it not. The Jet Engine itself being a time traveling artifact that would have fallen off the plane Donnie Darko's family would have been on, if Donnie had survived. Thus, revealing at the end that Donnie Darko is the villain of this story, and he must save the future from himself .", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/TomatoInThemirror", "media_links": ["/pmwiki/pmwiki.php/Film/AttackOfTheKillerTomatoes", "/pmwiki/pmwiki.php/Film/TheSixthSense", "/pmwiki/pmwiki.php/Film/The6thDay", "/pmwiki/pmwiki.php/Film/MulhollandDrive", "/pmwiki/pmwiki.php/Creator/DavidLynch", "/pmwiki/pmwiki.php/Creator/NaomiWatts", "/pmwiki/pmwiki.php/Creator/LauraElenaHarring", "/pmwiki/pmwiki.php/Film/ATaleOfTwoSisters", "/pmwiki/pmwiki.php/Film/Session9", "/pmwiki/pmwiki.php/Film/TheOthers", "/pmwiki/pmwiki.php/Film/AngelHeart", "/pmwiki/pmwiki.php/Creator/MickeyRourke", "/pmwiki/pmwiki.php/Film/FightClub", "/pmwiki/pmwiki.php/Film/TheThing1982", "/pmwiki/pmwiki.php/Film/TheCabinetOfDrCaligari", "/pmwiki/pmwiki.php/Film/DeadAndBuried", "/pmwiki/pmwiki.php/Film/JacobsLadder", "/pmwiki/pmwiki.php/Film/TheUninvited2009", "/pmwiki/pmwiki.php/Film/TheNeverendingStory", "/pmwiki/pmwiki.php/Film/Impostor", "/pmwiki/pmwiki.php/Film/Mirrors", "/pmwiki/pmwiki.php/Creator/JimHenson", "/pmwiki/pmwiki.php/Film/TheCube", "/pmwiki/pmwiki.php/Film/BladeRunner", "/pmwiki/pmwiki.php/Film/BladeRunner2049", "/pmwiki/pmwiki.php/Film/HellraiserInferno", "/pmwiki/pmwiki.php/Film/TerminatorSalvation", "/pmwiki/pmwiki.php/Series/TerminatorTheSarahConnorChronicles", "/pmwiki/pmwiki.php/Film/Reincarnation", "/pmwiki/pmwiki.php/Film/PoliceAcademy", "/pmwiki/pmwiki.php/Film/Identity", "/pmwiki/pmwiki.php/Film/Unknown2006", "/pmwiki/pmwiki.php/Film/Unknown2011", "/pmwiki/pmwiki.php/Film/Moon", "/pmwiki/pmwiki.php/Literature/TheDaVinciCode", "/pmwiki/pmwiki.php/Film/Passengers2008", "/pmwiki/pmwiki.php/Film/IAmLegend", "/pmwiki/pmwiki.php/Literature/IAmLegend", "/pmwiki/pmwiki.php/Film/TheDeathsOfIanStone", "/pmwiki/pmwiki.php/Film/Frailty", "/pmwiki/pmwiki.php/Film/TheMachinist", "/pmwiki/pmwiki.php/Creator/ChristianBale", "/pmwiki/pmwiki.php/Film/Triangle", "/pmwiki/pmwiki.php/Film/Memento", "/pmwiki/pmwiki.php/Film/TheTrumanShow", "/pmwiki/pmwiki.php/Film/Cypher", "/pmwiki/pmwiki.php/Film/CubeZero", "/pmwiki/pmwiki.php/Film/Thor", "/pmwiki/pmwiki.php/Film/EdenLog", "/pmwiki/pmwiki.php/Film/Oblivion2013", "/pmwiki/pmwiki.php/Film/NightAtTheMuseum", "/pmwiki/pmwiki.php/Film/RubySparks", "/pmwiki/pmwiki.php/Film/DonnieDarko", "/pmwiki/pmwiki.php/Film/FrozenDays", "/pmwiki/pmwiki.php/Film/TheWard", "/pmwiki/pmwiki.php/Film/Haunter", "/pmwiki/pmwiki.php/Film/ExMachina", "/pmwiki/pmwiki.php/Film/Djinn", "/pmwiki/pmwiki.php/Film/TheIsland", "/pmwiki/pmwiki.php/Film/Lifeforce", "/pmwiki/pmwiki.php/Film/Us"], "non_media_links": ["/pmwiki/pmwiki.php/Main/TwistEnding", "/pmwiki/pmwiki.php/UsefulNotes/Bollywood", "https://www.youtube.com/watch?v=YK51dpxxS3U", "https://www.youtube.com/watch?v=d13HQFT6-_E", "/pmwiki/pmwiki.php/Main/MindScrew", "/pmwiki/pmwiki.php/Main/TwistEnding", "/pmwiki/pmwiki.php/Main/UnreliableNarrator", "/pmwiki/pmwiki.php/Main/RealAfterAll", "/pmwiki/pmwiki.php/Main/TheEndingChangesEverything", "/pmwiki/pmwiki.php/Main/TheKillerInMe", "/pmwiki/pmwiki.php/Main/GroundhogDayLoop", "/pmwiki/pmwiki.php/Main/DeadallAlong", "/pmwiki/pmwiki.php/Main/IronicHell", "/pmwiki/pmwiki.php/Main/BittersweetEnding", "/pmwiki/pmwiki.php/Main/IntoTheMirror", "/pmwiki/pmwiki.php/Main/MindScrew", "/pmwiki/pmwiki.php/Main/GodInHumanForm", "/pmwiki/pmwiki.php/Main/LockedOutOfTheLoop", "/pmwiki/pmwiki.php/Main/GodInHumanForm", "/pmwiki/pmwiki.php/Main/AscendToAHigherPlaneOfExistence", "/pmwiki/pmwiki.php/Main/FreakOut", "/pmwiki/pmwiki.php/Main/Foil", "https://www.youtube.com/watch?v=0tHsZngoFDw", "/pmwiki/pmwiki.php/Main/TheMockbuster", "/pmwiki/pmwiki.php/WebVideo/BadMovieBeatdown", "/pmwiki/pmwiki.php/Main/SincerityMode", "/pmwiki/pmwiki.php/Main/IAmYouAndYouAreMe", "/pmwiki/pmwiki.php/Main/AsleepForDays", "/pmwiki/pmwiki.php/Main/MindScrew", "/pmwiki/pmwiki.php/Main/TheKillerInMe", "/pmwiki/pmwiki.php/Main/EvilTwin", "/pmwiki/pmwiki.php/Main/OutlawCouple", "/pmwiki/pmwiki.php/Main/SerialKiller", "/pmwiki/pmwiki.php/Main/GroundhogDayLoop", "/pmwiki/pmwiki.php/Main/DeadAllAlong", "/pmwiki/pmwiki.php/Main/FateWorseThanDeath", "/pmwiki/pmwiki.php/Main/LighterAndSofter", "/pmwiki/pmwiki.php/Main/UnwittingPawn", "/pmwiki/pmwiki.php/Main/GambitPileup", "/pmwiki/pmwiki.php/Main/MegaCorp", "/pmwiki/pmwiki.php/Main/MemoryGambit", "/pmwiki/pmwiki.php/Main/LieDetector", "/pmwiki/pmwiki.php/Main/MemoryGambit", "/pmwiki/pmwiki.php/Main/ReverseMole", "/pmwiki/pmwiki.php/Main/TheChessmaster", "/pmwiki/pmwiki.php/Main/MeaningfulName", "/pmwiki/pmwiki.php/Main/MemoryGambit", "/pmwiki/pmwiki.php/Main/LieDetector", "/pmwiki/pmwiki.php/Main/Anvilicious", "/pmwiki/pmwiki.php/Main/TheUnfavourite", "/pmwiki/pmwiki.php/Main/MagicKnight", "/pmwiki/pmwiki.php/Main/WorldOfBadass", "/pmwiki/pmwiki.php/Main/LukeIAmYourFather", "/pmwiki/pmwiki.php/Main/AfterTheEnd", "/pmwiki/pmwiki.php/Main/TurnedAgainstTheirMasters", "/pmwiki/pmwiki.php/Main/TheReveal", "/pmwiki/pmwiki.php/Main/PlanetLooters", "/pmwiki/pmwiki.php/Main/DeusExMachina", "/pmwiki/pmwiki.php/Main/SplitPersonality", "/pmwiki/pmwiki.php/Main/SplitPersonalityTakeover", "/pmwiki/pmwiki.php/Main/FreakOut", "/pmwiki/pmwiki.php/Main/EnfantTerrible", "/pmwiki/pmwiki.php/Main/PeopleFarms", "/pmwiki/pmwiki.php/Main/HumanResources", "/pmwiki/pmwiki.php/Main/ReleasedToElsewhere", "/pmwiki/pmwiki.php/Main/KillAndReplace", "/pmwiki/pmwiki.php/Main/MistakenForCheating", "/pmwiki/pmwiki.php/Main/SplitPersonality"]}