{"title": "Every 10,000 Points", "content": "Usually in games, the goal is to have the most points, in order to win. Yet when a game can go on indefinitely, the goal is to get as many points as possible. This likely started with pinball, but is more famous for Video Games, particularly Golden Age video games and puzzle games like Tetris.\n\nSome games also give you a reward for getting a certain number of points. This is similar to experience points in Role Playing Games, but instead of leveling up, the game gives an extra life or extra game. Sometimes there are other rewards, in order to get 100% Completion.\n\nIn several arcade games, the owner of the machine could set the difficulty switches to change the number of points required for a 1-Up. This is why Attract Modes sometimes advertised this number. In the gaming industry, these are sometimes referred to as \"extends\", since they extend the play time for the player.\n\nThe number of points needed to get each new life after the first may increase geometrically, so the bonus lives get fewer and farther between as the game goes on.\n\nThis isn't as common these days, along with points entirely, but it occasionally pops up.\n\nIn games where dying is inevitable, point-based extra lives can cause Unstable Equilibrium.\n• Alien Hominid uses a structure like this for its extra lives. The first one is at 1,000 points, and the number needed goes up by 100 points each time.\n• Zombies Ate My Neighbors replaced one dead neighbor every 40,000 pts. If you already had all 10, you got an extra life.\n• In the LEGO Adaptation Games, beginning with LEGO Star Wars, if you collect enough studs (points) in each level, you fill up the level's Stud Bar and get a part of an unlockable item. The Stud Bars are very difficult to fill however, so if you want 100% Completion you need to save up for Stud Multipliers.\n• In Final Fight, this was only way to get another lives in most versions of the game (except the Guy and One version on the SNES and GBA respectively, which introduced a 1-up item):\n• The arcade version can be set to allow up to five extra lives (one for the first 100,000 points and the rest for every subsequent 200,000 points), only one extra life for the first 100,000 or 200,000 points or none at all.\n• In the SNES version, the player can gain even more extra lives after the fifth one, resulting in a somewhat easier game, but the maximum stock is capped at nine.\n• Streets of Rage 3 awards, in addition to the point-based extra lives, technique stars that upgrade your blitz attack. Stars are accumulated at every 40,000 points on your current life, and a life lost will remove a star and require you to get 40,000 more points to get it back.\n• The original F-Zero in GP Mode gives you points every time you advance a lap based on your position and the lap number. Every 10,000 points, you get an extra chance to retry.\n• Rohan Online's M.Kill system (short for Monster Kill) gives you bonus XP for every 20 mobs you kill, with the bonus increasing until you get 100 monster kills, at which point it resets back to 0. You don't get the bonus if you're fighting monsters with their names in grey, which are too weak to give you any XP or item drops.\n• Guild Wars 2 has rewards for obtaining 100, 500, 1000, 1500 and so on achievement points.\n• The same happens in Dragon Nest.\n• The early Castlevania games tended to follow the same pattern: on the first NES game you'd get your first extra life at 30,000 points and each subsequent extra life for every 50,000 points afterward. The game had a ton of hidden treasures worth a lot of points to help you in this task, including one before you even enter the castle.\n• Super Castlevania IV had you gain a life at 20,000, 50,000 and every 50,000 points after that.\n• In The Caverns Of Hammerfest you get extra lives every one million points and at the marks of 100,000 and 500,000 points.\n• In Chip 'n Dale Rescue Rangers, a 1-up star will appear for every 50 flowers or 10 stars collected.\n• Chuckie Egg has it exactly: an extra level every 10,000 points. Curiously, the points value of an egg goes up every fourth level; on Levels 29-32 it reaches 800 points, meaning, since there are 12 eggs per level plus birdseed, you're guaranteed an extra life just for completing the level (and you will probably get most of the way to a second one from the time bonus). You'll need them all.\n• The first three Commander Keen games, as well as the Gaiden Game, Keen Dreams, gave Keen an extra life every 20,000 points. There were several levels containing enough points in an easily obtainable location to make infinite lives a cinch.\n• In the later games, the score you needed would double instead: first 20,000, then 40,000, then 80,000, then 160,000, and so on (up to at least 2,560,000 points, which is impossible to achieve without cheating), and the games also had the Law of 100 to gain an extra life. Of course, you could save mid-level anyway so it didn't matter.\n• The Fairyland Story gives extra lives at 30,000 points, at 100,000 points, and every 100,000 points thereafter.\n• In Monty Python's Flying Circus, you get an extra life for every 10000000 points you lose.\n• Nebulus gives an extra life for every 5000 points scored.\n• In Rayman 3: Hoodlum Havoc, collecting enough points can unlock you bonus cutscenes and minigames.\n• Road Runner's Death Valley Rally awards an extra life for every 50,000 points scored.\n• The classic Sonic the Hedgehog series awarded extra lives for collecting 100 & 200 rings (but not 300+; later games where it was possible to collect that many rings would fix that), plus (starting with Sonic the Hedgehog 2) an extra life every 50,000 points (and, in Sonic 2, a continue for earning over 10,000 points in bonuses in a single level).\n• Super Mario Bros. famously awarded an extra life for every 100 coins.\n• In Super Mario Bros. 3, obtaining 80,000 points causes an \"N-Spade\" to appear on the world map, which leads to a matching-card game where you can earn power-ups and extra lives.\n• For every 100,000 points you score in Super Mario Land, you'll be given a chance to continue should your game be over by losing all your lives!\n• Super Mario 64 is extremely generous with its extra lives, at least on the coin front, awarding one per 50 coins collected at the end of each level.\n• The tradition was continued with Super Mario Galaxy and its sequel, where 50 Star Bits or coins get you a life.\n• In Super Paper Mario your score is actually your Experience Points so achieving a high score would lead you to be more powerful.\n• In Back to the Future Part II & III for the NES, Marty McFly gains an extra life for every 100 points of junk food that he collects.\n• In Armed Police Batrider, by default, every 1.5 million points you get an extra life. Depending on the game version, it's either an instant 1-Up, or the next item that you generate once you cross the point boundary becomes a 1-up item. Fail to grab the 1-up and the announcer lets out a Big \"NO!\"\n• The Trope Maker is Asteroids, which awarded an extra ship for every 10,000 points, with a limit of 99 ships. Top-level players would max out their ships, then use the time that it would take thirty or forty ships to be destroyed in order to take bathroom and meal breaks (or even short naps) during marathon sessions.\n• Battle Garegga's Dynamic Difficulty is affected by the rate at which you get extra lives; the lowest extra life setting (at every 1,000,000 points) makes the game harder than with less frequent extra life rates. Those looking to complete the game will need the extra lives, as dying reduces the game's difficulty and keeps it playable.\n• Blue Revolver hands out up to four extra lives based on score in Normal and Hyper Modes. On Parallel Mode, you get one every 15 million points and you can go beyond four extra lives as long as you keep earning the necessary points. Experimental Weapon mode also lacks the point 1-up restriction, awarding you an extra life every 10 million points.\n• Blue Wish Resurrection gives you two extends: One at 4 million and another at 10 million. In Blue Wish Resurrection Plus, however, you get one every 5 million points and you'll always get your extra life so long as you hit any multiple of 5 million.\n• Castle of Shikigami III has an interesting version of this - at certain point thresholds you receive both a bomb AND a life. You can only carry up to 3 lives and 5 bombs, though, so these bonuses are commonly squandered.\n• Cave scoring systems, particularly those of newer games, tend to involve so many digits the difference between the first extend and the second is one or two whole digits. For instance:\n• You get an extra life in Centipede for every 12,000 points. The game even announces it by playing a victory tune.\n• Crystal Quest and its sequel grant extra lives at \"depressingly rarer\" point intervals. In the original, the intervals are determined by current level rather than total score, making it crucial to rack up points early on while they're still worth more.\n• Devil Engine awards an extra life every 50,000 points. You also gain an extra bomb every 5,000 points.\n• In Eliminate Down, it's 100,000 points for an extra life.\n• In Gate Of Thunder, the point values at which you receive an extra life follow a quasi-geometric progression, i.e.: 50,000 → 120,000 → 250,000 → 500,000.\n• In Every Extend, harnessing this gameplay mechanic is the only way to make any progress.\n• Geometry Wars gives you a Power-Up every so many points, and an extra life and bomb every other point threshold. The higher the level, the bigger the point gap: Grid Wars, for example, gives you an extra life every 150,000 points in Normal, and every 250,000 in Hard.\n• Geometry Wars Galaxies has the \"Sur-\" (survival) stages, which avert this trope: you get only one life, no bombs, and no way to get more of either.\n• Ghost Pilots for the Neo Geo awards an extra ship at 30,000 points and every 80,000 points after that.\n• Guardic for the MSX gives an extra Guardic every 20,000 points. The jingle that plays when you get this is not the 1-Up jingle familiar from other Compile games.\n• HELLSINKER plays with this trope, then again it plays with virtually every typical Shoot 'em Up trope:\n• Collecting enough heart icons will grant you extra lives. However, each time you do so the number of hearts for the next life increases Each character has a \"Life Scale\" and an \"Expand\" rating. Life Scale is the initial number of hearts needed for an extra life. When you get an Extra Life by collecting hearts, the number of hearts needed is (hearts needed for the previous Extend) + Expand, so for example a character with a Life Scale of 18 and an Expand rating of 2 needs 18 hearts for the fist extend, 20 for the second, 22 for the third, etc. , unless you're playing as a particular character and shot type combo . If you are at your max lives when you get an Extend, you instead get an Immortality Bonus, which increases each time you get an Extend at max lives.\n• When you reach get enough Spirits or kills, you get a \"BREAKTHROUGH\"; you gain an extra life and your Extend counter is re-initialized, making it easier to get further extra lives.\n• Perhaps the only straight use of this trope in the game is that you gain one heart piece every 100 spirits.\n• In Ketsui, by default, you get an extra life at 20 million points and again at 45 million points. There's two other ways to get one-ups.\n• In Raiden Fighters Jet, it is possible to get an extra life by reaching the second loop...in the unranked Hard and Very Hard difficulties of the 360 port.\n• Both Scramble and Super Cobra give you an extra ship for every 10,000 points.\n• Silver Surfer gives you an extra life every 100,000 points.\n• When you reach certain score intervals in the original Star Fox, you'll be rewarded with a chance to continue should your game be over by losing all your lives; up to a maximum of 3!\n• In Star Fox 64, your shield meter doubles if you collect three gold rings in a stage. Collecting another three gold rings within that same stage earns you an extra life.\n• In certain levels, it's possible to get multiple extra lives this way if you started with two rings already in hand because there actually were 7 rings. Nintendo tried to avoid this.\n• Same for Star Fox Command, except you need to collect coins first (which spread out from kill No. 100). Command also had an item system that had an item appear for every fifth kill.\n• Stargunner gives you an extra life at 500,000, 1 million, and every million after that. Not that this makes the game any easier...\n• The Thunder Force series likes to crank out lots of extra lives thanks to the low point requirements to get one. In Thunder Force III, for instance, it's possible to possess 12 extra lives (with 4 of them being your starting lives) by the time you get to stage 6.\n• Toaplan's Hellfire, Truxton, Fire Shark and Vimana awarded an extra fighter at 70,000 points and every 200,000 points after that. As usual, this behavior could be modified with DIP switches in the arcade versions.\n• Some Touhou games do this. Rarely evenly spaced though, given that scores tend to snowball.\n• Twin Cobra had different difficulty settings that could vary this. An extra helicopter might be granted at 50,000 points and every 150,000 points thereafter under one setting; at 70,000 points and every 200,000 points thereafter in another.\n• Warning Forever's 3 Lives mode displays your lives remaining as a decimal number with two significant digits. Every time you destroy an enemy part, you get .01 life, so every 100 parts you destroyed yielded a full extra life. Dying, of course, takes off 1.00 life, so once you fall into the 0.xx range, your next death will end the game.\n• In Kirby's Pinball Land, when you reached a point milestone, you'd get a Kirby dance!\n• Sonic the Hedgehog Spinball gave the player an \"extra ball\" every 20,000,000 points. Given the Nintendo Hard nature of the game, that was probably not generous enough.\n• Game & Watch games would often reward you with EXTENDED PLAY by clearing your misses at certain score levels - if you had no misses at that point, you'd instead enter CHANCE TIME (earn double points until you did miss). Also, if the game consisted of action that constantly sped up, it would usually slow down at certain intervals.\n• Atari ST game Time Bandit (unrelated to the movie) starts you off with about 20 lives. And you get another every 1000 points. You go through them fast.\n• The Beetle Mania Mini-Game in Super Mario RPG drops a heart at 10,000 points and then every additional 70,000 afterwards.\n• Every 5000 points in Robot Unicorn Attack gets pretty dolphins jumping around.\n• In pokemon.com, games will give you a trainer token after 5,000 points, the first time you reach it under an account, that is, then it sticks to this rule like glue, all games except puzzles apply.\n• In Brütal Legend, freeing every ten out of 120 Bound Serpents gave Eddie increasing bonuses to health, attack, and regeneration rate. You also got three Achievements along the way.\n• In Monaco: What's Yours Is Mine, you receive additional ammo for your currently equipped item for every 10 coins you collect.\n• In Crash of the Titans, you get an extra life for every 25.000 mojo you collect.\n• In Wonder Boy in Monster Land, you earn a Heart Container every several thousand points. You're gonna need them, because of the timed health drain, and since in the final stage of the arcade version and entirety of the SMS version, there are no continues.\n• Beat 'Em & Eat 'Em, the pornographic Atari 2600 game, gave an extra life for every 69 points.\n• Pac-Guy: In every game in the series, an extra life is awarded at every 1,000 points, though in the earlier games this resets your score afterwards.\n• Splatoon 2 awards one bonus capsule for every 100 points earned in Salmon Run. After reaching 1200 points in a single rotation, bonuses are only awarded every 200 points, but all bonus capsules earned after that point are guaranteed to contain exclusive gear.\n• The song \"Smoke Two Joints\" by the Toyes mentions this trope by name with the line, \"and at every 10,000 points, I smoke two joints.\" A one-up, indeed. Notably, the line is omitted in the cover by Sublime since modern video games don't really work this way.\n• Pinball machines in general use this to its fullest potential. Every modern machine will display a value which awards a free game to the player once it is surpassed, and most will also award additional games for earning enough points to appear on the high score list. These are signified by a loud knock from inside the machine, using an aptly-named solenoid called a \"knocker,\" an artifact from before pre-recorded audio (and thus was the only good way to alert the player to something). Newer games can also be set to give out extra balls for points as well, making it a straighter example of this trope. (Pinball 2000 used that as the default settings.) Whereas video game makers refer to them as \"extends,\" as seen at the description up top, pinball people call them \"replays.\"\n• The Skee-Ball variant Ice Ball rewards you with extra balls (along with the nine you start with) if you score high enough.\n• Referenced in an episode of The Fairly OddParents! in which Timmy and his friends play a virtual reality game in which dying in-game will result in real-life death. During the Final Boss battle with , Timmy sacrifices his last life to save his friends, and right after he loses his last life, his score counter hits the extend point of 50 million, allowing him to respawn and narrowly avoid a Game Over", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/EveryTenThousandPoints?from=Main.Every10000Points", "media_links": ["/pmwiki/pmwiki.php/VideoGame/Tetris", "/pmwiki/pmwiki.php/VideoGame/AlienHominid", "/pmwiki/pmwiki.php/VideoGame/ZombiesAteMyNeighbors", "/pmwiki/pmwiki.php/VideoGame/LEGOAdaptationGame", "/pmwiki/pmwiki.php/VideoGame/LEGOStarWars", "/pmwiki/pmwiki.php/VideoGame/FinalFight", "/pmwiki/pmwiki.php/VideoGame/StreetsOfRage", "/pmwiki/pmwiki.php/VideoGame/FZero", "/pmwiki/pmwiki.php/VideoGame/RohanOnline", "/pmwiki/pmwiki.php/VideoGame/GuildWars2", "/pmwiki/pmwiki.php/VideoGame/DragonNest", "/pmwiki/pmwiki.php/Franchise/Castlevania", "/pmwiki/pmwiki.php/VideoGame/CastlevaniaI", "/pmwiki/pmwiki.php/VideoGame/SuperCastlevaniaIV", "/pmwiki/pmwiki.php/VideoGame/TheCavernsOfHammerfest", "/pmwiki/pmwiki.php/VideoGame/ChipNDaleRescueRangers", "/pmwiki/pmwiki.php/VideoGame/ChuckieEgg", "/pmwiki/pmwiki.php/VideoGame/CommanderKeen", "/pmwiki/pmwiki.php/VideoGame/TheFairylandStory", "/pmwiki/pmwiki.php/VideoGame/MontyPythonsFlyingCircus", "/pmwiki/pmwiki.php/VideoGame/Nebulus", "/pmwiki/pmwiki.php/VideoGame/Rayman3HoodlumHavoc", "/pmwiki/pmwiki.php/VideoGame/RoadRunnersDeathValleyRally", "/pmwiki/pmwiki.php/VideoGame/SonicTheHedgehog", "/pmwiki/pmwiki.php/VideoGame/SonicTheHedgehog2", "/pmwiki/pmwiki.php/Franchise/SuperMarioBros", "/pmwiki/pmwiki.php/VideoGame/SuperMarioBros3", "/pmwiki/pmwiki.php/VideoGame/SuperMarioLand", "/pmwiki/pmwiki.php/VideoGame/SuperMario64", "/pmwiki/pmwiki.php/VideoGame/SuperMarioGalaxy", "/pmwiki/pmwiki.php/VideoGame/SuperPaperMario", "/pmwiki/pmwiki.php/VideoGame/BackToTheFuturePartIIAndIII", "/pmwiki/pmwiki.php/VideoGame/ArmedPoliceBatrider", "/pmwiki/pmwiki.php/VideoGame/Asteroids", "/pmwiki/pmwiki.php/VideoGame/BattleGaregga", "/pmwiki/pmwiki.php/VideoGame/BlueRevolver", "/pmwiki/pmwiki.php/VideoGame/BlueWishResurrection", "/pmwiki/pmwiki.php/VideoGame/CastleOfShikigami", "/pmwiki/pmwiki.php/Creator/Cave", "/pmwiki/pmwiki.php/VideoGame/DonPachi", "/pmwiki/pmwiki.php/VideoGame/DeathSmiles", "/pmwiki/pmwiki.php/VideoGame/Centipede", "/pmwiki/pmwiki.php/VideoGame/CrystalQuest", "/pmwiki/pmwiki.php/VideoGame/DevilEngine", "/pmwiki/pmwiki.php/VideoGame/EliminateDown", "/pmwiki/pmwiki.php/VideoGame/GateOfThunder", "/pmwiki/pmwiki.php/VideoGame/EveryExtend", "/pmwiki/pmwiki.php/VideoGame/GeometryWars", "/pmwiki/pmwiki.php/Creator/Compile", "/pmwiki/pmwiki.php/VideoGame/HELLSINKER", "/pmwiki/pmwiki.php/VideoGame/Ketsui", "/pmwiki/pmwiki.php/VideoGame/RaidenFighters", "/pmwiki/pmwiki.php/VideoGame/Scramble", "/pmwiki/pmwiki.php/VideoGame/SilverSurfer", "/pmwiki/pmwiki.php/VideoGame/StarFox", "/pmwiki/pmwiki.php/VideoGame/StarFox64", "/pmwiki/pmwiki.php/VideoGame/StarFoxCommand", "/pmwiki/pmwiki.php/VideoGame/Stargunner", "/pmwiki/pmwiki.php/VideoGame/ThunderForce", "/pmwiki/pmwiki.php/Creator/Toaplan", "/pmwiki/pmwiki.php/VideoGame/FireShark", "/pmwiki/pmwiki.php/VideoGame/Touhou", "/pmwiki/pmwiki.php/VideoGame/TwinCobra", "/pmwiki/pmwiki.php/VideoGame/WarningForever", "/pmwiki/pmwiki.php/VideoGame/KirbysPinballLand", "/pmwiki/pmwiki.php/VideoGame/SonicTheHedgehogSpinball", "/pmwiki/pmwiki.php/VideoGame/SuperMarioRPG", "/pmwiki/pmwiki.php/VideoGame/RobotUnicornAttack", "/pmwiki/pmwiki.php/VideoGame/BrutalLegend", "/pmwiki/pmwiki.php/VideoGame/MonacoWhatsYoursIsMine", "/pmwiki/pmwiki.php/VideoGame/CrashOfTheTitans", "/pmwiki/pmwiki.php/VideoGame/WonderBoyInMonsterLand", "/pmwiki/pmwiki.php/VideoGame/PacGuy", "/pmwiki/pmwiki.php/VideoGame/Splatoon2", "/pmwiki/pmwiki.php/WesternAnimation/TheFairlyOddParents"], "non_media_links": ["/pmwiki/pmwiki.php/Main/EndlessGame", "/pmwiki/pmwiki.php/Main/Pinball", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/UsefulNotes/TheGoldenAgeOfVideoGames", "/pmwiki/pmwiki.php/Main/RolePlayingGame", "/pmwiki/pmwiki.php/Main/VideoGameLives", "/pmwiki/pmwiki.php/Main/HundredPercentCompletion", "/pmwiki/pmwiki.php/Main/OneUp", "/pmwiki/pmwiki.php/Main/AttractMode", "/pmwiki/pmwiki.php/Main/NintendoHard", "/pmwiki/pmwiki.php/Main/UnstableEquilibrium", "/pmwiki/pmwiki.php/Main/SisterTrope", "/pmwiki/pmwiki.php/Main/LawOfOneHundred", "/pmwiki/pmwiki.php/Main/ActionAdventure", "/pmwiki/pmwiki.php/Main/OneHundredPercentCompletion", "/pmwiki/pmwiki.php/Main/BeatEmUp", "/pmwiki/pmwiki.php/Main/DrivingGame", "/pmwiki/pmwiki.php/Main/PlatformGame", "/pmwiki/pmwiki.php/Main/NintendoHard", "/pmwiki/pmwiki.php/Main/GaidenGame", "/pmwiki/pmwiki.php/Main/LawOfOneHundred", "/pmwiki/pmwiki.php/Main/MeaninglessLives", "/pmwiki/pmwiki.php/Main/InvertedTrope", "/pmwiki/pmwiki.php/Main/LawOfOneHundred", "/pmwiki/pmwiki.php/Main/ExperiencePoints", "/pmwiki/pmwiki.php/Main/ShootEmUp", "/pmwiki/pmwiki.php/Main/OneUp", "/pmwiki/pmwiki.php/Main/BigNo", "/pmwiki/pmwiki.php/Main/TropeMaker", "/pmwiki/pmwiki.php/Main/Cap", "/pmwiki/pmwiki.php/Main/DynamicDifficulty", "/pmwiki/pmwiki.php/Main/HarderThanHard", "/pmwiki/pmwiki.php/Main/PinballScoring", "/pmwiki/pmwiki.php/Main/PowerUp", "/pmwiki/pmwiki.php/UsefulNotes/NeoGeo", "/pmwiki/pmwiki.php/UsefulNotes/MSX", "/pmwiki/pmwiki.php/Main/OneUp", "/pmwiki/pmwiki.php/Main/ShootEmUp", "/pmwiki/pmwiki.php/Main/TheBattleDidntCount", "/pmwiki/pmwiki.php/Main/NintendoHard", "/pmwiki/pmwiki.php/Main/DigitalPinballTable", "/pmwiki/pmwiki.php/Main/NintendoHard", "/pmwiki/pmwiki.php/UsefulNotes/GameAndWatch", "/pmwiki/pmwiki.php/UsefulNotes/AtariST", "/pmwiki/pmwiki.php/Main/MiniGame", "/pmwiki/pmwiki.php/Main/HeartContainer", "/pmwiki/pmwiki.php/UsefulNotes/Atari2600", "/pmwiki/pmwiki.php/Main/AntiGrinding", "/pmwiki/pmwiki.php/Main/AndYourRewardIsClothes", "/pmwiki/pmwiki.php/Main/Pinball", "/pmwiki/pmwiki.php/Main/YourMindMakesItReal", "/pmwiki/pmwiki.php/Main/FinalBoss", "/pmwiki/pmwiki.php/Main/HeroicSacrifice", "/pmwiki/pmwiki.php/Main/GameOver"]}