{"title": "No Time to Think", "content": "There's a time to think, and a time to act. And this, gentlemen, is no time to think.\n\nAny critical choice a character must make quickly through gut instinct instead of logic or knowledge, especially one which would be trivial if not for some incomplete information. Even better if the character is The Spock, and learns An Aesop about trusting other characters, or their own instincts.\n\nThis frequently overlaps with, but is not limited to, the Wire Dilemma, where a character needs to disarm a bomb. Spot the Imposter is the version of this trope where a character needs to distinguish an Evil Duplicate from the original.\n• The second episode of (the remake of) Kujibiki Unbalance.\n• In Pokémon Adventures, Pearl is very good at making a plan when in the heat of the moment. This is a contrast to Diamond, who's better at figuring things out in the long term.\n• Subverted in Catwoman: One story arc involves the Film Freak trying to set off a nuke in the East End of Gotham. Selina stops it just in time by picking a wire at random and snipping it, explaining to her sidekick Holly, who questions her choice and flinches away when she cuts it, that \"They're all the right one. Cutting any wire will shut it down. Don't believe everything you see in the movies, Holly. This is the real world.\" She's actually wrong: in the actual real world, clipping random wires is a good way to set off a bomb, because dummy wires are the simplest trap a bombmaker can put inside his device with little effort.\n• Literally, in The Keys Stand Alone: The Soft World. An angry John has gone to see why Ringo has abandoned the others for the Guardians' psionics division. Realizing that the various psionics around him are massaging his thoughts to take control of him, and given maybe a second to act when his rage scours them out, John grabs Ringo and screams in his ear and simultaneously floods him with toxic emotion. *POP* Ringo's emergency teleport is triggered, and they're outta there!\n• In the 2007 Transformers movie, the final battle ends with Sam Witwicky jamming the omnipotent Allspark into Big Bad Megatron, betting on the off chance that the relic everyone spent the whole movie chasing would be too powerful for Megatron to handle and destroy him... and not, for example, make him an unstoppable machine god . Pretty lucky guess there, Sam!\n• More of a logical leap, as Optimus Prime's failsafe plan had been to do the same thing to himself in a Heroic Sacrifice .\n• Definitely a logical leap, when you consider that Optimus was urging Sam to implement this very same failsafe plan at the time .\n• By the looks of it, possibly not looks like the has a timer on it's reformatting powers\n• Conan runs into something like this in Conan the Destroyer. He's reasoned that the wizard he's fighting is behind one of two mirrors, while his friends are behind the other. He rears back to throw his sword, seemingly into the mirror hiding his friends, then turns and throws it at the other mirror, hitting the wizard. It's compelling, until Fridge Logic kicks in, and you wonder why A. none of his friends thought to simply duck, and B. why Conan decided to throw the sword, rather than just walking up to the mirrors and slashing them, as he had been doing.\n• In the film The Abyss, Bud has to disarm a nuclear weapon. He knows it's the red wire, not the blue wire, but in the green monochromatic light of the glowstick, they look the same. Whoops! He, of course, guesses right .\n• In the film Air Force One, President Marshall (played by Harrison Ford) has to cut two wires to drain Air Force One's fuel tanks. The bundle of wires he picks are green, yellow, blue, red and white. He is instructed to cut the green wire but is then cut off. He correctly chooses to cut the yellow wire, saying \"I'm counting on you, red, white and blue.\"\n• Gravity. The female protagonist has to reenter the Earth's atmosphere using the capsule on a Chinese space station whose orbit is already decaying, but the instructions in the capsule are all in Chinese. In the end she just has to push buttons and hope she's hitting the right ones. Fortunately she's been trained on a Russian Soyuz, which the Chinese capsule is based on, so her guesses turn out to be accurate.\n• In the Ciaphas Cain novel The Traitor's Hand, Cain foils an assassination attempt, only to discover a bomb built into the aircar used in the ram raid attack. He calls for help from an expert, prompting the following amusing conversation: Cogitator Ikmenedies: Are there wires leading to the promethium flask? Ikmenedies: Then it should be simple. All you have to do is cut the red one. Ikemenedies: (beat) You'll just have to use your best judgment.\n• He gets it right, of course.\n• In the Farscape episode \"PK Tech Girl,\" Crichton explains this trope to a Sebacean woman, who says that her culture has such entertainment as well.\n• Doctor Who example- dealing with a malfunctioning MRI in \"Smith and Jones\".\n• In Life On Mars Sam crawls under a car to disarm a bomb, but can't remember which wire it's supposed to be. He's saved at the last second when a bomb squad guy comes over and just snips the red wire without a second thought.\n• In the season finale of the J Drama Galileo, Prof. Yukawa tells the hot-blooded Detective Utsumi that diffusing a bomb is not as easy as cutting a red or blue wire. He proceeds to preform a large amount of complicated tasks and ends up with a choice: cut the blue, red, or PINK wire. In sharp contrast to his normally logical character, he guesses based on Utsumi's intuition and cuts the pink wire and saves Tokyo .\n• In a Stargate SG-1 episode, a meteor is heading towards Earth, but they find out that setting off a nuke to deflect it would only make things worse so they need to deactivate it. However the bomb gets damaged and refuses to shut down so Jack is told to open it and cut the Red wire, so this trope is almost subverted because he is given clear instructions to cut a wire, but here's the kicker - it turns out all the wires are yellow and he has to guess. You know, I'd like to take this opportunity to say that this is a very poorly designed bomb, and I think we should say something to somebody about it when we get back.\n• In the intro to the game Discworld II: Mortality Bytes, Rincewind and the Librarian discover a parody of a bomb that uses some sort of bubbling chemical (with an analog timer) attached. Rincewind debates between turning the red flask and turning the blue flask, reasoning that they can't kill him yet since the game hasn't started. He still picks the wrong one, and gets exploded. The explosion actually catches Death before he can grab Rincewind; Death then goes missing, which precipitates the main quest of the game.\n• Tales of Vesperia has this regarding . Karol wanted to look for another, more peaceful outcome, but Raven said that while he wishes there was and that there may indeed be one; they had no time to look for that solution and action had to be taken there and then or else the situation will get worse now.\n• The phrase \"Pulling a Homer\" (meaning to succeed despite stupidity) was introduced in The Simpsons after Homer stopped a nuclear reactor meltdown by randomly guessing which button activated the Manual Override. Twice. Using Eeny-Meeny-Miney-Moe, no less. It would work if he did the same Eeny-Meeny-Miney-Moe each time; then he would always get the right button.\n• Donkey Kong Country episode Orangotango has DK navigate three 'Rooms of Doom' in the Temple of Inka Dinka Doo. Said rooms have booby traps, mainly spike and arrows that fly out so quickly that DK has move so quickly he barely knows what he's doing. As Funky put it... \"Don't stop! Keep moving! Let your body do the brainwork!\"\n• Real life example: A doctor who didn't know whether to press the orange or blue buttons to restart a bypass machine sustaining a patient's life; news story here .", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/NoTimeToThink", "media_links": ["/pmwiki/pmwiki.php/Film/CanadianBacon", "/pmwiki/pmwiki.php/Anime/KujibikiUnbalance", "/pmwiki/pmwiki.php/Manga/PokemonAdventures", "/pmwiki/pmwiki.php/ComicBook/Catwoman", "/pmwiki/pmwiki.php/Film/Transformers", "/pmwiki/pmwiki.php/Film/ConanTheDestroyer", "/pmwiki/pmwiki.php/Film/TheAbyss", "/pmwiki/pmwiki.php/Film/AirForceOne", "/pmwiki/pmwiki.php/Film/Gravity", "/pmwiki/pmwiki.php/Literature/CiaphasCain", "/pmwiki/pmwiki.php/Series/Farscape", "/pmwiki/pmwiki.php/Series/DoctorWho", "/pmwiki/pmwiki.php/Series/LifeOnMars2006", "/pmwiki/pmwiki.php/Series/StargateSG1", "/pmwiki/pmwiki.php/VideoGame/Discworld", "/pmwiki/pmwiki.php/VideoGame/TalesOfVesperia", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/WesternAnimation/DonkeyKongCountry"], "non_media_links": ["/pmwiki/pmwiki.php/Main/TheSpock", "/pmwiki/pmwiki.php/Main/AnAesop", "/pmwiki/pmwiki.php/Main/DontThinkFeel", "/pmwiki/pmwiki.php/Main/WireDilemma", "/pmwiki/pmwiki.php/Main/SpotTheImposter", "/pmwiki/pmwiki.php/Main/Anime", "/pmwiki/pmwiki.php/Main/Manga", "/pmwiki/pmwiki.php/Main/ComicBooks", "/pmwiki/pmwiki.php/Main/FanWorks", "/pmwiki/pmwiki.php/Fanfic/TheKeysStandAlone", "/pmwiki/pmwiki.php/Main/TouchTelepathy", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/HeroicSacrifice", "/pmwiki/pmwiki.php/Main/FridgeLogic", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/JDrama", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/RealLife", "http://www.telegraph.co.uk/news/main.jhtml?xml=/news/2006/03/21/nhs121.xml"]}