{"title": "Space Cossacks", "content": "There is no hope and You Can't Go Home Again. The Empire is spreading out. Even The Federation has too many Obstructive Bureaucrats. There is no way for free men to get out of the reaches of The Government and even mounting La Résistance will be of no avail. So what do you do? You become Space Cossacks. You flee to the border and live in a tough area where you all have to be sharp. You set up as Space Pirates or as Hired Guns or as Intrepid Merchants. Or all of these at once. With you are various dissidents like people who feared being Made a Slave. There might be a Noble Fugitive or two, perhaps even a Defector from Decadence. You and your brave band of Fire-Forged Friends will struggle on to survive and maintain your freedom and heed no laws but your own and respect no authority but that of your Team Mom and/or Team Dad. Songs will be written of your deeds.\n\nThe Empire most likely officially considers these guys outlaws, either in the sense that they're to be shot on sight, or in the sense that they're \"outside the law\" and are to be left alone as long as they stay out of the way. Either way, they probably consider them useful, as they both screen the empire from external threats and tame the fringe worlds into a state ready to be colonised. They may also provide a handy place to send people who are to be Reassigned to Antarctica.\n\nGiven the parallels to the Wild West, a Space Western is almost sure to be set amongst such people.\n\nThe reference comes from the old Russian custom of disgruntled people fleeing to the steppes and joining a Cossack band.\n\nIf they persist for multiple generations they may become Space People.\n• Starship Operators: The crew of the Amaterasu were a bunch of space cadets on a training exercise when their homeworld was conquered. So they started a guerrilla war funded by filming their fights for a reality show.\n• The entire human species became Space Cossacks in Titan A.E. after the destruction of the Earth.\n• Dune: According to Fremen legends, they were once runaway slaves.\n• The Hyperion Cantos has the Ousters, who fit this trope quite nicely.\n• This was the background for H. Beam Piper's Space Vikings, in the book of the same title. \"At the end of the Big War, ten thousand men and women on Abigor, refusing to surrender, had taken the remnant of the System States Alliance navy to space, seeking a world the Federation had never heard of and wouldn't find for a long time.\" Eight centuries later, their descendants have begun raiding into the territory once held by the now-collapsed Terran Federation.\n• In C. J. Cherryh's Alliance/Union universe Conrad Mazian's fleet become pirates after the Earth-Union-Alliance war ends and the Earth Company abandons them. The Merchanter's Alliance may also count, comprising a number of nomadic merchant families and one station (plus one of Mazian's ships who defected) who got tired of the war between Earth and the Union and formed their own faction.\n• The Dendarii Mercenaries in Vorkosigan Saga play with this. They are a little like Cossacks, being irregulars in the service of Tsarist Russia Recycled In Space and they contain individuals escaping from social pressure on Barryar including Elena and her husband and in a different way Miles himself. However they mostly contain people from any and every world in the Nexus. Also they play the \"screening the Empire from external threats\" role.\n• The Nomads in Star Ways by Poul Anderson.\n• Asimov's Foundation has the Trader subculture, which roamed the galaxy trying to push Atom Punk gadgetry - first as a stalking horse for the Foundation's Path of Inspiration, and eventually as straight economic conquest by hegemony. Despite one of their own, Hober Mallow, taking complete control at the end of the first novel, Foundation and Empire has a major subplot of the small Traders in the field rebelling against the Merchant Princes who claimed to rule them. The only thing that prevented all-out civil war in the Foundation was the Mule.\n• Heinlein's Citizen of the Galaxy has the Free Traders, a clannish Proud Merchant Race who live and die in their trading starships and look down on planet dwellers of all species as vermin (with varying degrees of irony). A play written by a minor character about the founding of the ship Sisu explicitly has the first captain take his family into the void because of his disgust with the evil ways of \"fraki\".\n• Firefly: \"...take me out to the Black, tell them I ain't coming back. Burn the land and boil the sea, you can't take the sky from me\"\n• Star Trek:\n• The Maquis. Average Federation colonists who found themselves under the Cardassians after a treaty in which they had no say. They won numerous engagements against both the Cardassians and Starfleet, with large numbers of Starfleet officers even defecting to join the 'good fight.'\n• Tasha Yar was raised by human dissidents on Turkana IV, where various factions were constantly at war and gang rape was a common occurrence.\n• In both versions of Battlestar Galactica the remnants of the Twelve Colonies' fleet are fleeing to earth.\n• Kaizoku Sentai Gokaiger features a core group of aliens who came to Earth looking for the \"Greatest Treasure in the Universe\". They all have reasons to hate the Space Empire Zangyack, which has followed them to Earth and has an ever increasing bounty on them as the series goes on (it gets to the point that Captain Marvelous has an unlimited bounty placed on him... Zangyack will give whatever you want, provided you can bring him in).\n• Uchuu Sentai Kyoranger is shaping up to be this, with the core nine rangers all being selected to fight against the Jak Matter Shogunate.\n• In The Space Gypsy Adventures the Space Gypsies claim to have originated on a planet that was destroyed by a nova thousands of years ago. Due to more recent persecution by the Federal Alliance many of the few who remain free have resorted to smuggling and theft.\n• Traveller: Has a lot of examples of this. Among them are the Vilani Kimashargur, The Classic Traveller volume \"Pocket Empires\". And much of the history of the Sword Worlds as well a sample campaign from the Gurps volume of that name. Many others.\n• In the Battletech universe, there are the Clans, descendants of the old Star League's military who went into exile following the League's collapse. They are an interesting example as by the beginning of the main storyline they have become the dominant power in their own space and hold many systems of their own. Their warrior culture is enforced rather than necessary.\n• Raynor's forces in StarCraft are an example if this.\n• Endless Space: The Pilgrims are humans that choose to flee from the oppressive rule of the United Empire.\n• Wildstar: The Exiles are composed of four alien races who are allied against the Dominion for driving them off their homeworlds. The two factions wage war over the planet Nexus for control over it, for the Exiles its their last chance of getting a new home.\n• Mass Effect: Andromeda has the premise of you fleeing the galaxy just a year before the arrival of the Reapers without knowledge you are except at the leadership level. You then find most of the worlds you were going to settle are hellholes and you have to make a deal with the local species, the Angara, to fight an invading one in the Kett.\n• Stellaris has multiple randomly-generated versions:\n• Privateers are a conglomeration of species from past empires who subsist by piracy\n• Nomads are the peaceful version who put you in contact with other empires and might sell your empire ships or ask to settle on one of your planets.\n• Marauders, added in the Apocalypse DLC, are more like Space Mongols. They occasionally raid systems or extort tribute but can also be hired as mercenaries\n• This particularly backhanded Humanity, Fuck Yeah piece. \"Ryeed Hassanni\": We're the fucking tile grout of your shitty galactic civilization, and when the rest of it breaks into fragments, which it always does, we'll be there, everywhere, between everyone, holding everything together, armed to the teeth and with no loyalties. : We're the fucking tile grout of your shitty galactic civilization, and when the rest of it breaks into fragments, which it always does, we'll be there, everywhere, between everyone, holding everything together, armed to the teeth and with no loyalties.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/SpaceCossacks", "media_links": ["/pmwiki/pmwiki.php/Series/Firefly", "/pmwiki/pmwiki.php/Anime/StarshipOperators", "/pmwiki/pmwiki.php/Franchise/StarWars", "/pmwiki/pmwiki.php/WesternAnimation/TitanAE", "/pmwiki/pmwiki.php/Literature/Dune", "/pmwiki/pmwiki.php/Literature/HyperionCantos", "/pmwiki/pmwiki.php/Creator/HBeamPiper", "/pmwiki/pmwiki.php/Creator/CJCherryh", "/pmwiki/pmwiki.php/Literature/AllianceUnion", "/pmwiki/pmwiki.php/Literature/VorkosiganSaga", "/pmwiki/pmwiki.php/Creator/PoulAnderson", "/pmwiki/pmwiki.php/Literature/Foundation", "/pmwiki/pmwiki.php/Creator/RobertAHeinlein", "/pmwiki/pmwiki.php/Literature/CitizenOfTheGalaxy", "/pmwiki/pmwiki.php/Series/Firefly", "/pmwiki/pmwiki.php/Franchise/StarTrek", "/pmwiki/pmwiki.php/Series/StarTrekTheNextGeneration", "/pmwiki/pmwiki.php/Series/BattlestarGalactica1978", "/pmwiki/pmwiki.php/Series/BattlestarGalactica2003", "/pmwiki/pmwiki.php/Franchise/BattlestarGalactica", "/pmwiki/pmwiki.php/Series/KaizokuSentaiGokaiger", "/pmwiki/pmwiki.php/Series/UchuuSentaiKyoranger", "/pmwiki/pmwiki.php/Radio/TheSpaceGypsyAdventures", "/pmwiki/pmwiki.php/TabletopGame/Traveller", "/pmwiki/pmwiki.php/TabletopGame/Battletech", "/pmwiki/pmwiki.php/VideoGame/StarCraft", "/pmwiki/pmwiki.php/VideoGame/EndlessSpace", "/pmwiki/pmwiki.php/VideoGame/Wildstar", "/pmwiki/pmwiki.php/VideoGame/MassEffectAndromeda", "/pmwiki/pmwiki.php/VideoGame/Stellaris", "/pmwiki/pmwiki.php/Franchise/MassEffect"], "non_media_links": ["/pmwiki/pmwiki.php/Main/YouCantGoHomeAgain", "/pmwiki/pmwiki.php/Main/TheEmpire", "/pmwiki/pmwiki.php/Main/TheFederation", "/pmwiki/pmwiki.php/Main/ObstructiveBureaucrat", "/pmwiki/pmwiki.php/Main/TheGovernment", "/pmwiki/pmwiki.php/Main/LaResistance", "/pmwiki/pmwiki.php/Main/HadToBeSharp", "/pmwiki/pmwiki.php/Main/SpacePirates", "/pmwiki/pmwiki.php/Main/HiredGuns", "/pmwiki/pmwiki.php/Main/IntrepidMerchant", "/pmwiki/pmwiki.php/Main/MadeASlave", "/pmwiki/pmwiki.php/Main/NobleFugitive", "/pmwiki/pmwiki.php/Main/DefectorFromDecadence", "/pmwiki/pmwiki.php/Main/FireForgedFriends", "/pmwiki/pmwiki.php/Main/TeamMom", "/pmwiki/pmwiki.php/Main/TeamDad", "/pmwiki/pmwiki.php/Main/TheEmpire", "/pmwiki/pmwiki.php/Main/Terraforming", "/pmwiki/pmwiki.php/Main/ReassignedToAntarctica", "/pmwiki/pmwiki.php/Main/NewOldWest", "/pmwiki/pmwiki.php/Main/WildWest", "/pmwiki/pmwiki.php/Main/SpaceWestern", "/pmwiki/pmwiki.php/Main/SpacePeople", "/pmwiki/pmwiki.php/UsefulNotes/TsaristRussia", "/pmwiki/pmwiki.php/Main/RecycledInSpace", "/pmwiki/pmwiki.php/Main/AtomPunk", "/pmwiki/pmwiki.php/Main/PathOfInspiration", "/pmwiki/pmwiki.php/Main/OutsideContextProblem", "/pmwiki/pmwiki.php/Main/ProudMerchantRace", "/pmwiki/pmwiki.php/Main/CallARabbitASmeerp", "/pmwiki/pmwiki.php/Main/ProudWarriorRaceGuy", "/pmwiki/pmwiki.php/Main/TheEmpire", "/pmwiki/pmwiki.php/Main/TheEmpire", "https://www.funnyjunk.com/Humanity+fuck+yeah+comp+1/funny-pictures/5569844/", "/pmwiki/pmwiki.php/Main/StealthInsult", "/pmwiki/pmwiki.php/Main/HumansAreSuperior", "/pmwiki/pmwiki.php/Main/WritingAroundTrademarks"]}