{"title": "Literary Work of Magic", "content": "A true artistic work is \"revealed\" to have been created with some other purpose in mind. Perhaps some god or devil had a hand in it. Perhaps it was a summoning ritual, a la The King in Yellow. Perhaps it was part of a ritual to attain godhood, which is why everyone's so enraptured by it. Either way, someone, or something, other than the author had a hand in it, and we're just finding out for the first time.\n\nLike Beethoven Was an Alien Spy, but applying to the artistry rather than the artist.\n• Discworld: The Science of Discworld II: The Globe has the wizards of Unseen University visiting the \"Roundworld\" to fight off the elves as they disrupt A Midsummer Night's Dream.\n• SOD III: Darwin's Watch uses this trope as well with the wizards trying to make sure that Darwin completes The Origin of Species\n• Doctor Who, \"The Shakespeare Code\": Shakespeare's lost play, Love's Labours Won, was influenced by a trio of aliens to serve as a summoning ritual for their species.\n• In The League of Extraordinary Gentlemen: The Black Dossier, one of Shakespeare's fictional plays (Faerie's Fortunes Founded) is basically the minutes for the meeting in which the first League was founded.\n• New World of Darkness sourcebook Reliquary has Shakespeare's lost play, The Witches, serve as a summoning ritual that opens a portal to... well, it's not a very nice place. The backstory says Shakespeare got the entire audience together after the first performance to promise that it would never be used again.\n• The Sandman has Shakespeare putting on his debut performance of A Midsummer Night's Dream for Oberon, Titania, Robin Goodfellow, and Morpheus. Robin Goodfellow escapes into the world to pester others, and it's implied that Titania is responsible for the death of Shakespeare's son Hamnet. It's explicitly stated that Morpheus commissioned both A Midsummer Night's Dream and The Tempest, in exchange for making Shakespeare a skilled writer.\n\nThis seems to happen to William Shakespeare\n• It's revealed in Buffy the Vampire Slayer that the real Dracula helped write the original book. He just wanted to get famous, but Spike gripes that thanks to him, everyone knows the weaknesses of vampires.\n• In The Dresden Files, Dracula was commissioned by the competing White Court of Vampires for the explicit purpose of teaching humans how to kill Black Court vampires. Because of this, the few surviving Black Court vampires are exceptionally clever and dangerous. Additionally, the White Council of Wizards frequently publishes the nastier sorts of ritual so that the entity fueling them gets a crash-course in supply and demand (picture a vending machine being beaten to death with a sack of quarters). This almost backfires in the novella \"Backup\" when a different sort of baddy nearly tricks them into doing it with her little book \u0097 one filled with the names of ancient, terrible, forgotten beings.\n• In-universe, the Interview with the Vampire serves a similar function. When Lestat awakens in the sequel, he discovers his name and many details of his life with Louis are now famous and part of popular culture. The Vampire Lestat is framed and written as his response: cashing in on the popularity to promote his new rock and roll career, correcting misconceptions about his person, detailing his origins, and officially breaking The Masquerade while calling on other vampires to do so as well.\n• The Sookie Stackhouse Mysteries: A short story revealed that Bram Stoker was one of the vampires who wanted to come out early. His sire wanted to be the main character.\n• In Vampire: The Masquerade, Dracula influenced Stoker's writing as a \"parting gesture\" to Kindred society. In Vampire: The Requiem, meanwhile, the Ordo Dracul, a vampire society Dracula founded, are suspicious of the book's origins - it seems too much of a Contrived Coincidence - but ultimately don't know what's up with it.\n\nSimilar to Shakespeare, Dracula is mentioned in almost every Urban Fantasy with vampires, and Bram Stoker usually having an ulterior motive of some kind in writing the book.\n• In Dirk Gently's Holistic Detective Agency by Douglas Adams, Samuel Taylor Coleridge was possessed by an alien ghost, who left messages in his poetry.\n• The title character was revealed to be the infamous \"Person from Porlock\" who disrupted \"Kubla Khan\", because if completed the poem would've caused the end of the world.\n• Also, the entire works of Johann Sebastian Bach are actually the music of the motions of every particle of matter as read by an alien supercomputer and injected into history by a time traveller because he felt bad about blowing it up.\n• Doctor Who: Another example is \"The Unquiet Dead\". At the end, Charles Dickens is inspired to write the episode's monsters into The Mystery of Edwin Drood so the world will know the truth. Of course, he suffers Author Existence Failure before finishing it.\n• Gabriel Knight: The Beast Within has a few scenes revolving around a Richard Wagner opera that was capable of outing werewolves.\n• In Jekyll, it is revealed that The Strange Case of Dr. Jekyll and Mr. Hyde was a trap to kill anyone seeking Jekyll's abilities, as the potion described is poison. The real source of the abilities was Jekyll's maid\n• Promethean: The Created hints in one sourcebook that the poem \"Kubla Khan\" was inspired by a qashmallim for purposes unknown. The visitor that interrupted Coleridge and ruined his vision was a Promethean who feared dire results if the poem was finished.\n• The Read or Die OVA features a literal Beethoven Was an Alien Spy which also applies here: one of Beethoven's symphonies drives anyone who listens to it to suicide ; earlier researchers who examined the music killed themselves, but the I-Jin were drama queens, hence why their method consisted of a clone of him flying around on a massive rocket-powered steam organ .\n• In The Sandman, besides the Shakespeare example, Morpheus had his hand in the Arabian Nights. Specifically, the city of Baghdad originally was full of magic and wonders, but Haroun al-Rashid was afraid it wouldn't survive that way, so he made a deal with Morpheus; Baghdad became a mundane city, and Morpheus would preserve a dream version which became the stories in the Arabian Nights.\n• In Songs of Earth and Power by Greg Bear, any sufficiently great work of art is magical.\n• In the Tim Powers novel Three Days to Never, it turns out Charlie Chaplin worked symbolic imagery into City Lights as part of a magical ritual to attempt to bring his son back from the dead. An earlier movie he'd worked on but never shown to the public is part of the MacGuffin; Albert Einstein (yes, Einstein, this is Tim Powers we're talking about) had to talk Chaplin out of showing the movie, as the mojo generated by the imagery would likely fry some audience brains.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/LiteraryWorkOfMagic", "media_links": ["/pmwiki/pmwiki.php/Literature/TheKingInYellow", "/pmwiki/pmwiki.php/Literature/Discworld", "/pmwiki/pmwiki.php/Theatre/AMidsummerNightsDream", "/pmwiki/pmwiki.php/Series/DoctorWho", "/pmwiki/pmwiki.php/TabletopGame/NewWorldOfDarkness", "/pmwiki/pmwiki.php/Theatre/AMidsummerNightsDream", "/pmwiki/pmwiki.php/Theatre/TheTempest", "/pmwiki/pmwiki.php/Creator/WilliamShakespeare", "/pmwiki/pmwiki.php/Series/BuffyTheVampireSlayer", "/pmwiki/pmwiki.php/Literature/TheDresdenFiles", "/pmwiki/pmwiki.php/Literature/InterviewWithTheVampire", "/pmwiki/pmwiki.php/Literature/TheVampireLestat", "/pmwiki/pmwiki.php/Literature/TheSookieStackhouseMysteries", "/pmwiki/pmwiki.php/TabletopGame/VampireTheMasquerade", "/pmwiki/pmwiki.php/TabletopGame/VampireTheRequiem", "/pmwiki/pmwiki.php/Literature/Dracula", "/pmwiki/pmwiki.php/Creator/BramStoker", "/pmwiki/pmwiki.php/Literature/DirkGentlysHolisticDetectiveAgency", "/pmwiki/pmwiki.php/Creator/DouglasAdams", "/pmwiki/pmwiki.php/Creator/SamuelTaylorColeridge", "/pmwiki/pmwiki.php/Music/JohannSebastianBach", "/pmwiki/pmwiki.php/Series/DoctorWho", "/pmwiki/pmwiki.php/Creator/CharlesDickens", "/pmwiki/pmwiki.php/Literature/TheMysteryOfEdwinDrood", "/pmwiki/pmwiki.php/VideoGame/GabrielKnight", "/pmwiki/pmwiki.php/Music/RichardWagner", "/pmwiki/pmwiki.php/Series/Jekyll", "/pmwiki/pmwiki.php/Literature/TheStrangeCaseOfDrJekyllAndMrHyde", "/pmwiki/pmwiki.php/TabletopGame/PrometheanTheCreated", "/pmwiki/pmwiki.php/Anime/ReadOrDie", "/pmwiki/pmwiki.php/ComicBook/TheSandman", "/pmwiki/pmwiki.php/Literature/ArabianNights", "/pmwiki/pmwiki.php/Creator/GregBear", "/pmwiki/pmwiki.php/Creator/TimPowers", "/pmwiki/pmwiki.php/Literature/ThreeDaysToNever", "/pmwiki/pmwiki.php/Film/CityLights"], "non_media_links": ["/pmwiki/pmwiki.php/Main/BeethovenWasAnAlienSpy", "/pmwiki/pmwiki.php/Discworld/TheScienceOfDiscworld", "/pmwiki/pmwiki.php/Recap/DoctorWhoS29E2TheShakespeareCode", "/pmwiki/pmwiki.php/Comicbook/TheLeagueOfExtraordinaryGentlemen", "/pmwiki/pmwiki.php/Comicbook/TheSandman", "/pmwiki/pmwiki.php/Main/OurVampiresAreDifferent", "/pmwiki/pmwiki.php/Main/GodsNeedPrayerBadly", "/pmwiki/pmwiki.php/Main/TheMasquerade", "/pmwiki/pmwiki.php/Main/Dracula", "/pmwiki/pmwiki.php/Main/ContrivedCoincidence", "/pmwiki/pmwiki.php/Main/UrbanFantasy", "/pmwiki/pmwiki.php/Recap/DoctorWhoS27E3TheUnquietDead", "/pmwiki/pmwiki.php/Main/AuthorExistenceFailure", "/pmwiki/pmwiki.php/Main/ThePowerOfLove", "/pmwiki/pmwiki.php/Main/OurAngelsAreDifferent", "/pmwiki/pmwiki.php/Main/OVA", "/pmwiki/pmwiki.php/Main/BeethovenWasAnAlienSpy", "/pmwiki/pmwiki.php/Main/BrownNote", "/pmwiki/pmwiki.php/Main/MacGuffin"]}