{"title": "Dumped Via Text Message", "content": "Breakups are never easy. The pain of being rejected by someone you've formed a bond with can be excruciating and very, very hard to get over. Luckily, not every breakup is quite as bad as others- if it's done properly and respectfully, the pain of heartbreak can be somewhat alleviated, and the ex-couple may even be able to reconnect as Amicable Exes. Then there are these breakups.\n\nNo warning will be given. No concern will be had for the feelings of the person being dumped. There may not even be any explanation. Worst of all, it will be done over text message, making the act as distant and easy as possible for the dumper but as unfair and disrespectful as possible for the person being dumped. It's inherently one-sided, with the dumper only caring about themselves.\n\nThe key is that the breakup is done in the most convenient way possible for the dumper, requiring no effort or time on their part, requiring only that they pick up a phone or, perhaps, spend five minutes writing an email. What matters more than the mode of delivery is that it's kept quick, simple and informal. Any form of breakup that can occur instantly through the use of technology is acceptable, so long as the couple could not physically talk in person and the mode of delivery only benefits the dumper. For this reason, this trope can be both compared and contrasted to a \"Dear John\" Letter, which is kept formal and icy and often occurs to end a long-distance relationship. However, a breakup letter can work if kept short, blunt, and unprovoked.\n\nThis is almost always a sign that the dumper is a bad, selfish, and uncaring person, who is willing to break someone's heart without even a token attempt at considering their feelings. As such, this form of breakup is the territory of the resident Jerkass. The emphasis can be on the dumper to show how callous they are, or it can be on the victim, to emphasize their reaction.\n\nNot related to Offscreen Breakup, which is a breakup that the audience never gets to see.\n\nNo Real Life Examples, Please! Though this is Truth in Television, this is not the place to talk about how ethical some breakup methods are in reality.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/DumpedViaTextMessage", "media_links": ["/pmwiki/pmwiki.php/WesternAnimation/AvatarTheLastAirbender", "/pmwiki/pmwiki.php/Film/SierraBurgessIsALoser", "/pmwiki/pmwiki.php/Film/UpInTheAir", "/pmwiki/pmwiki.php/Literature/TheThreeMusketeers", "/pmwiki/pmwiki.php/Series/BigTimeRush", "/pmwiki/pmwiki.php/Series/BrooklynNineNine", "/pmwiki/pmwiki.php/Series/HowIMetYourMother", "/pmwiki/pmwiki.php/VideoGame/SilentHillShatteredMemories", "/pmwiki/pmwiki.php/WesternAnimation/DCSuperheroGirls", "/pmwiki/pmwiki.php/WesternAnimation/TotalDrama", "/pmwiki/pmwiki.php/WesternAnimation/TotalDramaAction", "/pmwiki/pmwiki.php/WesternAnimation/BatmanTheBraveAndTheBold", "/pmwiki/pmwiki.php/WesternAnimation/Sixteen"], "non_media_links": ["http://www.nothingcanpossiblygowrong.com/comic/page-001/", "/pmwiki/pmwiki.php/Main/AmicableExes", "/pmwiki/pmwiki.php/Main/DearJohnLetter", "/pmwiki/pmwiki.php/Main/Jerkass", "/pmwiki/pmwiki.php/Main/OffscreenBreakup", "/pmwiki/pmwiki.php/Administrivia/NoRealLifeExamplesPlease", "/pmwiki/pmwiki.php/Main/TruthInTelevision", "/pmwiki/pmwiki.php/Main/BedTrick", "/pmwiki/pmwiki.php/Main/SexForServices", "/pmwiki/pmwiki.php/Recap/BrooklynNineNineS3E06IntoTheWoods", "/pmwiki/pmwiki.php/Main/FromBadToWorse", "/pmwiki/pmwiki.php/Main/WhatTheHellHero", "/pmwiki/pmwiki.php/WebComic/TheAdventuresOfSuperheroGirl", "https://www.youtube.com/watch?v=W__qIJ24Kcw", "/pmwiki/pmwiki.php/Videogame/SuperSmashBrosUltimate", "/pmwiki/pmwiki.php/Main/FelonyMisdemeanor", "https://www.youtube.com/watch?v=nb0s1AePP2g", "/pmwiki/pmwiki.php/Main/SmearCampaign", "/pmwiki/pmwiki.php/Recap/TotalDramaCelebrityManhuntsTDAReunionShow", "/pmwiki/pmwiki.php/Main/BoyBand", "https://www.youtube.com/watch?v=Bz-kLDZ8ll0", "/pmwiki/pmwiki.php/Main/WhatTheHellHero"]}