{"title": "Superfluous Solo", "content": "This is based on opinion. Please don't list it on a work's trope example list.\n\nWhere a character in a musical or opera who otherwise doesn't get a spot by himself has a solo number that adds nothing to the show other than giving him a moment in the spotlight. Liable to be cut in theatrical productions where the performer doesn't demand its retention.\n\nCharacters who get other solos don't count as examples.\n• \"Bianca\" was written into Kiss Me Kate at a late stage largely because Harold Lang needed to show off his tap dancing; in the score, Bill otherwise has one line to sing in the tag of \"Why Can't You Behave?\" and is part of the \"Tom, Dick Or Harry\" trio.\n• Parodied in The Abduction of Figaro, where Schleporello, who is supposed to play Silent Partner to Donald Giovanni, executes a Hostile Show Takeover so his whiny voice can get an aria to sing.\n• The 1994 Broadway revival of Show Boat reassigned \"Why Do I Love You?\" to Parthy, who had to sing if played by Elaine Stritch. Parthy sings it to Magnolia's newborn daughter; that the song was originally a boy/girl duet is poorly camouflaged.\n• The Drowsy Chaperone pokes fun at this with \"As We Stumble Along\" (the iconic song of the show), shoehorned into the Show Within a Show to appease the Patti LuPone-esque diva.\n• When Frank Sinatra played Nathan Detroit in the movie version of Guys and Dolls, it was not enough for him to be half of the \"Sue Me\" duet and add his voice to the title number (which might have happened in the original production if Sam Levene hadn't been a non-singer). Therefore, the rather bland Movie Bonus Song \"Adelaide\" was written for him.\n• The song \"The Morning Report\" in The Lion King 2003 Special Edition; it's blatantly there just to give Zazu more singing time, and is little more than a Hurricane of Puns. To add insult to injury, Zazu doesn't even get to finish the song - Simba butts in and finishes it, for him, completely invalidating the reason for giving him the song to sing, in the first place.\n• In the Dr. Horrible's Sing-Along Blog musical commentary, Commentary! The Musical, a chorus member buys herself a solo, too bad\n• \"Another Suitcase in Another Hall\" from the stage production of Evita, sung by Juan Peron's lover prior to Evita, who has no real role in the play other than to be unceremoniously kicked out by Evita. (In the movie, the song is sung by Evita herself.)\n• In the fourth act of Mozart's opera The Marriage of Figaro, Marcellina and Basilio each have an aria. These arias are often omitted.\n• Gilbert and Sullivan have a couple of these. \"Come, Mighty Must\" from Princess Ida, often considered to be the worst song in the show (all the worse as it falls in the midst of some of the best music they ever wrote) is probably the biggest example.\n• Most of the others are good enough that the musical director needs no prompting to leave them in, \"When All Night Long\" in Iolanthe is far too much fun to leave out even if the character who sings it spends most of his stage time as scenery.\n• Arguably an inversion, the character only really exists to sing that song (and provide a husband for the Fairy Queen).\n• The Jester's number \"Very Soft Shoes\" in Once Upon a Mattress usually allows for a cool dance break, but nothing more.\n• \"Close Every Door To Me\" in Joseph and the Amazing Technicolor Dreamcoat. Joseph's the star, so they have to give him a big solo number, but it noticeably slows down the pace of the show.\n• In The Rocky Horror Show, Brad's song \"Once In A While\" originally existed solely because Brad was the only major character without his own song. Not all productions included it, as it was often considered the weakest in the show; it was also cut from the film.\n• Lampshaded in Spamalot with \"Whatever Happened To My Part\", a song the Lady of the Lake sings about not having a song in Act Two, and nothing to do at all since midway through Act One.\n• Really the only explanation for \"Shipoopi\" in The Music Man, The song appears to just be an excuse for Marcellus to sing and dance (in-story, it serves as a distraction, but the song itself is still bizarre).\n• Although the song is nonsensical, the dance break does move the plot forward a bit, as Marian's dancing with Professor Hill causes the ladies to accept her. Not that this is really a big plot point either.\n• \"Too Many Tomorrows\" in Sweet Charity is very likely one of these. The minor character Vittorio inexplicably has this long, slow, boring solo right after Charity's dazzling showstopper \u0093If My Friends Could See Me Now.\u0094 It has nothing to do with the plot, and he sings it to a thoroughly unimportant character. Notably, this song was removed from the movie.\n• \u0093Sandy\u0094 in Grease is John Travolta\u0092s only solo, as he shares his other songs with Olivia Newton-John (\u0093Summer Nights,\u0094 \u0093You\u0092re the One that I Want\u0094) and Jeff Conway (\u0093Grease Lightning\u0094). Yet, the song was written to capitalize on the The '70s trend of songs named after young women (such as \u0093Mandy\u0094).\n• \u0093Beauty School Dropout\u0094 may also count, as the song adds nothing to the plot, and seems to exist purely for the sake of \"Look! It's Frankie Avalon!\"\n• Mame adds a Movie Bonus Song to its 1974 film adaptation, \"Loving You\", solely to give third-billed Robert Preston's Beauregarde a solo and a little more screen time; his character only appears in the middle stretch of the story and dies offscreen shortly after this song.\n• \"If Your Father Were Here\" is this for Mrs. Bucket in the Broadway Retool of Charlie and the Chocolate Factory — while the West End original's \"If Your Mother Were Here\" also didn't have much bearing on the plot beyond refocusing attention on Charlie after four consecutive songs about the Bratty Kids, it was a duet for Mr. and Mrs. Bucket (who otherwise get minor parts in two group numbers). In the Broadway version, Mr. Bucket suffered Death by Adaptation in the Backstory and Mrs. Bucket disappears after Act One.\n• A common question raised by Broadway.com message board members who saw this show was why, when the retool incorporated many of the 1971 film adaptation's songs, \"Cheer Up Charlie\" — also fitting this trope — wasn't given to Mrs. Bucket instead.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/SuperfluousSolo", "media_links": ["/pmwiki/pmwiki.php/Theatre/KissMeKate", "/pmwiki/pmwiki.php/Theatre/ShowBoat", "/pmwiki/pmwiki.php/Theatre/TheDrowsyChaperone", "/pmwiki/pmwiki.php/Music/FrankSinatra", "/pmwiki/pmwiki.php/Theatre/GuysAndDolls", "/pmwiki/pmwiki.php/Disney/TheLionKing", "/pmwiki/pmwiki.php/Theatre/Evita", "/pmwiki/pmwiki.php/Theatre/TheMarriageOfFigaro", "/pmwiki/pmwiki.php/Creator/GilbertAndSullivan", "/pmwiki/pmwiki.php/Theatre/PrincessIda", "/pmwiki/pmwiki.php/Theatre/Iolanthe", "/pmwiki/pmwiki.php/Theatre/OnceUponAMattress", "/pmwiki/pmwiki.php/Theatre/JosephAndTheAmazingTechnicolorDreamcoat", "/pmwiki/pmwiki.php/Film/TheRockyHorrorPictureShow", "/pmwiki/pmwiki.php/Theatre/TheMusicMan", "/pmwiki/pmwiki.php/Theatre/SweetCharity", "/pmwiki/pmwiki.php/Film/Grease", "/pmwiki/pmwiki.php/Creator/JohnTravolta", "/pmwiki/pmwiki.php/Music/BarryManilow", "/pmwiki/pmwiki.php/Literature/AuntieMame", "/pmwiki/pmwiki.php/Theatre/CharlieAndTheChocolateFactory", "/pmwiki/pmwiki.php/Film/WillyWonkaAndTheChocolateFactory"], "non_media_links": ["/pmwiki/pmwiki.php/Main/SilentPartner", "/pmwiki/pmwiki.php/Main/HostileShowTakeover", "/pmwiki/pmwiki.php/Main/ShowWithinAShow", "/pmwiki/pmwiki.php/Main/MovieBonusSong", "/pmwiki/pmwiki.php/Main/HurricaneOfPuns", "/pmwiki/pmwiki.php/WebVideo/DoctorHorriblesSingAlongBlog", "/pmwiki/pmwiki.php/WebVideo/CommentaryTheMusical", "/pmwiki/pmwiki.php/Main/PairTheSpares", "/pmwiki/pmwiki.php/Main/Pun", "/pmwiki/pmwiki.php/Main/LetsDuet", "/pmwiki/pmwiki.php/Main/DistantDuet", "/pmwiki/pmwiki.php/Main/FollowTheLeader", "/pmwiki/pmwiki.php/Main/TheSeventies", "/pmwiki/pmwiki.php/Main/MovieBonusSong", "/pmwiki/pmwiki.php/Main/Retool", "/pmwiki/pmwiki.php/Main/DeathByAdaptation", "/pmwiki/pmwiki.php/Main/Backstory"]}