{"title": "Medley", "content": "In music, a medley is a piece composed from parts of existing pieces, played one after another, sometimes overlapping. They are common in popular music, and most medleys are songs rather than instrumental. A medley which is a remixed series is called a megamix, often done with tracks for a single artist, or for popular songs from a given year or genre.\n• \"Just a Gigolo\"/\"I Got Nobody\" by Louis Prima in 1956. Other artists that made cover versions are the Village People and David Lee Roth.\n• \"Stars on 45 Medley\" (1981) single by Stars On 45.\n• Dschinghis Khan have release a few medleys based on their hit songs.\n• \"Weird Al\" Yankovic has released numerous medleys, each covering about a dozen songs in a very polka-influenced style.\n• Nico Nico Douga Medleys are quite popular and have quite a few variations.\n• Metallica performed a 15-minute medley of songs from their first two albums (sensibly titled Kill/Ride Medley) on the Cunning Stunts live CD.\n• They also do a medley of early Mercyful Fate material on Garage Inc.\n• GWAR has done a medley of their entire first album at a few shows (probably an answer to fans that complain they never play anything from it anymore).\n• Dream Theater did a live medley of arena rock anthems on the Change of Seasons EP.\n• And it's got nothing on their Instrumedley. Google it.\n• The Beatles did an entire medley of Abbey Road at the end of the album.\n• Their album Love is essentially one long medley with few pauses between the songs.\n• \"Vector to the Heavens\" from Kingdom Hearts: 358/2 Days is a medley of \"Musique pour la tristesse de Xion\", \"Kairi\", and \"Dearly Beloved\".\n• One-Hit Wonder Cat Mother And the All Night Newsboys' hit \"Good Old Rock n Roll\" is a medley of 50's hits. The song's producer? None other than Jimi Hendrix.\n• is a medley by The 5th Dimension.\n• Listen to a classic rock station long enough, and you will likely hear \"Devil In A Blue Dress/Good Golly Miss Molly\" by Mitch Ryder and the Detroit Wheels. Depending on the station, you might even hear the version that includes \"CC Rider\".\n• In Homestuck a few important songs are medleys of other songs:\n• Descend , the song that plays at the end of Act 4, is a medley of many, many other songs. How many? Here's the list . (The last song on the list - marked with a ??? - is from a currently unreleased song known as Penumbra Phantasm. However, that music would also be used in Umbral Ultimatium, which starts with the ending of Descend.)\n• Cascade , the song that plays at the end of Act 5, is composed of four separate songs: Cascade (Beta) (originally another composer's take on Descend ), Flare , Savior of the Dreaming Dead , and Black Hole / Green Sun (a remix of Black Rose / Green Sun ).\n• Rex Duodecim Angelus , a song from the official albums, contains the Leitmotifs of most of the trolls.\n• The Australian Voices do a medley taken Up to Eleven: a classical style piece that's actually made up of fragments of 35 different pop songs. It's called Tra$h Ma$h and it's awesome.\n• \"The Blow in a Row\" by Rage from the album 10 Years in Rage, which is a medley of songs from their past seven albums.\n• As Genesis slowly moved away from their progressive rock roots and into their hitmaking period, they would perform medleys of their earlier epics. In perticular was the medley on Three Sides Live, which would begin with \"In The Cage\", incorporate the synth solo from \"The Colony Of Slippermen\", move into the instrumental section of \"The Cinema Show\", then end with \"...In That Quiet Earth\" and \"Afterglow\" Often sections from \"Firth Of Fifth\" and Supper's Ready would be included, too.\n• A so-called \"Blues Brothers\" medley, incorporating \"Turn It On Again\" with medleys of soul and pop classics from The '60s with the band wearing Cool Shades and fedoras, ended their shows in the mid-to-late '80's.\n• The boss theme for Lord Passion in MOTHER 3 is a medley of the first movement of Beethoven's Symphony No. 5, Bach's Toccata in D Minor, the \"Hallelujah\" chorus from Handel's Messiah oratorio, and the first movement of the \"Spring\" violin concerto by Vivaldi.\n• The music for the final stage of the arcade Battletoads rearranges the first stage's theme (which is also the boss theme) with bits of the second, third, and fourth stages' themes weaved in.\n• Amy Grant has one called \"Ageless Medley\" which covers many of her own songs.\n• Straight No Chaser has a medley in every single one of their Christmas albums.\n• The Super Smash Bros. series loves its medleys. While the first two games have no medleys, the series later grew to have many.\n• The orchestrated remix album from Melee includes three medleys. One of them is composed of Pokémon music, and another is nearly fifteen minutes long.\n• Brawl included a few medleys in the game itself, including:\n• The Legend of Zelda: Ocarina of Time\n• 3DS/Wii U went all out with these (along with a new 8-bit medley of NES tunes and the medleys from Brawl, we have medleys from:\n• Two medleys of various Bandai Namco Entertainment games\n• Super Smash Flash 2 has a medley from The Legend of Zelda: Majora's Mask for its Clock Town stage.\n• Version 0.9 of Super Smash Bros. Crusade has a medley of music from the Bomberman series. Version 0.8.4 also had a medley from the Wario Land series. It's likely that it, along with its stage, will be readded in a later version.\n• Mario & Sonic at the Sochi 2014 Olympic Winter Games includes two medleys (from Super Mario Land and Super Mario 3D Land). The previous game also has a medley of all three acts of Splash Hill Zone from Sonic the Hedgehog 4.\n• The second track from Brentalfloss's Flossophy album is a medley of music from EarthBound.\n• The Cake at Stake jingle used in the final episode of Battle for Dream Island is a medley of the show's previous Cake at Stake jingles, with the eliminated contestants giving out the \"Cake at Stake\" of the jingle.\n• Pokémon Mystery Dungeon: Explorers of Time/Darkness gives us the Blizzard Island Rescue Team Medley. It's comprised of Mt. Freeze Peak, Sky Tower, Mt. Thunder, and Thunderwave Cave's themes from the previous game.\n• Stinkoman 20x6's eighth level stage music is made up of segments of all the previous level's music, played at a higher pitch. This is fitting since Level 8 (or Level -0) is a Minus World made of glitchy, discordant pieces of the previous seven levels, with some wonky physics thrown in to boot.\n• Final Fantasy Record Keeper had a special festive-themed medley of Final Fantasy VII music as the main menu music during the 2015 Christmas season.\n• The \"In The Dead of Night\" suite by U.K. is a medley of \"In The Dead of Night\", \"By The Light of Day\" and \"Presto Vivace and Reprise\".", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/Medley", "media_links": ["/pmwiki/pmwiki.php/Music/VillagePeople", "/pmwiki/pmwiki.php/Music/DavidLeeRoth", "/pmwiki/pmwiki.php/Music/DschinghisKhan", "/pmwiki/pmwiki.php/Music/WeirdAlYankovic", "/pmwiki/pmwiki.php/Website/NicoNicoDouga", "/pmwiki/pmwiki.php/Music/Metallica", "/pmwiki/pmwiki.php/Music/GWAR", "/pmwiki/pmwiki.php/Music/TheBeatles", "/pmwiki/pmwiki.php/VideoGame/KingdomHearts358DaysOver2", "/pmwiki/pmwiki.php/Music/JimiHendrix", "/pmwiki/pmwiki.php/Webcomic/Homestuck", "/pmwiki/pmwiki.php/Music/Rage", "/pmwiki/pmwiki.php/Music/Genesis", "/pmwiki/pmwiki.php/Music/SuppersReady", "/pmwiki/pmwiki.php/Film/TheBluesBrothers", "/pmwiki/pmwiki.php/VideoGame/MOTHER3", "/pmwiki/pmwiki.php/VideoGame/Battletoads", "/pmwiki/pmwiki.php/Music/AmyGrant", "/pmwiki/pmwiki.php/VideoGame/SuperSmashBros", "/pmwiki/pmwiki.php/Franchise/Pokemon", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaOcarinaOfTime", "/pmwiki/pmwiki.php/VideoGame/WarioWare", "/pmwiki/pmwiki.php/Franchise/Kirby", "/pmwiki/pmwiki.php/VideoGame/KidIcarus", "/pmwiki/pmwiki.php/VideoGame/SuperMarioBros1", "/pmwiki/pmwiki.php/VideoGame/SuperMarioBrosTheLostLevels", "/pmwiki/pmwiki.php/VideoGame/SuperMarioBros3", "/pmwiki/pmwiki.php/VideoGame/SuperMarioWorld", "/pmwiki/pmwiki.php/VideoGame/MarioPaint", "/pmwiki/pmwiki.php/VideoGame/BalloonFight", "/pmwiki/pmwiki.php/VideoGame/DuckHunt", "/pmwiki/pmwiki.php/VideoGame/WreckingCrew", "/pmwiki/pmwiki.php/VideoGame/LuigisMansion", "/pmwiki/pmwiki.php/VideoGame/LuigisMansionDarkMoon", "/pmwiki/pmwiki.php/VideoGame/FireEmblemMysteryOfTheEmblem", "/pmwiki/pmwiki.php/VideoGame/NintendoLand", "/pmwiki/pmwiki.php/VideoGame/PaperMarioStickerStar", "/pmwiki/pmwiki.php/VideoGame/MarioKart", "/pmwiki/pmwiki.php/VideoGame/Xenoblade", "/pmwiki/pmwiki.php/VideoGame/WiiSports", "/pmwiki/pmwiki.php/VideoGame/MegaManClassic", "/pmwiki/pmwiki.php/Creator/BandaiNamcoEntertainment", "/pmwiki/pmwiki.php/VideoGame/SuperSmashFlash", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaMajorasMask", "/pmwiki/pmwiki.php/Franchise/Bomberman", "/pmwiki/pmwiki.php/VideoGame/WarioLand", "/pmwiki/pmwiki.php/VideoGame/MarioAndSonicAtTheOlympicGames", "/pmwiki/pmwiki.php/VideoGame/SuperMarioLand", "/pmwiki/pmwiki.php/VideoGame/SuperMario3DLand", "/pmwiki/pmwiki.php/VideoGame/SonicTheHedgehog4", "/pmwiki/pmwiki.php/Music/Brentalfloss", "/pmwiki/pmwiki.php/VideoGame/EarthBound", "/pmwiki/pmwiki.php/VideoGame/PokemonMysteryDungeonExplorers", "/pmwiki/pmwiki.php/VideoGame/PokemonMysteryDungeonRescueTeam", "/pmwiki/pmwiki.php/VideoGame/Stinkoman20x6", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyRecordKeeper", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyVII", "/pmwiki/pmwiki.php/Music/UK"], "non_media_links": ["/pmwiki/pmwiki.php/Main/CreditsMedley", "/pmwiki/pmwiki.php/Main/StarsOn45", "/pmwiki/pmwiki.php/Main/InTheStyleOf", "https://www.youtube.com/watch?v=9RBFaBGqvPQ", "https://www.youtube.com/watch?v=cepXLReu1aU", "https://www.youtube.com/watch?v=Xz0PaPpmGa8", "https://www.youtube.com/watch?v=cobFXU41cNo", "/pmwiki/pmwiki.php/Main/OneHitWonder", "https://www.youtube.com/watch?v=LANwIgpha7k", "https://www.youtube.com/watch?v=jyDdV8eIHGE", "http://www.formspring.me/FwugRadiation/q/169536600592638964", "https://www.youtube.com/watch?v=Ckr6KyZoS58", "https://www.youtube.com/watch?v=f0Mso1fdqEs", "https://www.youtube.com/watch?v=ktuDYYtbs2s", "https://www.youtube.com/watch?v=VXRN_P9miUc", "https://www.youtube.com/watch?v=B3cReQRgYxg", "http://homestuck.bandcamp.com/track/rex-duodecim-angelus", "/pmwiki/pmwiki.php/Main/Leitmotif", "/pmwiki/pmwiki.php/Main/UpToEleven", "https://www.youtube.com/watch?v=UpMKpOe4ORs", "/pmwiki/pmwiki.php/Main/TheSixties", "/pmwiki/pmwiki.php/Main/CoolShades", "/pmwiki/pmwiki.php/Main/BossRemix", "/pmwiki/pmwiki.php/Main/MiniBoss", "/pmwiki/pmwiki.php/Main/Retraux", "/pmwiki/pmwiki.php/Videogame/SuperSmashBrosCrusade", "/pmwiki/pmwiki.php/WebAnimation/BattleForDreamIsland", "/pmwiki/pmwiki.php/Main/MinusWorld"]}