{"title": "The Player Is the Most Important Resource", "content": "Jack Tretton, The President and CEO of , The President and CEO of Sony Computer Entertainment America, to their customers at E3 2011. \"You are the lifeblood of the company. Without you, there is no PlayStation .\"\n\nA specific form of Breaking the Fourth Wall applicable only to Video Games.\n\nThis is when game characters directly acknowledge that it is because of the player's participation that they are able to achieve success at whatever they do.\n\nThey might acknowledge it via narrative in the game's manual, or at the end of a completed quest/task/assignment/whatever the case may be in the game itself. Bonus points if you, the player, are directly thanked by any of the game's characters at the end of the game, when all the major objectives are met, at which time the characters will likely say that they couldn't have done it without your help.\n\nContrast Video Game Cruelty Potential, where you can do some very outrageous things to game characters for the sake of being a douche, and What the Hell, Player?, where you get called out for it. Also compare It's Up to You, Thanking the Viewer.\n\nAn inversion of Dude, Where's My Respect?, for the player. Not to be confused with An Economy Is You.\n• The \"Welcome, Ace\" segment in the Eagle Eye Mysteries game manuals, where you're introduced to Jake and Jennifer Eagle before you actually start playing the game, has an example of this. According to their speech, you are invaluable as an Eagle Eye Detective Agency member because you can pick up clues that they might have missed during the course of sleuthing. Our most important resource is you. You're our partner in all the Eagle Eye cases, and we depend on you to notice things we might miss and help us out during the course of our investigations. And in the end, it's up to you to point to the guilty party.\n• In both Baten Kaitos games, the player is Kalas/Sagi's \"Guardian Spirit\", which, in-story, grants them wisdom and strange powers. Both games milk this for all it is worth, using it for some very powerful plot twists.\n• The computer game Royal Envoy has this; you go from one town to the next on a series of islands directing repair/reconstruction work accompanied by a clerk named Cedric who praises your efforts from time to time (particularly when being awarded a trophy and at the end of the game).\n• The Chocolatier series of games, particularly at the end when the Baumiesters' firm is rebuilt, and when major human relationships get patched up (between two sisters in the first game, between the boss' daughter's boyfriend and the boss, rescuing the same boyfriend-cum-husband from captivity after WWII).\n• The SimCity series and its various spin-offs, where you are the one behind the creation and maintenance of cities and civilizations.\n• Ditto with Pharaoh. What would the Egyptians do without you...\n• In the first Advance Wars you, as the tactician, get frequently commended by the Commanding Officers you play as for allowing them to win.\n• Fire Emblem: The Blazing Blade: The characters of your party will be stunned at your great abilities upon victory, and especially grateful at the end of the game. However, this is optional—you don't need to \"create a tactician\" for the main characters to address.\n• At the end of Hotel Mario: Luigi, Mario, You're the best player ever!\n• Used in the Final Boss battle of EarthBound, to the extent that you, the player, implicitly destroy Giygas with your faith in the characters.\n• Also happens if you stick around after the end credits in MOTHER 3.\n• The popular PlayStation 3 ad \"Michael\", where numerous video game characters share stories of how their player led them to victory. Also seen in a teaser trailer for Play Station All Stars Battle Royale.\n• Played for Laughs in Super Paper Mario, where a couple of characters assert that the almighty being that watches over them from another dimension is the only one who will understand the fourth-wall breaking control instructions.\n• In Command & Conquer:\n• In Red Alert 2, the video cutscenes after the final mission acknowledge that the success of the final battle was due to your leadership.\n• In Tiberian Dawn, winning the Nod campaign results in Kane praising the player's skills, and allowing you to decide what target to use the captured GDI ion cannon on.\n• In Vangers, this is actually an important plot point.\n• During the ending of Final Fantasy VI, the game displays its \"cast list\" of the approximately 14 player characters along with their pertinent scenes, concluded by \"And You...\"\n• The ending of the fourth episode of Covert Front has Kara thanking the player.\n• In the commercial for Sly 2: Band of Thieves. Bentley remarks, \"The whole operation is blown — if we don't have someone at the controls.\" It shows an empty chair with a PlayStation 2 controller. And then Sly taps on the screen with his cane — complete with glass sound — in a manner reminiscent of the \"Mr. Opportunity\" series of commercials from Honda, while saying, \"So. You in?\"\n• In Marvel: Avengers Alliance, the player character is a SHIELD agent just out of basic training, but the other Marvel heroes start acknowledging your importance almost immediately.\n• The intro scene of Lemmings 2 shows this. \"Evacuation? All our tribes?? But how???\" \"Ah, by the very guiding force that helped us before and as written, will once again. The guide who saved us before.\" to the player) Aside Glance to the player)\n• An odd non-videogame example is Kiel'ndia from Drowtales using her fans as a resource directly, manifested as a swarm of black demon things, on Netherworld TV.\n• Villainous example. In Blazblue Continuum Shift Hazama will thank you for defeating him in arcade mode, and showing him a new possibility of the titular continuum shift.\n• In the game Bleed, Wryn thanks the player for their help in getting her inducted into the Hall of Heroes.\n• Trauma Center: In a post-credits scene, Gabe speaks directly to the player, after which you are treated to a message from all doctors thanking you.\n• In Firaxis and 2K Game's take on XCOM, XCOM: Enemy Unknown and XCOM 2, Bradford and the rest of XCOM acknowledge you as the player and Commander to be vital for your planning and leadership capabilities. The prologue to XCOM 2 features you getting rescued from enemy hands because you're the resistance's only hope of winning the war, and by the endgame, you do indeed play a vital role in the final mission of the campaign.\n• This is a central plot point in the Intercontinuity Crossover game from AMAX Interactive, where the fourth wall is completely shattered. C. Auguste Dupin, from their Dark Tales series, walks into the scene as soon as the player finishes creating their game profile and literally shoves the game information off of the screen before addressing the player and asking for help. As a resident of the \"real world,\" the player is in the best position to help him and his friends from other parallel universes (meaning other games by the same developer) prevent The End of the Worlds As They Know Them. Even the Big Bad acknowledges that the player is the ultimate Spanner in the Works because he didn't count on interference from a real person whom he could not affect.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/ThePlayerIsTheMostImportantResource", "media_links": ["/pmwiki/pmwiki.php/Creator/SonyComputerEntertainment", "/pmwiki/pmwiki.php/VideoGame/EagleEyeMysteries", "/pmwiki/pmwiki.php/VideoGame/BatenKaitos", "/pmwiki/pmwiki.php/VideoGame/SimCity", "/pmwiki/pmwiki.php/VideoGame/Pharaoh", "/pmwiki/pmwiki.php/VideoGame/AdvanceWars", "/pmwiki/pmwiki.php/VideoGame/FireEmblemTheBlazingBlade", "/pmwiki/pmwiki.php/VideoGame/HotelMario", "/pmwiki/pmwiki.php/VideoGame/EarthBound", "/pmwiki/pmwiki.php/VideoGame/MOTHER3", "/pmwiki/pmwiki.php/VideoGame/PlayStationAllStarsBattleRoyale", "/pmwiki/pmwiki.php/VideoGame/SuperPaperMario", "/pmwiki/pmwiki.php/VideoGame/CommandAndConquer", "/pmwiki/pmwiki.php/VideoGame/CommandAndConquerRedAlert2", "/pmwiki/pmwiki.php/VideoGame/CommandAndConquerTiberianDawn", "/pmwiki/pmwiki.php/VideoGame/Vangers", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyVI", "/pmwiki/pmwiki.php/VideoGame/CovertFront", "/pmwiki/pmwiki.php/VideoGame/Sly2BandOfThieves", "/pmwiki/pmwiki.php/VideoGame/Lemmings", "/pmwiki/pmwiki.php/Webcomic/Drowtales", "/pmwiki/pmwiki.php/VideoGame/BlazblueContinuumShift", "/pmwiki/pmwiki.php/VideoGame/Bleed", "/pmwiki/pmwiki.php/VideoGame/TraumaCenter", "/pmwiki/pmwiki.php/VideoGame/XCOM", "/pmwiki/pmwiki.php/VideoGame/XCOMEnemyUnknown", "/pmwiki/pmwiki.php/VideoGame/XCOM2", "/pmwiki/pmwiki.php/Creator/ERSGameStudios", "/pmwiki/pmwiki.php/VideoGame/DarkTales"], "non_media_links": ["/pmwiki/pmwiki.php/UsefulNotes/ElectronicEntertainmentExpo", "/pmwiki/pmwiki.php/UsefulNotes/PlayStation", "/pmwiki/pmwiki.php/Main/BreakingTheFourthWall", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/AllThereInTheManual", "/pmwiki/pmwiki.php/Main/VideoGameCrueltyPotential", "/pmwiki/pmwiki.php/Main/JerkAss", "/pmwiki/pmwiki.php/Main/ForTheEvulz", "/pmwiki/pmwiki.php/Main/WhatTheHellPlayer", "/pmwiki/pmwiki.php/Main/ItsUpToYou", "/pmwiki/pmwiki.php/Main/ThankingTheViewer", "/pmwiki/pmwiki.php/Main/DudeWheresMyRespect", "/pmwiki/pmwiki.php/Main/AnEconomyIsYou", "/pmwiki/pmwiki.php/Main/FinalBoss", "/pmwiki/pmwiki.php/Main/TheEndOrIsIt", "/pmwiki/pmwiki.php/UsefulNotes/PlayStation3", "/pmwiki/pmwiki.php/Main/PlayedForLaughs", "/pmwiki/pmwiki.php/Main/BreakingTheFourthWall", "/pmwiki/pmwiki.php/Main/HeKnowsAboutTimedHits", "/pmwiki/pmwiki.php/UsefulNotes/PlayStation2", "/pmwiki/pmwiki.php/Videogame/MarvelAvengersAlliance", "/pmwiki/pmwiki.php/Main/AsideGlance", "/pmwiki/pmwiki.php/Characters/DrowtalesVelVlozRess", "https://www.youtube.com/watch?v=k_XpsY_zczU", "/pmwiki/pmwiki.php/Main/IntercontinuityCrossover", "https://www.bigfishgames.com/games/15235/worlds-align-beginning-ce/?pc", "/pmwiki/pmwiki.php/Main/BreakingTheFourthWall", "/pmwiki/pmwiki.php/Main/TheEndOfTheWorldAsWeKnowIt", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/SpannerInTheWorks"]}