{"title": "Tactical Reminiscence", "content": "Tactical Reminiscence is where characters remind each other of their shared history to communicate and co-ordinate, giving additional meaning to references to the past only clear to those in the know. There are several ways the tactic can be used:\n• Sharing a plan the characters have used before by referring to it by name or \"Like that time in Berlin in '93\". Can be used as a quick way to refer to a plan when there is no-time to go into detail, a secretive way to share a plan when you need the element of surprise or if insinuated into the conversation, a way to share the plan without anyone overhearing knowing you have a plan at all.\n• Testing someone with a fake reminiscence (Bluff the Imposter)\n• Hinting to someone that something is wrong with a fake reminiscence like: Bob: Remember how we used to sit and read War and Peace together... \n\nAlice: [Thinking] We never read together, Bob must be trying to tell me where he hid the diamonds. Of course, he must have hollowed out his copy of War and Peace and hidden them inside!\n• Used in an overt fashion to convey covert information, like saying \"I'll meet you where we had our first kiss\". Doesn't conceal the intended action, or the fact that they're being deliberately secretive about it, but anyone listening in will still have no idea where the meeting is going to take place.\n\nUsing Tactical Reminiscence in dialogue is a useful tool for the writers as well.\n• It lets them hint at a plan in a concise way without revealing to the audience exactly what the plan is, allowing for the Unspoken Plan Guarantee.\n• The characters' reactions can be used for drama or comedy (\"Not an Aunt Sally, I still have the scars from last time!\")\n• It emphasizes that the characters have a long and colorful history together that might not have been seen on screen, or acts as a fun Call-Back if it's referring to something that was seen earlier.\n• It can become a Noodle Incident that's repeatedly referred to without revealing all the details.\n• It justifies the ability to enact and co-ordinate complex plans quickly, or even instantly; after all, this isn't the first time they've done this.\n• It can be used as a teaser for back-story the audience will find more out about later.\n• It leaves an opening for another character to ask \"What's an Aunt Sally?\" and have the plan explained to them and therefore the audience.\n• It's a great shortcut for writers to cut through the planning that would realistically be needed to pull off a coordinated plan and get straight to watching the action unfold.\n\nThis can backfire if the intended recipient does not or cannot actually recall the details whether through ordinary scatterminded-ness, amnesia or other inabilities to connect the intentionally vague dots.\n\nBluff the Imposter is a sub-trope, so examples of that kind should go there.\n\nCompare Out-of-Character Alert, Something Only They Would Say, and Covert Distress Code.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/TacticalReminiscence", "media_links": ["/pmwiki/pmwiki.php/Film/GalaxyQuest", "/pmwiki/pmwiki.php/Manga/Naruto", "/pmwiki/pmwiki.php/Film/IndianaJonesAndTheKingdomOfTheCrystalSkull", "/pmwiki/pmwiki.php/Film/BillAndTedsBogusJourney", "/pmwiki/pmwiki.php/Film/Inception", "/pmwiki/pmwiki.php/Film/RoadTo", "/pmwiki/pmwiki.php/Film/Hackers", "/pmwiki/pmwiki.php/Film/CapricornOne", "/pmwiki/pmwiki.php/Film/Sahara2005", "/pmwiki/pmwiki.php/Film/ThreeAmigos", "/pmwiki/pmwiki.php/Film/GalaxyQuest", "/pmwiki/pmwiki.php/Film/CaptainMarvel2019", "/pmwiki/pmwiki.php/VideoGame/RogueSquadron", "/pmwiki/pmwiki.php/Literature/TheThrawnTrilogy", "/pmwiki/pmwiki.php/Literature/XWingSeries", "/pmwiki/pmwiki.php/Literature/TheHungerGames", "/pmwiki/pmwiki.php/Series/BurnNotice", "/pmwiki/pmwiki.php/Series/WhiteCollar", "/pmwiki/pmwiki.php/Series/Leverage", "/pmwiki/pmwiki.php/Series/HumanTarget", "/pmwiki/pmwiki.php/Series/Chuck", "/pmwiki/pmwiki.php/Series/CriminalMinds", "/pmwiki/pmwiki.php/Series/Columbo", "/pmwiki/pmwiki.php/Series/Space1999", "/pmwiki/pmwiki.php/WesternAnimation/BatmanTheBraveAndTheBold"], "non_media_links": ["/pmwiki/pmwiki.php/Main/BluffTheImposter", "/pmwiki/pmwiki.php/Main/UnspokenPlanGuarantee", "/pmwiki/pmwiki.php/Main/CallBack", "/pmwiki/pmwiki.php/Main/NoodleIncident", "/pmwiki/pmwiki.php/Main/BluffTheImposter", "/pmwiki/pmwiki.php/Main/OutOfCharacterAlert", "/pmwiki/pmwiki.php/Main/SomethingOnlyTheyWouldSay", "/pmwiki/pmwiki.php/Main/CovertDistressCode", "/pmwiki/pmwiki.php/Main/BluffTheImpostor", "http://starwars.wikia.com/wiki/Cracken_Twist", "/pmwiki/pmwiki.php/Main/BarBrawl", "/pmwiki/pmwiki.php/Main/TheFace", "/pmwiki/pmwiki.php/Main/ContinuityNod", "/pmwiki/pmwiki.php/Main/LuredIntoATrap", "/pmwiki/pmwiki.php/Main/SherlockScan", "/pmwiki/pmwiki.php/Main/SpotTheImposter", "/pmwiki/pmwiki.php/Main/UnspokenPlanGuarantee", "/pmwiki/pmwiki.php/Main/ShootTheHostage", "/pmwiki/pmwiki.php/Main/ThisIsGonnaSuck"]}