{"title": "\"Best Of\" Anthology", "content": "This type of Anthology can occur in any medium. A work is published, but rather than the complete body of work, only a selected group of stories are included. The selection criteria is often \"the best\", chosen by the editor, the creator, or possibly even voting by fans.\n\nSee also the Super-Trope, Anthology (a collection of separate works gathered together in a single cohesive release), and for anthologies in the Music medium, we have the Sub-Trope Greatest Hits Album.\n• Digital Trends: On 1 Feb 2018, they ran an article titled \"From Wassup to Darth Vader, the 10 greatest Super Bowl commercials of all time\", where YouTube videos were inset and Christine Persaud shares a summary of the commercial itself and the reception to the commercial. (link)\n• Worlds Funniest And Cleverest Commercials: A DVD made in 2004 by Sofa studios with a host describing some of the commercials. The commercials range from 1960 to late 1990s.\n• 18 Greatest Science Fiction Stories: Picked by famous authors, the Tagline claims these are the \"best Science Fiction stories of all time - chosen by the masters of science fiction\".\n• Best Of Isaac Asimov: Published in 1976, Isaac Asimov selected twelve of his short fiction stories, from 1930s to 1970s, to represent the best of his hundreds of stories.\n• The Best Science Fiction: 1949: Published in 1949 by editors Everett F Bleiler and TE Dikty, a Genre Anthology representing works found in Pulp Magazines during the previous year. Also the first ever annual \"Best Of\" anthologies for Science Fiction.\n• Fantasy The Best Of 2002: Published in 2003, Karen Haber and Robert Silverberg collected eleven short Speculative Fiction stories to represent the best of 2002.\n• The Great SF Stories: A series of 25 (now 26) Genre Anthology volumes, covering the years of 1939 through 1964. Each volume contained a dozen or more short fiction stories to represent the best of the year, selected by editor Martin H. Greenberg, with Isaac Asimov (or Robert Silverberg) assisting.\n• Modern Masterpieces of Science Fiction: In 1965, editor Sam Moskowitz anthologized twenty-one famous tales of Science Fiction from the past thirty years.\n• My Best Science Fiction Story: Edited by Leo Margulies and Oscar J Friend, this book contains 25 different stories, chosen by each of their respective authors as the best stories they've written. Each story is preceded by biography and a short blurb by the author, explaining how they decided which story to submit for the Anthology.\n• Science Fiction Favorites: Isaac Asimov selected his ten favourite stories for this collection in 1975.\n• Science Fiction Hall of Fame: Volume One: Robert Silverberg, representing the Science Fiction Writers of America and their votes, edited an anthology of the best Short Stories and Novelettes of Science Fiction below 15,000 words first printed between 1929 and 1964.\n• S-F: The Year's Greatest Science-Fiction and Fantasy: Published in 1956, the eighteen best Science Fiction stories of 1955 are anthologized by editor Judith Merril.\n• Doctor Who: The short story anthology Short Trips: Re:Collections contains one story from each of the previous twenty-eight short story anthologies.\n• Superman: The Best Of Warner Bros Superman Collection is 30 disks worth of Superman TV shows, from Max Fleischers Superman to Superman: Doomsday, and from Lois & Clark to Smallville.\n• Analog: The 6 Decades: The Best of Analog anthology, by editor Stanley Schmidt, chooses one story from each of the six decades Analog had been in print to represent the best stories Analog ever published.\n• The Magazine Of Fantasy And Science Fiction: The Best From Fantasy And Science Fiction is a series of over twenty volumes, each Anthology collecting the best stories from The Magazine of Fantasy and Science Fiction since the previous release.\n• Batman: The Best Of Batman is a 13-episode DVD anthology, where the episodes are drawn from multiple Batman cartoons, all of which were known to be fan favourites.\n• Family Guy: The Freakin' Sweet Collection is a DVD with five episodes chosen by series creator Seth MacFarlane.\n• The New Scooby-Doo Movies: Warner Bros. didn't have the rights to republish all of their episodes as DVD, because they featured guest stars. So they released a \"Best-of\" DVD set, instead, limiting the selection further.\n• Nickelodeon's The Best of Nickelodeon: Summer Adventures: Contains SpongeBob SquarePants, All Grown Up! and Rocket Power episodes.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/BestOfAnthology", "media_links": ["/pmwiki/pmwiki.php/Website/DigitalTrends", "/pmwiki/pmwiki.php/Website/YouTube", "/pmwiki/pmwiki.php/Creator/ChristinePersaud", "/pmwiki/pmwiki.php/Creator/Sofa", "/pmwiki/pmwiki.php/Literature/EighteenGreatestScienceFictionStories", "/pmwiki/pmwiki.php/Literature/BestOfIsaacAsimov", "/pmwiki/pmwiki.php/Creator/IsaacAsimov", "/pmwiki/pmwiki.php/Literature/TheBestScienceFictionStories1949", "/pmwiki/pmwiki.php/Creator/EverettFBleiler", "/pmwiki/pmwiki.php/Creator/TEDikty", "/pmwiki/pmwiki.php/Literature/FantasyTheBestOf2002", "/pmwiki/pmwiki.php/Creator/KarenHaber", "/pmwiki/pmwiki.php/Creator/RobertSilverberg", "/pmwiki/pmwiki.php/Literature/TheGreatSFStories", "/pmwiki/pmwiki.php/Creator/MartinHGreenberg", "/pmwiki/pmwiki.php/Creator/IsaacAsimov", "/pmwiki/pmwiki.php/Creator/RobertSilverberg", "/pmwiki/pmwiki.php/Literature/ModernMasterpiecesOfScienceFiction", "/pmwiki/pmwiki.php/Creator/SamMoskowitz", "/pmwiki/pmwiki.php/Literature/MyBestScienceFictionStory", "/pmwiki/pmwiki.php/Creator/LeoMargulies", "/pmwiki/pmwiki.php/Creator/OscarJFriend", "/pmwiki/pmwiki.php/Literature/ScienceFictionFavorites", "/pmwiki/pmwiki.php/Creator/IsaacAsimov", "/pmwiki/pmwiki.php/Literature/ScienceFictionHallOfFameVolumeOne", "/pmwiki/pmwiki.php/Creator/RobertSilverberg", "/pmwiki/pmwiki.php/Literature/SFTheYearsGreatestScienceFictionAndFantasy", "/pmwiki/pmwiki.php/Creator/JudithMerril", "/pmwiki/pmwiki.php/Series/DoctorWho", "/pmwiki/pmwiki.php/Franchise/Superman", "/pmwiki/pmwiki.php/Series/TheBestOfWarnerBrosSupermanCollection", "/pmwiki/pmwiki.php/WesternAnimation/MaxFleischersSuperman", "/pmwiki/pmwiki.php/WesternAnimation/SupermanDoomsday", "/pmwiki/pmwiki.php/Series/LoisAndClark", "/pmwiki/pmwiki.php/Series/Smallville", "/pmwiki/pmwiki.php/Literature/SixDecadesTheBestOfAnalog", "/pmwiki/pmwiki.php/Creator/StanleySchmidt", "/pmwiki/pmwiki.php/Literature/TheBestFromFantasyAndScienceFiction", "/pmwiki/pmwiki.php/Franchise/Batman", "/pmwiki/pmwiki.php/WesternAnimation/TheBestOfBatman", "/pmwiki/pmwiki.php/WesternAnimation/FamilyGuy", "/pmwiki/pmwiki.php/Creator/SethMacFarlane", "/pmwiki/pmwiki.php/WesternAnimation/TheNewScoobyDooMovies", "/pmwiki/pmwiki.php/Creator/WarnerBros", "/pmwiki/pmwiki.php/Creator/Nickelodeon", "/pmwiki/pmwiki.php/WesternAnimation/SpongeBobSquarePants", "/pmwiki/pmwiki.php/WesternAnimation/AllGrownUp", "/pmwiki/pmwiki.php/WesternAnimation/RocketPower"], "non_media_links": ["/pmwiki/pmwiki.php/Main/Anthology", "/pmwiki/pmwiki.php/Main/SuperTrope", "/pmwiki/pmwiki.php/Main/Anthology", "/pmwiki/pmwiki.php/Main/Music", "/pmwiki/pmwiki.php/Main/SubTrope", "/pmwiki/pmwiki.php/Main/GreatestHitsAlbum", "/pmwiki/pmwiki.php/Main/Advertising", "https://www.digitaltrends.com/movies/best-super-bowl-commercials-of-all-time/", "/pmwiki/pmwiki.php/Advertising/WorldsFunniestAndCleverestCommercials", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/Tagline", "/pmwiki/pmwiki.php/Main/ScienceFiction", "/pmwiki/pmwiki.php/Main/GenreAnthology", "/pmwiki/pmwiki.php/Main/PulpMagazine", "/pmwiki/pmwiki.php/Main/ScienceFiction", "/pmwiki/pmwiki.php/Main/SpeculativeFiction", "/pmwiki/pmwiki.php/Main/GenreAnthology", "/pmwiki/pmwiki.php/Main/ScienceFiction", "/pmwiki/pmwiki.php/Main/Anthology", "/pmwiki/pmwiki.php/Main/ShortStory", "/pmwiki/pmwiki.php/Main/Novelette", "/pmwiki/pmwiki.php/Main/ScienceFiction", "/pmwiki/pmwiki.php/Main/ScienceFiction", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/Magazine", "/pmwiki/pmwiki.php/Magazine/Analog", "/pmwiki/pmwiki.php/Magazine/TheMagazineOfFantasyAndScienceFiction", "/pmwiki/pmwiki.php/Main/MultiVolumeWork", "/pmwiki/pmwiki.php/Main/Anthology", "/pmwiki/pmwiki.php/Main/Music", "/pmwiki/pmwiki.php/Main/GreatestHitsAlbum", "/pmwiki/pmwiki.php/Main/WesternAnimation"]}