{"title": "Dance of Despair", "content": "This is a desperate attempt to cope with a character's unsolvable problems through a frantic dance sequence.\n\nThe character in question will most likely be in the middle of a Heroic BSoD or a Despair Event Horizon. A Stepford Smiler would be the most likely person to attempt this kind of dancing, either to make the amounting troubles go away, or just to cope with them. You would most likely have this attempt when someone else is around. When the character is left to herself (or himself), a Despair Speech is imminent. The dance may prove to everybody else that everything is splendid, no problem here, just move along (please).\n\nCompare/contrast Happy Dance and Angry Dance. A subtrope of Cope by Creating. Musical variants to dealing with grief and despair include Melancholy Musical Number, Songs of Solace, Grief Song or Break-Up Song.\n• One Piece: One of the 3 princes of the Ryuugu Kingdom, Manboshi, likes dancing around (\"Akka Mambo!\"). It's revealed in a flashback that it became a habit after he and his brother Ryuboshi tried to cheer up their crying young sister Shirahoshi after their mother's death. They performed an impromptu dance routine for her while they were still crying themselves.\n• In the \"Homeschooling\" arc of Runaways, Karolina and Chase share a slow dance, depressed over the recent losses of their respective partners.\n• In Alps, as her life falls apart around her, Monte Rosa barges in on a dancing class and forces one of the patrons to dance with her.\n• In the movie adaptation of Harry Potter and the Deathly Hallows, Harry and Hermione dance a slow waltz to deal with .\n• In Us, Red's dance \"controlled\" by Adelaide is an expression of her desperation, as it demonstrates that she is the original and not a copy .\n• Sweeney Todd: The Demon Barber of Fleet Street: In the climax of the movie, Todd realizes that the beggar woman he has murdered was his wife Lucy. He accuses Mrs. Lovett of lying to him about her fate. She insists she didn't lie: Lucy did poison herself, but she survived. Todd pretends to forgive her and starts dancing with Mrs. Lovett in a manic way. Then he suddenly pushes her into the oven and burns her alive.\n• In Joker (2019), Arthur Fleck dances a few times on his own, and they're often slow and melancholy before he begins his descent into becoming The Joker (where conversely, he becomes far more upbeat). The most prominent instance of this is right after he commits his first murders: once he escapes the scene of the crime and ducks into a public bathroom, he slowly begins dancing by himself with a completely expressionless face.\n• In The Fangs of K'aath, the protagonists are so touched by the sadness of Yarim's dance that they rescue her from its perverted audience, although doing so is politically unwise.\n• The title heroine of Thaïs of Athens falls into a despair after her Best Friend Aegesichore and her lover Menedem are both murdered in a single day. The only thing that keeps her afloat (until major changes in her life help her overcome it) is riding out into the wilderness and dancing for hours at a time.\n• Implied in The Things They Carried chapter \"Style\". The platoon comes across a girl whose entire family had died in the war. This girl did nothing but dance, and was dancing when they found her, for reasons they can't understand, but figure it's a cultural thing. One rude soldier is even told off when he tries to mock her dancing.\n• In the final season of The Americans, Phillip takes up country line dancing in order to fill up all the spare time he now has as his spying career ends and his business falls apart.\n• Buffy the Vampire Slayer, \"Once More, with Feeling\": When she's asked by Sweet what she thinks about life, Buffy sings a pessimistic song about its meaning (\"Something to Sing About\"). Willow reacts with horror at finding out what Buffy's done. Buffy stops singing and dances so frenetically that she begins to smoke and nearly ignites and burns until Spike stops her.\n• In Twin Peaks, Mr. Palmer dances multiple times throughout the series when dealing with the loss of his daughter, Laura, often calling out her name. He performs the same dance as he murders his niece, Maddy Ferguson. The dance serves as a clue to Agent Cooper that Mr. Palmer killed Laura because it mirrors the dances the dwarf performed in his dream.\n• In the first episode of The Umbrella Academy (2019), the Hargreaves siblings all break into dance as their way of coping with having to reunite for their father's funeral.\n• A Doll's House: Nora's tarantella becomes more and more frantic. At one point, she is clearly desperate because she knows she may be busted by Krogstad any minute and she dances out of despair.\n• Elisabeth: The Mayerling Waltz is a frantic dance sequence with Rudolf either chasing the Angels for a gun, which they're playing keep-away with, or running from them. It ends with him shooting himself, usually with Death's helping hand.\n• Sweeney Todd: The Demon Barber of Fleet Street: When Sweeney Todd realizes that the Beggar Woman he has killed is his wife Lucy, he is utterly shocked and accuses Mrs. Lovett of lying to him. She explains that technically she didn't lie: Lucy did poison herself, but she lived and lost her mental health. Mrs. Lovett confesses she loves Mr. Todd. He pretends to forgive her and he starts dancing manically with Mrs. Lovett. Then he suddenly pushes her into the oven and she burns alive. Full of despair, Mr. Todd cradles his dead wife Lucy in his arms.\n• Played for Laughs in Ghost Trick with Bailey's \"panic dance\". It's been passed down by his family for generations: Bailey: When you don't know! What else to do! Dance! Dance! Dance!\n• In Octopath Traveler, Sex Slave Primrose channels her feelings of despair into the dances she's forced to perform.\n• The Cry of Mann: In one scene, as Courtney is losing her mind and suffering a breakdown, she asks her callers to tell her about their favorite dance moves, so she can try them out. Shortly after, her mood goes spiraling down, as she gives a sad monologue and listens to a recording from Tank Mann.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/DanceOfDespair", "media_links": ["/pmwiki/pmwiki.php/Manga/OnePiece", "/pmwiki/pmwiki.php/ComicBook/Runaways", "/pmwiki/pmwiki.php/Film/Alps", "/pmwiki/pmwiki.php/Literature/HarryPotterAndTheDeathlyHallows", "/pmwiki/pmwiki.php/Film/Us", "/pmwiki/pmwiki.php/Film/SweeneyToddTheDemonBarberOfFleetStreet", "/pmwiki/pmwiki.php/Film/Joker2019", "/pmwiki/pmwiki.php/ComicBook/TheJoker", "/pmwiki/pmwiki.php/Literature/TheFangsOfKaath", "/pmwiki/pmwiki.php/Literature/ThaisOfAthens", "/pmwiki/pmwiki.php/Literature/TheThingsTheyCarried", "/pmwiki/pmwiki.php/Series/TheAmericans", "/pmwiki/pmwiki.php/Series/BuffyTheVampireSlayer", "/pmwiki/pmwiki.php/Series/TwinPeaks", "/pmwiki/pmwiki.php/Series/TheUmbrellaAcademy2019", "/pmwiki/pmwiki.php/Theatre/ADollsHouse", "/pmwiki/pmwiki.php/Theatre/Elisabeth", "/pmwiki/pmwiki.php/Theatre/SweeneyToddTheDemonBarberOfFleetStreet", "/pmwiki/pmwiki.php/VideoGame/GhostTrick", "/pmwiki/pmwiki.php/VideoGame/OctopathTraveler", "/pmwiki/pmwiki.php/Series/TheCryOfMann"], "non_media_links": ["/pmwiki/pmwiki.php/Main/HeroicBSOD", "/pmwiki/pmwiki.php/Main/DespairEventHorizon", "/pmwiki/pmwiki.php/Main/StepfordSmiler", "/pmwiki/pmwiki.php/Main/DespairSpeech", "/pmwiki/pmwiki.php/Main/HappyDance", "/pmwiki/pmwiki.php/Main/AngryDance", "/pmwiki/pmwiki.php/Main/CopeByCreating", "/pmwiki/pmwiki.php/Main/MelancholyMusicalNumber", "/pmwiki/pmwiki.php/Main/SongsOfSolace", "/pmwiki/pmwiki.php/Main/GriefSong", "/pmwiki/pmwiki.php/Main/BreakupSong", "/pmwiki/pmwiki.php/Main/Anime", "/pmwiki/pmwiki.php/Main/Manga", "/pmwiki/pmwiki.php/Main/ComicBooks", "/pmwiki/pmwiki.php/Main/FilmsLiveAction", "/pmwiki/pmwiki.php/Main/VillainProtagonist", "/pmwiki/pmwiki.php/Main/HappyDance", "/pmwiki/pmwiki.php/Main/StartOfDarkness", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/BestFriend", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/Theatre", "/pmwiki/pmwiki.php/Main/DrivenToSuicide", "/pmwiki/pmwiki.php/Main/CradlingYourKill", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/PlayedForLaughs", "/pmwiki/pmwiki.php/Main/SexSlave", "/pmwiki/pmwiki.php/Main/WebVideo"]}