{"title": "Fan-Art", "content": "The graphical image equivalent of Fan Fic. Can be anything from parody to portraits, technical drawings to erotic indulgences, to Chibis, to all of the above combined.\n\nThe most common Art Subjects are from animation (both North American cartoons and anime), since by nature animated characters are designed to be easy to draw. People with an interest in visual arts are also more likely to be animation fans than most others.\n\nAs for live action shows, it takes a certain level of artistic sophistication to depict real people with any degree of recognition. That doesn't stop anyone, however, and any visually interesting or unique show is likely to have some fan-made pieces floating around. Most often these are Speculative Fiction shows, since most fan art based on normal people is more about the actor or actress than the character. Then again, an entire Yahoo! Group is dedicated to celebrity likenesses made with the Poser and FaceGen applications.\n\nIn Japan, the majority of Doujinshi are fan art in manga form.\n\nOf course, there's always Rule 34.\n\nMany Web Comics (particularly ones with recurring characters and good quality artwork) have dedicated fan art galleries on their websites, with images ranging from single characters to full-blown guest strips that don't fit in the archive.\n\nSee also Cosplay Fan Art, Rule 63 (for characters drawn as the opposite gender), Side-Story Bonus Art (official art), Self-Fanservice (when canonically unattractive characters look better in the Fan-Art).\n\nFan Artists with their own pages on the wiki:\n• See DeviantArt here for a large amount of Fan Art (as well as a wide range of original pieces). Beware, though — Sturgeon's Law very much applies. Searching people's favorite artwork galleries can help a lot in finding good work, even more if you share the same taste as those people. If you like someone's artwork, consider checking their \"favs\".\n• For a different kind of fan art also see vgboxart , a site/community that focuses on the creation of Fan Art in the form of covers. It started as a site for video game boxes (hence the name), but now it can be described as generalentertainmentboxart as works vary from games to movies to books. All sorts of Cover Tropes apply for the fan work seen there, a lot of uploads are actually good, and a select few are much better than the official packaging seen in stores.\n• As mentioned above, a lot of webcomics have Fan-Art sections. For example, Gunnerkrigg Court , El Goonish Shive and Zap! .\n• The Whateley Universe forums now have a fan art section, and some of that is links to Deviant ART pages.\n• Also, there is a section on the Looking for Group boards made for posting Fan Art - though it should be noted that there is a separate page for Fan Art feedback.\n• Furaffinity has an entire category dedicated to \"Sonic\" art due to the enormous dump of Fanart. Sturgeon's Law applies liberally to this one.\n• Pokémon and Digimon have their own categories as well, with their own Not Safe for Work sections.\n• Some Image Boards, like the dreaded 4chan.\n• The page image for Moveset Clone shows fanart of, well... Ryu And Ken.\n• A notorious historical example was a couple of Snow White fan-drawings found in an old cellar. They were found in Norway, dated to the late 30s, and were signed by a talented amateur artist called \"A. H.\". Mr. H. has been known to be a major fan of Disney, and he drew a couple other works too.\n• Ex-SNK artist Falcoon began his career at that company by drawing fan art for their various properties, such as The King of Fighters and Fatal Fury.\n• The careers of Jim Lee and Rob Liefeld both began with them being noticed for their detailed fan art.\n• This goes for any artist who is working at Marvel or DC. It is very unlikely that there are any artists at the Big Two who hadn't drawn Spider-Man or Batman before being hired.\n• Averted for Ctrl+Alt+Del: A fan once made a little CGI movie using Tim Buckley's characters for a school assignment and Buckley threatened him with a lawsuit because he wanted to save his artwork for The Animated Series. Oddly, there was an earlier post from Buckley saying it's okay to make fanart... Naturally this only pushes the hatedom to new heights of hilarity (usually involving a \"Loss Edit\").\n• Older Than Radio: The works of William Shakespeare have inspired art for hundreds of years, perhaps most famously Sir John Everett Millais' painting Ophelia.\n• A remarkable amount for Kim Possible, encompassing crossovers, the KP cast in other roles, Kim and Ron in the future (in college, married, with kids, or just older) and a lot of Kim and her nemesis Shego in a lesbian relationship. Curiously, though Rule 34 obviously applies, the last often tends toward being cute rather than overtly sexual.\n• There's a website called \"Rule 34 - If it exists there IS porn of it\". Guess what it's dedicated to. We're not going to link to it. The un-named site is currently in the doldrums as its creator says it is now under seriuous and sustained pressure under child pornography laws (both from law enforcement agencies and its residual non-porn advetising associates) to take down all art featuring characters who are clearly under sixteen. As a significant minority of characters in animation and comics are clearly children or adolescents, the drive to remove all potentially offending images is stripping out a lot of its content. Which is what made it a fairly squicky place to visit in the first place...\n• Homestuck, naturally, has a ton of fan art but what makes it unique is that it also has fan music, enough for an entire (free!) unofficial album which is a fraction of Tindeck's Homestuck .\n• Osamu Tezuka loved the Disney Duck family stories by Carl Barks and frequently sent greeting cards to him with his own drawings of them interacting with his own characters.\n• , a Booru-style image board, has grown huge enough to have over 100,000 registered users, house almost every piece of My Little Pony: Friendship Is Magic Fan-Art ever made (Excluding what's on their do not post list, but including a number of localized artists who don't post anywhere else), and has gone on to develop its own web culture and local memes Most famous being the use of the word 'duck' as an insult, thanks to a typo when one user meant to call a Troll a dick .\n• Marcoasalazarm draws fanart for many fanfics such like Last Child of Krypton and Superwomen of Eva 2: Lone Heir of Krypton (he drew the story's cover among other stuff).\n• Doing It Right This Time: One of the fans of this story makes illustrations of several scenes.\n• Evangelion 303: Grummancat not only draws his own Evangelion fancomic but also has done a crapton of fanart of Evangelion, Kim Possible and other works.\n• HERZ: Several fans created illustrations of the series and even a logo.\n• Once More with Feeling: A fan drew a picture of Asuka costumed with the dress she wore when she attended the school dance. Unfortunately, the art has been lost.\n• The One I Love Is: Many fans drew fanart and even comic pages from the story when it was at the height of its popularity. Unfortunately, it disappeared when the server crashed.\n• Shyft is a fanfic writer and artist has done plenty fanart for other people's fanfiction such like Advice and Trust and A Crown of Stars (he drew pictures of all OCs).\n• Justinedarkchylde from DeviantArt has drawn many illustrations of fanfics such like Thousand Shinji and Big Sister.\n• The Second Try inspired several artists to draw pictures and even mini-comics that can be found in the author's website.\n• The Penumbra Podcast hired the fanartist disasterscenario to be their official artist after seeing her comic-style reimagining of one of their scenes .\n• Author Blackmambauk often commissions fic covers for their fanfictions and other fanarts. As shown with Code Geass Colored Memories Fic Cover that was designed and created by Jit-Art . With Roanapur Connection's Fic Cover designed and created by KiraLNG .\n• In Total Drama fanfic Unbreakable Red Silken Thread one of the reviewers, CMR Rosa, not only commissioned a cover picture, but a whole gallery folder for character pictures from this story here .\n• In (Crossover: Rick and Morty, Total Drama) Rick and Morty New Drama Adventures the author commissioned not only a cover picture, but a whole gallery folder for character pictures from this story here .", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/Fanart", "media_links": ["/pmwiki/pmwiki.php/Franchise/MegaMan", "/pmwiki/pmwiki.php/WesternAnimation/MyLittlePonyFriendshipIsMagic", "/pmwiki/pmwiki.php/Creator/Bleedman", "/pmwiki/pmwiki.php/Creator/DanKim", "/pmwiki/pmwiki.php/Creator/Earthsong9405", "/pmwiki/pmwiki.php/Creator/Evay", "/pmwiki/pmwiki.php/Creator/Kilala97", "/pmwiki/pmwiki.php/Creator/LeutenantBecca", "/pmwiki/pmwiki.php/Creator/MxBones", "/pmwiki/pmwiki.php/Creator/Savu0211", "/pmwiki/pmwiki.php/Creator/Sayori", "/pmwiki/pmwiki.php/Creator/SeijunTombo", "/pmwiki/pmwiki.php/Creator/TaralWayne", "/pmwiki/pmwiki.php/Creator/VampireMeerkat", "/pmwiki/pmwiki.php/Creator/YamatoDamashi", "/pmwiki/pmwiki.php/Creator/Yamujiburo", "/pmwiki/pmwiki.php/Website/DeviantArt", "/pmwiki/pmwiki.php/Webcomic/CaseyAndAndy", "/pmwiki/pmwiki.php/Literature/WhateleyUniverse", "/pmwiki/pmwiki.php/Website/DeviantART", "/pmwiki/pmwiki.php/Webcomic/LookingForGroup", "/pmwiki/pmwiki.php/Franchise/SonicTheHedgehog", "/pmwiki/pmwiki.php/Franchise/Pokemon", "/pmwiki/pmwiki.php/Franchise/Digimon", "/pmwiki/pmwiki.php/Website/FourChan", "/pmwiki/pmwiki.php/Disney/SnowWhite", "/pmwiki/pmwiki.php/VideoGame/TheKingOfFighters", "/pmwiki/pmwiki.php/VideoGame/FatalFury", "/pmwiki/pmwiki.php/Creator/JimLee", "/pmwiki/pmwiki.php/Creator/RobLiefeld", "/pmwiki/pmwiki.php/Webcomic/CtrlAltDel", "/pmwiki/pmwiki.php/Creator/WilliamShakespeare", "/pmwiki/pmwiki.php/Theatre/Hamlet", "/pmwiki/pmwiki.php/WesternAnimation/KimPossible", "/pmwiki/pmwiki.php/Webcomic/Homestuck", "/pmwiki/pmwiki.php/Creator/OsamuTezuka", "/pmwiki/pmwiki.php/Creator/CarlBarks", "/pmwiki/pmwiki.php/WesternAnimation/MyLittlePonyFriendshipIsMagic", "/pmwiki/pmwiki.php/Manga/Evangelion303", "/pmwiki/pmwiki.php/WesternAnimation/KimPossible", "/pmwiki/pmwiki.php/Website/DeviantArt", "/pmwiki/pmwiki.php/WesternAnimation/TotalDrama", "/pmwiki/pmwiki.php/WesternAnimation/RickAndMorty", "/pmwiki/pmwiki.php/WesternAnimation/TotalDrama"], "non_media_links": ["/pmwiki/pmwiki.php/Main/IncrediblyLamePun", "/pmwiki/pmwiki.php/Main/MegaCrossover", "https://www.youtube.com/watch?v=x5ulc0By4EI#t=3m3s", "/pmwiki/pmwiki.php/Main/PeripheryDemographic", "/pmwiki/pmwiki.php/Main/FanFic", "/pmwiki/pmwiki.php/Main/Rule34", "/pmwiki/pmwiki.php/Main/SelfFanservice", "/pmwiki/pmwiki.php/Main/Chibi", "/pmwiki/pmwiki.php/Main/BreadEggsBreadedEggs", "/pmwiki/pmwiki.php/Main/ArtSubjects", "/pmwiki/pmwiki.php/Main/Anime", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/SpeculativeFiction", "http://groups.yahoo.com/group/3d_celebrities_2/", "/pmwiki/pmwiki.php/Main/Doujinshi", "/pmwiki/pmwiki.php/Main/RuleThirtyFour", "/pmwiki/pmwiki.php/Main/Chibi", "/pmwiki/pmwiki.php/Main/RuleOfFunny", "/pmwiki/pmwiki.php/Main/BreadEggsBreadedEggs", "/pmwiki/pmwiki.php/Main/WebComics", "/pmwiki/pmwiki.php/Main/GuestStrip", "/pmwiki/pmwiki.php/Main/StripArchive", "/pmwiki/pmwiki.php/ImageLinks/CosplayFanArt", "/pmwiki/pmwiki.php/Main/RuleSixtyThree", "/pmwiki/pmwiki.php/Main/SideStoryBonusArt", "/pmwiki/pmwiki.php/Main/SelfFanservice", "/pmwiki/pmwiki.php/Main/Canon", "/pmwiki/pmwiki.php/Main/FanArt", "http://www.deviantart.com/", "/pmwiki/pmwiki.php/Main/SturgeonsLaw", "http://www.vgboxart.com/", "/pmwiki/pmwiki.php/Main/CoverTropes", "/pmwiki/pmwiki.php/Main/FanArt", "http://www.gunnerkrigg.com/art.html", "http://community.910cmx.com/index.php?showforum=111", "http://zapinspace.com/fan_art.html", "http://forums.lfgcomic.com/index.php?showtopic=1784", "http://forums.lfgcomic.com/index.php?showtopic=1785", "http://www.furaffinity.net", "/pmwiki/pmwiki.php/Main/SturgeonsLaw", "/pmwiki/pmwiki.php/Main/RuleThirtyFour", "/pmwiki/pmwiki.php/Main/NotSafeForWork", "/pmwiki/pmwiki.php/Main/RuleThirtyFour", "/pmwiki/pmwiki.php/Main/ImageBoards", "/pmwiki/pmwiki.php/Main/MovesetClone", "/pmwiki/pmwiki.php/UsefulNotes/AdolfHitler", "/pmwiki/pmwiki.php/Main/Falcoon", "/pmwiki/pmwiki.php/Main/TheAnimatedSeries", "/pmwiki/pmwiki.php/Main/Hatedom", "/pmwiki/pmwiki.php/Main/ConvenientMiscarriage", "/pmwiki/pmwiki.php/Main/OlderThanRadio", "/pmwiki/pmwiki.php/Main/IntercontinuityCrossover", "/pmwiki/pmwiki.php/Main/ContinuationFic", "/pmwiki/pmwiki.php/Main/FoeYay", "/pmwiki/pmwiki.php/Main/LesYay", "/pmwiki/pmwiki.php/Main/RuleThirtyFour", "/pmwiki/pmwiki.php/SugarWiki/WAFF", "https://www.dropbox.com/s/tbcx3zpcno8m6ta/Fanart%20Aggregator/New%20This%20Week", "http://homestuckgaiden.bandcamp.com/album/land-of-fans-and-music", "http://tindeck.com/browse?gr=59", "http://i.crackedcdn.com/phpimages/article/4/2/4/43424.jpg?v=1", "http://www.derpiboo.ru", "/pmwiki/pmwiki.php/Main/FanArt", "/pmwiki/pmwiki.php/Main/MemeticMutation", "/pmwiki/pmwiki.php/Main/Troll", "http://marcoasalazarm.deviantart.com/", "/pmwiki/pmwiki.php/Fanfic/LastChildOfKrypton", "/pmwiki/pmwiki.php/Fanfic/SOE2LoneHeirOfKrypton", "/pmwiki/pmwiki.php/Fanfic/DoingItRightThisTime", "http://grummancat.deviantart.com/", "/pmwiki/pmwiki.php/Fanfic/HERZ", "/pmwiki/pmwiki.php/Fanfic/OnceMoreWithFeeling", "/pmwiki/pmwiki.php/Fanfic/TheOneILoveIs", "http://forums.sufficientvelocity.com/members/shyft.253/", "/pmwiki/pmwiki.php/Fanfic/AdviceAndTrust", "/pmwiki/pmwiki.php/Fanfic/ACrownOfStars", "http://justinedarkchylde.deviantart.com/", "/pmwiki/pmwiki.php/Fanfic/ThousandShinji", "/pmwiki/pmwiki.php/Fanfic/BigSister", "/pmwiki/pmwiki.php/Fanfic/TheSecondTry", "/pmwiki/pmwiki.php/Podcast/ThePenumbraPodcast", "http://disasterscenario.tumblr.com/", "http://78.media.tumblr.com/e1aae346b64c6b1a733a367bfa5f6750/tumblr_oebunyaRbg1qhozm3o1_1280.jpg", "http://78.media.tumblr.com/131d4721ba11889f088622a8be1e7925/tumblr_oebunyaRbg1qhozm3o2_1280.jpg", "https://www.fanfiction.net/~blackmambauk", "http://jit-art.deviantart.com/art/Code-Geass-FanFic-Cover-Art-648143911", "https://www.deviantart.com/jit-art", "https://www.deviantart.com/kiralng/art/Commission-Roanapur-Connection-733472233", "https://www.deviantart.com/kiralng", "/pmwiki/pmwiki.php/Fanfic/UnbreakableRedSilkenThread", "https://qmargot.deviantart.com/gallery/55265567/Unbreakable-Red-Silken-Thread-by-RufusTSerenity", "/pmwiki/pmwiki.php/Fanfic/RickAndMortyNewDramaAdventures", "https://qmargot.deviantart.com/gallery/66530094/Rick-and-Morty-New-Drama-Adventures-by-CRSTO20"]}