{"title": "The Weird Sisters", "content": "Supernatural women often form teams of three. The most common variant types are witches, fairy godmothers, and female seers. They may or may not be actual sisters.\n\nThe Trope Codifier for the modern era are the three prophetic witches of Macbeth, who have also supplied or reinforced other classic witch stereotypes like warty noses, bubbling cauldrons, and animal familiars. Shakespeare's magical trio, however, is itself based in folklore with roots in pre-Christian mythology, namely, the belief in a trinity of goddesses whose job in the greater order of things is to assign fate to us mortals. This notion can be traced back to the Moirai or \"Fates\" of Greek Mythology (though probably not much further).\n\nThe women of fate were not categorically friendly nor hostile, as they distributed both the good and the bad things in life. When Christianity did away with the goddesses of old, the trio lived on in fairy tales and folklore under new labels, although they now were more likely to be limited to either a harmful or a helpful role—either as Wicked Witches who make bad things happen to people just because, or benign Fairy Godmothers who aid and protect. What has remained is that whenever such magical women appear in groups, there tend to be three of them.\n\nA third reincarnation of the three women of fate is a trio of seeresses who predict fate, but do not interfere with it directly. When the Weird Sisters are more specifically embodying or invoking the goddesses of fate, they will be equipped with spinning or weaving tools.\n\nGenerally, a mortal is most likely to encounter the Weird Sisters at the important times in life—birth, coming-of-age, death, any major turning point or crisis between these times.\n\nThe Trope Namer is not strictly Macbeth, but its direct source, the Chronicles of England, Scotland, and Ireland by Raphael Holinshed, which opines that the three prophetic ladies who met Macbeth\n\nIn the Macbeth print of 1623, the three witches are referred to as \"weyward\" respectively \"weyard Sisters\". This is variously rendered as \"wayward\" or \"weird\" by modern editions, and suggests that Shakespeare's contemporaries were uncertain about the meaning and spelling of the phrase. In reality, \"weird\" is a Scots derivative from Old English wyrd, which means \"fate\". As the word was not widely known then, it were the very \"Weird Sisters\" of Holinshed and Shakespeare that led to the word being re-interpreted as \"uncanny\", \"supernatural\". This was the primary meaning of \"weird\" until relatively recently.\n\nIn most instances from genuine mythology or folklore, the Weird Sisters are either all of the same or similar age, or one of them is distinctly older or younger than the other two. Only when each of the three has their own distinct profile, they may be the The Hecate Sisters. The Three Faces of Eve usually does not apply, because a Weird Sister may be a maiden, a mother, or a crone, but almost never a child. May be a Power Trio.\n• Little Witch Academia takes this to dizzying heights. All the witches-in-training at the school are divided into 3-girl covens who do almost everything together.\n• Tweeny Witches:\n• Arusu, Sheila, and Eva are three apprentice witches who live together in Dragon House. They have no name as a group until \"Magical Girl Squad\", where they form the Magical Girl Squad at Arusu's suggestion.\n• The Three Sages are secondary leaders of witches.\n• The special task force are a trio of combat-oriented witches sent by Atelia to recapture the fairies Arusu has released back to the wild.\n• In Marvel Comics' limited series Witches, Doctor Strange recruits the three youthful witches Jennifer Kale, Satana Hellstrom and Topaz to combat an Ancient Evil.\n• In the Vertigo Comics joint universe, the Three are the powerful women goddesses of various aspects of reality, and have many incarnations, including as the Moirae, goddesses of fate, and the Furies, goddesses of revenge. They appear often in the The Sandman, in which Dream often consults with them when he is in doubt, and they eventually kill him in their aspect of the Furies .\n• The Black Cauldron: The witches of Morva, a trio of neutral witches who possess the titular artifact.\n• Hercules: The three Fates visit Hades at the beginning of the movie and warn him about Hercules's destiny to defeat him should he attempt to start a coup on Olympus.\n• Sleeping Beauty: The three good fairies Flora, Fauna and Merryweather attend princess Aurora's baptismal celebration to confer blessings on Aurora, and after take Aurora in their care in order to protect her from Maleficent's curse.\n• The Craft has Nancy, Bonnie and Rochelle who - although searching for a fourth witch to create a Four-Element Ensemble - are still separate from Sarah. They become the film's antagonists in the third act.\n• The Witches of Eastwick revolves around a trio of single women who, by their weekly get-togethers, unknowingly form a witches' coven and discover they have the power to make wishes come true when all three of them make the same wish together.\n• Hocus Pocus revolves around the Evil Plan of three witches, the Sanderson sisters, to suck out the souls of the children of Salem, Massachusetts. Sarah is a ditzy young blond, Mary is a fat goofball, and Winifred is the scheming leader who takes herself too seriously.\n• Maleficent: In a perspective flip of Disney's Sleeping Beauty, princess Aurora is given into the care of the three female pixies Knotgrass, Flittle and Thistlewit, who however are rather incompetent at the task of raising and protecting their ward.\n• The Wizard of Oz combines two witches from the book into one - so there are now three instead of four: The Wicked Witch if the West, her sister the Wicked Witch of the East, and Glinda the Good Witch of the North.\n• Oz: The Great and Powerful follows the same tradition, with three witch characters; Glinda, Evanora and Theodora.\n• In the \"History of Troilus and Zellandine\", an episode from the chivalric romance Perceforest (France, 14th century), three goddesses attend the birth celebration of princess Zellandine. Lucina (the goddess of childbirth) confers health on Zellandine, the second, Themis (the goddess of divine law), curses her to prick her finger on a distaff and fall in a magical sleep; the third, Venus (goddess of love), promises that she will be released from Themis' curse.\n• Raphael Holinshed's Chronicles of England, Scotland and Ireland (1577) relates how the Scottish nobles Macbeth and Banquo, returning from a victorious battle and riding through \"woods and fields\" without companions, meet \"three women in strange and wild apparell, resembling creatures of [an] elder world\" in a forest clearing. Of these the first greets Macbeth as Thane of Glamis, the second as Thane of Cawdor, and the third as \"Macbeth that hereafter shall be king of Scotland\". When Banquo inquires whether they have prophecies for him too, the women predict that Banquo's descendants will be kings, whereas Macbeth will leave no heir. The prophecy that he will be king eventually encourages Macbeth (with Banquo's help) to kill King Duncan and usurp the kingdom. [T]he common opinion was, that these women were either the weird sisters, that is (as ye would say) the goddesses of destinie, or else some nymphs or feiries, indued with knowledge of prophesie by their necromanticall science, bicause euerie thing came to passe as they had spoken.\n• Invoked in Dracula, where Jonathan Harker in his journal refers to the three Brides of Dracula as \"those weird sisters\".\n• The Chronicles of Prydain: Orwen, Orddu, and Orgoch, three sisters who live in the Marshes of Morva, are hundreds (if not thousands) of years old and masters of magic. All of them appear as young beauties at night and old crones in daylight. Each of them has their distinct personality, but oddly they also seem to take turns at being each sister and are able to swap their identities between them. When Taran visits them in The Black Cauldron, they are just weaving a magical tapestry. They will never give anything for free, but are willing to bargain, or to offer advice if they like you. Word of God has it that they're also the Fates, the Furies, the Morrigan, and probably a lot more that they don't feel inclined to share.\n• Discworld: Wyrd Sisters introduces the \"coven\" of the Lancre Witches, formed by Granny Weatherwax, Nanny Ogg and Magrat Garlick (from Maskerade onwards replaced by Agnes Nitt). Wyrd Sisters explains why three witches are required for a coven: Two witches get on each other's nerves; the third one can get them to make up, so they can all get on the nerves of everyone else\n• The villains in the Dresden Files novel Blood Rites are a trio of evil ex-wives attempting to use an Evil Eye ritual curse to murder their ex-husband's possible suitors, to protect their alimonies. A magical ritual requires at least three participants to work properly, and Dresden notes that this is where the Weird Sisters \"three witches cackling around a cauldron\" stereotype comes from.\n• The villains of Warren the 13th are three witches named Annaconda, Scalene, and Isosceles who plot to find the magical All-Seeing Eye and use it for their own wicked purposes.\n• In The Worst Witch from the second book onwards, Mildred is in a Power Trio with Maud and Enid. All three are apprentice witches. In the TV series they're in a Five-Man Band instead.\n• A Tale Of...:\n• The Odd Sisters are the main antagonists of the series and appear in every book. They're witches that are involved with numerous wrongdoings in the Disney 'verse. They're a trio of identical triplets who are distant cousins of Snow White's father.\n• Discussed with Gothel and her two sisters. They're fraternal sisters but it's mentioned that identical triplet witches are considered special. As it turns out, Hazel and Primrose aren't Gothel's biological sisters. They're not even related to one another either. Their mother Manea stole them as infants to keep her daughter Gothel company .\n• Are You Afraid of the Dark?: \"The Tale of Watcher's Woods\" features a trio of Wicked Witches haunting the titular woods.\n• Charmed (1998):\n• The Charmed Ones are a group of three sisters (or half-sisters), Piper, Prue and Phoebe, who are the most powerful witches of their day. While there are actually four of them, only three are ever the Charmed Ones at any given time. Paige was brought in after Prue's death .\n• \"The Power of Three Blondes\" introduced the Stillman Sisters, evil sisters who want to steal the Halliwells' powers.\n• \"Repo Manor\" also had a trio of demons who were emulating the sisters in the hopes of stealing their powers to vanquish an enemy.\n• Chilling Adventures of Sabrina:\n• Prudence, Agatha, and Dorcas are the Alpha Bitch/Girl Posse version of this. They're even called the Weird Sisters by the other characters.\n• Sabrina and her aunts Zelda and Hilda are a more heroic example.\n• Doctor Who: In \"The Shakespeare Code\", there is a trio of witches consisting of one maiden and two crones. They are a Shout-Out to Macbeth.\n• Winnie in Free Spirit is the central of three witch sisters. Only one of them appears in the show though; the major one Cassandra.\n• Once Upon a Time:\n• Season 4 features Ursula, Maleficent and Cruella De Ville teaming up to form the Queens of Darkness.\n• The Snow Queen arc involves a spell that requires three participants to represent Ingrid's sisters. Ingrid enchants Emma and Elsa to be immune to the Shattered Sight's effects.\n• Sabrina the Teenage Witch had the Fates showing up in Season 7 - annoyed that Sabrina helped a friend cheat death.\n• Supernatural had one of the Fates show up. With a minor research flub, the one that showed up was Atropos, and she claimed that \"her two sisters are bigger and badder than [Atropos] in every way.\"\n• Witches of East End (book and TV show) revolves around a family of witches constituted by Joanna Beauchamp and her two grown-up daughters Ingrid and Freya. The show introduces a fourth witch, Wendy Beauchamp, who is Joanna's estranged sister.\n• The Worst Witch: In the TV series Agatha Cackle (who had loads of accomplices in the book) is given two partners in Betty Bindweed and Millicent Coldstone.\n• Classical Mythology:\n• In Theogony, there are three Moirai or goddesses of fate: Clotho (\"spinner\") spins the thread of life at the birth of a human being, Lachesis (\"allotter\") measures it, and Atropos (\"inevitable\"), also called Aisa (\"destiny\"), cuts it when life is at its end. The Moirai are sometimes described as ugly old women, but are also depicted as young women in works of art. Their parentage varies between sources, but they are always sisters. Atropos is usually given as the oldest. The notion of three Moirai was codified by Theogony; in traditions predating Hesiod there are two Moirai or only one Moira. The basic meaning of moira is \"lot\" or \"share\".\n• The Roman equivalent of the Moirai are the Parcae, later also Fata \"Fates\", whose names are Nona, Decuma and Morta.\n• Hecate, the goddess of magic, necromancy, and crossroads, is often depicted as \"triplicate\" in Ancient Greek art, i.e. as three young and beautiful women standing back to back to each other or against a column. Paradoxically, all three women are Hecate.\n• The Matrons (matronae, also matres \"mothers\", or matrae) were female deities worshipped by a syncretic cult practiced by Romans, Gauls and Germani in the provinces of the Western Roman Empire, chiefly in Gaul and the Rhine area, from the first to the third century CE. The matrons are exclusively known from stone images and inscriptions, which suggest that every tribe and place had its own matrons. While these matrons have no individual names that we know of, there are always three of them depicted together, usually one young unmarried woman and two elder married women.\n• Irish Mythology: The goddess of war and fate known as the Morrígan is sometimes described as just one of three sisters collectively called 'the Morrígna'. The names of the three Morrígna, who are the \"daughters of Ernmas\", are variously given as Badb, Macha and Morrígan; Badb, Macha and Nemain; Badb, Macha and Anand; Fea, Erinn and Anand, and others. Both Badb and Anand are sometimes equated with the Morrígan.\n• Sami Mythology: The three sisters Sáhráhkká, Uksáhkká and Juoksáhkka together govern childhood and in addition serve as goddesses for their separate areas of expertice. Uksáhkká (Door Goddess) governs and guards all entrances and exits. Juoksáhkká (Bow Goddess) decides that a child shall become a boy instead of a girl, and governs hunting and skiing. They are led by Sáhráhkká (the meaning of the word \"Sáhr\" is lost) who is the main goddess of birth, the protector of girl-children, and goddess of the hearth.\n• Norse Mythology:\n• According to \"Voluspa\" in the Poetic Edda, the sacred Well of Urd is guarded by three Norns (goddesses of fate) by the names of Urd (\"fate\"), Verdandi (\"happening\") and Skuld (\"destiny\"). The guardians of the Well of Urd are consistently referred to as \"maidens\", although Prose Edda (in \"Gylfaginning\") specifies that Skuld is the youngest of the three.\n• Gesta Danorum: In Book 6, King Fridleif consults \"the oracles of the Fates\" to ask for how the life of his newborn son Olvar will turn out. He goes to \"the house of the gods\" where he finds three maidens who are sisters, of which the first two grant beauty, popularity and generosity; but the third one is malicious and rules that Olvar will be considered a miser. The text leaves ambiguous whether the three women are three seers, or the Fates themselves.\n• \"The Tale of Norna-Gest\": At Nornagest's birth, his father invites three seeresses to foretell Nornagest's fate; of these the two elder ones make good predictions but the youngest curses the baby. The three women are introduced as seers, but the youngest one is then referred to as a Norn, and she pronounces a curse (not a prophecy).\n• Valkyries, the supernatural women who determine who is going to die in a battle, are distinct from but related to Norns, insofar they too govern a (very specific) kind of fate. Valkyries frequently come in groups of three or multiples of three:\n• Poetic Edda: There is a list of six valkyries in \"Voluspa\" and a list of twelve in \"Grimnismal\". The young Helgi Hjorvardsson sees nine valkyries riding by, and the giantess Hrimgred mentions she has seen Helgi being followed by twenty-seven valkyries who protect him. Volund and his two brothers encounter three valkyries spinning flax on the shore of a lake, and by taking their swan garments prevent them from turning into birds and flying away.\n• Prose Edda: There is a list of three valkyries in \"Gylfaginning\" and a list of nine in \"Skaldskaparmal\".\n• Njal's Saga: On the day of the Battle of Clontarf, a Scottish clairvoyant watches twelve valkyries weaving on a loom made of weapons and human body parts, singing a song that predicts the outcome of the battle.\n• Macbeth:\n• Macbeth's descent into villainy is triggered by his encounter with three old and freakishly ugly witches who predict that he is destined to be king of Scotland, which prompts Macbeth to murder King Duncan. In act IV, Macbeth seeks out the witches again and receives three more prophecies which lull him into a false sense of security. While the witches manipulate Macbeth, their prophecies are truthful, just worded in ways apt to be misinterpreted by Macbeth, and they do not interfere with fate directly.\n• There are also three more witches who form the company of Heccat (Hecate), and who do not have any speaking lines.\n• The Ring of the Nibelung:\n• In The Rhine-Gold, the Rhine-Maidens are three water-women who guard the magical Rhine-Gold, but lose it to Alberich who forges it into a magical ring. In Act 3 of Gotterdämmerung, Siegfried, the present owner of Alberich's ring, accidentally encounters the Rhine-Maidens who warn him about the curse of the ring and urge him to return it to the river. When Siegfried dismisses the warning, they predict Siegfried's death, which comes to pass.\n• In the beginning of Gotterdämmerung, the three Norns are seen weaving the thread of Destiny, and sing a song which predicts the burning of Valhalla and the end of the gods. The thread snaps suddenly, foreshadowing that their prophecy will come true by the end of the opera.\n• Final Fantasy X-2 - if you put all three characters in the Black Mage Dressphere (which evokes classic witch imagery) then you get this.\n• Loom: The three Elders of the Guild of Weavers are named Clotho, Lachesis and Atropos like the Moirai of Greek Mythology. The Weavers have mastered the art of weaving \"subtle patterns of influence into the very fabric of reality\" and are the keepers of the Great Loom, a device that is able to predict the future as well as to manipulate reality.\n• The Witcher 3: Wild Hunt: The Three Crones of Crookback Bog, witches and daughters of a woodland spirit who went insane, protect the wilderness of Velen from their mother and offer other services while demanding reverence and tribute, including human sacrifice (which they use to maintain illusions of eternal youth and beauty).\n• The Fates appear in God of War II as a six-foot tall warrior valkyrie with one breast visible, a giant, grotesquely fat woman with many arms and breasts and a stick-thin woman that seems to be partially made of darkness. The three are a dark representation of the Greek Moirai.\n• The Shin Megami Tensei games include the Fates - Clotho, Lachesis, and Atropos - as separate demons that can be recruited. In some games, the three can be fused together in a special process to produce Norn, which is depicted as three goddesses united around a clock.\n• Gruntilda and her sisters, Mingella and Blobbelda, in Banjo-Tooie.\n• Gargoyles: The Weird Sisters, apparently the actual ones from Macbeth, are shown as inhabitants and guardians of the enchanted island of Avalon. They all take the same form at the same time, but different people see them differently: Depending on who they are speaking to at the time, they may look like a trio of creepy little girls, old crones, aged female gargoyles, or voluptuous young 20-somethings. The latter is their preferred form and the one the audience usually sees.\n• The Simpsons:\n• In the segment \"Easy-Bake Coven\" of episode \"Treehouse of Horror VIII\", set in 1649 Springfield, Marge and her two elder twin sisters Patty and Selma are witches who intend to eat the children of the Springfieldians.\n• \"Rednecks and Broomsticks\": Lisa gets lost in the forest and runs into three teenage girls who are performing a Wicca ritual. The way the three are first seen—three cowled figures around a cauldron—alludes to the witches of Macbeth. Eventually the three invite Lisa to be the fourth member of their \"coven\", but the induction is not complete when Chief Wiggum arrests the girls for witchcraft.\n• Steven Universe: The Diamonds are supernatural Gem rulers that go by female pronouns. They're technically a quartet, but are usually shown in one trio that excludes White Diamond (in terms of interpersonal dynamics) or another that excludes Pink Diamond (in terms of Homeworld's current rulership).\n• Winx Club has the recurring villainesses the Trix coven, made up of triplet witch sisters: Icy, Darcy, and Stormy. There are also their ancestors, the First Witches of the Magic Dimension, the Ancestral Witches Belladonna, Lyslis, and Tharma.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/TheWeirdSisters", "media_links": ["/pmwiki/pmwiki.php/Film/MacBeth", "/pmwiki/pmwiki.php/Film/Inferno", "/pmwiki/pmwiki.php/Theatre/Macbeth", "/pmwiki/pmwiki.php/Myth/GreekMythology", "/pmwiki/pmwiki.php/Anime/LittleWitchAcademia", "/pmwiki/pmwiki.php/Anime/TweenyWitches", "/pmwiki/pmwiki.php/Creator/MarvelComics", "/pmwiki/pmwiki.php/ComicBook/DoctorStrange", "/pmwiki/pmwiki.php/Creator/VertigoComics", "/pmwiki/pmwiki.php/ComicBook/TheSandman", "/pmwiki/pmwiki.php/Disney/TheBlackCauldron", "/pmwiki/pmwiki.php/Disney/Hercules", "/pmwiki/pmwiki.php/Disney/SleepingBeauty", "/pmwiki/pmwiki.php/Film/TheCraft", "/pmwiki/pmwiki.php/Film/TheWitchesOfEastwick", "/pmwiki/pmwiki.php/Film/HocusPocus", "/pmwiki/pmwiki.php/Film/Maleficent", "/pmwiki/pmwiki.php/Disney/SleepingBeauty", "/pmwiki/pmwiki.php/Film/TheWizardOfOz", "/pmwiki/pmwiki.php/Film/OzTheGreatAndPowerful", "/pmwiki/pmwiki.php/Literature/Dracula", "/pmwiki/pmwiki.php/Literature/TheChroniclesOfPrydain", "/pmwiki/pmwiki.php/Literature/Discworld", "/pmwiki/pmwiki.php/Literature/DresdenFiles", "/pmwiki/pmwiki.php/Literature/BloodRites", "/pmwiki/pmwiki.php/Literature/WarrenTheThirteenth", "/pmwiki/pmwiki.php/Literature/TheWorstWitch", "/pmwiki/pmwiki.php/Literature/ATaleOf", "/pmwiki/pmwiki.php/Series/AreYouAfraidOfTheDark", "/pmwiki/pmwiki.php/Series/Charmed1998", "/pmwiki/pmwiki.php/Series/ChillingAdventuresOfSabrina", "/pmwiki/pmwiki.php/Series/DoctorWho", "/pmwiki/pmwiki.php/Series/FreeSpirit", "/pmwiki/pmwiki.php/Series/OnceUponATime", "/pmwiki/pmwiki.php/Series/SabrinaTheTeenageWitch", "/pmwiki/pmwiki.php/Series/Supernatural", "/pmwiki/pmwiki.php/Series/WitchesOfEastEnd", "/pmwiki/pmwiki.php/Series/TheWorstWitch", "/pmwiki/pmwiki.php/Myth/ClassicalMythology", "/pmwiki/pmwiki.php/Literature/Theogony", "/pmwiki/pmwiki.php/Creator/Hesiod", "/pmwiki/pmwiki.php/Myth/IrishMythology", "/pmwiki/pmwiki.php/Myth/SamiMythology", "/pmwiki/pmwiki.php/Myth/NorseMythology", "/pmwiki/pmwiki.php/Literature/PoeticEdda", "/pmwiki/pmwiki.php/Literature/ProseEdda", "/pmwiki/pmwiki.php/Literature/GestaDanorum", "/pmwiki/pmwiki.php/Literature/TheTaleOfNornaGest", "/pmwiki/pmwiki.php/Literature/PoeticEdda", "/pmwiki/pmwiki.php/Literature/ProseEdda", "/pmwiki/pmwiki.php/Theatre/Macbeth", "/pmwiki/pmwiki.php/Theatre/TheRingOfTheNibelung", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyX2", "/pmwiki/pmwiki.php/VideoGame/Loom", "/pmwiki/pmwiki.php/VideoGame/TheWitcher3WildHunt", "/pmwiki/pmwiki.php/VideoGame/GodOfWarII", "/pmwiki/pmwiki.php/Franchise/ShinMegamiTensei", "/pmwiki/pmwiki.php/VideoGame/BanjoKazooie", "/pmwiki/pmwiki.php/WesternAnimation/Gargoyles", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/WesternAnimation/StevenUniverse", "/pmwiki/pmwiki.php/WesternAnimation/WinxClub"], "non_media_links": ["/pmwiki/pmwiki.php/Main/PowerTrio", "/pmwiki/pmwiki.php/Main/FairyGodmother", "/pmwiki/pmwiki.php/Main/Seers", "/pmwiki/pmwiki.php/Main/SiblingTeam", "/pmwiki/pmwiki.php/Main/TropeCodifier", "/pmwiki/pmwiki.php/Main/WitchClassic", "/pmwiki/pmwiki.php/Main/Familiar", "/pmwiki/pmwiki.php/UsefulNotes/Christianity", "/pmwiki/pmwiki.php/Main/WickedWitch", "/pmwiki/pmwiki.php/Main/FairyGodmother", "/pmwiki/pmwiki.php/Main/Seer", "/pmwiki/pmwiki.php/Main/TropeNamer", "/pmwiki/pmwiki.php/Main/TheHecateSisters", "/pmwiki/pmwiki.php/Main/TheThreeFacesOfEve", "/pmwiki/pmwiki.php/Main/PowerTrio", "/pmwiki/pmwiki.php/Recap/TweenyWitchesDestiny20MagicalGirlSquad", "/pmwiki/pmwiki.php/Main/AncientEvil", "/pmwiki/pmwiki.php/Main/ArtifactOfDoom", "/pmwiki/pmwiki.php/Main/FourElementEnsemble", "/pmwiki/pmwiki.php/Main/EvilPlan", "/pmwiki/pmwiki.php/Main/WordOfGod", "/pmwiki/pmwiki.php/Discworld/WyrdSisters", "/pmwiki/pmwiki.php/Discworld/Maskerade", "/pmwiki/pmwiki.php/Main/EvilEye", "/pmwiki/pmwiki.php/Main/MacGuffin", "/pmwiki/pmwiki.php/Main/PowerTrio", "/pmwiki/pmwiki.php/Main/FiveManBand", "/pmwiki/pmwiki.php/Main/WickedWitch", "/pmwiki/pmwiki.php/Main/AlphaBitch", "/pmwiki/pmwiki.php/Main/GirlPosse", "/pmwiki/pmwiki.php/Recap/DoctorWhoS29E2TheShakespeareCode", "/pmwiki/pmwiki.php/Main/ShoutOut", "/pmwiki/pmwiki.php/Main/BalancingDeathsBooks", "/pmwiki/pmwiki.php/Main/Valkyries", "/pmwiki/pmwiki.php/Main/AppearanceIsInTheEyeOfTheBeholder", "/pmwiki/pmwiki.php/Recap/TheSimpsonsS9E4TreehouseOfHorrorVIII", "/pmwiki/pmwiki.php/Recap/TheSimpsonsS21E7RednecksAndBroomsticks", "/pmwiki/pmwiki.php/UsefulNotes/Wicca"]}