{"title": "Background Music Override", "content": "Callie: Agent 3! Can you hear our song?\n\nA video game trope, most seen in console RPGs.\n\nIn a game, there's generally separate Battle Theme Music and a Victory Theme. Then there's a piece of music which is so long that, in order to hear all of it in one go, the player would have to sit around in the party-menu screen doing nothing. The developers don't want that to happen, so instead they let the music stay on during battles and victories and everything else. The music overrides all other normal themes for as long as the players are in the area or for the entire duration of the sequence. This ensures the player will remember the music as intrinsically tied to that scene, area, or sequence; the player sliced monsters in half to this music, they opened treasure chests to this music, they even saw the characters do a victory dance to it.\n\nAlternately, in an intense situation, the battle theme or the regular boss theme plays during everything. It can be just as effective if the battle/boss theme is good enough.\n• Chrono Trigger:\n• The Ocean Palace, where the ominous music keeps going through the battles due to the crisis happening in-game ( The group is racing to stop Queen Zeal from summoning Lavos. ) This also happens during Magus' Castle.\n• After the Wham Episode in 2300 AD (when you discover Lavos), \"Chrono Trigger\" starts playing, and plays until you leave the Storage Area, fights or no.\n• If you have in your party during the final battle against Queen Zeal, his theme plays instead.\n• Disgaea:\n• In Disgaea 2: Cursed Memories, calling Kurtis or Axel with a cell phone will cause the music on the map to be replaced by their respective theme songs for the duration of the battle. Also, throughout the series, the Item World music changes whenever any pirates arrive on the scene, only ceasing once they've been dealt with, or if you move to the next floor.\n• In Disgaea 4: A Promise Unforgotten Axel's Love Dynamite S skill overrides the current BGM with his vocal theme \"White Tiger\" from Disgaea 2: Cursed Memories while in Disgaea Dimension 2, his Love Dynamite T skill uses his ending theme from Disgaea 4, \"Pandora Ignition\".\n• Final Fantasy:\n• FFIV plays the Boss Battle theme throughout the entire siege of Fabul, though your characters spend about as much time retreating further inward as they do fighting.\n• The After Years also plays the boss battle theme throughout the entire siege on Baron Castle; there are a couple of other instances as well with the Mysterious Girl's theme and the Archfiends' theme.\n• FFV has the Battle on the Big Bridge, the escape from Exdeath's castle takes you over the Big Bridge, which has many battles, but only one song, the awesomely, epic theme of Gilgamesh. Later in the game, when you fight randomly encountered palette swaps of Exdeath, you still hear the dungeon music and not the battle theme.\n• FFVI:\n• The encounter with Kefka in Narshe where you split your party in three groups to defeat the incoming soldiers. \"Protect the Espers!\" is playing through everything up until the confrontation with Kefka himself.\n• During the opera scene where the party has five minutes to prevent Ultros from dropping a weight onto Celes, the orchestra plays over any battle you get into to heighten the tension.\n• In the scene where you team up with Moogles to protect Terra, Locke jumps down a hole, a bunch of Moogles decides to help, heroic music (\"Locke's Theme\") starts playing, you fight your way to boss, the music changes to the equally awesome \"The Decisive Battle\" as you get destroyed by the Marshal's Charge attack, then, as you prepare to try again with a better team, the music reverts. Yes, the music is just that awesome.\n• There's also minecart sequence where you're escaping from the Vector magitech laboratory, the sequence when you're trying to get to Ultros in order to stop him from ruining the opera, and the sequence where Sabin is holding up a house while you try to save the child inside. FFVI seems to like this trope A LOT.\n• Further, during the sequence where everyone is escaping from the falling Floating Continent, the battles continue \"Metamorphosis\".\n• On The Veldt, the standard battle music does not play during fights. \"The Wild West\" (the official name of The Veldt's background tune) keeps playing.\n• In the World Of Ruin version of Narshe, \"Dark World\" keeps playing as you fight the frozen esper.\n• FFVII:\n• One of the two most prominent examples would be the Aerith Death scene, where Aerith's theme plays from Aerith being stabbed by Sephiroth, through the fight with Jenova-LIFE and until it's time to switch discs .\n• \"Opening - Bombing Mission\" is still playing during the first boss fight.\n• The battle theme version is done when you're climbing the section 7 Pillar. The regular battle theme plays through the entire climb.\n• There's also the Shinra HQ. After you break out, all you hear is \"Trail of Blood\", even during battles. Then, after the battle with Rufus, the game's normal boss battle music continues with the sequence with Rufus and as Cloud and Tifa make their escape.\n• To add to the list is the \"Attack of the Weapon\" (or, \"Weapon Raid\") track, which plays whenever the Weapons show up, and during the fights with them.\n• \"Shinra, Inc\", (or, \"Shinra Corporation\") plays during the battle against Proud Clod (or, Proudclad) in Midgar by the end of Disc 2, instead of a regular boss theme.\n• This also happens in one dungeon in Crisis Core, with its creepy, slow-paced dungeon music.\n• Also appears during the first flashback after leaving Midgar with just the chimes from the start of \"Those Chosen By The Planet\". Very creepy.\n• After the party decides to go to Midgar at the end of Disc 2, the World Map theme is locked as \"Cid's Theme\" and plays regardless of your method of transportation - walking, flying the Highwind, or riding a chocobo. It continues as such until you go to Midgar. (Once you go there, you're stuck there until you complete the events and it becomes Disc 3.)\n• Early in FFVIII, during the SeeD exam, \"The Landing\" plays from the start of the FMV sequence of the arrival at Dollet until you've reached your checkpoint at the central square.\n• FFIX:\n• The most notable is \"You Are Not Alone\". The song plays while Zidane doubts himself and his right to live, and is considered by many an absolute masterpiece from the beginning of Zidane's black thoughts until his friends have made him see that he's not alone.\n• \"Protecting My Devotion\" is also pretty epic and memorable. It plays when you are defending the city of Alexandria from Kuja's monster invasion with Steiner, and the badass guest character Beatrix.\n• FFX: The stretch from the hill where Tidus tells his story, to the gates of the Zanarkand Ruins, plays \"Fleeting Dream\" (or, \"Someday the Dream Will End\") continuously through battles.\n• Earlier in the game, on the ship before the Evrae fight, the standard battle music doesn't play and is overriden by the quieter atmospheric music on the rest of the ship\n• In FFX2, \"Yuna's Ballad\" is used as the battle theme for Bahamut. Also, \"YRP, Fight! No. 1\" plays continuously while doing the Machina Mayhem mission in Chapter 3 on the Mi'ihen Highroad until Mission Complete, or until it's over.\n• FFXIII sports the latest use of this trope in the series. It's used at least a couple of times throughout the game, most notably with the song \"Dust to Dust\" playing through the . In fact, Final Fantasy XIII absolutely loves to do this, and does it all the time, with themes such as \"Defiers of Fate\" and \"Can't Catch a Break.\"\n• After the initial string of battles in FFXIII-2, the game allows \"Full Steam Ahead\" (\"Dash\" in Japan) play through on repeat until the first fight with Gogmagog. Of course, this song features a badass violin playing like a fucking guitar, and solos for every instrument. As with Final Fantasy XIII, XIII-2 is fond of this as well and uses it in a number of other instances and areas, such as A Dying World.\n• In Final Fantasy XIV: A Realm Reborn, the background music of Garlean outposts and the beast tribes' territories plays even during battle. In Heavensward, this occurs in the Azys La zone as well.\n• Final Fantasy Type-0 normally only plays music during its battles, with a lack of music otherwise. The Clash at Big Bridge, however, has \"War: The Quiet Bloodbath\" play from the start of the mission, through a fight with a new Helldiver MA and a defense against a whole legion of Colossi, until the first save point. A little less drastic compared to X or XIII, but the guitar gives you just the moodlift you need to make it through a fight like this.\n• Used to amazing effect in Fire Emblem Awakening. After the tragic death of , when you start the next chapter, a soft, solemn piano piece (titled \"......\") is playing. Then Plegians arrive to attack you, and all you want is to run away, but you're forced to fight. So the preparation screen shows up, and...the piano piece keeps playing, instead of the usual preparation music. The simple act of choosing your units and equipping them suddenly feels somber due to what has happened. And once you actually start the chapter, you find out that the boss is a really nice and honorable guy who's only following orders to hunt you down, and is more than willing to spare you if you surrender, and that his men don't want to fight either, but he rallies them on to fight so Gangrel won't have their head. And once the fighting starts, a more bombastic, but equally tragic piece (\"Don't speak her name!\") takes over, and unlike other themes, where the music will change whether you're on the map or in a battle, the same music stays throughout. All of this combines to make it one of the most emotionally powerful moments of the game, and of the series. Later, during the final chapter, \"Id (Purpose)\" persists, whether it is the player or enemy's turn, even during battle.\n• Similarly, Fire Emblem Echoes: Shadows of Valentia overrides the standard battle themes for certain major storyline battles. The Rudolf fight has \"Lord of a Dead Empire\" play throughout the entire level, including the boss fight against Rudolf himself. The final Berkut battle has \"Praise This Despair!\" play on the field and during all fights except Berkut himself, while the Duma battle has \"Twilight of the Gods\" play for all fights except Jedah and Duma.\n• Granblue Fantasy:\n• The Drum Master class can cause this by applying a full-power Fever buff to the party via a full Chain Burst, switching the music to \"Song of the Three Men \" for the duration of the buff. Due to Drum Master's focus on meter building, it's capable of keeping the song going for quite a while.\n• The Summer version of Diantha has the music change to an instrumental version of \"Never-Ending Fantasy\" when the buff granted by her Charge Attack is active.\n• Sakura Kinomoto causes the background music to change to her iconic theme when the debuff from her Charge Attack is active.\n• Sonic Riders features two bikes named Hang-On and Super Hang-On, which are modelled after their respective arcade cabinets and replace the background music of all tracks with their themes (in Super Hang-On's case, Outride a Crisis).\n• There's a special gear part in Sonic Free Riders, unlocked by completely finishing the story that plays the main theme songs of the previous games throughout the race they're used in, overriding the regular music of the tracks.\n• Chrono Cross:\n• Used during the \"save Marbule\" quest, the Magical Dreamers music continues through battles. Justified since it's a live performance. It's also used during the battle with Miguel in the Dead Sea.\n• And in the beginning of the game we have a battle theme version, where the boss theme plays through almost the entire dream sequence (though without the chanting).\n• When Serge travels back in time to Lucca's house, \"Orphanage of Flame\" plays exclusively, including during battle.\n• At the beginning of MARDEK, the \"Mighty Heroes\" track plays throughout the entire sequence up until the boss fight. Also done in the arena: The battle music is never interrupted until the last fight, which is the only one that plays victory music.\n• In Star Ocean: The Second Story, after beating Gabriel Celesta and finishing the Cave of Trials, the \"Star Ocean Forever\" fanfare tune will start to play and will keep on playing as long as you stay in the cave. However, there won't be any enemy encounters until you exit the cave and come back (which will also reset the music). It's a swap but not an override.\n• In the Super Robot Wars games, player characters have a specific BGM that plays during the battle animations, however powerful enemy bosses will sometimes have their own BGM which will override the player characters' music.\n• In the first Super Robot Wars Original Generation game on the Gameboy Advance:\n• A bug in the programming for an enemy boss which switches to the player's side prevented his BGM priority from being reset, making it so his music overrode all the other themes in the game, including the Final Boss theme. This has become known as \"Trombe Override\" after the name of the song, . And has been added as a feature for every subsequent game in which that character appears.\n• In some climactic moments, a special theme, belonging to neither the players or the enemies will play throughout the stage, overriding both the player's and the boss's themes.\n• Of special note is the final battle of Alpha 3, where the heroic \"GONG\" plays for the entire fight... unless the Macross 7 crew attacks, in which case their music kicks in. Thoroughly justified, however: they're the ones playing GONG in the first place.\n• In Super Robot Wars UX, Fei-Yen HD overrides the music with her songs when she attacks And, unlike with previous games with licensed songs, Banpresto went the extra mile by having them be full vocal versions. Notably, this is the first time one of them, , is shown as having vocals at all!\n• In Second Original Generation: Dark Prison, when Shu Shirakawa gets the Neo Granzon, Dark Prison : Dark Prison (Ver.OGDP) will override any theme music including the Final Boss.\n• In the first two entries of Another Centurys Episode, Whenever the Layzner activates it's signature V-MAX program in-gameplay, its respective theme will instantly override the background music of whatever stage the SPT's played in for the program's duration and cool-off period. This is especially telling in the fight against Ru Kain and his Zakaal in both games, as he utilizes its own V-MAX program in a kamikaze charge against the player, thus providing the same musical override.\n• The Bottomless Pit area of The Legend of Legacy has two examples. One theme plays during all encounters of the first several areas, and the Singing Shard song plays through all encounters in the final area of the level.\n• Ace Attorney:\n• In the third case of Phoenix Wright: Ace Attorney, the normal cross-examination music is overridden with the more intense \"Pursuit ~ Cornered\" theme, after a testimony flaw is pointed out by , allowing you to continue.\n• In Ace Attorney Investigations 1 the \"Presto\" confrontation theme plays near the end of case two despite not actually cross-examining the killer, and Played for Laughs in the sequel, where Yumihiko Ichiyanagi's first argument is so overwrought and nonsensical that his extremely loopy theme music plays throughout it.\n• Ocassionally, a witness's theme will override the cross-examination theme as their testimony is given, but not during the cross-examination itself. This includes in her first testimony in the final case of Trials and Tribulations, a hip-hop beat for after his transformation in Dual Destinies, and Pees'lubn Andistan'dhin's themes \"Ethnic Music\" and \"Head Banging\" for all of his testimonies in Spirit of Justice.\n• Happens with Athena's theme, Courtroom Revolutionnaire , in the final case of Phoenix Wright: Ace Attorney \u0096 Dual Destinies. It's very fittingly used in a Mood Matrix segment, as Athena is examining Bobby Fulbright with it to show that he expresses no emotions in his voice, exactly matching Dr. Metis Cykes' psychological profile on the Phantom .\n• For the final confrontation in Trials and Tribulations, that game's Pursuit theme, \"Pursuit ~ Caught\", is overridden by a remix of \"Pursuit ~ Cornered\", the Pursuit theme from the first game.\n• In Ultimate Marvel VS Capcom 3, Phoenix Wright's normal theme is a remix of first game's \"Objection!\", but once he reaches Turnabout Mode, the music automatically changes to a remix of the iconic \"Pursuit ~ Cornered\". This theme will override any other theme playing at the time, and it will only stop playing once either Turnabout Mode ends or Phoenix gets K.O.'d.\n• Bang Shishigami of BlazBlue can use a super attack once his Fu-Rin-Ka-Zan meter is full, that overrides the battles theme song, changing it into \"Beat a nail with your hammer \"; although his never stops playing untill the match is over, as his Super Mode doesn't run out once it is activated. This is subverted as of Chronophantasma, where Fu-Rin-Ka-Zan is now his overdrive, which has a time limit, however this does not affect Unlimited Bang, who regains Fu-Rin-Ka-Zan as a distortion drive.\n• BlazBlue: Cross Tag Battle: While Bang Shishigami doesn't return, Yang Xiao Long from RWBY follows in his footsteps by replacing the background music with \"I Burn \" when she activates her Rage semblence.\n• In Cave Story's hidden final level, Sacred Grounds, the fanfares for Heart Containers and new weapons don't appear, so the track \"Running Hell\" plays uninterrupted until the Boss Bonanza at the end with . There was a new Life Capsule added in the 3D remake that they forgot to edit the jingle out for.\n• In Metroid: Samus Returns, the lava theme is capable of overriding the Metroid battle themes, regardless of which kind of Metroid you're currently facing.\n• In Monster Hunter, this has started becoming possible since Freedom Unite, when quests with more than one monster (the Epic Quests) were introduced:\n• Monster Hunter Tri has four possible battle themes for each stage: The Great Jaggi/Baggi theme, each stage's normal Monster Battle theme, the special track for the Arena, and the theme for the online-only nomad beast \"Deviljho\". Each overrides the themes before them (Jaggi/Baggi < Stage = Arena < Deviljho). Monster Hunter 3 Ultimate adds a few more songs to the mix, thus becoming Jaggi < Arzuros < Stage < Nargacuga < Zinogre < Brachydios < Tower = Arena < Deviljho.\n• 4 and 4 Ultimate introduce a slew of new themes, each having a different degree of overriding privilege, but of note is the theme used for monsters in Apex status, which has maximum BGM priority, overriding even the Arena's and Deviljho's themes.\n• Generations gives the Deviant theme maximum priority as well, even over the Arena theme.\n• World adds the theme for the High-Rank wanderer Bazelgeuse, which like Deviljho's overrides all other themes. Of course, once it attacks, you soon understand why it starts off sounding like an Air Raid siren. World's first DLC pack added the Deviljho, whose theme overrides Bazelgeuse's.\n• In the beginning of Super Mario RPG, the theme for Bowser's Castle plays over the battle theme until Mario fights Bowser.\n• Mega Man Star Force 3 had a particularly memorable bit where the WAZA HQ is under attack by clones. The Satella Police theme plays throughout, uninterrupted, until all the clones are dealt with. Unfortunately not repeated in the final stage, where touching the Crimson bits only plays the regular battle theme. Repeated in the post-game, where if an area contains an Omega Boss, a very special, dark and foreboding theme plays, not interrupting until you either leave or find the boss.\n• The Japanese-only PS2 Version of Tales of Symphonia changed a few things during the Seed Chamber scene. When the party members, thought to have been left for dead, save Lloyd, the instrumental of the opening begins to play and plays throughout the first boss battle.\n• In Super Castlevania IV, Simon's Theme starts playing once you get Dracula's health below half.\n• In Baten Kaitos Origins, during the boss battle with , the amazingly creepy song '[1] ' plays over the fight, instead of the regular boss music. Fitting, considering this is a massive Wham Episode. Earlier on, during the segment where Sagi and Guillo escape Mintaka, the normal battle music doesn't play over the first few scripted fights.\n• Tales of Phantasia has the regular battle theme replaced with \"Open Fire\" during The War Sequence in Valhalla Plains and replaced with \"Threatening Sky\" during the Pegasus sequence following shortly thereafter.\n• The climax of Professor Layton and the Last Specter has, in lieu of the normal puzzle theme, \"Theme of the Last Battle \" play while you're puzzling the antagonist into submission as well as during the intermittent cutscenes. This is repeated in Miracle Mask with the puzzle just after Randall falls into the ravine in the ruins . It also happens to be Puzzle #100.\n• The Legend of Zelda:\n• The Legend of Zelda: Link's Awakening: Getting a Piece of Power or Guardian Acorn replaces all area music with a short power-up theme.\n• The Legend of Zelda: Ocarina of Time: In Ganon's Tower, the background music keeps going during fights, rather than jumping into the standard battle music.\n• The Legend of Zelda: Majora's Mask: If Link gets to the point where there are only six in-game hours left until the moon falls, the theme of the final hours will play in the background until the moon falls or Link goes back to the first day. The theme overrides any and all songs in the game other than those of the current dungeon, mini-boss or boss.\n• In The Legend of Zelda: Twilight Princess:\n• When ; \" \" will play in all areas unless an enemy is nearby, in which case it gets overriden.\n• While you're busting through Hyrule Castle, the normal enemy music will be overriden with the sound of the rain if you're outdoors, or Hyrule Castle's theme if you're inside.\n• The underground zone of the Ancient Cistern in The Legend of Zelda: Skyward Sword has a theme that overrides the enemy music. This is the only dungeon theme in the game capable of doing this.\n• In The Legend of Zelda: Breath of the Wild, Hyrule Castle's musical theme will always play even if you encounter enemies, though a bass line and marching sound effects will be added during combat.\n• In Resident Evil 3: Nemesis, when the Big Bad Nemesis is stalking you, the BGM is overridden by \"Feel the Tense\". If playing with a scratched disc, it may be replaced by dead silence, making it even scarier.\n• In The Adventures Of Rad Gravity, if for some reason you decide to exit a boss's lair, the boss music continues to play. Conversely, the Final Dungeon uses the boss music for its main theme, but switches to the regular action music when you fight Agathos.\n• In Super Contra (arcade), the miniboss of the final stage has its own unique BGM and victory fanfare, but when the Final Boss appears, it plays the original stage music again! This may have been a programming error.\n• In Twisted Metal: Black a more frantic music theme (different for each stage) takes over when there's only one opponent left. Oddly, Snowy Roads is the only stage that lacks a normal battle theme, instead only playing its ambient track prior to the final opponent.\n• In Legend of Legaia, when you are traversing a Mist Generator dungeon, the dungeon theme continues to play during random battles. This happens again for a certain sequence in Ratayu, and then again inside the Very Definitely Final Dungeon , the Bio Castle .\n• Pokémon\n• In Pokémon Ruby and Sapphire, when either the sun has intensified or there is a massive downpour, all overworld music (including surfing and cycling) will be replaced with one ominous track.\n• In Pokémon Black and White, the dynamic music in Village Bridge will also override the surfing and cycling music.\n• Route 23 in Kanto gradually became this trope. Beginning partially with Yellow (the surf music would still play) and entirely in FireRed and LeafGreen, the dramatic background music would continue regardless of the player's current mode of transportation.\n• Since Pokémon Black and White, the Victory Road themes have consistently override the surfing and cycling music, and each Pokémon League's theme also plays even when you enter the League's Pokémon Center.\n• In Omega Ruby and Alpha Sapphire, an overworld music stays on during a battle for the first time in the series. A rock remix of Wally's theme starts playing when you find him at the end of Victory Road, and keeps playing until you defeat him in battle.\n• In Pokémon Sun and Moon, when in an area with a wild Ultra Beast, the area's BGM is replaced and overrides any other BGM (such as when riding a Ride Pokémon) until a battle (against a Trainer, a wild Pokémon, or the Ultra Beast) is initiated.\n• Once it has been revealed which final story dungeon you have to go to in Pokémon Mystery Dungeon: Rescue Team, and until you actually go there, the overworld music is overriden to the same one on all places.\n• The Binding of Isaac:\n• After beating the game 10 times, the credits music changes to a corrupted version of \"Jesus Loves Me\" .\n• In , the entire level consists of nothing but bosses, chests, and fire. The usual boss music plays nonstop until you reach the final boss, and it really sets the mood that the game—and maybe you, if you've managed to pick up a combination of game breaking items—is at an absolute breaking point and climax.\n• In Afterbirth, the \"???\" floor (or Blue Womb according to an in-game achievement) has a song that plays everywhere except the boss room. It overrides the shop theme, the usual \"jingle\" that plays upon entering a treasure room will not play, and even if the player teleports to a devil/angel room, the song will continue uninterrupted. It helps add to the eerieness of the stage and gives buildup to an extremely difficult Bonus Boss.\n• Ori and the Blind Forest:\n• After restoring the Element of Waters, the gloomy Thornfelt Swamp music is permanently replaced by the pastoral tune \"The Waters Cleansed\".\n• Once you light the Shrouded Lantern and retrieve the Gumon Seal in the Misty Woods, the creepy whole-tone scale music changes to a bright major-key arrangement.\n• In the last section of Sorrow Pass after learning the Charge Jump and before reaching the Sunstone, \"Riding The Wind\" is overridden by \"Completing the Circle\". After you descend from the summit, it changes back.\n• In Final Zone II, if playing as Momoko in Stage 4, her Theme Music Power-Up \"Don't Stop\" replaces the normal stage theme.\n• Project X Zone\n• One of the stages is from a game called -Primitive Force from a game called Gain Ground and it's from SEGA. It's the only bgm that keeps playing throughout the entire stage and at Operation Crackdown. Even better, \"Rocks\" in Chapter 27 .\n• In a New Game+, you can manually select a BGM that would play throughout the entire stage. Or you can just set it to random and be amused as Zephyr and Leanne get Ultra Violet playing on their turn. Or even Over the Clouds on Kite and Black Rose's turn.\n• In Donkey Kong 64, when you get to Hideout Helm, the level music keeps playing, even inside of the Tag Barrel or when your Kong has transformed. The only exception is during the mini games and the Battle Crown arena.\n• Paper Mario:\n• Paper Mario: Sticker Star has one battle where battle music doesn't play: five Boos in a room with a disco ball. With disco music playing after revealing them and lasting through the battle.\n• The final area of Paper Mario: Color Splash has its theme play over battles.\n• A secret code in Street Fighter X Mega Man lets you override any stage song in the game with Guile's theme from Street Fighter II (a reference to the \"Guile's theme goes with everything \" meme, and also the name of the track).\n• Wild Arms 2 has the Knightblazer theme overriding any battle theme music when Ashley transforms into his Superpowered Evil Side.\n• The stages in Playstation All Stars Battle Royale run on the theme of one PS world being attacked or taken over by another. This happens every time a new franchise shows up, most amusingly with the music from Patapon overtaking the Duel With Hades theme.\n• Happens in the EXA_PICO series, as whenever a Hymn is being sung for any reason in any of the games, it overrides all and any of the music played at the moment.\n• In Mad Father this trope is played for horror during the True Ending. If the player knows Maria's backstory and chooses to heal her after she is injured by Dr. Drevis , her theme will replace the segment's usual silence, until .\n• In Fallout 3 and Fallout: New Vegas, the Pip-Boy radio overrides the normal ambient BGM, which can be dangerous since it also cancels out the panic music.\n• Saints Row\n• Used in the second-to-last mission of Saints Row: The Third: Three Way. Halfway through the mission, the player finds out that the Big Bad is escaping, however, at the same time, the anti-gang military group STAG has kidnapped a number of Saints members, and intends to kill them by blowing up a Statue Of Liberty Expy. There is only enough time to deal with one problem. Until the player reaches the boss battle of the chosen route, Bonnie Tyler's 'Holding Out For A Hero' plays, muting out any car radio.\n• Saints Row IV:\n• Whatever music you have playing is replaced by the Warden theme whenever one of them comes into play. However, even the Warden theme has to give way against the might of the Dubstep Gun.\n• Many missions will turn off your radio, in order to play some mood-setting music, whether it be atmospheric, or one of the songs that can be heard on the radio. Examples of the latter include Insane In The Brain during the Shaundi rescue mission, Blow The Roof during Overload The Simulation, and Stan Bush's The Touch in the final mission when you obtain the Powered Armour.\n• Star Fox\n• In Star Fox 2 when fighting enemies nearby a member of Star Wolf it's possible for that member to appear mid-fight. Whatever theme was playing prior will change to Surprise Attack, Star Wolf's theme from Star Fox 2.\n• In Star Fox 64's Bolse stage, the boss theme for All-Range stages plays when the reactor emerges...but if you didn't finish off Star Wolf at Fortuna/Fichina or don't pass through that particular stage at all, Star Wolf will appear during this phase and their theme plays until you complete the stage or die, even after all of Star Wolf has been defeated.\n• The theme of the FireCrawlers in Star Fox Adventures is capable of overriding any other theme, including the barrel chase theme (as seen when Fox rides an EarthWalker in Dragon Rock and then approaches a FireCrawler). This also happens when Fox approaches a RedEye in Walled City, because they borrow this theme.\n• In Sonic Unleashed:\n• The jazzy battle theme takes over from the night stages' regular music whenever you get into a scrap with some enemies, except in the final level, Eggmanland, whose moody, climactic theme plays nonstop throughout its numerous nighttime segments.\n• In most of his playable, non-story related appearances, transforming into Super Sonic will replace the stage music either with a variant of the title theme song or a unique theme made for Super Sonic.\n• Pikmin 2, normally, has the area or cave theme heard during gameplay, subtly applying Variable Mix into it when an enemy is close, or when the characters start retrieving a treasure, or when the player switches between characters. But all of that is subject to change in one of the caves, Submerged Castle. When the Waterwraith comes into scene, the cave's music is completely gone and replaced with a sinister theme, which will keep playing even if the characters approach a treasure or enemy, and no changes will occur during a character switch either. The only music that isn't overriden is the boss theme, which is heard when the Waterwraith itself can be challenged for a definitive battle.\n• In Tetris: The Grand Master 3, the rather mellow Sakura mode music overrides all over BGM when two players are present and not playing versus mode. This leads to some completely unfitting situations for the music to play in, such as the invisible roll in Master mode and the final 300 levels of Shirase mode.\n• Guilty Gear Xrd has several moments when the BGM is overridden. For any character, successfully landing an Instant Kill switches the BGM to the game's theme, Heavy Day. Second, if while playing Ky Kiske you take too much damage, his hair becomes undone and the music switches to Holy Orders III from Guilty Gear 2. Finally, activating Sol Badguy's Dragon Install changes the BGM to Ride the Fire.\n• In the fourth Touhou fighting game, Hopeless Masquerade, after one of the fighters reaches 100% Popularity (which enables use of their Last Word), the background music is overriden by a souped-up version of that character's musical theme.\n• Both Saber and Archer can invoke this in Fate/unlimited codes. If Saber uses a burst and reveals her sword ( , usually hidden by a wind spell), a remixed version of \"Sword of Promised Victory\" will play for the duration of the burst. If Archer completes his Unlimited Blade Works chant, a remixed version of \"EMIYA\" will play for the duration of the match.\n• Activating an All-Star in Sonic & SEGA All-Stars Racing and Sonic & All-Stars Racing Transformed will change whatever is the background music to that of the All-Star's theme for all players involved. As All-Stars are huge, powerful attacks where no one is truly safe, hearing the music suddenly change is a tipoff that one's been activated, and it's important for players to remember which theme is whose to be ready for what shows up. If an All-Star activates while another one is in session, the next one will override the previous one.\n• In Shin Megami Tensei IV, activating a quest will trigger one of two Challenge Quest tracks—\"Challenge Quest α\" for hunting quests and \"Challenge Quest β\" for other quests—which will override whatever background music is playing while you're exploring, although on the Tokyo map, only \"Challenge Quest α\" will have higher priority than the map music. This can lead to some amusing results, such as replacing the climatic final dungeon tracks, or adding music to an area with no music (e.g. the various underground shelters and ).\n• In the video game Dragon Ball Z: The Legacy of Goku II, you have to get the song \"Eye of the Lion\" and give it to Hercule so that he'll move his parade float and you can talk to Piccolo. While the record is taken away from your inventory when you give it to Hercule, you can select it from your inventory before then, which will cause the song to play instead of the usual music until you go to a new screen.\n• Several WarioWare games have stages where a special music plays throughout the stage, instead of each minigame having their own theme. In the shuffle modes and microgame indexes, they play their own songs.\n• WarioWare: Twisted!: Dribble & Spitz, you even get to select the song via the radio in the intro cutscene.\n• WarioWare: Smooth Moves!: Dribble & Spitz once again and the Kelerometer.\n• Azure Striker Gunvolt\n• If the player collects over 1000 Kudos at once, the stage music is replaced with Lumen's anthem, . If the player fulfills certain conditions and synths and equips Audiolockets, Beyond the Blue can be replaced with several different songs. Additionally, if you manage this feat in the Boss Rush, you instead get the English version of Beyond the Blue, .\n• If Gunvolt dies and is resurrected with Lumen's song, he gets back all of his HP, gains unlimited EP, and the stage music is entirely replaced with the track .\n• Reincarnation also overrides the background music during the true final mission, Azure, due to Lumen entering Gunvolt's mind to resurrect and heal his wounds from Asimov's earlier gunshot\n• In Flying Warriors, when the player acquires a critical quest-important item, an upbeat remix of the series' main theme plays until the end of the stage.\n• Plants vs. Zombies 2: It's About Time:\n• The Pianist Zombie, who plays salon music as long as he's on-screen, causing all cowboy zombies to dance and switch lanes.\n• The Disco-Tron 5000, who plays futuristic disco music while summoning Disco Jetpack Zombies.\n• The Boombox Zombie, who holds up a boombox that plays romantic tunes, overriding the current music, as well as putting most plants to sleep.\n• Splatoon\n• During a Splatfest, nearly all of Inkopolis Plaza's themes are overriden by the Squid Sisters' performance of \"City of Color \". Their single can even be heard from the weapon testing area.\n• The last phase of the Final Boss includes a Theme Music Power-Up, as \"Calamari Inkantation \" overrides the boss's track . While the regular theme has some Variable Mix to it, the final track plays uninterrupted until the fight ends.\n• Normally, the last minute of a Turf War match is always accompanied by some variation of the song \"Now or Never! \". The final day of Splatoon 2's Final Fest: Splatocalypse event marked the first time in the series' history that this wasn't the case, as \"Fly Octo Fly ~ Ebb and Flow (Octo) \" played instead for the entire match.\n• A rare non-video game example, the Law & Order television series (including the various spin-offs) will occasionally forego the iconic \"Clang-clang!\" sound that accompanies scene changes and simply allow the background music to continue during moments of high drama.\n• After inflicting enough damage on Alec Travelyan in GoldenEye (1997), Settle the Score with 006 plays when he descends on the ladder.\n• In Undertale:\n• If you leave Napstablook's house with one of his CDs still playing, the music will continue playing outside. It will stop if you head east towards the Blook Acres, but if you go south to the save area, you'll enter a faux random encounter with Aaron and Woshua , where the music keeps on playing. These two do not fight you, they just get way too scared by the music to do anything and run away.\n• In order to build endgame suspense (and ensure that the player gets to hear the whole theme, as there is very little downtime between battles), the CORE (being the Very Definitely Final Dungeon) has its theme play through battles instead of Enemy Approaching, the usual battle theme.\n• Once you reach the Golden Ending, the song Reunited plays over every possible area (except Papyrus's room, the hidden Dog Room, and room_mysteryman) until you initiate the credits, even over Temmie Village and Bird That Carries You Over A Disproportionately Small Gap. This is likely an allusion to EarthBound, which Toby Fox is a great fan of and which served as a major inspiration for Undertale.\n• In the Genocide Route, entering an empty encounter after having killed off all the monsters in an area will cause the unsettling growling noise you get as the \"fight\" BGM, aptly titled \" But Nobody Came \", to stick with you for most of what's ahead in the given area. Though the main reason this happens is to indicate you finished up \"cleansing\" this area of monsters. This also doubles as a Musical Spoiler if you're into fiddling with audio files. Turns out this is a 1200% slower version of Flowey's Theme\n• Super Smash Bros.:\n• In the original Super Smash Bros., Training Mode plays its own theme during gameplay instead of the chosen stage's normal theme. Since this does not happen in later games, it can be attributed to Early Installment Weirdness.\n• In Super Smash Bros. for Nintendo 3DS/Wii U, Cloud's victory theme is the victory music from his home game. When he wins a match, this theme overrides the normal battle results track.\n• In Super Smash Bros. Ultimate, Joker like Cloud his victory theme - the exact same as Persona 5 - takes over the normal post-fight fanfare and endlessly loops. Joker also marks the first time a single character has more than one victory fanfare in the same game: the results themes from Persona 3 and Persona 4 play instead if he wins a match on Mementos while songs from either one of those games are playing.\n• Sometimes in Rakenzarn Tales, character themes for original characters play during their respective sidequests. Deadpool invokes this by playing his Marvel vs. Capcom 3 theme during the climax of Chapter 9.\n• The Trails games in the Legend of Heroes series love doing this.\n• In Trails in the Sky FC it happens while .\n• In Trails in the Sky SC, it happens again while .\n• In Trails of Cold Steel it occurs during the In Medias Res opening sequence and later much more extensively when you replay that sequence in much more detail in Chapter 5 of the game.\n• Super Baseball Simulator 1000 replaces the stadium themes with a fight song-style motif when a player is on third base. Another special tune plays in all stadiums when both teams are in the Ultra League.\n• In Tales of Zestiria:\n• Following the battle with the , \"Rising Up (Reprise)\" is continuous in Glaivend Basin once you're able to return there. If you do the sidequest for fighting the Medusa hellions, then it switches to just being the location theme, with the normal battle and victory music playing during battles, but it returns to continuous status if you complete that sidequest.\n• In the four Trial Shrine dungeons, the background music is used both in and out of battles, giving you a chance to enjoy some of the best music in the game.\n• In Persona 5, the song \"Life Will Change\" plays on any day you go to challenge the boss of a dungeon, overriding the regular dungeon, safe room, and battle themes. In fact, it only turns off when you challenge bosses or mini-bosses.\n• In Shin Megami Tensei: Persona games, starting with Persona 3, the music in town will be replaced by a more foreboding one once the game reaches its final month(s).\n• In the final level of Freedom Planet, the life-up jingle is muted, letting the various versions of the Final Dreadnought continue to play. Considering they're all remixes of Lord Brevon's leitmotif, it's appropriate.\n• The Xenoblade Chronicles series has a theme for certain Boss in Mook Clothing enemies. Given that they can be twice the level of the party when they first enter the area at the very least, having it start up in the middle of an ordinary fight is a warning that it's time to run.\n• In ''Amagon, Zone 4 's ear-piercingly high-pitched BGM plays uninterrupted through the entire zone, overriding both Megagon's Power Up Motif and the Battle Theme Music.\n• In The Very Definitely Final Dungeon of Tales of Berseria, the dungeon-exploration track, \"The way of the embodied dragon ,\" continues throughout basic battles and victory screens. (Bosses have their own music.)\n• Any time you encounter Lu Bu in Koei's various Dynasty Warriors titles or its Gaiden Games, you can expect to hear one of the many renditions of his distinctive and badass themes until you either beat him, he flees for a story event, or you get your ass kicked.\n• In BoxxyQuest: The Gathering Storm, this happens in each of the last three main storyline dungeons.\n• Atelier Lydie & Suelle: The Alchemists and the Mysterious Paintings:\n• Combination Attacks now have their own musical theme that override the battle music, the first time such has happened since Sophie got rid of special finishers.\n• The mysterious painting Heavenly Flower Garden has its own theme which plays throughout exploring it, including the battle and victory screens.\n• In Max Payne 3, during the climactic battle at the Sao Paulo airport, \"Tears\" overrides the level's Variable Mix music.\n• This is a common trope for Invincibility Power-Ups (e.g. the Super Mario Bros. Starman, Kirby Invincibility Candy), adding to the sense of power and brief unstoppability.\n• When Kirby rides the Animal Friends Rick the Hamster, Coo the Owl, or Kine the Fish in Kirby's Dream Land 2, the partner's respective theme replaces the level music.\n• Entering Climax mode in Revue Starlight ReLIVE has your team's selected Revue Song override the standard battle music—or in PvP, your opponent's selected Revue Song if they entered Climax mode before you.\n• In Syphon Filter 2, the Agency Biolab Infiltration level lacks an alert BGM, so the creepy ambience continues to play after the alarm is triggered. Conversely, the following level, Agency Biolab Escape, uses the Aljir Prison Escape alert music for its entirety.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/BackgroundMusicOverride", "media_links": ["/pmwiki/pmwiki.php/VideoGame/Splatoon", "/pmwiki/pmwiki.php/VideoGame/ChronoTrigger", "/pmwiki/pmwiki.php/Franchise/Disgaea", "/pmwiki/pmwiki.php/VideoGame/Disgaea2CursedMemories", "/pmwiki/pmwiki.php/VideoGame/Disgaea4APromiseUnforgotten", "/pmwiki/pmwiki.php/VideoGame/Disgaea2CursedMemories", "/pmwiki/pmwiki.php/VideoGame/DisgaeaDimension2", "/pmwiki/pmwiki.php/Franchise/FinalFantasy", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyIV", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyIVTheAfterYears", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyV", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyVI", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyVII", "/pmwiki/pmwiki.php/VideoGame/CrisisCore", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyVIII", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyIX", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyX", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyX2", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyXIII", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyXIII2", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyXIV", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyType0", "/pmwiki/pmwiki.php/VideoGame/FireEmblemAwakening", "/pmwiki/pmwiki.php/VideoGame/FireEmblemGaiden", "/pmwiki/pmwiki.php/VideoGame/GranblueFantasy", "/pmwiki/pmwiki.php/VideoGame/SonicRiders", "/pmwiki/pmwiki.php/VideoGame/SonicFreeRiders", "/pmwiki/pmwiki.php/VideoGame/ChronoCross", "/pmwiki/pmwiki.php/VideoGame/MARDEK", "/pmwiki/pmwiki.php/VideoGame/StarOcean", "/pmwiki/pmwiki.php/VideoGame/SuperRobotWars", "/pmwiki/pmwiki.php/VideoGame/SuperRobotWarsOriginalGeneration", "/pmwiki/pmwiki.php/VideoGame/SuperRobotWarsUX", "/pmwiki/pmwiki.php/VideoGame/SuperRobotWarsOriginalGeneration", "/pmwiki/pmwiki.php/VideoGame/SuperRobotWarsEX", "/pmwiki/pmwiki.php/Franchise/AceAttorney", "/pmwiki/pmwiki.php/VisualNovel/PhoenixWrightAceAttorney", "/pmwiki/pmwiki.php/VisualNovel/AceAttorneyInvestigations", "/pmwiki/pmwiki.php/VisualNovel/PhoenixWrightAceAttorneyDualDestinies", "/pmwiki/pmwiki.php/VideoGame/UltimateMarvelVSCapcom3", "/pmwiki/pmwiki.php/VideoGame/BlazBlue", "/pmwiki/pmwiki.php/VideoGame/BlazBlueCrossTagBattle", "/pmwiki/pmwiki.php/VideoGame/CaveStory", "/pmwiki/pmwiki.php/VideoGame/MetroidSamusReturns", "/pmwiki/pmwiki.php/VideoGame/MonsterHunter", "/pmwiki/pmwiki.php/VideoGame/SuperMarioRPG", "/pmwiki/pmwiki.php/VideoGame/MegaManStarForce", "/pmwiki/pmwiki.php/VideoGame/TalesOfSymphonia", "/pmwiki/pmwiki.php/VideoGame/SuperCastlevaniaIV", "/pmwiki/pmwiki.php/VideoGame/BatenKaitosOrigins", "/pmwiki/pmwiki.php/VideoGame/TalesOfPhantasia", "/pmwiki/pmwiki.php/VideoGame/ProfessorLaytonAndTheLastSpecter", "/pmwiki/pmwiki.php/VideoGame/ProfessorLaytonAndTheMiracleMask", "/pmwiki/pmwiki.php/Franchise/TheLegendOfZelda", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaLinksAwakening", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaOcarinaOfTime", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaMajorasMask", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaTwilightPrincess", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaSkywardSword", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaBreathOfTheWild", "/pmwiki/pmwiki.php/VideoGame/ResidentEvil3Nemesis", "/pmwiki/pmwiki.php/VideoGame/TheAdventuresOfRadGravity", "/pmwiki/pmwiki.php/VideoGame/Contra", "/pmwiki/pmwiki.php/VideoGame/TwistedMetalBlack", "/pmwiki/pmwiki.php/VideoGame/LegendOfLegaia", "/pmwiki/pmwiki.php/Franchise/Pokemon", "/pmwiki/pmwiki.php/VideoGame/PokemonRubyAndSapphire", "/pmwiki/pmwiki.php/VideoGame/PokemonBlackAndWhite", "/pmwiki/pmwiki.php/VideoGame/PokemonBlackAndWhite", "/pmwiki/pmwiki.php/VideoGame/PokemonRubyAndSapphire", "/pmwiki/pmwiki.php/VideoGame/PokemonSunAndMoon", "/pmwiki/pmwiki.php/VideoGame/PokemonMysteryDungeonRescueTeam", "/pmwiki/pmwiki.php/VideoGame/TheBindingOfIsaac", "/pmwiki/pmwiki.php/VideoGame/OriAndTheBlindForest", "/pmwiki/pmwiki.php/VideoGame/ProjectXZone", "/pmwiki/pmwiki.php/VideoGame/ResonanceOfFate", "/pmwiki/pmwiki.php/VideoGame/DevilMayCry", "/pmwiki/pmwiki.php/VideoGame/GodsEaterBurst", "/pmwiki/pmwiki.php/VideoGame/DotHackR1Games", "/pmwiki/pmwiki.php/VideoGame/DonkeyKong64", "/pmwiki/pmwiki.php/VideoGame/PaperMario", "/pmwiki/pmwiki.php/VideoGame/PaperMarioStickerStar", "/pmwiki/pmwiki.php/VideoGame/PaperMarioColorSplash", "/pmwiki/pmwiki.php/VideoGame/StreetFighterXMegaMan", "/pmwiki/pmwiki.php/VideoGame/StreetFighterII", "/pmwiki/pmwiki.php/VideoGame/WildArms2", "/pmwiki/pmwiki.php/VideoGame/PlaystationAllStarsBattleRoyale", "/pmwiki/pmwiki.php/VideoGame/Patapon", "/pmwiki/pmwiki.php/VideoGame/ExaPico", "/pmwiki/pmwiki.php/VideoGame/MadFather", "/pmwiki/pmwiki.php/VideoGame/Fallout3", "/pmwiki/pmwiki.php/VideoGame/FalloutNewVegas", "/pmwiki/pmwiki.php/Franchise/SaintsRow", "/pmwiki/pmwiki.php/VideoGame/SaintsRowTheThird", "/pmwiki/pmwiki.php/VideoGame/SaintsRowIV", "/pmwiki/pmwiki.php/Franchise/StarFox", "/pmwiki/pmwiki.php/VideoGame/StarFox2", "/pmwiki/pmwiki.php/VideoGame/StarFox64", "/pmwiki/pmwiki.php/VideoGame/StarFoxAdventures", "/pmwiki/pmwiki.php/VideoGame/SonicUnleashed", "/pmwiki/pmwiki.php/VideoGame/Pikmin", "/pmwiki/pmwiki.php/VideoGame/TetrisTheGrandMaster", "/pmwiki/pmwiki.php/VideoGame/GuiltyGear", "/pmwiki/pmwiki.php/VideoGame/TouhouProject", "/pmwiki/pmwiki.php/VideoGame/FateUnlimitedCodes", "/pmwiki/pmwiki.php/VideoGame/SegaSuperstars", "/pmwiki/pmwiki.php/VideoGame/ShinMegamiTenseiIV", "/pmwiki/pmwiki.php/VideoGame/DragonballZTheLegacyOfGoku", "/pmwiki/pmwiki.php/VideoGame/WarioWare", "/pmwiki/pmwiki.php/VideoGame/AzureStrikerGunvolt", "/pmwiki/pmwiki.php/VideoGame/PlantsVsZombies2ItsAboutTime", "/pmwiki/pmwiki.php/VideoGame/Splatoon", "/pmwiki/pmwiki.php/VideoGame/Splatoon2", "/pmwiki/pmwiki.php/Series/LawAndOrder", "/pmwiki/pmwiki.php/VideoGame/GoldenEye1997", "/pmwiki/pmwiki.php/VideoGame/Undertale", "/pmwiki/pmwiki.php/VideoGame/EarthBound", "/pmwiki/pmwiki.php/VideoGame/SuperSmashBros", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyVII", "/pmwiki/pmwiki.php/VideoGame/SuperSmashBrosUltimate", "/pmwiki/pmwiki.php/VideoGame/Persona5", "/pmwiki/pmwiki.php/VideoGame/RakenzarnTales", "/pmwiki/pmwiki.php/VideoGame/MarvelVsCapcom3", "/pmwiki/pmwiki.php/VideoGame/KisekiSeries", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfHeroesTrailsInTheSky", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfHeroesTrailsOfColdSteel", "/pmwiki/pmwiki.php/VideoGame/TalesOfZestiria", "/pmwiki/pmwiki.php/VideoGame/Persona5", "/pmwiki/pmwiki.php/Franchise/ShinMegamiTenseiPersona", "/pmwiki/pmwiki.php/VideoGame/Persona3", "/pmwiki/pmwiki.php/VideoGame/FreedomPlanet", "/pmwiki/pmwiki.php/VideoGame/XenobladeChronicles", "/pmwiki/pmwiki.php/VideoGame/Amagon", "/pmwiki/pmwiki.php/VideoGame/TalesOfBerseria", "/pmwiki/pmwiki.php/VideoGame/DynastyWarriors", "/pmwiki/pmwiki.php/VideoGame/BoxxyQuestTheGatheringStorm", "/pmwiki/pmwiki.php/VideoGame/AtelierLydieAndSuelleTheAlchemistsAndTheMysteriousPaintings", "/pmwiki/pmwiki.php/VideoGame/AtelierSophieTheAlchemistOfTheMysteriousBook", "/pmwiki/pmwiki.php/VideoGame/MaxPayne", "/pmwiki/pmwiki.php/Franchise/SuperMarioBros", "/pmwiki/pmwiki.php/Franchise/Kirby", "/pmwiki/pmwiki.php/VideoGame/KirbysDreamLand2", "/pmwiki/pmwiki.php/Anime/ShoujoKagekiRevueStarlight", "/pmwiki/pmwiki.php/VideoGame/SyphonFilter"], "non_media_links": ["/pmwiki/pmwiki.php/Main/BattleThemeMusic", "/pmwiki/pmwiki.php/Main/LongSongShortScene", "/pmwiki/pmwiki.php/Main/EldritchAbomination", "/pmwiki/pmwiki.php/Main/WhamEpisode", "/pmwiki/pmwiki.php/Main/MysteriousWaif", "/pmwiki/pmwiki.php/Main/DegradedBoss", "/pmwiki/pmwiki.php/Main/MinecartMadness", "/pmwiki/pmwiki.php/Main/FloatingContinent", "/pmwiki/pmwiki.php/Main/YouAreNotAlone", "/pmwiki/pmwiki.php/Main/OneWomanWail", "/pmwiki/pmwiki.php/Main/AmericanKirbyIsHardcore", "/pmwiki/pmwiki.php/Main/MundaneMadeAwesome", "/pmwiki/pmwiki.php/Main/AntiVillain", "/pmwiki/pmwiki.php/Main/AFatherToHisMen", "https://www.youtube.com/watch?v=L5blz6NDxNI", "https://www.youtube.com/watch?v=xIKsjEfsHWQ", "/pmwiki/pmwiki.php/Main/JustifiedTrope", "/pmwiki/pmwiki.php/UsefulNotes/GameboyAdvance", "/pmwiki/pmwiki.php/Main/GoodBadBugs", "/pmwiki/pmwiki.php/Main/FinalBoss", "https://www.youtube.com/watch?v=7r8b3NqevME", "/pmwiki/pmwiki.php/Main/Macross7", "/pmwiki/pmwiki.php/Main/DLC", "https://www.youtube.com/watch?v=RhIPKvCqRnw", "/pmwiki/pmwiki.php/Main/FinalBoss", "/pmwiki/pmwiki.php/VideoGames/AnotherCenturysEpisode", "/pmwiki/pmwiki.php/Videogame/TheLegendOfLegacy", "/pmwiki/pmwiki.php/Main/PlayedForLaughs", "/pmwiki/pmwiki.php/Main/SmallNameBigEgo", "https://www.youtube.com/watch?v=_YF5kO5_oHw", "/pmwiki/pmwiki.php/Main/SuperMode", "https://www.youtube.com/watch?v=PFNCD22jkJk&feature=related", "/pmwiki/pmwiki.php/Main/SuperMode", "/pmwiki/pmwiki.php/WebAnimation/RWBY", "https://www.youtube.com/watch?v=_XoOt-5pW_Q", "/pmwiki/pmwiki.php/Main/HeartContainer", "/pmwiki/pmwiki.php/Main/BossBonanza", "/pmwiki/pmwiki.php/SugarWiki/AwesomeMusic", "/pmwiki/pmwiki.php/Main/NoExportForYou", "/pmwiki/pmwiki.php/Main/ThemeMusicPowerUp", "/pmwiki/pmwiki.php/Main/ThatOneBoss", "https://www.youtube.com/watch?v=tHoXjLu2rmE", "/pmwiki/pmwiki.php/Main/WhamEpisode", "/pmwiki/pmwiki.php/Main/TheWarSequence", "/pmwiki/pmwiki.php/Main/HighAltitudeBattle", "https://www.youtube.com/watch?v=0wKd7Afv4Vo", "/pmwiki/pmwiki.php/Main/MundaneMadeAwesome", "/pmwiki/pmwiki.php/Main/VariableMix", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/FinalDungeon", "/pmwiki/pmwiki.php/Main/FinalBoss", "/pmwiki/pmwiki.php/Main/VeryDefinitelyFinalDungeon", "/pmwiki/pmwiki.php/Main/IronicNurseryTune", "/pmwiki/pmwiki.php/Main/TheVeryDefinitelyFinalDungeon", "/pmwiki/pmwiki.php/Main/GameBreaker", "/pmwiki/pmwiki.php/Main/BonusBoss", "/pmwiki/pmwiki.php/Main/NightmareFuel", "/pmwiki/pmwiki.php/Main/DreamMelody", "/pmwiki/pmwiki.php/Main/ThemeMusicPowerUp", "https://www.youtube.com/watch?v=Gi6BlxUycK8", "https://www.youtube.com/watch?v=o3LbWcfJTio", "/pmwiki/pmwiki.php/Main/NewGamePlus", "http://knowyourmeme.com/memes/guiles-theme-goes-with-everything", "/pmwiki/pmwiki.php/Main/SuperpoweredEvilSide", "https://www.youtube.com/watch?v=CpfNhztWQfc", "/pmwiki/pmwiki.php/Main/TrueEnding", "/pmwiki/pmwiki.php/Main/SongsInTheKeyOfPanic", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/LoudOfWar", "/pmwiki/pmwiki.php/Main/PoweredArmour", "/pmwiki/pmwiki.php/Main/TheVeryDefinitelyFinalDungeon", "/pmwiki/pmwiki.php/Main/MarathonLevel", "/pmwiki/pmwiki.php/Main/GoldenSuperMode", "/pmwiki/pmwiki.php/Main/TriumphantReprise", "/pmwiki/pmwiki.php/Main/PowerUpMotif", "/pmwiki/pmwiki.php/Main/VariableMix", "/pmwiki/pmwiki.php/Main/SoundtrackDissonance", "/pmwiki/pmwiki.php/SugarWiki/AwesomeMusic", "/pmwiki/pmwiki.php/Main/OrchestralBombing", "/pmwiki/pmwiki.php/Main/SuperPoweredEvilSide", "/pmwiki/pmwiki.php/Main/MetalScream", "/pmwiki/pmwiki.php/Main/LimitBreak", "/pmwiki/pmwiki.php/Main/LimitBreak", "/pmwiki/pmwiki.php/Main/Invocation", "/pmwiki/pmwiki.php/Main/SoundtrackDissonance", "/pmwiki/pmwiki.php/Main/ItMakesSenseInContext", "https://www.youtube.com/watch?v=nPZAX64do4Y", "https://www.youtube.com/watch?v=qbg2E4hAoH0", "https://www.youtube.com/watch?v=ogCTyhbQr-A", "https://www.youtube.com/watch?v=KcQoPtFuGDY", "https://www.youtube.com/watch?v=pYsmtOHFiyo", "https://www.youtube.com/watch?v=KTSen9v3uoE", "https://www.youtube.com/watch?v=2IQ21t6NZNA", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Main/BossRush", "https://www.youtube.com/watch?v=tHj2EZG-qyo", "https://www.youtube.com/watch?v=OGzZS2eadWY", "/pmwiki/pmwiki.php/Main/TriumphantReprise", "/pmwiki/pmwiki.php/Main/SummonBackupDancers", "/pmwiki/pmwiki.php/Main/FictionalHoliday", "/pmwiki/pmwiki.php/Main/HubWorld", "/pmwiki/pmwiki.php/Main/IdolSinger", "https://youtu.be/wxkKUbNnXKE?t=9m5s", "/pmwiki/pmwiki.php/Main/FinalBoss", "/pmwiki/pmwiki.php/Main/ThemeMusicPowerUp", "https://youtu.be/wxkKUbNnXKE?t=19m4s", "/pmwiki/pmwiki.php/Main/VariableMix", "https://youtu.be/wxkKUbNnXKE?t=5m27s", "/pmwiki/pmwiki.php/Main/GrandFinale", "https://youtu.be/jGZW_Uvhvvk?t=29m37s", "https://www.youtube.com/watch?v=Jp6wad2yXs4", "https://www.youtube.com/watch?v=P5eUOZIRGIA", "/pmwiki/pmwiki.php/Main/VeryDefinitelyFinalDungeon", "/pmwiki/pmwiki.php/Main/GoldenEnding", "/pmwiki/pmwiki.php/Main/DevelopersRoom", "/pmwiki/pmwiki.php/Main/ExactlyWhatItSaysOnTheTin", "https://www.youtube.com/watch?v=L9EPrZvArYo", "/pmwiki/pmwiki.php/Main/MusicalSpoiler", "https://www.youtube.com/watch?v=L2RT1ZiOtHQ", "https://www.youtube.com/watch?v=2ycv3BiMGsw", "/pmwiki/pmwiki.php/Main/EarlyInstallmentWeirdness", "https://www.youtube.com/watch?v=obhkiPewDBU", "/pmwiki/pmwiki.php/Main/InMediasRes", "/pmwiki/pmwiki.php/Main/SongsInTheKeyOfPanic", "/pmwiki/pmwiki.php/SugarWiki/AwesomeMusic", "/pmwiki/pmwiki.php/Main/EarlyInstallmentWeirdness", "/pmwiki/pmwiki.php/Main/BossInMookClothing", "https://www.youtube.com/watch?v=IL34n0kIezM", "/pmwiki/pmwiki.php/Main/HellIsThatNoise", "/pmwiki/pmwiki.php/Main/PowerUpMotif", "/pmwiki/pmwiki.php/Main/BattleThemeMusic", "/pmwiki/pmwiki.php/Main/TheVeryDefinitelyFinalDungeon", "https://youtu.be/zI5rrFORcEs", "/pmwiki/pmwiki.php/Main/BloodKnight", "/pmwiki/pmwiki.php/Main/OneManArmy", "/pmwiki/pmwiki.php/Main/GaidenGame", "/pmwiki/pmwiki.php/Main/VariableMix", "/pmwiki/pmwiki.php/Main/InvincibilityPowerUp", "/pmwiki/pmwiki.php/Main/SongsInTheKeyOfPanic", "/pmwiki/pmwiki.php/Main/DroneOfDread", "/pmwiki/pmwiki.php/Main/SoundtrackDissonance"]}