{"title": "Plot-Sensitive Snooping Skills", "content": "A character who shows incredible insight into the minds of strangers is more or less blind to the secrets of his or her own inner circle. This is generally done because the writers want it that way; if the character were to learn the motivations of his/her nearest and dearest, the series would run out of material a good ten or twelve episodes early. The character is not unobservant, per se, but is only really capable of guessing whatever the writer wants him or her to guess - and that rarely includes devastating revelations that have a personal effect on the guesser or that would cause an untimely plot twist. A requirement for the Chaste Hero.\n\nA kind of involuntary Selective Obliviousness, insofar as it is not an intentional refusal to guess at (or acknowledge) the truth. Also a frequent cause of Failed a Spot Check. Not exactly unknown in Real Life; compare The Cobbler's Children Have No Shoes. Not to be confused with Exact Eavesdropping, which is about plot-sensitive good luck in the accidental or deliberate discovery of a secret.\n• Usagi from Sailor Moon is a particularly egregious case. A number of one-shot characters fail to hide their innermost secrets from her, but she never notices her little brother's crush on Ami in the fourth season Beach Episode.\n• Robert DeNiro's character in Meet the Parents, who discovers all sorts of unsavory things about his future son in law, but has no clue (even when said clues are waved in his face) that his own son smokes pot. He also comes to some incorrect conclusions because he didn't bother to deconflict the different people with the same name, a mistake that is only possible if everyone involved ignores the fact that there might be more than one person with his same (or similar) name.\n• In Sonya Sones's young adult novel One of Those Hideous Books Where the Mother Dies, Ruby claims that, like her mother, she has a \"gaydar\" that's never wrong in detecting gay people. Her gaydar leads her to believe that Max, one of the workers for her father, is gay, which turns out to be right on the mark, but completely fails in regards to her own father who turns out to be the guy Max's dating. In fact, she kept on thinking that her father had something going on with Cameron Diaz who occasionally drops by (he's a famous movie star) even when it became clear that he and Max know each other really well.\n• Sostratos in the Over the Wine-Dark Sea series has an interesting justification. While he is too socially awkward to know how the sailors around him think, he can keep pace with the murderous politics of the Hellenic world because his historical studies made him accustomed to how warlords think at least, even if he can't understand ordinary people. This skill proves useful from time to time while trading in dangerous places.\n• Galaxy of Fear's Tash Arranda is an untrained Force-Sensitive. She knows her uncle is hiding something right from the start of the first book, but in The Swarm, when Zak has a secret he desperately wants to unload but can't seem to just spit out, she's totally oblivious and keeps interrupting.\n• The television show Profiler, and every show like it. Sure, she can look at a handful of clues and figure out why the killer liked the color purple (or whatever), but she can't look at years of evidence and figure out who has a crush on her, or what her daughter is up to, or anything personal.\n• Kate (and to some extent, nearly everyone) on NCIS. Kate is supposed to be an amazing profiler because of her Secret Service training, but she was the most oblivious person on the team until McGee showed up.\n• You would think the profilers on Criminal Minds are a justified example, since they have a rule about not profiling each other, but their camaraderie is so strong that they really can't keep secrets from the team for long and they all are basically each other's therapists.\n• Fraser on Due South, having been Raised by Wolves.\n• Breaking Bad: Hank Schrader, a competent DEA agent, with regard to his brother-in-law Walter White. A chance discovery at Walter's house finally opens his eyes at the end of episode 5x08.\n• Shawn Spencer in Psych completely misreads Juliet's friendliness and touchiness with another cop as completely familial. This is in spite of having severe UST with her.\n• Sherlock can work out Watson's military career and family life from scratches on his phone but doesn't work out that a woman putting on lipstick and asking him if he'd like a coffee is hitting on him.\n• This applies to inspector Faber from the german Tatort (site of crime) crime series. Faber is quite brilliant in putting himself in other people's shoes and acting just the way it's necessary to get information from witnesses and suspects. But he mostly fails social skills altogether when it comes to his colleagues - pretty much the only people he has steady social contacts with since his wife and his little daughter died in a car accident . He doesn't really care for them - maybe except from Böhnisch he most frequently works directly together with - and often is inept for team work.\n• Pretty much any reporter or detective supporting character of a superhero.\n• But not always. It's implied that Commissioner Gordon has a pretty good idea as to who Batman really is, but he doesn't attempt to prove this, because if he officially knew who Gotham's top vigilante was, he'd be obliged to do something about him. During No Man's Land, Batman removed his mask but Gordon kept his eyes closed (no, really). Batman strongly suspects that Perry White figured out that Clark Kent is Superman quite some time ago and has chosen to keep silent.\n• In Batman Year One, it's all but said that Gordon knows. As his partner points out, he's the only one in Gotham with the time and money. But there's no evidence, just a convenient collection of alibis and 'accidental injuries' right where Batman would have them.\n• This leads to the I Know You Know I Know scene at the climax when Batman (out of costume) saves Gordon's son. Gordon conveniently blames the loss of his glasses for preventing him from recognizing the man standing no more than two feet away from him who hands him the child. Batman made no attempt to hide his identity, and clearly recognizes that Gordon is willing to protect his secret.\n• Often applies to villains as well; Superman's disguise as Clark Kent is never picked up on by Lex Luthor, one of the smartest men in the world who sees both Superman and Clark quite often. (At least one story in which he has the connection pointed out to him and backed with up evidence suggests that the dismisses it not because he's blind to the facts as such, but because he can't bring himself to believe that somebody with Superman's powers would ever invest so much time into a complete second life as a \"mere\" reporter.)\n• Notably averted in the early days of the Amazing Spider-Man, as two of the sharpest folks supporting Spidey were NYPD captain George Stacy (Gwen's dad) and Bugle editor Robbie Robertson. They both worked out Spider-Man = Peter Parker, but they kept up the masquerade because they approved of Peter's actions.\n• In Fans!, Rikk seems to have some kind of mental block that prevents him from realizing that Rumy is in love with him, despite having been outright told so on multiple occasions. Frequently lampshaded by his friends and later, even by himself .", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/PlotSensitiveSnoopingSkills", "media_links": ["/pmwiki/pmwiki.php/WesternAnimation/JusticeLeague", "/pmwiki/pmwiki.php/Manga/SailorMoon", "/pmwiki/pmwiki.php/Film/MeetTheParents", "/pmwiki/pmwiki.php/Literature/OverTheWineDarkSea", "/pmwiki/pmwiki.php/Literature/GalaxyOfFear", "/pmwiki/pmwiki.php/Series/Smallville", "/pmwiki/pmwiki.php/Series/Profiler", "/pmwiki/pmwiki.php/Series/NCIS", "/pmwiki/pmwiki.php/Series/CriminalMinds", "/pmwiki/pmwiki.php/Series/DueSouth", "/pmwiki/pmwiki.php/Series/BreakingBad", "/pmwiki/pmwiki.php/Series/Merlin2008", "/pmwiki/pmwiki.php/Series/Psych", "/pmwiki/pmwiki.php/Series/Sherlock", "/pmwiki/pmwiki.php/Webcomic/Fans"], "non_media_links": ["/pmwiki/pmwiki.php/Main/TrueCompanions", "/pmwiki/pmwiki.php/Main/ChasteHero", "/pmwiki/pmwiki.php/Main/SelectiveObliviousness", "/pmwiki/pmwiki.php/Main/FailedASpotCheck", "/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/Main/TheCobblersChildrenHaveNoShoes", "/pmwiki/pmwiki.php/Main/ExactEavesdropping", "/pmwiki/pmwiki.php/Main/Anime", "/pmwiki/pmwiki.php/Main/Manga", "/pmwiki/pmwiki.php/JustForFun/Egregious", "/pmwiki/pmwiki.php/Main/BeachEpisode", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/LiveActionTelevision", "/pmwiki/pmwiki.php/Main/ThereAreNoTherapists", "/pmwiki/pmwiki.php/Main/RaisedByWolves", "/pmwiki/pmwiki.php/Main/Cliffhanger", "/pmwiki/pmwiki.php/Main/UnresolvedSexualTension", "/pmwiki/pmwiki.php/Main/DarkAndTroubledPast", "/pmwiki/pmwiki.php/Main/TheNotLoveInterest", "/pmwiki/pmwiki.php/Main/LikeAnOldMarriedCouple", "/pmwiki/pmwiki.php/Comicbook/BatmanNoMansLand", "/pmwiki/pmwiki.php/Main/IKnowYouKnowIKnow", "/pmwiki/pmwiki.php/Comicbook/SpiderMan"]}