{"title": "Unbreakable Bones", "content": "Talis: It was an interesting operation. The replacement had to be done molecule by molecule, taking care to match your original skeleton exactly in shape and weight, and to ensure that your bone marrow adapted. But it all seems entirely successful. There is an interesting side effect. The alloy has quite surprising resilience and strength. Our tests have shown that it is almost completely infrangible. \n\nKeill: Infrangible? \n\nGlr: It means, mudhead, that your bones cannot be broken. It was an interesting operation. The replacement had to be done molecule by molecule, taking care to match your original skeleton exactly in shape and weight, and to ensure that your bone marrow adapted. But it all seems entirely successful. There is an interesting side effect. The alloy has quite surprising resilience and strength. Our tests have shown that it is almost completely infrangible.Infrangible?It means, mudhead, that your bones cannot be broken.\n\nNot everyone can have a body that's Nigh Invulnerable. So, what's the next best thing for creating a character who is highly resistant to injury? Why giving them bones that can't be broken. The character will still bleed and bruise, and will still be vulnerable to a cut throat, or a stab to the heart, yet will be immune to any number of potentially crippling injuries. From a storytelling perspective this can be the best of both worlds, providing a character who can justifiably shrug off incredible beatings, while still being in a believable amount of danger from most weapons.\n\nHow their bones became unbreakable can vary. Perhaps they were surgically reinforced or altered. Perhaps they were bonded with, or even replaced with, metal. Perhaps the character is a mutant, and bones with the tensile strength of titanium are simply a part of his or her natural makeup. This trope is most often seen in science-fictional settings where mutation, genetic engineering, or advanced surgical techniques can justify its existence, though it can show up anywhere.\n\nMay be a trait of the Cyborg or Super Soldier. Might be combined with a Healing Factor to create a truly unstoppable warrior. See Super Toughness and other Nigh Invulnerable subtropes for when it's the entire body and not just the bones that are this hard to damage. Not to be confused with I Am Big Boned.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/UnbreakableBones", "media_links": ["/pmwiki/pmwiki.php/ComicBook/Wolverine", "/pmwiki/pmwiki.php/Literature/LastLegionary", "/pmwiki/pmwiki.php/ComicBook/Wolverine", "/pmwiki/pmwiki.php/ComicBook/Daredevil", "/pmwiki/pmwiki.php/Film/Avatar", "/pmwiki/pmwiki.php/Creator/HughJackman", "/pmwiki/pmwiki.php/Film/XMenFilmSeries", "/pmwiki/pmwiki.php/Literature/TheCobraTrilogy", "/pmwiki/pmwiki.php/Literature/JudgeDee", "/pmwiki/pmwiki.php/Literature/LastLegionary", "/pmwiki/pmwiki.php/Literature/Uglies", "/pmwiki/pmwiki.php/Literature/ThePrideOfParahumans", "/pmwiki/pmwiki.php/TabletopGame/Warhammer40000", "/pmwiki/pmwiki.php/TabletopGame/Shadowrun", "/pmwiki/pmwiki.php/TabletopGame/GammaWorld", "/pmwiki/pmwiki.php/VideoGame/Fallout", "/pmwiki/pmwiki.php/Franchise/Halo"], "non_media_links": ["/pmwiki/pmwiki.php/Main/GoodThingYouCanHeal", "/pmwiki/pmwiki.php/Main/NighInvulnerable", "/pmwiki/pmwiki.php/Main/Cyborg", "/pmwiki/pmwiki.php/Main/SuperSoldier", "/pmwiki/pmwiki.php/Main/HealingFactor", "/pmwiki/pmwiki.php/Main/SuperToughness", "/pmwiki/pmwiki.php/Main/NighInvulnerable", "/pmwiki/pmwiki.php/Main/IAmBigBoned", "/pmwiki/pmwiki.php/Main/SuperSoldier", "/pmwiki/pmwiki.php/Main/NeverMyFault", "/pmwiki/pmwiki.php/Main/MotiveRant", "/pmwiki/pmwiki.php/Main/SuperSoldier", "/pmwiki/pmwiki.php/Main/TrainingFromHell", "/pmwiki/pmwiki.php/Main/OneManArmy", "/pmwiki/pmwiki.php/Main/Archenemy", "/pmwiki/pmwiki.php/Main/EvilCripple", "/pmwiki/pmwiki.php/Main/DepravedDwarf", "/pmwiki/pmwiki.php/Main/PoweredArmour", "/pmwiki/pmwiki.php/Main/ArtificialHuman", "/pmwiki/pmwiki.php/Main/EvilCounterpart", "/pmwiki/pmwiki.php/Main/SuperSoldier", "/pmwiki/pmwiki.php/Main/BioAugmentation", "/pmwiki/pmwiki.php/Main/PoweredArmor", "/pmwiki/pmwiki.php/Main/RedShirt", "/pmwiki/pmwiki.php/WebComic/GenocideMan", "http://yalemedicine.yale.edu/autumn2002/news/findings/53806/", "https://en.wikipedia.org/wiki/Hero_shrew"]}