{"title": "Practice Target Overkill", "content": "One way of demonstrating the power of a weapon or ability is by going to a Shooting Gallery and seriously damaging or obliterating the practice targets there, and possibly anything else in the surrounding area. If a bullseye is worth 10 points, then this trope is Up to Eleven.\n\nUsually beforehand, other characters will be practicing their own abilities or weapons with varying levels of accuracy or skill just to contrast the difference in strength or ability.\n\nSometimes it is mentioned how inconvenient or expensive it is to replace or repair the destroyed objects.\n\nIf this is unintentional, it overlaps with Gone Horribly Right. May happen in a Testing Range Mishap.\n• Dragon Ball Z: In Buu Saga, before the Tenkaichi Tournament, Son Goku tells all his friends and allies to use a minimum of their power on a punching dummy machine so they can pass the preliminaries without making a scene. Deliberately ignoring this warning, Vegeta punches it without restraint and destroys it, to the surprise of all the normal people in attendance.\n• Bleach anime episode #46. While attending the Soul Reaper Academy, the students practice one of the kido spells, Hado 33 \"Shakkaho Red Flame Cannon\" (AKA a fireball). When it's his turn, Renji tries to show off by destroying the target. He puts too much power into the spell, causing an explosion and giving him an Ash Face.\n• In Brave, Merida fires an arrow that goes straight through the target and into the wooden support.\n• Played for laughs in Der Schuh des Manitu; Ranger teaches Winnetouch how to shoot and fires multiple times at a target dummy with his rifle. When it's Winnetouch's turn, he pulls a tiny handgun out of his purse and shoots the target once, only for the dummy to explode.\n• Some college students with Real Genius discover a way to raise the power output of a lab laser, and secretly modify it for a test firing. These wonderballs calculated a beam in the megawatt range; the beam produced was in the terawatt range, which burned a hole completely through a concrete safety shield, then the lab's cinder block walls, then a bronze statue of the college's founder, and on into space.\n• The hired assassin from The Day of the Jackal brings his custom-made sniper rifle to a remote wooded area to test it and to align its scope. This needs only two standard rifle bullets fired into a melon in a mesh tote bag, as the gunsmith had already tested it and tweaked the sights. Then came one of the vaned, mercury bullets: the melon disintegrated and the tote was left in tatters.\n• Robocop 1987: Robo first demonstrates his capacity as a Job-Stealing Robot when he rips a target to shreds with his Auto-9 on the Metro South station's firing range.\n• Knight's & Magic:\n• The academy has a shooting gallery where students use their magic staffs to launch fireballs at wooden targets, with varying accuracy. Once Eru steps up with his gun-shaped staff, he shoots with pinpoint accuracy and obliterates the wooden targets.\n• Eru's testing for a crossbow Arm Cannon for the Silhouette Gear shows that the arrow not only easily breaks the wooden targets, but continues flying and destroying the wall behind it.\n• Thud!: One of the Specials (a volunteer militia used when the City Watch needs more manpower) is Andy \"Two Swords\" Hancock, a worryingly enthusiastic katana dual wielder. Vimes: Normally a training dummy lasts for months, captain. You're not supposed to chop through three in half an hour!\n• The City Watch also has Detritus and his Piecemaker siege ballista, whose modification to fire dozens of arrows at once had the unforeseen consequence of creating a cloud of fiery wooden shrapnel that obliterates everything it's even vaguely pointed at. When it was tried out in the shooting gallery, the target was removed from existence, along with the two targets on either side and an unfortunate flock of seagulls right above Detritus.\n• In Doctor Who, the Twelfth Doctor episode \"Robot of Sherwood\" has Robin Hood and the Sheriff of Nottingham compete for the Golden Arrow by the classic bow and arrow game. Then the Doctor appears to join the game and with his Sonic Screwdriver simply destroys the target, proclaiming himself the \"winner\" of the game and taking the arrow for himself.\n• An episode of CSI involves the discovery of a dead man on the desert, shot with so many guns (some of them of a caliber as big as .50) that it was possible to see right through his torso because of all the bullet holes. Turned out that the man had walked into an open-air shooting range and blown away by the shooting party that was going on.\n• Persona Q: Shadow of the Labyrinth: After Naoto demonstrates her marksmanship in the shooting gallery, Aigis uses her Finger Firearms to completely destroy the wooden targets.\n• Whenever you research a new weapon tier in XCOM: Enemy Unknown, there's a cinematic of a scientist using one of your shiny new guns to utterly obliterate a target. In the sequel, Lily Shen will demonstrate your new weapons instead.\n• Overwatch: one of Hanzo's highlight openings shows him not only Splitting the Arrow, but splitting the entire target as well.\n• One of the cutscenes in Crisis Core has Sephiroth Genesis and Angeal sparring atop Junon's Mako Canon. Sephiroth utterly destroys the the cannon's barrel, Genesis later unleashes some fire magic which Angeal retargets by yanking his arm aside at the last second. The blast blows up a wall revealing that they are in a Holodeck which is now showing significant damage with sparking walls, and is presumably no longer functional.\n• One-Punch Man:\n• When Saitama goes through the physical application for hero registration, he effortlessly destroys a punching dummy machine. In fact, he practically does Practice Range Overkill with his side to side hops creating imprints of his feet on the cement floor and crashing into the roof for the high jump exam.\n• Genos and Saitama are having a practice bout, with Genos demanding Saitama try harder. Saitama obligingly throws a haymaker that he stops at the last minute. Then Genos turns around to see that the air displaced by the punch has carved an entire canyon out of the cliff behind them.\n• Paranatural: Isabella's grandpa demonstrates the strength of his energy attacks by blasting straight through a target, breaking it in half.\n• El Goonish Shive: in the strip for 2-21-05 , Nanase Kitsune is practicing her ki-powered martial arts attacks at Sensei Greg's dojo. After repeated strikes, she notices that the punching bag she's been hitting has been destroyed. She apologizes to Sensei Greg, but he tells her not to worry about it because he buys them in bulk.\n• The Legend of Korra: When the Spirit Cannon is first tested, it puts a hole clear through a mountain.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/PracticeTargetOverkill", "media_links": ["/pmwiki/pmwiki.php/Anime/DragonBallZ", "/pmwiki/pmwiki.php/Manga/Bleach", "/pmwiki/pmwiki.php/WesternAnimation/Brave", "/pmwiki/pmwiki.php/Film/DerSchuhDesManitu", "/pmwiki/pmwiki.php/Film/RealGenius", "/pmwiki/pmwiki.php/Film/TheDayOfTheJackal", "/pmwiki/pmwiki.php/Film/Robocop1987", "/pmwiki/pmwiki.php/LightNovel/KnightsAndMagic", "/pmwiki/pmwiki.php/Series/DoctorWho", "/pmwiki/pmwiki.php/Creator/PeterCapaldi", "/pmwiki/pmwiki.php/Myth/RobinHood", "/pmwiki/pmwiki.php/Series/CSI", "/pmwiki/pmwiki.php/VideoGame/PersonaQShadowOfTheLabyrinth", "/pmwiki/pmwiki.php/VideoGame/XCOMEnemyUnknown", "/pmwiki/pmwiki.php/VideoGame/XCOM2", "/pmwiki/pmwiki.php/VideoGame/Overwatch", "/pmwiki/pmwiki.php/VideoGame/CrisisCore", "/pmwiki/pmwiki.php/Webcomic/OnePunchMan", "/pmwiki/pmwiki.php/Webcomic/Paranatural", "/pmwiki/pmwiki.php/Webcomic/ElGoonishShive", "/pmwiki/pmwiki.php/WesternAnimation/TheLegendOfKorra"], "non_media_links": ["/pmwiki/pmwiki.php/Main/ShootingGallery", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Main/GoneHorriblyRight", "/pmwiki/pmwiki.php/Main/TestingRangeMishap", "/pmwiki/pmwiki.php/Main/Anime", "/pmwiki/pmwiki.php/Main/Manga", "/pmwiki/pmwiki.php/Main/MagicallyIneptFighter", "/pmwiki/pmwiki.php/Main/AshFace", "/pmwiki/pmwiki.php/Main/JobStealingRobot", "/pmwiki/pmwiki.php/Main/HandCannon", "/pmwiki/pmwiki.php/Main/LightNovels", "/pmwiki/pmwiki.php/Main/AutomaticCrossbows", "/pmwiki/pmwiki.php/Main/ArmCannon", "/pmwiki/pmwiki.php/Main/MiniMecha", "/pmwiki/pmwiki.php/Discworld/Thud", "/pmwiki/pmwiki.php/Main/BloodKnight", "/pmwiki/pmwiki.php/Main/DualWielding", "/pmwiki/pmwiki.php/Main/BFG", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Recap/DoctorWhoS34E3RobotOfSherwood", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/FingerFirearms", "/pmwiki/pmwiki.php/Main/SplittingTheArrow", "/pmwiki/pmwiki.php/Main/Webcomics", "/pmwiki/pmwiki.php/Main/OldMaster", "http://www.egscomics.com/index.php?id=629", "/pmwiki/pmwiki.php/Main/WesternAnimation"]}