{"title": "Filler Strips", "content": "Webcomic artists are only human. Sometimes they're sick, sometimes they get swamped by their day job, sometimes they just want to take a break , dammit! ...and they can't update the strip for a day or two or twenty. They might just leave a blank spot on the calendar , or if things get drastic they might change their updating schedule permanently, but the more common solution is to just drop in some kind of non-continuity filler. Generally the filler takes one of three forms:\n• Guest strips by other webcomic artists. Actually quite popular amongst webcomic readers, as guest artists tend to try their best to make a funny contribution, and when you're familiar with the work of both artists it's fun to see the guest's take on the strip.\n• Bonus material — work the artist did years ago, doodlings from their sketchbook, photos of their vacation, walkthroughs of how they put the strip together, that sort of thing.\n• Some actual original material, but something easy — brief, quickly slapped together, not even necessarily done by the artist, and possibly outright Stylistic Suck.\n\nNone of these are objectionable, provided they're used in moderation. Once an artist puts up filler every third day or so, the audience's patience starts to wear thin.\n\nPrint comics will rerun old strips instead of creating filler. Rerunning strips is considered bad form in webcomics because the archive is easily accessed if fans want a second look. Filler may or may not be included in the archives; if not, it generally either is put on a separate \"Art\" page, or disappears into the electronic aether.\n\nThe only way to avoid this is to have a Strip Buffer.\n\nWebsnark discusses the best kinds of original filler material here .\n• Perhaps the best-known example is from Sluggy Freelance, which has gone through a huge variety of different sorts over the years. You name it, they've had it as filler. Even though the ones made by the author Pete Abrams himself were intended to conserve his effort, they still often turned up something clever and funny, though not by any means always.\n• Probably the best notable were the Stick Figure Comics, drawn by Pete himself, starting with \"Stick Figure Week\", in which the characters were stick figures and nothing much happened, and continuing with many sequels. These involved for example Torg trying to make events take such a turn that Pete would have to make an effort to draw them, and eventually more complicated Recycled In Space versions, including one that was even called \"Stick Figures in Spaaaaaace\" and grew into a multi-part but unambitiously random Story Arc.\n• Pete also did a couple of filler stories that involved the characters in their normal state but not doing anything much. One included their testing a time machine that kept rewinding time to the moment before they tested it, and events repeated with only slight variations as they slowly became aware that they were stuck in a loop. Another featured everyone sitting around being bored. (Pete still managed to wring out a joke out of dialogue in which no-one said anything but variations of \"dude\" and \"man\" during one strip .)\n• Other people associated with Sluggy have provided filler strips as well, including among others \"Shirt-Guy Tom\" (who handles the merchandise or something, including t-shirts, hence the name), and colourist Joe Sunday. Tom, no artist himself as far as one can tell from Sluggy, did an intentionally terrible version of his own of stick-figure week, which established the filler-specific Running Gag that \"Stick-Figure Shirt-Guy Tom\" wants to take over the comic from Pete.\n• Then there are the numerous filler stories by other actual comic artists, notably \"Sluggy Freelance, where are you?\" in 2000 in the middle of \"Love Potion\" when Pete's daughter Leah was born and a number of others, apparently led by Ian McDonald, whipped up a story that involved the \"cast\" of Sluggy Freelance going missing and characters from other comics trying to substitute and looking for them. It turned out Shirt-Guy Tom had kidnapped them. There are a whole number of others scattered around the comic, with authors ranging from Ian McDonald to Phil Foglio. The circle comes to a close nicely with the 2016 filler strips by Leah Abrams. (\"Justine Kasich \"Goes Terribly Wrong\" )\n• Various sketches and pictures both by Pete and others (including Torg, see below) have also appeared as filler quite often after the strip's initial more fillerless days.\n• Torg, the most central main character with noteworthy art skills of his own, has also acted as a guest artist — the art obviously drawn by Pete himself but still counting as filler. This culminated in Torg's \"the greatest comic book of all time\", Gunman Stan McKurt vs. the Gates of the City of the Damned , which, while well drawn and having a certainly... interesting plot, consisted entirely of cut-and-paste pieces of the same detailed image with different text. So, yes, that was filler too.\n• There are also the regularly scheduled fillers that started appearing on Saturdays and then Sundays, which include sketches by Pete and other things of the sorts mentioned above. Two long-running guest strips on the Saturday slots included Ian McDonald's \"Meanwhile in the Dimension of Pain\" (or elsewhere) that was received less well for being even wackier than the comic usually was, and \"Bikini Suicide Frisbee Days\" by Clay Yount, which contained non-canonical strips set in the pre-Cerebus Syndrome days of the comic's timeline. Pete also drew \"No Content on Saturdays\", which featured Kiki looking for the \"no content\", which proved to be difficult because her presence constituted content, and also because she was mailed to Siberia at one point.\n• Finally, there has also been a variety of random odd things like photos of Sluggy characters as Legos (in one case re-enacting John Carpenter's The Thing (1982)), World of Warcraft screenshots, and Sluggy Mad Libs.\n• Megatokyo went through a period where it was notorious for every second or third day being either a \"Dead Piro Day\", ie a day where artist Piro was only up to providing a sketch from his scrapbook, or a \"Shirt Guy Dom\" day, a \"borrowing\" of Sluggy Freelance's filler concept with considerably more crude stick figures. Recently, this hasn't happened that often - he just simply stopped updating regularly.\n• Parodied in this strip of Irregular Webcomic!.\n• As well as this xkcd strip, though a bit more self-mockingly. (The alternate caption reads \"Maybe I should let up on Megatokyo a little?\")\n• Irregular Webcomic itself is another notable aversion, having updated consistently for more than 6 years. Although some sequences and strips have been canon, but fairly filler-ish in nature, notably 'blowing up of the universe', which featured around a week of blank coloured panels, graduating from pure white through red to black.\n• When Dream Catcher doesn't update on time, it sometimes has one of these.\n• When Jon Rosenberg of Goats takes days off, he allows his friend Phillip to fill in with strips drawn incredibly poorly on post-it notes.\n• Often when Gabe and Tycho of Penny Arcade are traveling (which usually entails being away at a convention), they still update — but with a less polished strip, usually a single roughly-sketched panel, based around the events at the con. (Example: a sketch submitted from Vegas, showing Tycho playing a slot machine called \"Ding, And Then You Don't Get Any Money.\")\n• Sam and Fuzzy has a set annual period for guest artists, known as the Obligatory Guest Artist Weekly Duration (or O-GAWD).\n• Colour Wheel has these from time to time as the author tries to balance creating a buffer and having a life. Fillers usually depict the day-to-day lives of the author, \"Phillr Kitty\" (aka Phil, a mildly psycho creature raised by LOLCats), and the snarky silhouette of a not-yet-introduced main character. Once a regular page goes up, fillers are moved to the Extras page.\n• Adis of Count Your Sheep insists on putting something up on the site every single day...even if that means he has to put up a rough sketch of something irrelevant, perhaps the same sketch he's used three times already but with slightly different coloring...it is more than a little frustrating.\n• Help Desk fills in with conversations between a circle marked \"A\" and a circle marked \"B\".\n• A notable exception is Schlock Mercenary. Howard Tayler has updated his strip every day for the past eight years.\n• He even has a buffer of more than 30 strips that will automatically post new strips each day in case of conventions, sickness or other unforeseen consequences. Tayler could be dead for a month before anyone would be the wiser.\n• The things other artists use for filler, Howard Tayler uses as some of the bonus features in the books.\n• On April 1, 2008, a text image went up in place of the daily strip, stating that day's strip would be late due to convention travel issues. Thirty seconds later, the image automatically changed to the proper, fully-colored strip.\n• In the early days, there were a few guest strips...which were posted alongside the strips they were meant to fill in for.\n• Same goes for User Friendly. Illiad noted this on the 10th anniversary of the strip (6 × 365 + 4 × 366 = 3,654 strips). He's never missed an update since.\n• Scratch that. For nearly a year now, the strip has been in reruns. That isn't even filler, that's just lazy.\n• has never missed an update since 1995.\n• El Goonish Shive has a separate section of the archives for Filler Strips.\n• One of the worst offenders is The Wotch, which over its four-year run has had, at this writing, 371 real comics and 148 days of filler \u0097 nearly 30% of all its strips are filler. Yes, it keeps statistics.\n• Even worse was Avalon, which had more filler than real comics.\n• The creators of Faux Pas have, on more than one occasion, posted a picture of one or two of the regular characters tending to an injured or sickly other character, with a notice explaining that the strip is on a brief hiatus due to cartoonist illness or injury. On a couple other occasions, a non-continuity strip appears during such a hiatus, following a formula of sorts: the foolish and self-absorbed Myrtle explains (utterly erroneously) some kind of \"fun fact;\" the artwork illustrating it is recycled from some earlier strip.\n• Parodied/lampshaded in this strip of The Order of the Stick.\n• It was also played straight early in the series, when the comic had a regular update schedule; they're still available at this page .\n• Ctrl+Alt+Del often alternates between story arcs followed by one-shots not part of any particular story. This allows Tim Buckley the time to plan and make the next arc in advance.\n• Chef Brian was first posted as a filler strip when Tim was drunk and an hour away from a deadline. However, it proved popular with fans, and Brian appeared in a strip at the end of the earlystory arc.\n• Michael \"Mookie\" Terriano, writer of Dominic Deegan: Oracle For Hire does the \"standard\" filler comic from time to time. However, he often fills in the space with brief previews of upcoming story arcs.\n• Usually these come with warnings ahead of time and tend to occur when Mookie is off at a convention.\n• Spoofed in this strips, just going to show again that webcomics without this problem really, really love to mock Megatokyo for it.\n• This is a regular occurrence in Animals Have Problems Too, usually in the form of a post-it note interlude, though sometimes he just does a little bloggy strip where he makes fun of the irrelevance of webcomics, like here and here.\n• Bob and George is an interesting example...the \"filler\" sprite comics ended up becoming the actual strip rather than the (originally intended) hand-drawn comics.\n• Penny and Aggie has become particularly notorious of late for completely halting the plotline for filler strips with no explanation as to why. While the strips are supposedly canonical, they have become further and further removed from the plot, culminating in the month long \"Min Jung\" which was set in Korea and starred a completely new set of characters that were guaranteed by the author to never have any plot impact. The extremely negative reaction to Min Jung caused the filler strips to at least star characters from the comic again when they ran as well as better timing on their runs.\n• Achewood has a few forms of filler: guest strips, which are considered to be of varying quality depending on the artist; photo collages, sometimes even from different locales (such as a trip to Europe, complete with stuffed Philippe ); and reruns of older, popular strips, which seems to be the method Onstad is sticking with nowadays.\n• Questionable Content has parody filler strip/Cut-and-Paste Comic \"series\" featuring a bird yelling obscenities at the comic artist . The character is known as none other than Yelling Bird.\n• At one point, Jeph tried something different, and added an uncolored woman to the cast, who was only known as \"Sweet Tits.\" She showed up twice, before disappearing for a long while until the week before new year Here , where Yelling Bird throws a party at her apartment against her will, causing her to eventually throw everybody out in a fit of rage, including Randy\n• Dandy and Company has intentionally made a feature of this. For years there was a designated \"Total Chaos\" week in October (later expanded to two weeks), in which guest strips were run in lieu of the regular comic. Later, the format was changed so that Saturdays were all guest strips, and Sundays were \"Community Theater,\" commissioned artwork by the cartoonist.\n• 8-Bit Theater uses either guest comics or \"explanations for the Schedule Slip.\n• Averted, mostly, in Girl Genius, in which the 'filler strips' are often of the same quality as the main work, usually involving their own brief storylines. That said, there have been a few exceptions.\n• Jayden and Crusader debuted on Drunk Duck and happily posted filler when the artist had nothing more, though he removed much of it when he got a specific domain. That which remains the artist views as being of suitable quality for viewers to enjoy in lieu of a comic. Only a few filler pages remain though.\n• Dinosaur Comics, which updates nearly every day, has had a couple of weeks of nothing but filler strips. The fillers do a good job as they generally try different styles outside the comic's normal structure.\n• has a somewhat unusual way of doing filler strips. The site features a build-your-own-comic-maker for fans to create their own strips. During times the creators are delayed in updating, they will use the \"BYOC\" to create a strip, oftentimes tying in the delay into the narrative of the filler strip. Once the strip is properly updated, the filler strips are placed in the bonus section of the site.\n• MSF High: A 'lorecrackers' parody arc was done by Wraith and luckybucket.\n• Casey and Andy would often run cheesecake as filler.\n• Pictures Of You does that in an interesting way. During the hiatus that occurs after every book, the readership is rewarded with original scenes drawn by Guest Artists as well as the original draft of the comic.\n• The Life of Nob T. Mouse filler strips tend to be jokes about why there's no comic on that particular day; like this strip : Franky: Nob! Nob! Why are there no updates? Nob Mouse: Because the writers messed up on their scheduling...\n• Two Lumps will throw in the occasional \"Eben and Snooch drawn chibi-style\" whenever the human creators go to an anime convention. And then there was the special one-panel filler for a special occasion ....\n• The writer of Collar 6 is about to take a one-week hiatus, which will mean two Guest Strips.\n• Red String actually has a Strip Buffer and filler, it updates every weekday; however, every week has a Sketch Friday. Between Chapters 43 and the upcoming Chapter 44, it is playing host to some guest strips while Gina Biggs moves again, and gets ahead on the comic.\n• Today Nothing Happened, when a comic is late, will update with a \"fat animal\" (exclusive to those who check for a new strip early enough) until the comic is ready. It all started with a one-time joke about a fat dragon that escalated.\n• Venus Envy has fallen prey to this at many times throughout the comic's history, but the artist eventually became so obviously bad at maintaining her schedule that she gave up and stopped posting anything unless it was a new comic. After its triumphant 2009 return and semi-consistent updates, it's now fallen back on hiatus since March 2010.\n• actually spends most of the year doing these. It's a journal comic about attending anime conventions, but the author only attends four or five per year. Thus, the rest of the year's weekly updates are \"filler arcs.\"\n• What's more, many of those pages are just cute mascot characters explaining why there's no \"real\" comic that week. That's right, Conventional Wisdom actually has filler FOR THE FILLER.\n• Gunnerkrigg Court sometimes has extremely cute fillers between the chapters, starring pigeons.\n• 5 Color Control makes occasional use of filler art to keep up its schedule.\n• Ears for Elves often has these. They can happen when Naarie Kermie doesn't have the time/tools to draw a \"proper\" strip, and usually consist of concept art or a brief sidestory.\n• Sinfest often has these. They can be one-shot Genre Roulette strips, or a gag featuring one-shot characters , or a calligraphy gag , or even a gag-a-day strip in the middle of a story arc. (The last can be hard to tell. Story arcs are jumped from and to quite frequently.)\n• The Law of Purple has these semi-frequently due to the author having real life interfere with her comics.\n• The Daily Derp at least twice used a strip where Derpy simply says \"404\" , when no regular comic could be provided that day.\n• Arthur, King of Time and Space has filler using clip-art of the characters making Fourth Wall Breaking observations (usually a topical comment, an explanation for the lack of a strip, or some variant on how much Gadzikowski hates having to make \"can't think of a joke\" jokes) against the green background of the website. This is now considered a setting of its own - the \"green room\" arc.\n• Myth Tickle has been putting up almost nothing but reruns for months.\n• Metroid: Third Derivative has special \"Logfile Filler\" comics that expand on certain parts of the story and give insight into how Samus is doing status-wise. This is in addition to the random filler.\n• Zero Percent Discount has a filler strip made in a mere 10 seconds .\n• Realm Of Owls has occasional filler material, specifically sections of Lord of the Realm reading fan mail .", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/FillerStrips?from=Main.FillerStrip", "media_links": ["/pmwiki/pmwiki.php/Webcomic/ElGoonishShive", "/pmwiki/pmwiki.php/Webcomic/SluggyFreelance", "/pmwiki/pmwiki.php/Creator/PhilFoglio", "/pmwiki/pmwiki.php/Creator/JohnCarpenter", "/pmwiki/pmwiki.php/Film/TheThing1982", "/pmwiki/pmwiki.php/VideoGame/WorldOfWarcraft", "/pmwiki/pmwiki.php/Webcomic/Megatokyo", "/pmwiki/pmwiki.php/Webcomic/IrregularWebcomic", "/pmwiki/pmwiki.php/Webcomic/Xkcd", "/pmwiki/pmwiki.php/Webcomic/DreamCatcher", "/pmwiki/pmwiki.php/Webcomic/Goats", "/pmwiki/pmwiki.php/Webcomic/PennyArcade", "/pmwiki/pmwiki.php/Webcomic/ColourWheel", "/pmwiki/pmwiki.php/Webcomic/CountYourSheep", "/pmwiki/pmwiki.php/Webcomic/SchlockMercenary", "/pmwiki/pmwiki.php/Webcomic/UserFriendly", "/pmwiki/pmwiki.php/Webcomic/ElGoonishShive", "/pmwiki/pmwiki.php/Webcomic/TheWotch", "/pmwiki/pmwiki.php/Webcomic/Avalon", "/pmwiki/pmwiki.php/Webcomic/FauxPas", "/pmwiki/pmwiki.php/Webcomic/TheOrderOfTheStick", "/pmwiki/pmwiki.php/Webcomic/CtrlAltDel", "/pmwiki/pmwiki.php/Webcomic/DominicDeegan", "/pmwiki/pmwiki.php/Webcomic/AnimalsHaveProblemsToo", "/pmwiki/pmwiki.php/Webcomic/BobAndGeorge", "/pmwiki/pmwiki.php/Webcomic/PennyAndAggie", "/pmwiki/pmwiki.php/Webcomic/Achewood", "/pmwiki/pmwiki.php/Webcomic/QuestionableContent", "/pmwiki/pmwiki.php/Webcomic/GirlGenius", "/pmwiki/pmwiki.php/Webcomic/DinosaurComics", "/pmwiki/pmwiki.php/Webcomic/MSFHigh", "/pmwiki/pmwiki.php/Webcomic/CaseyAndAndy", "/pmwiki/pmwiki.php/Webcomic/PicturesOfYou", "/pmwiki/pmwiki.php/Webcomic/TheLifeOfNobTMouse", "/pmwiki/pmwiki.php/Webcomic/TwoLumps", "/pmwiki/pmwiki.php/Webcomic/Collar6", "/pmwiki/pmwiki.php/Webcomic/RedString", "/pmwiki/pmwiki.php/Webcomic/TodayNothingHappened", "/pmwiki/pmwiki.php/Series/WhoseLineIsItAnyway", "/pmwiki/pmwiki.php/Webcomic/VenusEnvy", "/pmwiki/pmwiki.php/Webcomic/GunnerkriggCourt", "/pmwiki/pmwiki.php/Webcomic/FiveColorControl", "/pmwiki/pmwiki.php/Webcomic/EarsForElves", "/pmwiki/pmwiki.php/Webcomic/Sinfest", "/pmwiki/pmwiki.php/Webcomic/TheLawOfPurple", "/pmwiki/pmwiki.php/Webcomic/TheDailyDerp", "/pmwiki/pmwiki.php/Webcomic/ArthurKingOfTimeAndSpace", "/pmwiki/pmwiki.php/Webcomic/MythTickle", "/pmwiki/pmwiki.php/Webcomic/MetroidThirdDerivative", "/pmwiki/pmwiki.php/Webcomic/ZeroPercentDiscount", "/pmwiki/pmwiki.php/Webcomic/RealmOfOwls"], "non_media_links": ["http://en.wikipedia.org/wiki/Firesheep", "http://www.firefox.com/", "/pmwiki/pmwiki.php/Main/SeriesHiatus", "/pmwiki/pmwiki.php/Main/ScheduleSlip", "/pmwiki/pmwiki.php/Main/GuestStrip", "/pmwiki/pmwiki.php/Main/StylisticSuck", "/pmwiki/pmwiki.php/Main/StripBuffer", "/pmwiki/pmwiki.php/Blog/Websnark", "http://www.websnark.com/archives/2004/08/zen_and_the_art.html", "/pmwiki/pmwiki.php/Main/StickFigureComic", "/pmwiki/pmwiki.php/Main/RageAgainstTheAuthor", "/pmwiki/pmwiki.php/Main/RecycledInSpace", "/pmwiki/pmwiki.php/Main/StoryArc", "http://www.sluggy.com/comics/archives/daily/20001010", "/pmwiki/pmwiki.php/Main/RunningGag", "/pmwiki/pmwiki.php/Main/GuestStrip", "/pmwiki/pmwiki.php/Main/AnimatedActors", "http://www.sluggy.com/comics/archives/daily/160510", "http://www.sluggy.com/comics/archives/daily/20080217", "/pmwiki/pmwiki.php/Main/CerebusSyndrome", "http://www.irregularwebcomic.net/1463.html", "http://xkcd.com/157/", "/pmwiki/pmwiki.php/WebOriginal/LOLCats", "/pmwiki/pmwiki.php/Main/DeadpanSnarker", "http://colourwheelcomic.com/gallery/", "/pmwiki/pmwiki.php/Main/AprilFoolsDay", "http://www.kevinandkell.com", "/pmwiki/pmwiki.php/Main/FillerStrips", "/pmwiki/pmwiki.php/Main/LampshadeHanging", "http://www.giantitp.com/comics/oots0033.html", "http://www.giantitp.com/comics/GuestStrips.html", "http://www.drunkduck.com/Stickman_and_Cube/index.php?p=269364", "http://www.animalshaveproblemstoo.com/index.php?id=391", "http://www.animalshaveproblemstoo.com/index.php?id=403", "http://achewood.com/index.php?date=07042003", "/pmwiki/pmwiki.php/Main/CutAndPasteComic", "http://www.questionablecontent.net/view.php?comic=1140", "http://www.questionablecontent.net/view.php?comic=1566", "http://www.questionablecontent.net/view.php?comic=1545", "/pmwiki/pmwiki.php/WebComic/DandyAndCompany", "/pmwiki/pmwiki.php/WebComic/EightBitTheater", "http://www.nuklearpower.com/daily.php?date=040720", "http://www.nuklearpower.com/daily.php?date=080930", "http://www.nuklearpower.com/daily.php?date=050215", "/pmwiki/pmwiki.php/Main/ScheduleSlip", "http://www.jaydenandcrusader.com", "http://www.bitmapworld.com/", "http://www.bitmapworld.com/byoc/", "/pmwiki/pmwiki.php/Main/Fanservice", "http://www.nobmouse.net/2009/11/23/why-the-long-pause/", "http://www.twolumps.net/d/20060318.html", "/pmwiki/pmwiki.php/Main/StripBuffer", "http://www.drunkduck.com/Conventional_Wisdom/index.php", "http://www.drunkduck.com/Conventional_Wisdom/index.php?p=646598", "http://www.drunkduck.com/Conventional_Wisdom/index.php?p=673280", "http://www.drunkduck.com/Conventional_Wisdom/index.php?p=681091", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Main/GenreRoulette", "http://www.sinfest.net/archive_page.php?comicID=2723", "http://www.sinfest.net/archive_page.php?comicID=3891", "http://dailyderp.tumblr.com/post/23566774592/no-daily-derp-today-i-hoped-i-would-never-use", "/pmwiki/pmwiki.php/Main/FourthWallBreaking", "/pmwiki/pmwiki.php/Main/AnimatedActors", "http://zeropercentdiscountcomic.tumblr.com/post/130441373178", "https://realmofowls.com/comics/fan-mail-to-lord-part-7"]}