{"title": "Frantic Object Concealment", "content": "Sometimes, life can be really tough. Whether it's receiving a special yet mushy gift from a loved one, or taking up a hobby that is deemed undignified for your well-being, or maybe even buying a childish item for yourself at the nearby convenience store.\n\nSay that you're given a bouquet of flowers by someone who has a crush on you, or you've just decided taking up doing embroidery, or buying a wind-up toy frog. You're in the middle of doing your embarrassing hobby and what-not, when, uh-oh! One of your friends is coming down the sidewalk, possibly on the verge of discovering the object that you have.\n\nWhat's the best thing to do? Hide said object behind your person, with the most popular hiding place on your body being behind your back. However, if your True Companions discover what you're hiding behind your back, Hilarity Ensues.\n\nMost precisely, this is a comedy trope, in which a character hides his most treasured item or whatever behind his body. Sometimes, it works, and sometimes, it doesn't. Expect it to show up in some forms of media.\n• Tubby did this twice in an episode of the Little Lulu anime; first with a bouquet of flowers that Lulu gave him earlier (which he promptly stomps flat in anger, once it's been discovered), and the second time with a doll wrapped up in a sweater that he attempted giving to Lulu.\n• Done to hilarious effect in one Bleach filler when Ichigo attempts to hide his enormous butcher's knife of a sword behind his back. A good 2 feet of the sword stuck out above his head.\n• In Harry Potter and the Philosopher's Stone, Harry, Ron, and Hermione all squeeze together to keep Snape from noticing that they have a jar of probably illegal fire behind them to keep them warm. Unfortunately, Snape notices that they look guilty and comes over to punish them for something else.\n• In Kamen Rider OOO, Dr. Maki quickly stuffs a Cous Coussier flyer into his pocket when Date comes into the lab. Date, however, notices and tries to see what it is. Rather than let him see, Dr. Maki eats the flyer.\n• Peanuts once had a variant, where Linus made his blanket resemble a toy rabbit so Lucy wouldn't throw the blanket into the trash burner.\n• Used hilariously in this LOLCats page.\n• Played for Drama in Spring Awakening when Moritz is about to commit suicide : He takes out a gun and prepares to fire it before he is interrupted by Ilse, and frantically hides the gun to prevent her from figuring out his true intentions.\n• In My Little Pony: Friendship Is Magic, Rainbow Dash frantically conceals her book whenever her friends come in, as she doesn't want them to know that she actually loves reading.\n• Bolin from The Legend of Korra attempts to hide from Opal a piece of metal so she doesn't notice he is trying to metalbend, but ultimately fails when trying to put it back in place.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/FranticObjectConcealment", "media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/Anime/LittleLulu", "https://tvtropes.org/pmwiki/pmwiki.php/Manga/Bleach", "https://tvtropes.org/pmwiki/pmwiki.php/Literature/HarryPotterAndThePhilosophersStone", "https://tvtropes.org/pmwiki/pmwiki.php/Series/KamenRiderOOO", "https://tvtropes.org/pmwiki/pmwiki.php/WesternAnimation/MyLittlePonyFriendshipIsMagic", "https://tvtropes.org/pmwiki/pmwiki.php/WesternAnimation/TheLegendOfKorra"], "non_media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/Main/OhCrap", "https://tvtropes.org/pmwiki/pmwiki.php/Main/TrueCompanions", "https://tvtropes.org/pmwiki/pmwiki.php/Main/HilarityEnsues", "https://tvtropes.org/pmwiki/pmwiki.php/Main/ComedyTropes", "https://tvtropes.org/pmwiki/pmwiki.php/Main/Anime", "https://tvtropes.org/pmwiki/pmwiki.php/Main/Manga", "https://tvtropes.org/pmwiki/pmwiki.php/Main/AgitatedItemStomping", "https://tvtropes.org/pmwiki/pmwiki.php/Main/LiveActionTelevision", "https://tvtropes.org/pmwiki/pmwiki.php/Main/NewspaperComics", "https://tvtropes.org/pmwiki/pmwiki.php/ComicStrip/Peanuts", "https://tvtropes.org/pmwiki/pmwiki.php/Main/WebOriginal", "http://dogs.icanhascheezburger.com/2010/10/30/funny-dog-pictures-whaff-hoff-dagz/", "https://tvtropes.org/pmwiki/pmwiki.php/WebOriginal/LOLCats", "https://tvtropes.org/pmwiki/pmwiki.php/Main/PlayedForDrama", "https://tvtropes.org/pmwiki/pmwiki.php/Theater/SpringAwakening", "https://tvtropes.org/pmwiki/pmwiki.php/Main/AteHisGun", "https://tvtropes.org/pmwiki/pmwiki.php/Main/DriventoSuicide", "https://tvtropes.org/pmwiki/pmwiki.php/Main/WesternAnimation", "https://tvtropes.org/pmwiki/pmwiki.php/Main/ExtraOreDinary"]}