{"title": "Standard FPS Enemies", "content": "While most FPS games boast a menagerie of several enemy types, 90% of the games in the genre seem to use a mixture of the same several enemy archetypes. The reason for this range from game designers sticking with what works, to there simply being only so many different ways an NPC enemy can behave. This is especially true for shooters with a semi-realistic tone, which tend to limit themselves largely to human or humanoid-type enemies.\n\nPlease only include this trope on a work's page if it has a writeup in the examples here; also, avoid doing writeups on a work's page, they're large and confusing outside of here.\n\nAs with many FPS tropes, this trope also applies to games in similar genres, such as Third-Person Shooter games.\n• The Zombie: Enemies that mindlessly engage in melee. \n\nThe zombie is pretty much as simple as you can get in terms of an FPS enemy. As you'd expect from the name, the zombie is pretty much limited to charging (at a crawl or at a run) at the player and attacking them with melee hits at close range. Some zombies may carry guns, but instead of using cover or fighting tactically all they can do is run straight at you while firing. Zombies need not be actual zombies; they can be anything from minor hellspawn to a thug with a knife and a 60 point I.Q. The main thing is that all they know how to do is run at you and attack. They can be slow or fast, but usually come in large numbers but have low durability. Particularly nasty examples of Zombies will actually explode once they get near you. Manic, \"fantasy\"-type shooters like Serious Sam or Painkiller love using enemies of this type, as their simple A.I. means you can throw a lot of them at the player all at once without using an unworkable amount of system resources.\n• Typical examples of Zombies include the Flood from Halo, headcrab zombies from the Half-Life series, Infected from Left 4 Dead, Monkey Trigens from Far Cry, Wretches from Gears of War, Nightmares and Specters from the F.E.A.R. series, \"Pinky\" Demons (but not the actual zombies) from Doom (which was the Trope Codifier for many of these categories), Processed Civilians in Red Faction II, Feral Ghouls(except for Reavers) in Fallout 3, animals and especially dogs in most FPS games such as Far Cry 3, and many of the melee enemies encountered in Serious Sam or Painkiller.\n• The Soldier: The standard combatant, striking a balance between the Cannon Fodder Grunt and the tough Elite. \n\nThe Soldier fights like, well, a soldier. Typically he's armed with an assault rifle (although he sometimes also carries a shotgun, submachine gun, grenade launcher, or other weapon), and runs around the battlefield shooting at you. He'll probably also take cover behind objects and fire from cover, although how intelligently he does so varies greatly from game to game. It's fairly standard for him to also occasionally throw grenades at you. He may also be found manning fixed gun emplacements or riding around in a light utility vehicle. Usually he dies after a handful of bullets. Rarely, some will be equipped with rocket launchers or a similarly powerful weapon, turning them into typical Glass Cannons (though said weapon may also be wielded by Grunts or Elites). This guy is easily the most typical Mook found in a modern FPS, being the main cannon fodder you face in games from F.E.A.R. to Call of Duty, and even being found in more fantastical settings like Doom or Quake, albeit as probably the lowest-tier enemy type unless a Grunt, Rat or Zombie takes that role. Note that the Soldier doesn't need to actually be a soldier by occupation; thugs, security guards, and other characters also count as Soldiers if their combat behavior is similar.\n• Typical examples of Soldiers include Replica soldiers from F.E.A.R., Combine Overwatch Soldiers from Half-Life 2, Z-Sec and Tactical Strogg from Doom 3 and Quake IV respectively, Leadhead Splicers from BioShock, Skirmishers from Halo: Reach, Privateer Assaulters from Far Cry 3, and every Nazi Ultranationalist Russian Arab North Korean Terrorist enemy ever seen in the likes of Call of Duty or Medal of Honor.\n• The Turret: A stationary enemy. \n\nThe Turret is an enemy bolted down to the floor (or to the ceiling). Often robotic, it does not move, only shoots. To balance its lack of flexibility, it will typically pack a lot of firepower and be able to shred you in seconds. Typically used as more of an obstacle than an enemy, either inhibiting your ability to deal with other types or being used as a pseudo puzzle. Common tactics to defeat this enemy include taking an alternate route outside of its fire arc; waiting for it to shut down or become distracted and using the delay to shoot or run past it; and utilizing indirect fire weapons such as grenades to take them out from cover.\n• Typical examples of Turrets include Turrets from Duke Nukem 3D, HECU Sentry Turrets from Half-Life, Combine Sentry Turrets from Half-Life 2, automated turrets in every one of the 3D Fallout games, and minigun turrets from Serious Sam,\n• The Rat: A small, weak, and basic enemy. \n\nThe Rat is the weakest, most basic enemy in the FPS genre, usually about the size of a house cat. Sometimes, they have projectiles, sometimes they crawl at you and attempt to melee, and sometimes they explode when they attack, but the basic idea is the same. Typically, they die in a couple shots from the basic pistol, but are fairly common in the early levels and/or interfere with your ability to deal with other enemies. Expect them to mostly disappear in later levels, or only be used as a small distraction in the lull between the big battles. The Bat is a sub-variant, being essentially identical to a Rat, except it can fly.\n• Typical examples of Rats include the Headcrabs from the Half-Life series (arguably the Trope Codifier), Flood Infection Forms from the Halo series, Marsh Hoppers from Serious Sam 1, Radroaches from Fallout 3, and Mantis Nymphs from Fallout: New Vegas. Examples of Bats include the Manhacks from Half-Life 2, the Sentinels from Halo, Flyers from Quake II, Geth Recon Drones from the Mass Effect series, Lost Souls from Doom, Bloatflies and Enclave Eyebots from Fallout 3, and Floaters from Serious Sam 2.\n• The Grunt: Weak versions of the Soldier. \n\nThe Grunt is The Goomba of the FPS world. These guys are pure cannon fodder, even more so than the basic Zombie or Soldier. The weakest enemy encountered in an FPS (other than Goddamn Bats), these guys usually have less health and weaker weapons than the average Mook. In pseudo-realistic FPS series, they're usually thugs, security guards, or untrained terrorists, and are weaker compared to average Soldier mooks due to being less tactically intelligent, being armed only with pistols, or being unable to throw grenades. It's also common for Grunts to lack the ability to strafe effectively or use melee attacks, as well as to take cover less than Soldiers, if they take cover at all. They're often seen mainly in the first few levels, from which point they're usually replaced by standard Soldiers.\n• Typical examples of Grunts include the Grunts from Halo (of course!), Strogg Marines from Quake II and Quake IV, Thuggish Splicers from BioShock, Vortigaunts from Half-Life, Civil Protection / Metro Cops from Half-Life 2, Pirate Assaulters from Far Cry 3, zombies and Imps from Doom, and Raiders from the Fallout series.\n• The Elite: Stronger version of the Soldier. \n\nThe opposite of the Grunt, these are a game's Elite Mooks. They typically fight like Soldiers, but have superior skills and stats. They often have more health than basic Soldiers, with the more robust examples being able to survive two to three times as much damage as a basic Mook. They may also have better aim, better reaction times, or be tactically smarter. They also may be equipped with better weaponry. Elites are usually reserved for the later levels of a game, and either replace the basic Mooks entirely, or appear leading them into battle.\n• Typical examples of Elites include Combine Elite from Half-Life 2, Replica Elite from F.E.A.R., Theron Guards from Gears of War, Skaarj from the Unreal series, Alien Grunts from Half-Life, Endtrails from Turok 2, Chaingunners from Doom, Ultor Elite Guards in Red Faction, Elite Big Daddies in BioShock, Privateer Defenders from Far Cry 3, and most Brutes and Elites as seen throughout the Halo series. The highest ranked Elites and Brutes fall somewhere between Elite and Champion due to their very tough energy shields and optional cloaking devices or jetpacks.\n• The Heavy: The FPS Giant Mook. \n\nThe Heavy is your basic FPS Giant Mook. He's big, can dish out lots of damage, and can take a lot of damage in turn. To balance this out, he's usually slow as hell. 9 times out of 10 he'll carry a minigun or at least a heavy machinegun as his main weapon. He's also typically decked out in a heavy suit of armor to justify his insane durability. The Heavy can usually survive at least a couple dozen bullets, with the more robust examples requiring two or three full clips of assault rifle fire to kill. Weapons that are a one-hit kill against standard Mooks, such as the shotgun or grenade launcher, usually require several shots to finish a Heavy. Sometimes Heavies are puzzle enemies that can only be killed by specific means, such as shooting them in a weak point or killing them with environmental traps (examples of this type can be found in Wolfenstein and Killzone). He's usually used more sparingly than the basic Soldier, with at most two or three appearing per level. The Heavy is one of the more fantastical FPS enemies, and \"realistic\" shooter series such as Call of Duty and Medal of Honor generally don't use him (although there are occasional exceptions). However, he's a popular and commonly used enemy-type in even moderately fantastical FPS games, and 9 out of 10 games in the genre will probably feature an enemy of his type.\n• Typical examples of Heavies include Barons of Hell, Hell Knights and Mancubi from Doom and especially Doom 3, Heavy Armor soldiers from F.E.A.R., the Boomers from Gears of War, Brute Warchiefs and Hunters from Halo, Fat Boys from Far Cry (PC version), Proto-Soldats and Uber-Soldats from Return to Castle Wolfenstein, Drudge Scarabs from The Conduit, minigun Ganados/Majini from Resident Evil 4 and Resident Evil 5, and the Triad Enforcers in Rise of the Triad.\n• Beware of Heavies whose strength and bulk does nothing to decrease their speed! These Lightning Bruisers will often be some of the nastiest enemies you'll ever face. Examples include the Bouncer and Rosie Big Daddies from BioShock, Juggernauts and Lords of the Flesh from 'Turok 2, Super Mutant Overlords and Behemoths from Fallout 3, the Juggernauts from Call of Duty Modern Warfare 2, Heavy Hover Tanks from Quake IV, and the Hunters from Half-Life 2.\n• The Ninja: An enemy that is fast, stealthy, or agile. \n\nIn many ways, the Ninja is the opposite of the Heavy. Instead of being much stronger than the basic Mook, he's much faster - or she is. If there's a female mook, it's often the Ninja. The Ninja has very high movement speed, and is usually also very agile, having moves not available to standard Mooks such as being able to climb walls or make two-story jumps to move up to higher platforms. In extreme cases they can outright teleport. Ninjas usually prefer melee attacks, or are at least limited to light weapons such as pistols or submachine guns. They're often equipped with some form of cloaking device as well. Surprisingly, the Ninja isn't really a Fragile Speedster, and can usually survive at least as much damage as a standard Soldier Mook.\n• Typical examples of Ninjas include the Replica Assassins from F.E.A.R., the Assassins from Half-Life, the Veil Assassins from Wolfenstein (2009), the Spider and Houdini Splicers from BioShock, Xenomorphs from Aliens vs. Predator, the Chameleons from Resistance 2, the F.R.O.G.S. from Metal Gear Solid 4: Guns of the Patriots, the Revenants from Doom, the Nightkin from Fallout: New Vegas, and the Ceph Stalkers from Crysis 2.\n• The Pyro: Short-ranged enemy focused on flushing out the player. \n\nUsually wielding a Hollywood Flamethrower, but also occasionally equipped with another close-range weapon such as Short-Range Shotgun, these Mooks tend to be a type of Zombie, characterized by their Elite-level durability, low speed, and short-ranged attacks that bring a world of hurt if they're allowed to actually come close. Their role is to force the players to take them out quickly or be pushed out of cover. Often overlaps with...\n• The Canister: A walking explosive barrel. \n\nThe Canister is a type of mook, often a Pyro, characterized by wearing a bulky, obvious backpack. Usually of the volatile sort. A few well placed shots turn the Canister into a Exploding Barrel, while a few misplaced ones turns it into an Action Bomb. Canisters who are also Heavies tend to be only defeatable by targeting their namesake.\n• A good example of Pyros that are also Canisters are the Pyro type mercenaries from Mass Effect 2. Borderlands has the Badass Crimson Lance elemental troopers, a good example of a Heavy Canister who isn't a Pyro. The gas-masked tank-backpacked enemies in the first Soldier of Fortune are also this.\n• The Shield: An enemy who fancies a shield. \n\nThe Shield is a type of Soldier or (more commonly) Zombie that is characterized by being heavily armored from the front. The most common type is a Soldier carrying an enormous riot shield that is immune or nigh-immune to damage. A Shield has to be defeated in a more tactical way than the average Mook, though it varies greatly from game to game. Sometimes the shield leaves exposed a part of the enemy that can be hit for normal (or massive) damage. Sometimes the Shield has to lower the defense for a moment in order to attack. Sometimes hitting the shield hard enough will cause the owner to flinch, exposing him to damage. Powerful weapons may ignore the shield, but ammunition is never plentiful. Sometimes the shield has to be removed by some use of the player's powers, as in the Puzzle. Co-op games tend to encourage defeating Shields by surrounding them, as usually they are vulnerable from the rear. And so on, and so forth.\n• Examples of Shield Zombies include Lasrian Maulers, Alpha Skags, Brains, and 'ard Boyz, while Shield Soldiers include Lance Defenders, Riot-shield using Russian soldiers, and Jackal Majors (sort of).\n• The Sniper: A long range fighter. \n\nThe Sniper is Exactly What It Says on the Tin. He's armed with a powerful long range weapon, has excellent aim, and can usually kill you in just a few shots. Instead of charging you alongside his Soldier buddies, the Sniper is usually perched high up in a guard tower or top-story window. They usually feature a \"tell\" to help warn players of their presence, such as a conspicuous laser sight or a flash of sunlight reflecting off their scope. Snipers that don't feature a tell to help you spot them and/ or can kill you in one or two shots are the very definition of Demonic Spiders. Snipers are becoming one of the most commonly used modern FPS enemies next to Soldiers, because (to quote Duty Calls) they are \"a real-life war scenario\". Note that Snipers need not be wielding actual sniper rifles; rocket launchers, laser weapons, or even a really long tentacle can suffice as armament for the Sniper, as long as his behavior fits.\n• The Champion: The FPS Superpowered Mooks. \n\nOften, these guys have the same or similar powers as the player character, allowing them to match the powers which you've been using to curbstomp even the Elite Mooks. Like Elite Mooks, they also usually have significantly more health than a regular Mook, although usually not as much health as a Heavy or Boss.\n• Typical examples of Champions include Nightcrawler Elites from F.E.A.R., Feral Warriors from Far Cry Evolution, Nano Elites from Red Faction II, Elite Guard from Project: Snowblind, Quantum Guards from Time Shift, Ultra Elites in Halo 2 and Halo: Reach, and North Korean Nanosuit soldiers from Crysis.\n• The Trigger: An enemy that must be treated with care otherwise something bad will happen. \n\nThe Trigger is a type of Zombie or Soldier that will, if treated the wrong way, become a much greater threat to the player. Typical conditions that result in the increase in difficulty include being inflicted with the wrong Standard Status Effect, taking too long between first shooting them and finishing them off, taking out their allies before them, not interrupting them when they start doing something to power themselves up, or simply not taking them out early enough.\n• Examples of Triggers include Psycho Zombies which receive an insane speed boost if downed and not finished off, Cerberus Combat Engineers which will deploy a strong turret if not killed or interrupted with an attack, and Goliaths who go into a berserk rage if their helmet is shot off.\n• The Medic: Those that heal or resurrect others. \n\nThe Medic comes in two types - there is The Nurse, whose task is to replenish the Hit Points of their allies, and The Necromancer, who has the ability to bring other enemies back from the dead. While related, they play different roles. A Nurse will often appear alongside a Heavy (or worse), making them that much harder to take out, and may often come to the aid of a boss, requiring you to take them out before they heal back your hard-earned progress. Necromancers meanwhile tend to focus the battle around themselves, requiring either quick taking down or that the corpses be somehow made unresurrectable (with gibbing being the widely accepted method), before the enemy wears the player down with numbers. While Nurses tend to be Soldiers or Grunts (if they even can fight at all), Necromancers also are known to be Elites or Heavies, often standing back well behind their resurrected minions.\n• Examples of Medics include Crimson Lance Combat Medics, who are Soldier Nurses, Medics and Repair Bots, who are Soldier and Bat necromancers, and Arch-Viles, who are Heavy Necromancers.\n• The Walking Tank: A souped-up version of the Heavy. \n\nThe Walking Tank is the Heavy taken Up to Eleven. Often a Humongous Mecha, the Walking Tank is generally used as a boss-type encounter in games which don't actually use unique bosses. They take an incredible amount of firepower to put down, often being able to take at least a couple hundred assault rifle bullets before dying, or more often than not being outright Immune to Bullets and requiring a ton of rockets to bring down. Fortunately, you'll usually be given a rocket launcher or other heavy weapon just prior to fighting them. There will usually only be a handful of them at most in a single game. There's some overlap between Heavy and Walking Tank; the Walking Tank tends to be much larger and tougher, and typically only a handful appear within a game.\n• Typical examples of Walking Tanks include the 4 different varieties of Powered Armor from the F.E.A.R. series, the boxguards from Deus Ex: Human Revolution, the Gargantuas from Half-Life, the Titans from Unreal, the Tanks from the Quake series, Hunter-Choppers and Striders from Half-Life 2, the Drudge Invaders from The Conduit, the Ceph Pingers from Crysis 2, the Cyberdemon and Spiderdemon from Doom, Battle Armors in Red Faction II, and the Super Mutant Behemoths from Fallout 3.\n• Just Plain Tank: An armored vehicle. \n\nThe Just Plain Tank is, as simple as that, an armored crawling vehicle, which can be an actual tank, an IFV or something like that. Sometimes they are mobile, and sometimes they are just very large turrets, like in the first Half-Life.\n• Typical examples of Tanks include the Pig Cop Tank from Duke Nukem 3D, HECU tanks and Bradleys from Half-Life, combine APCs from Half-Life 2, T-72s in Modern Warfare, and Wraiths from Halo.\n• Gunship: A flying attack platform. \n\nThe Gunship is most often a helicopter, but it doesn't really have to be, and will sometimes be replaced by something fantastical in a future setting. Basically, a gunship is just that, a gunship, a hovering aircraft that flies around while firing at you. Most often armed with a machine gun, but will also sparingly use rockets. Expect to find a rocket launcher right before you engage them. In more realistic games, this will be used as a Mini-Boss, and it almost always supports the infantry. Some gunships may drop infantry, but often times this duty is instead delegated to a different aircraft.\n• Typical examples of Gunships include the Synth Gunships from Half-Life 2, the Apaches in Half-Life, Russian Hinds in Modern Warfare 1 and 2, Phantoms in Halo (of the \"also drops infantry\" variety), the helicopter in Perfect Dark, and the helicopters in Crysis.\n• Halo series:\n• Grunts: Grunts, of course! They can actually survive as many bullets as most FPS soldier enemies (three to ten shots from the assault rifle depending on the variant) and throw grenades, but they're usually equipped with the weakest weapons (and fire very slow bolts), can't use melee attacks (until Halo 5: Guardians), are very dumb, prone to run away or sleep in a warzone, and their short stubby legs make them really slow. Jackals also count, being about as dangerous as Grunts; they can take slightly fewer bullets and can't throw grenades, but they have a hand-held energy shield that blocks damage. There's also Crawlers, which are extremely agile and have a low profile, but are otherwise fairly weak. Then there's Drones in 3 and ODST, who are basically Grunts that fly.\n• Soldiers: Promethean Soldiers, Sentinels, SpecOps Grunts, and Skirmishers. Skirmishers mostly carry carbines and needle rifles and can move very fast. SpecOps Grunts have about twice as much health as standard grunts and carry better weapons, such as needlers, fuel rod guns, and occasionally plasma rifles; their morale also doesn't break as easily. Arguably, Elite Minors and Storm count as well, with higher ranked Elites like the Majors being the Elites... when compared to the Elites.\n• Rats: Flood Infection Forms. They die in one hit from anything and are limited to very weak suicide attacks.\n• Snipers: Jackal snipers, who are outright Demonic Spiders on the higher difficulties due to their shots being a one-hit-kill. Later games not only add Crawler Snipes, but also cross this over with Elites; Promethean Lancers armed with binary rifles, Elites armed with beam rifles, and Soldier Snipers are the major culprits here.\n• Elites: Brutes (especially in Halo: Reach and Halo 3) and Elites (especially the higher ranked ones, such as majors) can survive 2 to 3 times as much damage as a \"standard FPS soldier\" Mook depending on the variant, and come equipped with better-than-average weapons. Particularly, the plasma rifle favored by Elites is especially effective against your character's own energy shield. Promethean Soldiers and Halo 4's version of Promethean Knights are very much this too.\n• Heavies: Hunters; huge, slower than normal (they become much faster in the later games), armed with either an explosive cannon or a beam cannon, with high health and bulletproof armor leaving them only vulnerable only to either anti-tank weapons or shots to their exposed weak spot. Halo 5: Guardians's version of Promethean Knights are also this, being tough, slowish enemies with a lot of firepower who only expose their weak spots after you've damaged them enough. Brute Chieftains and Elite Generals/Warriors also count, being able to take a few dozen assault rifle shots before falling, and also often wielding plasma grenade launchers or Fuel Rod Guns.\n• Ninjas: Drones, Brute Jumpers, Elite Rangers, Special Ops / Stealth Elites, and Brute Stalkers; the former three fly and jump all over the area, the latter two are equipped with cloaking devices. There's also the Skirmishers, which run extremely fast, leap around frequently, and take about as many bullets to kill as standard FPS 'Soldiers'. Grunt and Jackal Rangers are a borderline example. Promethean Soldiers and Halo 4 Knights also border on this, due to their ability to teleport around.\n• Shields: No dedicated enemy, but Jackals (Grunts) and Hunters (Heavies) both have shields. Just about every tactic described above works on them.\n• Champions: The highest ranked Elites, such as Ultras, Zealots, Generals/Commanders wielding swords, and Special Ops Elites are just as tough as the player character, and have (depending on the game) the ability to dual wield and throw grenades even in games where other lesser Elites can't, a powerful and fast-recharging energy shield, lethal melee attacks, and special armor abilities such as Jetpacks, Active Camouflage, and Armor Lock-up. Brute Chieftains wielding gravity hammers qualify as well.\n• Medics: Engineers, who give enemies shields, and Watchers, who can heal, shield, and (in Halo 4) even resurrect fallen enemies.\n• Just Plain Tanks: Covenant Wraiths. One of the weaker examples, since their projectiles are very slow, they only have one pintle-mounted machine gun, and they can be handily destroyed with anything bigger than an assault rifle.\n• Zombies: The Flood. Pretty self-explanatory, really. Even in the later games where they do get a bit smarter, they mainly just run at you and try to melee you, or run at you while shooting wildly.\n• Gunships: Covenant Banshees, slow fragile one-man craft that strafe you with plasma cannons and fuel rod guns, and Phantoms, bulbous transports that drop infantry while firing at you with their mounted guns. Also, Forerunner Phaetons, which don't drop troops, but actively try to kill you.\n• Half-Life series:\n• Zombies: Headcrab Zombies, All variants except for Fast Headcrab Zombies Bullsquids, Houndeyes, Race X Pit Drones, Antlion workers, Antlion soldiers The workers are about twice as tough as the soldiers and have a projectile attack, but both variants just mindlessly jump or charge at you in an attempt to maul you to death.\n• Grunts: Alien Slaves, Their species was named \"Vortigaunts\" in the second game, which turns them into friendly Champions Civil Protection officers\n• Walking Tanks: Gargantuas, Alien Aircraft, Only in Decay, otherwise they don't appear outside of scripted scenes and background decoration. Combine Striders, Combine Hunter-Choppers Normally the latter would fill a Gunship role, but they are much more powerful than other enemies that would fill that role, including Synth Gunships in this same game and Apache gunships in 1, and both Hunter-Choppers are treated as boss encounters.\n• Rats: Headcrabs and their varieties; Manhacks, Scanners, and Synth Scanners are of the flying type\n• Gears of War series:\n• Heavies: Boomers and their various sub-types, Bloodmounts\n• Walking Tanks: Reavers in the second game\n• F.E.A.R. series\n• Grunts: Recon Replica soldiers, ATC BlackOps light troopers. These guys, fought in the first levels, have less health and slightly worse aim compared to standard Replica/ATC troops. ATC light troopers are also noteable for not being able to throw grenades.\n• Soldiers: Replica soldiers, ATC BlackOps. These guys are probably one of the Trope Codifiers with regards to how most standard FPS enemies behave and fight.\n• Snipers: Replica snipers. In the first game they're just standard Replicas armed with a particle beam rifle and stationed in high windows, in the second game they're lightly armored and equipped with anti-material rifles (which helpfully give away their position due to being mounted with laser sights).\n• Elites: Replica Elites, Nightcrawlers, ATC Elites. Replica Elites and Nightcrawlers from the first game occasionally carry BFGs and are tough enough to survive a direct hit from a frag grenade or particle beam rifle, while Replica Elites in the second game wear heavy armor and can survive more than twice as much damage as a normal Replica soldier.\n• Heavies: Heavy Armor soldiers, ATC Pyro troopers. Heavy Armors are equipped with armor-piercing rifles or miniguns, and take about a full clip and a half of assault rifle fire to kill. Pyros are nearly as tough, and armed with a goddamn flamethrower.\n• Ninjas: Replica Assassins, Abominations, and Shadow Creatures. All are very fast and agile; Assassins and Abominations can leap around all over the area and attack you from different directions, while Assassins and Shadow Creatures are nearly invisible due to technological or supernatural cloaking.\n• Champions: Nightcrawler Elites in the Perseus Mandate expansion pack. They have the same Slo Mo power as your character, which lets them zoom several feet in a split second and also means they aren't slowed down when you activate your own Slo Mo. They're also agile like Assassins and nearly as durable as a Heavy, and often carry heavy weapons such as grenade launchers, lightning guns, or BFGs.\n• Walking Tanks: REV 6 Power Armor, REV 8 Power Armor, Elite Power Armor. Humongous Mecha that are used in lieu of actual bosses throughout the series.\n• Zombies: Nightmares and Specters; their attack pattern is extremely simply... just fly directly at you and explode on contact. Fortunately, it only takes 1 or 2 bullets to pop them.\n• Far Cry series:\n• Far Cry:\n• Grunts: T-shirt Mercs, Pirates (Instincts). In the console version these guys are equipped only with pistols and have less health than average, while on the PC version they lack body armor and thus have nothing to deflect bullets shot at their torso.\n• Soldiers: Mercenaries. Armed with assault rifles, throw grenades, take cover, etc. Notably come in several different variants based on weapon specialization and tactical behavior.\n• Snipers: Merc Snipers. Dressed in black outfits and armed with sniper rifles.\n• Elites: Elite Mercenaries, Soldier Trigen (PC version), Alpha Trigen (Instincts). All can survive noticeably more bullets than regular Mercs, with Elite Mercs having night-vision goggles, Soldier Trigen being able to jump several dozen feet, and Alpha Trigen having powerful machineguns and a real nasty melee attack.\n• Heavies: Fat Boys (PC version), 8-foot-tall slow-but-relentless bruisers capable of withstanding two to three clips of assault rifle fire and having a rocket launcher for an arm.\n• Ninjas: Stealth Trigen, equipped with a cloaking device that's almost always on, and wielding silenced submachine guns. They're also notable for having almost-perfect invisibility, without the usual Predator-style blur effect to give them away.\n• Champions: Feral Warriors (Instincts) from the console series have the same special powers your character does, including super-speed running, enhanced jumping ability, and a very powerful leaping melee attack.\n• Walking Tanks: Fat Boys (Instincts), 9-foot tall obese ogres that charge at you and try to club you, and can survive an insane amount of bullets.\n• Zombies: Monkey Trigens, Trigen zombies (Instincts). Monkey trigens just run straight at you and try to jump and melee you, while Trigen zombies just run straight at you while shooting you with their P90s. Monkey trigens can kill you in just 3 hits on Normal difficulty, while Trigen zombies often attack you in swarms of a couple dozen at once.\n• Far Cry 3: Also includes their camera tags.\n• Zombies: Pirate Beheaders (appear as lightning bolts), they only carry machetes and attack by charging straight at you; most hostile animals (appear as predator's teeth) fall into this category as well.\n• Triggers: Attack Dogs (appear as predator's teeth), they act like Zombies when playing noisy, but are hard to dispatch in stealth as they can detect you even while you're out of sight.\n• Grunts: Pirate Assaulters (appear as skulls), they carry AKMs and appear in most enemy patrols and outposts; they go down after a couple of bullets, only wear T-shirts, and have poor accuracy even when they're not blind-firing or hip-firing, which they often are.\n• Soldiers: Privateer Assaulters (appear as skulls), are similar to pirates, but they carry P416s, are smarter, can throw grenades, have better accuracy, and wear body armor that lets them survive a few assault rifle rounds before going down.\n• Elites: Pirate and Privateer Defenders (appear as skulls), they are more armored versions of the Assaulters and are often found guarding outposts.\n• Ninjas: Pirate Berserkers carry shotguns and can sprint to you while dodging gunfire. Privateer Chargers are instead armed with submachineguns and can do the same, but can also shoot from afar. Both appear as lightning bolts.\n• Canisters: Pirate Molotov Throwers (appear as lightning bolts), they are only armed with Molotov Cocktails and will burst into flame when shot.\n• Snipers: Pirate and Privateer Snipers (appear as crosshairs), they act like standard Snipers, down to the Laser Sight, but also pack submachineguns in case you get too close. Pirate and Privateer RPG Shooters (also appear as crosshairs) are very similar: they only use their rocket launchers from long range, like Snipers but without the \"tell,\" and also pack submachineguns as sidearms.\n• Heavies: Pirate and Privateer Heavy Gunners (appear as shields), they carry light machine guns and wear bomb disposal suits that allow them to survive a point-blank grenade explosion or several dozen assault rifle rounds. You need a special skill to do takedowns on them.\n• Pyros: Privateer Heavy Flamers (appear as shields), they carry flamethrowers and wear fireproof suits. The gas tanks on their backs take a lot of damage before exploding. Just as with Heavy Gunners, you need a special skill to take them down.\n• Gunships: Helicopters. They only appear when outposts call for reinforcements and carry around three enemies.\n• Far Cry 4: Remains largely the same as Far Cry 3's lineup, but with the Royal Army and the Royal Guard in place of Pirates and Privateers, respectively. Assaulters and Defenders now appear as triangles. Changes and additions listed below.\n• Ninjas: Royal Army Beheaders (appear as lightning bolts), they are now upgraded into this, as they can dodge gunfire more easily and can use throwing knives to attack at range. They are armed with kukris.\n• Champions: Royal Army and Royal Guard Hunters (appear as crossed arrows), they only use bows, but rely the same stealth tactics you do. They only stay tagged for a few seconds and can charm nearby predators into attacking you.\n• Far Cry 4's Shangri-La episodes: The Rakshasa in these missions embody their own enemy types.\n• Ninjas: Butchers take after the Royal Army Beheaders, but with the added bonus of intermittently disappearing from view.\n• Snipers: Lurkers use bows, so they don't have a \"tell.\" They occasionally use poisoned arrows to disorient you, and can summon Beasts.\n• Triggers: Beasts take after the attack dogs, but can also explode when they get close. Their dead bodies can be used to cause explosions if left intact.\n• Heavies: Scorchers are so huge that you need to distract them with the tiger to do takedowns on them. They literally breathe fire, so they also count as Pyros.\n• Crysis and Crysis: Warhead:\n• Snipers: North Korean snipers; perched in guard towers or on top of hills, and equipped with .406 sniper rifles.\n• Heavies: Alien Scouts; take a few dozen assault rifle rounds or a couple direct hits from a grenade launcher to kill, have strong weapons, and can fly, which they use to dodge around while pelting you from afar with flechettes, bombs, freeze rays, and particle beams; balanced out by their enormous hitbox (as big as a Humvee).\n• Champions: North Korean Nanosuit soldiers, which are statistically identical to the PC.\n• Walking Tanks: Alien Hunters, building-sized tripod mechas equipped with multiple large cannons and armor capable of soaking up man-portable anti-tank missiles.\n• Gunships: North Korean WZ-19s; as noted earlier, Alien Scouts can also fly, and while weaker individually than attack helicopters, they tend to come in squads.\n• Crysis 2 and 3\n• Elites: Ceph Grunts; thrice as durable as C.E.L.L. Operators, with stronger weapons, greater speed and maneuverability, a built-in sticky grenade launcher, and powerful melee attacks.\n• Heavies: Ceph Devastators, 12-foot tall heavily armored bruisers with the Ceph equivalent of a heavy machine gun and grenade launcher.\n• Ninjas: Ceph Stalkers, shorter than Grunts with a slightly weaker gun, but slightly tougher and very fast and agile.\n• Champions: Ceph Commanders; like the Grunts, but thrice as durable (with most of that coming in the form of a rechargeable energy shield), stronger, more accurate, and equipped with better weapons. They're nearly as tough as the PC, can heal like him, and are equal to him in melee combat. Ceph Guardians are similar, except they favor melee combat more, are a bit tougher, and can cloak.\n• Walking Tanks: Ceph Pingers, 18-foot tall bipedal mechs with JAW-resistant armor and cannons that can casually core an IFV.\n• Mass Effect :\n• Heavies: Geth Primes (and to a lesser extent, Geth Hunters); Geth Destroyers; any Krogan unit; Geth Armatures are somewhere between this and Walking Tanks, depending on your level and whether or not you've got the Mako IFV.\n• Walking Tanks: Geth Colossi and Thresher Maws. Different than most examples, since they are more common and you fight them with an IFV. They only really qualify for this if you fight them on foot, which isn't necessary.\n• Mass Effect 2 :\n• Soldiers: Geth Troopers; Blue Suns Troopers and Heavies; Eclipse Troopers and Heavies; Blood Pack Troopers and Boom Squads; Collector Drones; Project Guards; Shadow Broker Agents; Batarian Troopers.\n• Heavies: Geth Primes (and to a lesser extent, Geth Hunters); Scions; Blue Suns Commanders; Eclipse Commandos; Krogan Battlemasters technically this isn't an enemy, since all of the Krogan Battlemasters fought are named and have unique models, but they occur about as often as the \"Heavy\" unit for the other two merc groups, Commandos and Commanders, and all of them fight the exact same way, making them functionally identical from a gameplay perspective\n• Canisters: All of the pyros. LOKI and YMIR mechs also explode if shot in the head hard enough.\n• Walking Tanks: Geth Colossi (unless you're fighting them inside the Hammerhead; YMIR mechs; Collector Praetorians; Thresher Maws.\n• Gunships: The Mantis gunships fought as bosses in two levels in the second game, and once in a DLC.\n• Mass Effect 3:\n• Cerberus Troops:\n• Soldiers: Assault Troopers are fairly standard Soldiers, though they are tactically smart and come equipped with powerful melee attacks and are very accurate with their grenades.\n• Elites: Centurions are like Assault Troopers, but have regenerating Deflector Shields (making them more durable), slightly stronger guns, and deploy smoke screens to help their allies.\n• Snipers: Nemeses combine Sniper duties with the mobility of a Soldier.\n• Heavies: Dragoons are well armored and will often try to rush into melee combat with their biotic whips.\n• Shields: Guardians are a textbook example. Every single tactic described in the main entry works to a lesser or greater degree.\n• Triggers: Combat Engineers are Soldiers that will, if left unchecked, deploy powerful automated turrets.\n• Medics: Engineers can also repair both their own turrets and allied Atlas Mechs.\n• Walking Tanks: Atlas combat mechs have considerable weaponry and take a lot of firepower to take down. They're more like simple Heavies in multiplayer.\n• The Ninja: Phantoms, complete with speed, melee attacks, invisibility, and considerable durability.\n• Husks/Reaper Forces:\n• The Soldier: Cannibals. They're mostly the same as troopers, even being able to fire grenades from their arm cannon, but their guns have a lower rate of fire, they don't take cover as effectively, and they can't roll. To make up for this, they also come equipped with the unique ability to eat fallen allies to regain health and add armor plating.\n• The Elite: Marauders. Equipped with deflector shields, armed with Phaeston assault rifles, and have the ability to buff Husks and Cannibals with armor plating.\n• The Medic: As mentioned, they can buff their allies with armor plates.\n• The Heavy: Brutes. Big, durable, deadly in melee combat. Also, Harvesters.\n• The Champion: Banshees. They can use many of the same biotic abilities that the players can, including Nova, Charge, Warp, and Barrier. They can also Flash Step. May also be a Walking Tank given just how powerful they are.\n• Snipers: Ravagers. They're quite heavily armored for snipers, and their cannons are faster than sniper rifles, but they still fit a sniper's behavior of camping in the back and pelting you with incredibly accurate and powerful shots.\n• Geth:\n• Triggers: Geth Bombers have no normal weaponry but will, well, drop bombs if they get close enough.\n• Walking Tank: Primes. More like Heavies in multiplayer though.\n• Rats: The combat and turret drones deployed deployed by the Primes.\n• Collectors:\n• Zombies: Abominations. Just like husks... except they explode on death.\n• Soldiers: Troopers. They're mostly the same as Cerberus troopers, but can be possessed by a Reaper, resulting in them gaining much more health, a barrier, and the ability to put up webs.\n• Elites: Captains. More durable than troopers, come equipped with a recharging barrier, and summon Seeker Swarms. Possessed Captains and Possessed Troopers also qualify.\n• Heavies: Scions. Similar to Ravagers, they are very well armored, much more so than any non-boss unit, and fire a powerful cannon rather than a sniper rifle. When possessed, they can also fire cluster grenades. Double as the Sniper.\n• Walking Tanks: Praetorians. Particularly possessed ones. Also, Possessed Scions.\n• CAT6 mercenaries (Citadel DLC):\n• Champion: Not technically a part of this faction, only appearing in the arena in the same DLC, but still notable: Mirror Match enemies.\n• Modern Warfare / Call of Duty :\n• Zombie: Dogs. Zombies in Nazi Zombies mode. Japanese soldiers when using the banzai charge. Suicide Bombers in Modern Warfare 3's Survival Mode are the Action Bomb variant.\n• Soldier: Almost every Russian / German / Middle Eastern / Japanese soldier encountered in any game in the series. Normal AK-47 wielding soldiers in Survival Mode.\n• Elite: Varies, but most games have one unit who are functionally better than the rest, such as Shadow Company from Modern Warfare 2 or gas mask wearing Commandos in Modern Warfare 3's Survival Mode. In particular, the Commandos can take more punishment than should be humanly possible even with the best body armor, being able to survive 7-9 rifle rounds before dying. They also carry western firearms like the ACR, and have near perfect accuracy.\n• Heavy: Juggernauts, light machine gun carrying soldiers with extremely heavy armor. Mostly regulated to Survival Mode and special ops missions.\n• Serious Sam 3: BFE:\n• Elites: Arachnoid Hatchlings can survive twice as much damage as a standard FPS 'Soldier' Mook, are one of the only enemies in the game equipped with hitscan weapons (which does twice as much damage as the Cloned Soldiers' rifles), and have a deadly melee attack.\n• Ninjas: Scythian Witch Harpies and Aurigan Cave Demons; the former can fly, toss slow moving energy balls, and survive as much damage as a standard FPS 'Soldier' Mook, whereas the latter leap around and stick to walls\n• Walking Tanks: Khnums. Until the final level, where you face dozens of them.\n• Marathon\n• Walking Tanks: Drinniols, Mother of All Hunters, Mother of All Cyborgs\n• Descent I and II\n• Pyros: Smelters (ricocheting projectiles force you out of cover), SPIKE's (their Omega Cannon will zap you at close range)\n• Triggers: Supervisors don't attack, but alert other enemies to your presence; Sidearm Modulas will reform into a full-size Sidearm if not killed quickly; Diamond Claws and Class 2 Heavy Drillers shoot returning homing plasma if hit with energy weapons.\n• Red Faction 1:\n• Snipers: Guard Captains when using Sniper Rifles, Mercenary Commanders when using Rail Drivers\n• P.N.03, although a Third-Person Shooter, has many of the FPS enemy types\n• Grunts: Pilz, Walnusse; the latter of which are more durable than most grunts, but still have weak weapons\n• Triggers: Pilz self-destruct if you get too close, Rankes explode if they latch onto Vanessa.\n• Resident Evil 4:\n• Triggers: Starting with Chapter 2, Ganados will randomly hatch Plagas if headshot, and starting with Chapter 3, those can One-Hit Kill you via decapitation.\n• Fallout 3\n• Snipers: Can appear among any human faction\n• Pyros: Fire Ants, Mister Gutsy at close range, Flamer-wielding humans, Glowing Ones, Enclave Hellfire Troopers (when using the Heavy Incinerator)\n• Medics: Glowing Ones heal nearby Feral Ghouls with their radiation.\n• Fallout: New Vegas:\n• Champions: NCR Veteran Rangers, Legionary Assassins, Brotherhood Paladins, Irradiated Marked Men, Irradiated Heavy Troopers, and Irradiated Legionaries. The Paladins, Veterans and Assassins have the highest stats of any non-boss human enemy, as well as Level Scaling with the player, while the latter three have very high HP and regenerate it when exposed to radiation.\n• Snipers: Any human mook when using sniper/marksman weapons\n• Canisters: Spore Carriers explode if not quickly killed. The Giant Ants in the Nellis Generators also explode upon death.\n• Triggers: Blind Deathclaws alert other nearby deathclaws when they sense the player.\n• Left 4 Dead 2:\n• Triggers: Boomers, which can puke on players to draw in more Common Infected, and Survivor Infected, which can be killed for a highly valuable med kit but have a lot of health and try to run away\n• Cannisters: Boomers also explode when killed; being caught in the explosion will get its guts on you, which can also attract zombies\n• Saints Row IV\n• Grunt: Gang members and police. Armed with basic weapons and no powers or extra abilities to speak of. They were easily disposed of even when the Boss didn't have super powers, but now, they're no more threatening than a fly.\n• Soldier: Zin Grunts. They use better weapons than police and are armed with suppression grenades that disable your super powers.\n• Elite/The Ninja: Super-Powered Zin. They are more durable than regular Zin, are unfazed by being set on fire (although they still take damage), can ninja flip to recover after being knocked down, often come equipped with rocket launchers, and can use the Super Sprint and Super Jump powers to maneuver around like the Boss can.\n• The Heavy: Murderbots. Armed with either a highly inaccurate but fast-firing laser gun or a slow-firing but powerful mine launcher, and backed up by a sizable health pool and immunity to fire. However, they are very slow and can be outmaneuvered with ease.\n• The Shield: Zin Grunts with Zin Tek Force Shields that protect them from firearm damage from the front.\n• The Medic: CID's. They can provide an energy shield to fellow Zin which protects them from damage, but have no offensive capabilities whatsoever, save for the finale, in which explosive CID's try to attack you.\n• The Champion: Wardens. Big, bad creatures working for the Zin Empire who enforce the rules when the simulation is pushed too far. They have an arsenal of superpowers at their disposal, including an energy blast, telekinesis, and a super stomp. At close range, they will either fire their wrist-mounted laser at the Boss or simply knock them away with a powerful melee attack. They can also leap tremendous distances and even body slam the player if they are in a vehicle, instantly destroying it. If that wasn't bad enough, they also come equipped with an energy shield after their first encounter, granting them immunity to bullets until it is disabled temporarily.\n• The Gunship: Zin UFO's that attack you at higher notoriety levels. They are quite frail, but can deal large amounts of damage with their missiles.\n• Just Plain Tank: Marauders. They have a slow-firing but powerful laser attack and must remain stationary to fire, but can move around in a ball form.\n• Spec Ops: The Line\n• The Grunt: Refugees. They use the weakest weapons in the game and are easily disposed of.\n• The Soldier: 33rd Infantry. They make up most of the enemies in the game. They use a greater variety of weapons then the Insurgents, such as assault rifles, shotguns, and SMG's, and also have better tactics.\n• The Elite: Zulu Squad. They are incredibly durable, wield powerful weapons such as the AA-12 shotgun or P90, and can be identified before they appear by their ice cold radio chatter. They appear in greater numbers as the campaign progresses, and replace all enemies in co-op if the difficulty is Suicide.\n• The Heavy/The Champion: Heavy Troopers. They wade into battle with a huge amount of health and an incredibly powerful LMG which can tear apart Walker and his squad with ease. They are weak to grenades and explosives, which stagger them long enough to get a large amount of shots into them. A unique one appears in \"Alone\", where it attacks Walker while teleporting around the room as the lights flicker on and off.\n• The Sniper: 33rd snipers. As their name implies, they typically fight at long range, but are easily killed while they take time lining up a shot.\n• The Ninja: Edged Weapon Experts. They are too fast to outrun, can dodge gunfire by rolling, and will kill you in only a few hits if they get in range.\n• Metroid Prime\n• Triggers: Sentry Drones lock down a room when they spot Samus, Puddle Spores release a spread of energy globules when approached.\n• Sniper Elite 4\n• Grunt: Italian Blackshirts, Kriegsmarines, and other infantry enemies without helmets.\n• Soldiers: Infantry with helmets, allowing them to survive headshots from weak weapons, such as silenced ones.\n• The Turret: Panzerturms, basically a tank cannon stuck in the ground .\n• The Elite: Jager troops, more aggressive, durable, and accurate than normal soldiers.\n• The Sniper: Enemy snipers, they can spot the player from ridiculous distances and shoot with incredible accuracy, and Faust Troopers, enemies who carry Panzerfaust anti-tank weapons that can damage the player even when they are behind cover.\n• The Champion: Valkyrie Squad, they are stronger than Jager troopers and have stronger variations of each other enemy type in their ranks.\n• Just Plain Tank: The various armored vehicles found throughout the game.\n• Bioshock Infinite:\n• Zombies: Columbian baton police, melee thugs, and machete Vox Populi; despite being (ostensibly) regular humans, they just suicidally attempt to charge and engage you in melee.\n• Grunts: Columbian Police (both genders), firearm thugs, and female Vox Populi; all are less accurate and weaker than Soldiers, and usually only carry pistols.\n• Soldiers: Soldiers and male Vox Populi; the most common foes in the game and equipped with carbines, shotguns, and submachine guns, they're as standard as this enemy type gets, excepting their lack of grenades and questionable tactical behavior.\n• Elites: Heavy Soldiers; identical to the above but with souped-up hit points thank to their armor, they are common in late-game areas.\n• Snipers: Columbian snipers and Vox Populi snipers; again, a standard example of the archetype, they're perched on elevated platforms and wield bolt-action sniper rifles.\n• Ninjas: Columbian Crows; they can turn into a murder of crows to fly, dodge fire, and 'teleport' around the player, attempting to sneak up on them to engage at close-range with shotguns and swords.\n• Pyro: Columbian Firemen; they shoot napalm-like fireballs out of their hands and always attempt to close the distance with the aid of their sprinting ability and thick armor.\n• Triggers: Boys of Silence; they're harmless on their own, but if they spot you, they sound an alarm that alerts other enemies of your location and causes every nearby foe to pile on you.\n• Turrets: Automatons; bog-standard automated machine gun turrets, every tactic described in the description above works on them.\n• Walking Tanks: Handymen, very rare gorilla-esque cyborgs that can absorb tons of damage (unless you shoot their head or heart) and dish out a lot too.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/StandardFPSEnemies", "media_links": ["/pmwiki/pmwiki.php/VideoGame/SeriousSam", "/pmwiki/pmwiki.php/Franchise/Halo", "/pmwiki/pmwiki.php/VideoGame/HalfLife", "/pmwiki/pmwiki.php/VideoGame/Left4Dead", "/pmwiki/pmwiki.php/VideoGame/FarCry1", "/pmwiki/pmwiki.php/VideoGame/GearsOfWar", "/pmwiki/pmwiki.php/VideoGame/FirstEncounterAssaultRecon", "/pmwiki/pmwiki.php/VideoGame/Doom", "/pmwiki/pmwiki.php/VideoGame/RedFactionII", "/pmwiki/pmwiki.php/VideoGame/Fallout3", "/pmwiki/pmwiki.php/VideoGame/FarCry3", "/pmwiki/pmwiki.php/VideoGame/SeriousSam", "/pmwiki/pmwiki.php/VideoGame/FirstEncounterAssaultRecon", "/pmwiki/pmwiki.php/VideoGame/CallOfDuty", "/pmwiki/pmwiki.php/VideoGame/Doom", "/pmwiki/pmwiki.php/VideoGame/Quake", "/pmwiki/pmwiki.php/VideoGame/FirstEncounterAssaultRecon", "/pmwiki/pmwiki.php/VideoGame/HalfLife2", "/pmwiki/pmwiki.php/VideoGame/Doom", "/pmwiki/pmwiki.php/VideoGame/QuakeIV", "/pmwiki/pmwiki.php/VideoGame/BioShock", "/pmwiki/pmwiki.php/VideoGame/HaloReach", "/pmwiki/pmwiki.php/VideoGame/FarCry3", "/pmwiki/pmwiki.php/VideoGame/CallOfDuty", "/pmwiki/pmwiki.php/VideoGame/MedalOfHonor", "/pmwiki/pmwiki.php/VideoGame/DukeNukem3D", "/pmwiki/pmwiki.php/VideoGame/HalfLife", "/pmwiki/pmwiki.php/VideoGame/HalfLife2", "/pmwiki/pmwiki.php/Franchise/Fallout", "/pmwiki/pmwiki.php/VideoGame/SeriousSam", "/pmwiki/pmwiki.php/VideoGame/HalfLife", "/pmwiki/pmwiki.php/Franchise/Halo", "/pmwiki/pmwiki.php/VideoGame/SeriousSam", "/pmwiki/pmwiki.php/VideoGame/Fallout3", "/pmwiki/pmwiki.php/VideoGame/FalloutNewVegas", "/pmwiki/pmwiki.php/VideoGame/HalfLife2", "/pmwiki/pmwiki.php/Franchise/Halo", "/pmwiki/pmwiki.php/VideoGame/QuakeII", "/pmwiki/pmwiki.php/Franchise/MassEffect", "/pmwiki/pmwiki.php/VideoGame/Doom", "/pmwiki/pmwiki.php/VideoGame/Fallout3", "/pmwiki/pmwiki.php/VideoGame/SeriousSam", "/pmwiki/pmwiki.php/Franchise/Halo", "/pmwiki/pmwiki.php/VideoGame/QuakeII", "/pmwiki/pmwiki.php/VideoGame/QuakeIV", "/pmwiki/pmwiki.php/VideoGame/BioShock", "/pmwiki/pmwiki.php/VideoGame/HalfLife1", "/pmwiki/pmwiki.php/VideoGame/HalfLife2", "/pmwiki/pmwiki.php/VideoGame/FarCry3", "/pmwiki/pmwiki.php/VideoGame/Doom", "/pmwiki/pmwiki.php/VideoGame/Fallout", "/pmwiki/pmwiki.php/VideoGame/HalfLife2", "/pmwiki/pmwiki.php/VideoGame/FirstEncounterAssaultRecon", "/pmwiki/pmwiki.php/VideoGame/GearsOfWar", "/pmwiki/pmwiki.php/VideoGame/Unreal", "/pmwiki/pmwiki.php/VideoGame/HalfLife1", "/pmwiki/pmwiki.php/VideoGame/Turok", "/pmwiki/pmwiki.php/VideoGame/Doom", "/pmwiki/pmwiki.php/VideoGame/RedFaction", "/pmwiki/pmwiki.php/VideoGame/BioShock", "/pmwiki/pmwiki.php/VideoGame/FarCry3", "/pmwiki/pmwiki.php/Franchise/Halo", "/pmwiki/pmwiki.php/VideoGame/Wolfenstein", "/pmwiki/pmwiki.php/VideoGame/Killzone", "/pmwiki/pmwiki.php/VideoGame/CallOfDuty", "/pmwiki/pmwiki.php/VideoGame/MedalOfHonor", "/pmwiki/pmwiki.php/VideoGame/Doom", "/pmwiki/pmwiki.php/VideoGame/FirstEncounterAssaultRecon", "/pmwiki/pmwiki.php/VideoGame/GearsOfWar", "/pmwiki/pmwiki.php/Franchise/Halo", "/pmwiki/pmwiki.php/VideoGame/FarCry1", "/pmwiki/pmwiki.php/VideoGame/ReturnToCastleWolfenstein", "/pmwiki/pmwiki.php/VideoGame/TheConduit", "/pmwiki/pmwiki.php/VideoGame/ResidentEvil4", "/pmwiki/pmwiki.php/VideoGame/ResidentEvil5", "/pmwiki/pmwiki.php/VideoGame/RiseOfTheTriad", "/pmwiki/pmwiki.php/VideoGame/BioShock", "/pmwiki/pmwiki.php/VideoGame/Turok", "/pmwiki/pmwiki.php/VideoGame/Fallout3", "/pmwiki/pmwiki.php/VideoGame/CallOfDuty", "/pmwiki/pmwiki.php/VideoGame/ModernWarfare", "/pmwiki/pmwiki.php/VideoGame/QuakeIV", "/pmwiki/pmwiki.php/VideoGame/HalfLife2", "/pmwiki/pmwiki.php/VideoGame/FirstEncounterAssaultRecon", "/pmwiki/pmwiki.php/VideoGame/HalfLife1", "/pmwiki/pmwiki.php/VideoGame/Wolfenstein2009", "/pmwiki/pmwiki.php/VideoGame/BioShock", "/pmwiki/pmwiki.php/VideoGame/AliensVsPredator", "/pmwiki/pmwiki.php/VideoGame/Resistance", "/pmwiki/pmwiki.php/VideoGame/MetalGearSolid4GunsOfThePatriots", "/pmwiki/pmwiki.php/VideoGame/Doom", "/pmwiki/pmwiki.php/VideoGame/FalloutNewVegas", "/pmwiki/pmwiki.php/VideoGame/Crysis", "/pmwiki/pmwiki.php/VideoGame/MassEffect2", "/pmwiki/pmwiki.php/VideoGame/Borderlands", "/pmwiki/pmwiki.php/VideoGame/DarkSector", "/pmwiki/pmwiki.php/VideoGame/Borderlands", "/pmwiki/pmwiki.php/VideoGame/QuakeII", "/pmwiki/pmwiki.php/VideoGame/Warhammer40000SpaceMarine", "/pmwiki/pmwiki.php/VideoGame/Borderlands", "/pmwiki/pmwiki.php/VideoGame/ModernWarfare", "/pmwiki/pmwiki.php/Franchise/Halo", "/pmwiki/pmwiki.php/VideoGame/DutyCalls", "/pmwiki/pmwiki.php/VideoGame/Left4Dead", "/pmwiki/pmwiki.php/VideoGame/FirstEncounterAssaultRecon", "/pmwiki/pmwiki.php/VideoGame/FarCryEvolution", "/pmwiki/pmwiki.php/VideoGame/RedFactionII", "/pmwiki/pmwiki.php/VideoGame/ProjectSnowblind", "/pmwiki/pmwiki.php/VideoGame/TimeShift", "/pmwiki/pmwiki.php/VideoGame/Halo2", "/pmwiki/pmwiki.php/VideoGame/HaloReach", "/pmwiki/pmwiki.php/VideoGame/Crysis", "/pmwiki/pmwiki.php/VideoGame/Borderlands", "/pmwiki/pmwiki.php/VideoGame/MassEffect3", "/pmwiki/pmwiki.php/VideoGame/Borderlands2", "/pmwiki/pmwiki.php/VideoGame/Borderlands", "/pmwiki/pmwiki.php/VideoGame/QuakeII", "/pmwiki/pmwiki.php/VideoGame/Doom", "/pmwiki/pmwiki.php/VideoGame/FirstEncounterAssaultRecon", "/pmwiki/pmwiki.php/VideoGame/DeusExHumanRevolution", "/pmwiki/pmwiki.php/VideoGame/HalfLife1", "/pmwiki/pmwiki.php/VideoGame/Unreal", "/pmwiki/pmwiki.php/VideoGame/Quake", "/pmwiki/pmwiki.php/VideoGame/HalfLife2", "/pmwiki/pmwiki.php/VideoGame/TheConduit", "/pmwiki/pmwiki.php/VideoGame/Crysis", "/pmwiki/pmwiki.php/VideoGame/Doom", "/pmwiki/pmwiki.php/VideoGame/RedFactionII", "/pmwiki/pmwiki.php/VideoGame/Fallout3", "/pmwiki/pmwiki.php/VideoGame/DukeNukem3D", "/pmwiki/pmwiki.php/VideoGame/HalfLife1", "/pmwiki/pmwiki.php/VideoGame/HalfLife2", "/pmwiki/pmwiki.php/VideoGame/ModernWarfare", "/pmwiki/pmwiki.php/Franchise/Halo", "/pmwiki/pmwiki.php/VideoGame/HalfLife2", "/pmwiki/pmwiki.php/VideoGame/HalfLife1", "/pmwiki/pmwiki.php/VideoGame/ModernWarfare", "/pmwiki/pmwiki.php/Franchise/Halo", "/pmwiki/pmwiki.php/VideoGame/PerfectDark", "/pmwiki/pmwiki.php/VideoGame/Crysis", "/pmwiki/pmwiki.php/Franchise/Halo", "/pmwiki/pmwiki.php/VideoGame/Halo5Guardians", "/pmwiki/pmwiki.php/VideoGame/HaloReach", "/pmwiki/pmwiki.php/VideoGame/Halo3", "/pmwiki/pmwiki.php/VideoGame/Halo4", "/pmwiki/pmwiki.php/VideoGame/Halo5Guardians", "/pmwiki/pmwiki.php/VideoGame/Halo5Guardians", "/pmwiki/pmwiki.php/VideoGame/HalfLife", "/pmwiki/pmwiki.php/VideoGame/GearsOfWar", "/pmwiki/pmwiki.php/VideoGame/FirstEncounterAssaultRecon", "/pmwiki/pmwiki.php/VideoGame/Wolfenstein", "/pmwiki/pmwiki.php/VideoGame/ReturnToCastleWolfenstein", "/pmwiki/pmwiki.php/VideoGame/Wolfenstein2009", "/pmwiki/pmwiki.php/VideoGame/Wolfenstein3D", "/pmwiki/pmwiki.php/VideoGame/FarCry", "/pmwiki/pmwiki.php/VideoGame/FarCry1", "/pmwiki/pmwiki.php/VideoGame/FarCry3", "/pmwiki/pmwiki.php/VideoGame/FarCry3BloodDragon", "/pmwiki/pmwiki.php/VideoGame/FarCry4", "/pmwiki/pmwiki.php/VideoGame/FarCry3", "/pmwiki/pmwiki.php/VideoGame/FarCry4", "/pmwiki/pmwiki.php/VideoGame/Crysis", "/pmwiki/pmwiki.php/VideoGame/Crysis", "/pmwiki/pmwiki.php/VideoGame/DeusExHumanRevolution", "/pmwiki/pmwiki.php/VideoGame/MassEffect1", "/pmwiki/pmwiki.php/VideoGame/MassEffect2", "/pmwiki/pmwiki.php/VideoGame/MassEffect3", "/pmwiki/pmwiki.php/VideoGame/ModernWarfare", "/pmwiki/pmwiki.php/VideoGame/CallOfDuty", "/pmwiki/pmwiki.php/VideoGame/NaziZombies", "/pmwiki/pmwiki.php/VideoGame/ModernWarfare3", "/pmwiki/pmwiki.php/VideoGame/ModernWarfare2", "/pmwiki/pmwiki.php/VideoGame/NaziZombies", "/pmwiki/pmwiki.php/VideoGame/ModernWarfare", "/pmwiki/pmwiki.php/VideoGame/ModernWarfare3", "/pmwiki/pmwiki.php/VideoGame/Quake", "/pmwiki/pmwiki.php/VideoGame/QuakeII", "/pmwiki/pmwiki.php/VideoGame/QuakeIV", "/pmwiki/pmwiki.php/VideoGame/Doom", "/pmwiki/pmwiki.php/VideoGame/SeriousSam", "/pmwiki/pmwiki.php/VideoGame/Marathon", "/pmwiki/pmwiki.php/VideoGame/DukeNukem3D", "/pmwiki/pmwiki.php/VideoGame/Turok", "/pmwiki/pmwiki.php/VideoGame/PathwaysIntoDarkness", "/pmwiki/pmwiki.php/VideoGame/Descent", "/pmwiki/pmwiki.php/VideoGame/Descent", "/pmwiki/pmwiki.php/VideoGame/RedFaction", "/pmwiki/pmwiki.php/VideoGame/PN03", "/pmwiki/pmwiki.php/VideoGame/Doom", "/pmwiki/pmwiki.php/VideoGame/ResidentEvil4", "/pmwiki/pmwiki.php/VideoGame/Fallout3", "/pmwiki/pmwiki.php/VideoGame/FalloutNewVegas", "/pmwiki/pmwiki.php/VideoGame/Left4Dead2", "/pmwiki/pmwiki.php/VideoGame/Dishonored", "/pmwiki/pmwiki.php/VideoGame/Vanquish", "/pmwiki/pmwiki.php/VideoGame/SaintsRowIV", "/pmwiki/pmwiki.php/VideoGame/SpecOpsTheLine", "/pmwiki/pmwiki.php/VideoGame/SunsetOverdrive", "/pmwiki/pmwiki.php/VideoGame/MetroidPrime", "/pmwiki/pmwiki.php/VideoGame/SniperElite4", "/pmwiki/pmwiki.php/VideoGame/TheAdventuresOfSquare", "/pmwiki/pmwiki.php/VideoGame/MirrorsEdge", "/pmwiki/pmwiki.php/VideoGame/BioshockInfinite"], "non_media_links": ["/pmwiki/pmwiki.php/Main/ThirdPersonShooter", "/pmwiki/pmwiki.php/Main/TropeCodifier", "/pmwiki/pmwiki.php/Main/DemonicSpiders", "/pmwiki/pmwiki.php/Main/CannonFodder", "/pmwiki/pmwiki.php/Main/GlassCannon", "/pmwiki/pmwiki.php/Main/Mook", "/pmwiki/pmwiki.php/Main/NinjaPirateZombieRobot", "/pmwiki/pmwiki.php/Main/StandardFPSGuns", "/pmwiki/pmwiki.php/Main/AirborneMook", "/pmwiki/pmwiki.php/Main/TropeCodifier", "/pmwiki/pmwiki.php/Main/TheGoomba", "/pmwiki/pmwiki.php/Main/GoddamnBats", "/pmwiki/pmwiki.php/Main/EliteMooks", "/pmwiki/pmwiki.php/Main/GiantMook", "/pmwiki/pmwiki.php/Main/GiantMook", "/pmwiki/pmwiki.php/Main/LightningBruiser", "/pmwiki/pmwiki.php/Main/DemonicSpiders", "/pmwiki/pmwiki.php/Main/FragileSpeedster", "/pmwiki/pmwiki.php/Main/HollywoodFlamethrower", "/pmwiki/pmwiki.php/Main/ShortRangeShotgun", "/pmwiki/pmwiki.php/Main/Mooks", "/pmwiki/pmwiki.php/Main/AmmunitionBackpack", "/pmwiki/pmwiki.php/Main/StuffBlowingUp", "/pmwiki/pmwiki.php/Main/ExplodingBarrel", "/pmwiki/pmwiki.php/Main/ActionBomb", "/pmwiki/pmwiki.php/Main/SoldierOfFortune", "/pmwiki/pmwiki.php/Main/HeavilyArmoredMook", "/pmwiki/pmwiki.php/Main/ShieldBearingMook", "/pmwiki/pmwiki.php/Main/Mook", "/pmwiki/pmwiki.php/Main/ExactlyWhatItSaysOnTheTin", "/pmwiki/pmwiki.php/Main/InstakillMook", "/pmwiki/pmwiki.php/Main/DemonicSpiders", "/pmwiki/pmwiki.php/Main/SuperpoweredMooks", "/pmwiki/pmwiki.php/Main/EliteMooks", "/pmwiki/pmwiki.php/Main/EliteMooks", "/pmwiki/pmwiki.php/Main/IncendiaryExponent", "/pmwiki/pmwiki.php/Main/StandardStatusEffect", "/pmwiki/pmwiki.php/Main/HitPoints", "/pmwiki/pmwiki.php/Main/AnimateDead", "/pmwiki/pmwiki.php/Main/ChunkySalsaRule", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Main/HumongousMecha", "/pmwiki/pmwiki.php/Main/ImmuneToBullets", "/pmwiki/pmwiki.php/Main/PoweredArmor", "/pmwiki/pmwiki.php/Main/TankGoodness", "/pmwiki/pmwiki.php/Main/TanksButNoTanks", "/pmwiki/pmwiki.php/Main/SuspiciousVideoGameGenerosity", "/pmwiki/pmwiki.php/Main/MiniBoss", "/pmwiki/pmwiki.php/Main/EnemySummoner", "/pmwiki/pmwiki.php/Main/PainfullySlowProjectile", "/pmwiki/pmwiki.php/Main/ArtificialStupidity", "/pmwiki/pmwiki.php/Main/DirtyCoward", "/pmwiki/pmwiki.php/Main/AirborneMook", "/pmwiki/pmwiki.php/Main/DemonicSpiders", "/pmwiki/pmwiki.php/Main/MookMobile", "/pmwiki/pmwiki.php/Main/ExplodingBarrels", "/pmwiki/pmwiki.php/Main/MookMaker", "/pmwiki/pmwiki.php/Main/UniqueEnemy", "/pmwiki/pmwiki.php/Main/APCs", "/pmwiki/pmwiki.php/Main/MascotMook", "/pmwiki/pmwiki.php/Main/BFG", "/pmwiki/pmwiki.php/Main/BFG", "/pmwiki/pmwiki.php/Main/REV6", "/pmwiki/pmwiki.php/Main/REV8", "/pmwiki/pmwiki.php/Main/HumongousMecha", "/pmwiki/pmwiki.php/Main/MacheteMayhem", "/pmwiki/pmwiki.php/Main/HeavilyArmoredMook", "/pmwiki/pmwiki.php/Main/ShortRangeShotgun", "/pmwiki/pmwiki.php/Main/MoreDakka", "/pmwiki/pmwiki.php/Main/MolotovCocktail", "/pmwiki/pmwiki.php/Main/LaserSight", "/pmwiki/pmwiki.php/Main/CrazyPrepared", "/pmwiki/pmwiki.php/Main/MoreDakka", "/pmwiki/pmwiki.php/Main/KungFuProofMook", "/pmwiki/pmwiki.php/Main/KungFuProofMook", "/pmwiki/pmwiki.php/Main/KukrisAreKool", "/pmwiki/pmwiki.php/Main/KungFuProofMook", "/pmwiki/pmwiki.php/Main/EnemySummoner", "/pmwiki/pmwiki.php/Main/EnemySummoner", "/pmwiki/pmwiki.php/Main/ActionBomb", "/pmwiki/pmwiki.php/Main/ExplodingBarrels", "/pmwiki/pmwiki.php/Main/BreathWeapon", "/pmwiki/pmwiki.php/Main/ActionBomb", "/pmwiki/pmwiki.php/Main/SuperpoweredMooks", "/pmwiki/pmwiki.php/Main/AwesomePersonnelCarrier", "/pmwiki/pmwiki.php/Main/DeflectorShields", "/pmwiki/pmwiki.php/Main/FlashStep", "/pmwiki/pmwiki.php/Main/MirrorMatch", "/pmwiki/pmwiki.php/Main/ActionBomb", "/pmwiki/pmwiki.php/Main/DeadlyLunge", "/pmwiki/pmwiki.php/Main/BigCreepyCrawlies", "/pmwiki/pmwiki.php/Main/ActionBomb", "/pmwiki/pmwiki.php/Main/Mook", "/pmwiki/pmwiki.php/Main/Mook", "/pmwiki/pmwiki.php/Main/DegradedBoss", "/pmwiki/pmwiki.php/Main/LightningGun", "/pmwiki/pmwiki.php/Main/GLs", "/pmwiki/pmwiki.php/Main/ThirdPersonShooter", "/pmwiki/pmwiki.php/Main/ActionBomb", "/pmwiki/pmwiki.php/Main/OneHitKill", "/pmwiki/pmwiki.php/Main/OffWithHisHead", "/pmwiki/pmwiki.php/Main/LevelScaling", "/pmwiki/pmwiki.php/Main/ActionBomb", "/pmwiki/pmwiki.php/Main/HollywoodAcid", "/pmwiki/pmwiki.php/Main/MookMaker", "/pmwiki/pmwiki.php/Main/WalkingTanks", "/pmwiki/pmwiki.php/Main/HarderThanHard", "/pmwiki/pmwiki.php/Main/ArtificialStupidity", "/pmwiki/pmwiki.php/Main/ArtificialStupidity", "/pmwiki/pmwiki.php/Main/PlayingWithFire"]}