{"title": "Transhumans in Space", "content": "In the time-honored Space Opera genre, characters tend to be either aliens, robots, or standard humans—maybe somebody has a prosthetic limb or two, but generally augmentation is frowned upon.\n\nCyberpunk and its less gloomy successor Post-Cyberpunk, on the other hand, feature rampant Transhuman augmentation despite tending to be set on Earth.\n\nIt shouldn't be too surprising that eventually somebody decided to combine the two.\n\nCompare Transhuman Aliens when transhumans are substituted for aliens.\n• Knights of Sidonia is a fairly standard Space Opera of a colony ship of humans fleeing the destruction of Earth by alien creatures known as the Gauna but being written by Tsutomu Nihei, transhumanism is rampant to the point where there are no baseline human characters. A short list of transhuman features present in the series are human capable of the photosynthesising to reduce (but not eliminate) the need for food (everyone except the main character), medically indueced immortality (the command crew), an enhanced Healing Factor implied to be tied to an innate form of biological immortality (main character Tanikaze), cybernetic replacements for lost limbs (Lalah and later Isana), an artificially created third sex that eventually transitions to either male or female after becoming attracted to someone (Isana and a couple of minor characters), mass cloning (the Honoka sisters), Super Strength (again, the Honoka sisters). And that doesn't even begin to cover some of the more extreme instances in the series courtesy of Ochiai\n• In Strange Frame: Love and Sax, humans have moved out to the Jovian belt. In order to survive in the different environments of the Jovian moons, most humans have undergone some degree of genetic or cybernetic modification.\n• The Culture is a civilization spanning a good chunk of the galaxy whose citizens engage in frequent body-modding ranging from drug glands to extra limbs to brain backups.\n• Eldraeverse: The Eldrae were transhuman to begin with, being Transplanted Humans genetically modified by Precursors. Around the time they started venturing out into space they were taking things further such as adding Body Backup Drive to their \"natural\" lack of aging.\n• Great Ship: Humanity, who for the most part have starting replacing their brains with ceramic hardware, was the first species to gain access to the titular massive starship.\n• Aeon 14 is by design a reconstruction of the setting. Cyborgs, Bio-Augmentation, and fully self-aware Artificial Intelligences are all over the setting, up to and including known cases of AI merging with humans and organics and AI ascending beyond flesh and silicon. At the same time though, they still have recognizably human personalities, behaviors and motivations, and love, hate, fight, laugh and cry.\n• Schismatrix portrays a spacefaring setting dominated by transhumans and split between shapers who favor biotech and mechanists who favor cybernetics. Characters routinely and casually receive bionic and biological enhancements, especially in short fiction set in the shaper/mechanist 'verse.\n• In the Takeshi Kovacs series, Earth humans have colonized several star systems by uploading their brains to cloned bodies, often with biological or cybernetic enhancements.\n• Very lightly touched upon in Crest of the Stars. While the Abh themselves play the part of Transhuman Aliens the novels mention that even more heavily modified groups exist but are generally fairly reclusive. The only non-Abh modified character we meet is a United Mankind intelligence agent who is descended from a group that modified themselves for extended lifespans.\n• In That Hideous Strength, N.I.C.E. hopes to bring the vision of the first book's villain to life by creating an interplanetary empire. Unlike him, they have also set their sight on eliminating the flaws of organic matter and hope to replace humanity with a select few minds that have been stripped of their flesh, allowing them to eventually create a totally hygienic and controlled universe.\n• Blindsight has a team of transhumans sent to the Oort Cloud to make First Contact. The entire crew have hibernation genes from prehistoric vampires, the biologists have cybernetic senses at the expense of expressive control, the linguist has four artificially induced split personalities, the combat specialist is wired into a team of drones, the captain is an actual vampire, and the protagonist had a radical hemispherectomy to cure his epilepsy so he has a prosthetic brain hemisphere.\n• The GURPS setting Transhuman Space takes place in the year 2100 in a solar system colonized by genetically engineered humans, Artificial Humans, and AI.\n• Eclipse Phase: During a Singularity gone wrong, Earth was evacuated by Brain Uploading to artificial bodies produced throughout the solar system.\n• Hc Svnt Dracones: After a nuclear war on Earth the corporate colonies on Mars repopulated the solar system with genetically engineered human-animal hybrids and Ridiculously Human Robots. 700 years later there are entire Mega Corps specializing in Bio or Cyber augmentation.\n• Nova Praxis: A seed AI known as \"Mimir\" provided the nanotechnology both to convert a human brain into a synthetic neural network and to build stargates.\n• Mindjammer: Ten thousand years after launching STL colony ships Earth develops FTL travel and the planet's immortal oligarchs reach out to the various branches of humanity scattered throughout the stars.\n• Blue Planet has genetically and cybernetically modified humans and uplifts exploring an oceanic planet.\n• Civilization: Beyond Earth: Most of the Affinities use some variety of this concept when Settling the Frontier of alien worlds. In those cases, the Affinity level indicates how far the faction has diverged from the human baseline.\n• Supremacy uses Cyborg enhancements, Artificial Intelligence, and eventual Brain Uploading to develop a civilization that can flourish irrespective of conditions on alien worlds. Its unique victory option returns to Earth to share its technology-born immortality in what might be a Benevolent Alien Invasion, an Assimilation Plot, or both.\n• Harmony uses Bio-Augmentation and Genetic Adaptation to adapt to alien environments, ultimately becoming part of the alien ecosystem. Its unique victory option merges all life on the planet into a single transcendent consciousness.\n• The Harmony-Purity hybrid Affinity believes that Humanity Is Superior and engineers Designer Babies in an attempt to refine the human race into an Ultimate Life Form.\n• The Supremacy-Harmony hybrid Affinity uses both biological and technological enhancements so enthusiastically that it can become nigh-impossible to distinguish flesh from machine, never mind tell whether the organism was human to begin with.\n• Always Human: Bio-Augmentation \"mods\" are ubiquitous on Earth, humans are beginning to colonize the solar system, and space travelers get a suite of specialized mods to acclimate themselves to off-world conditions as a matter of course.\n• Orion's Arm is a future history where, over the course of the next ten millennia, humanity branches off into millions of modified clades, creates countless varieties of AI, and uplifts seemingly every species on Earth and many other planets within a 5,000-light-year radius of Sol.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/TranshumansInSpace", "media_links": ["/pmwiki/pmwiki.php/Manga/KnightsOfSidonia", "/pmwiki/pmwiki.php/Creator/TsutomuNihei", "/pmwiki/pmwiki.php/WesternAnimation/StrangeFrame", "/pmwiki/pmwiki.php/Literature/TheCulture", "/pmwiki/pmwiki.php/Literature/Eldraeverse", "/pmwiki/pmwiki.php/Literature/GreatShip", "/pmwiki/pmwiki.php/Literature/Aeon14", "/pmwiki/pmwiki.php/Literature/Schismatrix", "/pmwiki/pmwiki.php/Literature/TakeshiKovacs", "/pmwiki/pmwiki.php/LightNovel/CrestOfTheStars", "/pmwiki/pmwiki.php/Literature/TheSpaceTrilogy", "/pmwiki/pmwiki.php/Literature/Blindsight", "/pmwiki/pmwiki.php/TabletopGame/GURPS", "/pmwiki/pmwiki.php/TabletopGame/TranshumanSpace", "/pmwiki/pmwiki.php/TabletopGame/EclipsePhase", "/pmwiki/pmwiki.php/TabletopGame/HcSvntDracones", "/pmwiki/pmwiki.php/TabletopGame/Mindjammer", "/pmwiki/pmwiki.php/VideoGame/CivilizationBeyondEarth", "/pmwiki/pmwiki.php/Webcomic/AlwaysHuman"], "non_media_links": ["/pmwiki/pmwiki.php/Main/Transhuman", "/pmwiki/pmwiki.php/Main/ExactlyWhatItSaysOnTheTin", "/pmwiki/pmwiki.php/Main/SpaceOpera", "/pmwiki/pmwiki.php/Main/NoTranshumanismAllowed", "/pmwiki/pmwiki.php/Main/Cyberpunk", "/pmwiki/pmwiki.php/Main/PostCyberpunk", "/pmwiki/pmwiki.php/Main/Transhuman", "/pmwiki/pmwiki.php/Main/TranshumanAliens", "/pmwiki/pmwiki.php/Main/SpaceOpera", "/pmwiki/pmwiki.php/Main/ImmortalityInducer", "/pmwiki/pmwiki.php/Main/HealingFactor", "/pmwiki/pmwiki.php/Main/ArtificialLimbs", "/pmwiki/pmwiki.php/Main/ClonesArePeopleToo", "/pmwiki/pmwiki.php/Main/SuperStrength", "/pmwiki/pmwiki.php/Main/MadScientist", "/pmwiki/pmwiki.php/Main/TransplantedHumans", "/pmwiki/pmwiki.php/Main/Precursors", "/pmwiki/pmwiki.php/Main/BodyBackupDrive", "/pmwiki/pmwiki.php/Main/Reconstruction", "/pmwiki/pmwiki.php/Main/Cyborg", "/pmwiki/pmwiki.php/Main/BioAugmentation", "/pmwiki/pmwiki.php/Main/ArtificialIntelligence", "/pmwiki/pmwiki.php/Main/MergerOfSouls", "/pmwiki/pmwiki.php/Main/AscendToAHigherPlaneOfExistence", "/pmwiki/pmwiki.php/Main/TranshumanAliens", "/pmwiki/pmwiki.php/Main/FirstContact", "/pmwiki/pmwiki.php/Main/ArtificialHuman", "/pmwiki/pmwiki.php/Main/BrainUploading", "/pmwiki/pmwiki.php/Main/RidiculouslyHumanRobots", "/pmwiki/pmwiki.php/Main/MegaCorp", "/pmwiki/pmwiki.php/Main/SettlingTheFrontier", "/pmwiki/pmwiki.php/Main/Cyborg", "/pmwiki/pmwiki.php/Main/ArtificialIntelligence", "/pmwiki/pmwiki.php/Main/BrainUploading", "/pmwiki/pmwiki.php/Main/BenevolentAlienInvasion", "/pmwiki/pmwiki.php/Main/AssimilationPlot", "/pmwiki/pmwiki.php/Main/BlueAndOrangeMorality", "/pmwiki/pmwiki.php/Main/BioAugmentation", "/pmwiki/pmwiki.php/Main/GeneticAdaptation", "/pmwiki/pmwiki.php/Main/HumanityIsSuperior", "/pmwiki/pmwiki.php/Main/DesignerBabies", "/pmwiki/pmwiki.php/Main/UltimateLifeForm", "/pmwiki/pmwiki.php/Main/BioAugmentation", "/pmwiki/pmwiki.php/WebOriginal/OrionsArm"]}