{"title": "Machinomics", "content": "\"Machinomics\" are comic-styled narratives that combine video game screenshots with player narrative to tell a story. They're like Machinima, only they're the static Webcomics version. They may crossover with other genres of media, or may be played straight. A straight-up Machinomic is one in which all the characters, backgrounds, etc. are created INSIDE of a video game or similar medium. However, a Machinomic may also import video game characters into Photo Comic backgrounds or may even place Real Life actors inside of video game backgrounds. This forum bears an early example of this term being used. However, the term has now been adopted elsewhere, including on Comixpedia. A Machinomic differs from a Sprite Comic because the characters are fully 3-D, as opposed to using sprites like those in early video games.\n\nReasons run the gamut for why someone would choose to make a Machinomic instead of simply making Machinima. Perhaps you are a lousy editor, or your video card is inferior. Maybe you're planning to do stuff that isn't possible in-game for the sake of telling a better story. Or maybe, you just don't have good audio recording equipment. Or, perhaps you have bandwidth issues. Or perhaps you're hand-making every model and prop in 3D editing software, instead of a 3D engine released with a game. Regardless your reasons, Machinomics can be a good substitute for dozens of other Webcomics formats and for Machinima. Machinomics may use a variety of Webcomic publication formats, from being straight-up comic strips to formalized DVD-Storybook Hybrid Webcomics (a.k.a., DSHW, inspired by storytelling exchanges on game websites and by DVD menus) to basically anything.\n\nMachinomics bear some flexibility over Machinima in the simple fact that the user only needs to assemble images and text using screenshots and manipulating them with image software. A live screenshot may be captured from any work, but scripted shots are just as possible. Games that allow a user to pause gameplay without obstructing scene view are particularly useful. Quick machinima video clips may also be paused, with clips from these videos assembled into Machinomic material.\n\nPopular sources of Machinomics include Rainbow Six, The Sims, F.E.A.R., Halo and Garry's Mod for Half-Life 2.\n\nNot surprisingly, there's a lot of overlap between this trope and a Let's Play, particularly the narrative type rather than an illustrated fanmade walkthrough.\n\nExamples should be listed according to the game software used to make them.\n• Kendl Core is a comic made using Half-Life 2 and Garry's Mod\n• Concerned is another comic made using Garry's Mod.\n• Life With Lamarr is yet another comic made using Garry's Mod.\n• Some of the parts in Draw Your Own Story.\n• The now-defunct Internet community based at PHWOnline was dedicated to creating comics using Garry's Mod. During its operation, it spawned such classics as Ravenholm Armory, Kenny the Cop and BrashFink's stunning comic Apostasy, detailing the events immediately prior to Half-Life 2.\n• Currently, a new Internet community called Metrocop hosts Garry's Mod comics both new and old, from the aforementioned Apostasy to the more recent The Adventures of Hercule Cubbage, as well as many more.\n• War Neighbors is a Garry's Mod comic about two unnamed Halo modeled characters with the orange soldier having a one-sided rivalry with the green soldier.\n• Space Blood Mostly does that with Space Ship Models and some Backgrounds from Garry's Mod with the character and other backgrounds being made from a comic making software, downplaying the trope.\n• Pac-Catchers was a proposed comic by Checkered Fox at the now-defunct DigitalPh33r Forums, with the proposed cast doing a mock-ad for Pepto Bismol. It is quite possibly the Trope Namer.\n• The creation of Machinomics is essentially built right into the Sims games with the \"family album\" feature, which allows the player to take snapshots, arrange them in the desired order (though the first game lacks this feature, forcing creators to take all their pictures in order), and add captions of any length.\n• The whole point of The Sims Story Exchange (all known versions) is to use players' derivative products as free advertising for the game.\n• Dozens of sites that feature Game Mods also feature storyteller forums, whose purpose is similar. Mod The Sims' Social Forums are one example, with the Creativity sub-forums featuring over 150 different Sims Comics of varying levels of quality from various site users.\n• is an ongoing Soap Opera Machinomic created by MLEK, that has been hosted at various website hosts over the years, currently on blogger.\n• Ciem (pictured above) is a DSHW Machinomic from Dozerfleet Comics, available on Mod The Sims Social. While the original story also served as a promotion for the DSHW format, Ciem sought in so many words to be the Trope Codifier.\n• It's now available on MTS only, although an in-the-works series called Cataclysmic Horizons seeks to repurpose and reuse a lot of its characters.\n• is another Machinomic, put out my My-Sims-Reality at LiveJournal.\n• What Lies Beneath is a strip format Sims comic at SimsSoaps.com.\n• Strangetown, Here We Come is one using the characters from the premade neighborhood Strangetown.\n• An Astronomical Alphabetacy, Hermione's ABCs, The Marina Legacy Transformed, and My Favorite Things The Legacy are ongoing Machinomics that follow the legacy challenge rules.\n• Alice And Kev is a particularly heartwrenching one, using The Sims 3.\n• is one of, if not THE most popular Sims story ever.\n• The Scumthorpe Files is a collection of storylines that follow the legacy of the Scumthorpe family. Mainly written by MinghamSmith but had several expanded family branches that follows separate storylines.\n• Fortune & Romance is a prequel to the storylines at the beginning of The Sims 2.\n• Eight Cicadas is a dramedy that uses The Sims 3.\n• Bella Square is a sequel to several of the Sims 2 storylines.\n• The Daily Blink is a World of Warcraft webcomic satirizing the game and surrounding fanbase.\n• Stolen Pixels is a weekly machinomic by Shamus Young made using a variety of different video games hosted at The Escapist.\n• The comics in Top Secret! are a variant: the cartoonish characters are overlaid on top of (photoshopped) video game screenshots and interact with the videogame characters. Of course, since the comics were made in the early 90's, we're talking about 2D pixelated graphics here.\n• Jenny Everywhere's Infinite: Quark Time uses Second Life snapshots to create its panels, following the stories of several Jenny Everywheres.\n• Scenery Porn and Technology Porn being a key part of the game's appeal, most Kerbal Space Program LetsPlays and Mission Reports use this format to a greater or lesser extent.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/Machinomics", "media_links": ["/pmwiki/pmwiki.php/Webcomic/CiemWebcomicSeries", "/pmwiki/pmwiki.php/VideoGame/RainbowSix", "/pmwiki/pmwiki.php/VideoGame/TheSims", "/pmwiki/pmwiki.php/VideoGame/FirstEncounterAssaultRecon", "/pmwiki/pmwiki.php/Franchise/Halo", "/pmwiki/pmwiki.php/VideoGame/GarrysMod", "/pmwiki/pmwiki.php/VideoGame/HalfLife2", "/pmwiki/pmwiki.php/VideoGame/HalfLife2", "/pmwiki/pmwiki.php/VideoGame/GarrysMod", "/pmwiki/pmwiki.php/VideoGame/HalfLife2", "/pmwiki/pmwiki.php/VideoGame/GarrysMod", "/pmwiki/pmwiki.php/Webcomic/Concerned", "/pmwiki/pmwiki.php/Webcomic/LifeWithLamarr", "/pmwiki/pmwiki.php/Webcomic/DrawYourOwnStory", "/pmwiki/pmwiki.php/VideoGame/HalfLife2", "/pmwiki/pmwiki.php/Franchise/Halo", "/pmwiki/pmwiki.php/VideoGame/TheSims", "/pmwiki/pmwiki.php/Webcomic/CiemWebcomicSeries", "/pmwiki/pmwiki.php/Website/LiveJournal", "/pmwiki/pmwiki.php/Webcomic/StrangetownHereWeCome", "/pmwiki/pmwiki.php/Webcomic/AliceAndKev", "/pmwiki/pmwiki.php/Webcomic/TheScumthorpeFiles", "/pmwiki/pmwiki.php/Webcomic/FortuneAndRomance", "/pmwiki/pmwiki.php/Webcomic/EightCicadas", "/pmwiki/pmwiki.php/Webcomic/BellaSquare", "/pmwiki/pmwiki.php/Webcomic/TheDailyBlink", "/pmwiki/pmwiki.php/VideoGame/WorldOfWarcraft", "/pmwiki/pmwiki.php/Webcomic/DMOfTheRings", "/pmwiki/pmwiki.php/VideoGame/SecondLife", "/pmwiki/pmwiki.php/VideoGame/KerbalSpaceProgram"], "non_media_links": ["/pmwiki/pmwiki.php/Main/Machinima", "/pmwiki/pmwiki.php/Main/Webcomics", "/pmwiki/pmwiki.php/Main/RogerRabbitEffect", "/pmwiki/pmwiki.php/Main/PhotoComic", "/pmwiki/pmwiki.php/Main/RealLife", "http://digitalph33r.forum2u.org/machinomics-t2612.html?sid=772042fff4c18da50b50bea7f7d38e74", "http://www.comixpedia.org/index.php?title=Machinomics", "/pmwiki/pmwiki.php/Main/SpriteComic", "http://www.comixpedia.org/index.php?title=DVD-Storybook_Hybrid_Webcomic", "/pmwiki/pmwiki.php/Main/LetsPlay", "http://en.wikipedia.org/wiki/PHWOnline", "http://metrocop.net", "http://war-neighbors.thecomicseries.com/comics/first", "http://space-blood.thecomicseries.com/", "/pmwiki/pmwiki.php/Main/TropeNamer", "/pmwiki/pmwiki.php/Main/Machinomic", "/pmwiki/pmwiki.php/Main/GameMod", "http://arrendaleheights.blogspot.com/", "/pmwiki/pmwiki.php/Main/SoapOpera", "/pmwiki/pmwiki.php/Main/TropeCodifier", "http://my-sims-reality.livejournal.com/131599.html", "/pmwiki/pmwiki.php/Fanfic/AnAstronomicalAlphabetacy", "/pmwiki/pmwiki.php/Blog/HermionesABCs", "/pmwiki/pmwiki.php/Blog/TheMarinaLegacyTransformed", "/pmwiki/pmwiki.php/Blog/MyFavoriteThingsTheLegacy", "/pmwiki/pmwiki.php/Main/TearJerker", "http://deception-pass.livejournal.com/", "/pmwiki/pmwiki.php/Magazine/TopSecret", "/pmwiki/pmwiki.php/WebOriginal/JennyEverywhere", "/pmwiki/pmwiki.php/Main/SceneryPorn", "/pmwiki/pmwiki.php/Main/TechnologyPorn", "/pmwiki/pmwiki.php/Main/LetsPlay", "/pmwiki/pmwiki.php/Main/AfterActionReport"]}