{"title": "Sound Proof Booth", "content": "Some trivia game shows ask questions to one contestant at a time instead of pitting them against each other directly with a buzzer. For example, Alice will answer a set of questions, and then Bob will answer a set afterwards.\n\nThe problem with this is, if Alice and Bob are asked different questions, it doesn't feel fair, and if they are asked the same questions, then Bob will know the questions ahead of time when they're asked to Alice.\n\nThis is where the sound-proof booth comes in. Bob is placed in a large glass booth through which no sound can enter, while Alice answers the questions. Bob usually wears headphones as well, just in case. The host is careful to let us know the purpose of the booth every time it's used, even though it's usually pretty self-explanatory. An odd tendency is for the host to whisper this fact to us, seemingly simulating what it sounds like to the person in the sound proof booth (in which case it isn't very sound proof at all).\n\nAs to why they couldn't just put Bob backstage: a sound-proof booth is just cooler.\n\nThe sound-proof booth has also been used in beauty pageants, including those in the Miss Universe organization, when the contestants are asked a final question before the judges decide the winner. And, of course, any professional voice actor worth their salt has one of these in their home for auditions.\n• 21 is one of the most famous examples of this.\n• The Alex Trebek-hosted quizzer Double Dare (not to be confused with the kids' show).\n• Win Ben Stein's Money: In this case, the booth is open; the headphones do all the work. Ben always got a fancy library-themed booth, while the challenger got a plain looking beige one.\n• On Whew!, while the blocker placed blocks on the board, the charger sat behind a scenic flat, wearing headphones that played white sound.\n• Cheerfully parodied on Good News Week: despite the insisting of Paul McDermott and the elaborate fanfare, the sound-proof booths used in the show are anything but.\n• The Simpsons did a parody in a Halloween episode where the space alien Kang is revealed to be Maggie's biological father (long story), and the family ends up telling their story on The Jerry Springer Show. When Jerry informs the family that they've had Kang sitting in a sound-proof booth backstage the entire time, Kang loudly proclaims, \"I HEAR ALL!\"\n• Australian sketch comedy show The Micallef Program parodied this, with Micallef (as the host) and Wayne (as one of the contestants) tricking the other person into the booth under the guise of a Game Show sketch, then using the opportunity to talk about him behind his back. After Wayne accused the man of being a thief, he got to chose a gas to be released into the chamber. He chose chloroform.\n• Played with on one episode of Home Improvement: Tim makes a booth that is anything but soundproof, but claims it to be soundproof, complete with a convincing \"demonstration\" using some good acting. He them prompts Al to get in the booth and make a fool of himself thinking nobody could hear him.\n• A comedian at Just for Laughs used the sound-proof booth in one of his routines. He mocked the whispering of \"The contestant is in a sound-proof booth,\" saying that if it is sound-proof, the host should be yelling to prove it. \"Sound-proof booth! This is the fattest lady we've ever had on the show!\"\n• Family Feud, during its original run, used a soundproof booth for the second contestant of \"Fast Money.\" In the current series, sound-blocking headphones are used for this purpose.\n• Friend or Foe put its teams in soundproof booths so that they could only hear Kennedy and not the other teams.\n• The UK gameshow Mr And Mrs (which is basically The Newlywed Game with no time limit on how long the couples were married) tested couples on how well they knew each other. One of them would go in a Soundproof Booth, and the other would be asked questions about their spouse's likes and dislikes. Then the spouse would be taken out of the booth and asked the questions about themselves. If they matched, you got points.\n• The Bonus Round on The $1,000,000 Chance of a Lifetime was played in one that was wired so the couple could hear only the host.\n• The $64,000 Question used one of these for the higher-level questions. Sponsored by Revlon!\n• PDQ, a 1965 syndicated show had two teams with one member of each in soundproof booths competing to identify words and phrases their partners assembled using as few letters as possible. Retooled for NBC in 1973 as Baffle.\n• The UK gameshow Raise The Roof used soundproof booths in its penultimate round.\n• Used all the time on daytime talk shows of the Point and Laugh variety, usually when one partner of a relationship wishes to confront the other over something the other has done, or air their grievances about a certain issue in the relationship. Sadly, people who get put in said booths have a terminal case of Genre Blindness, and never ask questions about why their sweetie has elected to have them appear on the show with them.\n• Pawnography, a Spin-Off game show of the History Channel series Pawn Stars, uses a booth in its final round. The contestant goes up against the team of Rick, Corey, and Chumlee, and each side waits in the booth while the other answers questions.\n• The celebrity couples on He Said, She Said and its revival Tattletales had one member of each sequestered backstage with earphones. They would later be shown on TV monitors on stage when it was their turn to respond.\n• Whose Line Is It Anyway? does something similar for the \"Action Replay\" game. Wayne Brady and Kathy Greenwood will act out a scene while Colin Mochrie and Ryan Styles watch, but noise-cancelling headphones keep them from hearing the dialogue. After Wayne and Kathy are finished, Colin and Ryan have to perform the same actions with their own dialogue.\n• Star Words, an unsold Mark Goodson game for CBS in 1983, had two teams trying to match associated words from pairs of displayed words. One member of each team was backstage and seen only on a TV monitor when it was his/her turn to pick two displayed words then brought back on when he/she tried to match the on-stage partner's association.\n• Hot Seat, a thirteen-week wonder for ABC daytime in 1976, used couples, one member of which was in a sound-proof booth hooked to a sensor that detects emotional levels. The on-stage mate had to choose which of two choices to a question would score the higher emotional level from the sequestered mate.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/SoundproofBooth", "media_links": ["/pmwiki/pmwiki.php/Series/TwentyOne", "/pmwiki/pmwiki.php/Creator/AlexTrebek", "/pmwiki/pmwiki.php/Series/DoubleDare1976", "/pmwiki/pmwiki.php/Series/DoubleDare1986", "/pmwiki/pmwiki.php/Series/WinBenSteinsMoney", "/pmwiki/pmwiki.php/Series/Whew", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/Series/TheJerrySpringerShow", "/pmwiki/pmwiki.php/Series/HomeImprovement", "/pmwiki/pmwiki.php/Series/FamilyFeud", "/pmwiki/pmwiki.php/Series/FriendOrFoe", "/pmwiki/pmwiki.php/Series/TheNewlywedGame", "/pmwiki/pmwiki.php/Series/TheOneMillionChanceOfALifetime", "/pmwiki/pmwiki.php/Series/The64000Question", "/pmwiki/pmwiki.php/Series/FiftyGrandSlam", "/pmwiki/pmwiki.php/Series/PawnStars", "/pmwiki/pmwiki.php/Series/HeSaidSheSaid", "/pmwiki/pmwiki.php/Series/Tattletales", "/pmwiki/pmwiki.php/Series/WhoseLineIsItAnyway"], "non_media_links": ["/pmwiki/pmwiki.php/Main/GameShow", "/pmwiki/pmwiki.php/Main/RuleOfCool", "/pmwiki/pmwiki.php/Main/VoiceActors", "/pmwiki/pmwiki.php/Main/GameShow", "/pmwiki/pmwiki.php/Main/SoundproofBooth", "/pmwiki/pmwiki.php/Main/BonusRound", "/pmwiki/pmwiki.php/Main/ProductPlacement", "/pmwiki/pmwiki.php/Main/TalkShow", "/pmwiki/pmwiki.php/Main/PointAndLaughShow", "/pmwiki/pmwiki.php/Main/GenreBlind", "/pmwiki/pmwiki.php/Main/SpinOff"]}