{"title": "Bonus Space", "content": "A condition in a Game Show which provides a contestant with additional winnings or a superior position in the game. This covers such things as monetary multipliers or high-value prizes such as vacation packages (a popular choice), or even just a small monetary addition or a rule modifier. Sometimes it'll provide access to a Progressive Jackpot\n\nBonus Spaces are usually hidden and/or must be encountered by chance; but this is not always the case.\n\nThe polar opposite is the Whammy.\n• Wheel of Fortune has several:\n• Free Play (pictured above), which allows a contestant to call any letter (a vowel for no charge, or a consonant to earn $500 per letter revealed) or try to solve the puzzle. If the called letter is not in the puzzle or the player solves it incorrectly, Free Play allows the player to keep his or her turn anyway.\n• Its predecessor, the Free Spin, which simply allowed a player to keep his or her turn if he or she would normally have to give it up. Unlike the Free Play, the player had to earn the free spin token, same as any other space, and could then use the token at their discretion, surrendering it upon doing so.\n• Wild Card, for which a second letter can be called on the same spin. If carried to the Bonus Round, it can be used to call an extra consonant.\n• The Express Wedge, which when landed on $1,000 is awarded for each correct consonant & a choice of continuing to play for $1,000 a letter without spinning again; however, making a wrong guess of any kind during Express play results in a Bankrupt.\n• The two Mystery Wedges. One hides a $10,000 cash prize, the other a Bankrupt.\n• The Prize Wedge, Gift Tag, and \"1/2 Car\" tags, which respectively award: a prize, a $1,000 credit at the sponsoring company, and a car if a player wins a round while holding two of them.\n• Starting in Season 30, all three (and the Wild Card) are placed on $500 spaces and now award that much per letter, essentially making them a bonus added to the regular value.\n• The Million-Dollar Wedge. It has no effect on the scores, but if a player wins the game while holding it, he/she has a chance to win that amount in the Bonus Round.\n• That wedge was preceded by a $10,000 wedge with a similar design (big thing surrounded by skinny Bankrupts), but that wedge was treated as a prize and did not factor into the bonus round.\n• The $2500, $3500, and $5000 spaces qualify, especially if Pat hits the $5000 space on the Final Spin.\n• Blue or pink spaces in Scrabble worth a $500 or $1,000 bonus, respectively, but only if the contestant guessed the word right then and there. For the 1993 revival, solving on one of those spaces added money to the Sprint Jackpot instead.\n• Win Ben Stein's Money features, in the first round, a Bonus Question for whoever correctly answers each main question.\n• The first round of Wipeout has the Hot Spot hidden among the 11 correct answers on the board. Whoever finds the Hot Spot, and holds onto it until the end of the round, wins a prize by advancing to the next round.\n• The Hollywood Squares has the Secret Square.\n• On High Rollers, rolling doubles entitles the contestant to an insurance marker, which the contestant must return after an invalid roll of the dice to avoid losing.\n• The Price Is Right had several:\n• In the Showcase Showdown, getting exactly one dollar on the wheel (either by hitting the $1 space directly or two other spaces which add up to $1) nets the contestant $1,000 bonus cash and an extra spin. If the contestant gets the 5¢ or 15¢ spaces on this spin, he earns $10,000 more, and the $1 space has a $25,000 payoff. Not bad, considering that most of the time a score of $1.00 is guaranteed to get you into the Showcase.\n• During the \"Contestants' Row\" bidding sequence, a contestant whose bid is exactly correct wins $500 cash on the spot.\n• In the Showcase, if the winning contestant is within $250 of the price of his Showcase, he wins both Showcases.\n• From the Barker/Carey TPIR: The Bonus Game. The contestant has to determine whether or not the actual price of a \"small\" prize is higher or lower than the given price for four prizes. Guessing right on a particular one would win him/her a much more valuable prize. (The board used for the game would light a panel with \"BONUS\" on it next to the prize linked with the bigger prize.\n• The Shell Game. Each correct \"higher/lower\" guess on four small prizes gives the player a chip, which has to be placed next to one of four giant nutshells. A ball is hidden under one shell; if the player sets a chip here, he/she wins the game's big prize.\n• And if the contestant wins all four chips, they get an additional cash bonus for guessing which shell conceals the ball.\n• The Bill Cullen era had the winner of an item up for bids winning a bonus prize. It occurred twice a show and the winnings went towards their final score at the end of the show (highest total returned next show). On the NBC nighttime show, at least one bonus was a separate contest to win bonus money or prizes.\n• And in the current version, a contestant who makes it up on stage does not have to win their pricing game to continue to the end of the show, possibly fitting them (in general) into this trope.\n• Estate of Panic has developed two of these for its contestants: First, the first round has two parts of an item that, if a contestant can get both halves, will net him an extra $1,000, which is usually enough to ensure they're not in the bottom two. Second, the contestant who found the most money in the second room gets a special advantage in the third round, though the fact that the contestant has to figure out how to use that advantage kinda nullifies it.\n• Cha$e, another Sci-Fi show, has the 25 money flags, worth an extra $1,000 each to the contestant who found them and subsequently won the game. There were also the \"defensive tools'', that a player could use to temporarily stop the pursuing Hunters.\n• Each round of the Ohio Lottery game show Cash Explosion has two Double squares (which give an extra spin on the board and double whatever was found behind that spin, or even quadruple if one is lucky enough to get the other Double square) and a Bonus square with cash and prizes (formerly an Ohio-made car, and even longer ago took a player out of the game if accepted, until a famous incident where a union worker turned down a Honda because it was made in the non-union plant in Marysville).\n• Press Your Luck always had a square on the board during the second round marked \"$3000/$4000/$5000 + One Spin\" to counteract its signature Whammy. During the first season of the original, a contestant named Michael Larson memorized the patterns to hit that square every single time, effectively creating a Cash Sampo. He won with over $100,000 on a show where previous big winners barely cracked $10,000. More generally, there was a square marked Big Bucks, which would switch you over to the highest value on the board, and was a common contestant chant.\n• Not unrelated to the \"Big Bucks + One Spin\" space above were \"Double Your $$ + One Spin\" and \"Add-A-One\". If you hit them with a nice amount already in your bank, they were awesome. If you hit them with your first spin of the game or after getting a Whammy, um, spin again?\n• On the 2002 revival Whammy!, the Big Bank space made its appearance in the second season. If a player hit this space and correctly answered a question, they won $3,000 plus any cash or prizes taken by the Whammy up to that point.\n• The Jack Barry and Pat Finn versions of The Joker's Wild used Jokers in different ways:\n• For the Barry version, a Joker could be used to double the value of any displayed category, and spinning three became a Golden Snitch that gave the player a chance to win the game immediately.\n• For the Finn version, it depended on the format- in the first definition-based format, spinning a Joker tripled the question value (the sum of the amounts in the two other windows) and gave the player 15 seconds to answer as many as possible. The second category-based format had them acting like they did before, but spinning three now gave the contestant $250 and the choice of any three categories revealed by the Jokers to answer questions worth $100 in.\n• Also from the Barry version, the \"Mystery\" category was always played for double normal value; \"Stumpers\" could be played for single or double value; and \"Fast Forward\" allowed the player to keep answering questions until he either missed one or chose to stop.\n• Nick Arcade had squares that, as opposed to the usual questions, puzzles and video challenges, just gave the players who landed on them free points or an Undesirable Prize: $50 savings bonds and the like.\n• Debt had the \"Debt-onator\" in round one, which was originally a single clue on the board, worth $500. It was later changed to be an entire category in which every clue was played for double value.\n• The various incarnations of Pyramid usually had one category per match with a hidden bonus card behind it, which was revealed when the category was selected, and awarded the contestant a bonus prize or amount of money if they managed to sweep the category. The two most well-known were the Dick Clark-era \"7-11\" in Round 1 (get 7 out of 7 and win $1,100) and the \"Mystery 7\" in Round 2 (get 7 out of 7, without knowing how the clues are related, and win a bonus prize).\n• Some versions have had bonuses for getting a 21 score in the main-game (Cullen $25,000 had $2,100; $20,000 had a varying prize (one episode had $1,000, but by the final week of the show in 1980 it was a color TV)).\n• The Wild Cards on all versions of Concentration. Whatever number was called before or after the Wild Card automatically matched. The difference on the third version, Classic Concentration, is that the square where the natural match would have been made is also revealed.\n• On Classic, if the contestant selected a Wild Card first then proceeded to select a second, they would receive a $500 bonus in addition to the prize they'd receive and four squares removed (once they chose a prize square, and, as before, its natural match). If, by chance, they found the third Wild Card, they would receive another $500 on top, and five squares revealed.\n• There were also the Take spaces, which had to be matched just like any other prize. A player with a Take card could use it to steal a prize from his opponent's inventory. Another item would award the player 5 extra seconds in the Bonus Round if he/she won the game.\n• There were other spaces in Classic as well, including the Cashpot (a Progressive Jackpot starting at $500 and going up $100 each day it wasn't won) and 5 Bonus Car Seconds (for extra time in the Bonus Round).\n• Three on a Match would occasionally have bonuses hidden behind one of the categories; there were \"Free Box\" bonuses (ranging from 1 to 3; you could only use the bonus boxes if you went to the match board immediately after answering your questions), and the \"Double Pot\" bonus (which doubled the pot for answering questions, for a max amount of $220).\n• The Jeopardy! Daily Doubles are acknowledged as this. On the other hand, an incorrect response will result in an equal penalty.\n• Tic-Tac-Dough:\n• Some of the special categories on the syndicated version. In particular: the Grand Question (added $1,000 to the pot); the Bonus Category (three-parter worth an extra turn, also a possible Golden Snitch); and Double or Nothing (chance to win a second box, but had to risk the first one). The Grand Question's predecessor, the Secret Category, doubled the entire pot on a right answer.\n• The 1990 version of the Bonus Round had the Dragonslayer. Picking him was not only worth an instant win, it also doubled the contestant's pot.\n• Mario Party 8 has the golden \"Lucky Space\", which takes you to a special place separate from the regular board where all the spaces have bonus coins on them, and you're pretty much guaranteed to get a star (three on one board) at the end of it.\n• And of course, the Donkey Kong spaces, which essentially act as the exact opposite of the Bowser Spaces.\n• \"Hidden boxes\" in the earlier games, which give 20 coins or a star to any player lucky enough to land on a space with one.\n• The whirl-wheel in No Good Gofers has several of these.\n• In the board game Monopoly, the Free Parking space is often given this designation. Originally, it was an extra space that the game's creator included to make the spacing of the game even out. \"House Rules,\" specific changes to the game when played in a non-competitive (i.e. family) setting, often use this space as a kind of lottery. All of the money from penalties, such as Income Tax or Chance cards, is placed in the center of the board and given to the next person landing on the spot.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/BonusSpace", "media_links": ["/pmwiki/pmwiki.php/Series/WheelofFortune", "/pmwiki/pmwiki.php/Series/WheelOfFortune", "/pmwiki/pmwiki.php/Series/MervGriffinsCrosswords", "/pmwiki/pmwiki.php/Series/Scrabble", "/pmwiki/pmwiki.php/Series/WinBenSteinsMoney", "/pmwiki/pmwiki.php/Series/Wipeout1988", "/pmwiki/pmwiki.php/Series/TheHollywoodSquares", "/pmwiki/pmwiki.php/Series/HighRollers", "/pmwiki/pmwiki.php/Series/ThePriceIsRight", "/pmwiki/pmwiki.php/Creator/BillCullen", "/pmwiki/pmwiki.php/Series/EstateOfPanic", "/pmwiki/pmwiki.php/Series/ChaseGameShow", "/pmwiki/pmwiki.php/Series/CashExplosion", "/pmwiki/pmwiki.php/Series/PressYourLuck", "/pmwiki/pmwiki.php/Series/Whammy", "/pmwiki/pmwiki.php/Creator/JackBarry", "/pmwiki/pmwiki.php/Series/TheJokersWild", "/pmwiki/pmwiki.php/Series/NickArcade", "/pmwiki/pmwiki.php/Series/Debt", "/pmwiki/pmwiki.php/Series/Pyramid", "/pmwiki/pmwiki.php/Series/Concentration", "/pmwiki/pmwiki.php/Series/ThreeOnAMatch", "/pmwiki/pmwiki.php/Series/Jeopardy", "/pmwiki/pmwiki.php/Series/TicTacDough", "/pmwiki/pmwiki.php/VideoGame/MarioParty", "/pmwiki/pmwiki.php/TabletopGame/Monopoly"], "non_media_links": ["/pmwiki/pmwiki.php/Main/GameShow", "/pmwiki/pmwiki.php/Main/ProgressiveJackpot", "/pmwiki/pmwiki.php/Main/Whammy", "/pmwiki/pmwiki.php/Main/BonusRound", "/pmwiki/pmwiki.php/Main/BonusRound", "/pmwiki/pmwiki.php/Main/BonusRound", "/pmwiki/pmwiki.php/Main/Determinator", "/pmwiki/pmwiki.php/Main/Whammy", "/pmwiki/pmwiki.php/Main/MagnificentBastard", "http://en.wikipedia.org/wiki/Michael_Larson", "/pmwiki/pmwiki.php/Main/InfiniteOneUps", "/pmwiki/pmwiki.php/Main/Whammy", "/pmwiki/pmwiki.php/Main/GoldenSnitch", "/pmwiki/pmwiki.php/Main/UndesirablePrize", "/pmwiki/pmwiki.php/Main/BonusRound", "/pmwiki/pmwiki.php/Main/ProgressiveJackpot", "/pmwiki/pmwiki.php/Main/BonusRound", "/pmwiki/pmwiki.php/Main/GoldenSnitch", "/pmwiki/pmwiki.php/Main/BonusRound", "/pmwiki/pmwiki.php/Main/Whammy", "/pmwiki/pmwiki.php/Pinball/NoGoodGofers", "/pmwiki/pmwiki.php/Main/HouseRules"]}