{"title": "Race Film", "content": "A \"race film\" (or \"race movie\") was a form of American film released during the 1910s through 1950s. They focused on having all-black casts and were aimed at black audiences. Occasionally, a film aimed at other racial minorities were named \"race films\", however the term usually referred to black-centric works.\n\nRace films almost never depicted poverty, ghettos, or crime. They also often avoided discussing racism. Race films instead tended to be based on middle class and upper-middle urban individuals. They discussed themes of \"improving\" the black race and the tension between uneducated and educated black people. At the same time, there was a focus on avoiding Heritage Disconnect while becoming more successful. Many race films come off as Author Tracts as a result. The stock black characters seen in mainstream films, such as mammys and Uncle Toms, were either absent from race films or were relegated to being supporting roles and villains.\n\nRace films were usually produced in northern states by white directors, however they were aimed at lower-income Southern black people and black Southeners who moved up north. In states where racial segregation was practiced, race movies were shown at black theaters. In states where they weren't, race films were usually shown only in predominantly black neighborhoods. Occasionally white theaters in segregated areas would air special time-slots for race films, such as at midnight.\n\nAt least five hundred race films were produced however less than one hundred still exist. Race films were rarely, if ever, mainstream and thus most fell into obscurity until they were rediscovered decades later.\n\nMany of the surviving race films were directed by Oscar Micheaux, an influential black director. Most of his works were of the political sort and focused on the above-mentioned themes of \"improving\" the black race, and such as.\n\nSee also Race Records, the musical equivalent (more here ). Compare to Blaxploitation. Related to Minority Show Ghetto. Not to be confused with films about racing; those are covered under Sports Stories.\n• Oscar Micheaux films:\n• 1920's Within Our Gates is one of the earliest surviving race films and is considered a Take That! at The Birth of a Nation. It's Oscar Micheaux's most famous film. Within Our Gates has a famous lynching scene and a Near-Rape Experience of the protagonist, who is actually Mixed Race and the daughter of the man who almost raped her. It was highly controversial at the time and banned in a number of states. Scenes were edited and remove to please censors, however that didn't help much.\n• 1920's The Symbol Of The Unconquered is directed by Oscar Micheaux. It was another Take That! at The Birth of a Nation. It's about a black heiress who fights off the Ku Klux Klan.\n• In 1932's Ten Minutes to Live, a movie producer offers a nightclub singer a role in his latest film. He has ulterior motives of wanting to sleep with her, however she still accepts the role. A patron at the club receives a note saying that she will be killed ten minutes after receiving a second note.\n• Murder in Harlem is a 1935 film about a black night watchman who finds a white woman murdered one night and ends up Mistaken for Murderer. It's loosely based on the Leo Frank murder trial.\n• The Scar of Shame is a 1927 race film. It stars Alvin Hillyard, a well-educated, upper-class black man and a talented composer, who rescues a lower-class woman named Louise from her abusive, alcoholic stepfather. The two later get married, however Alvin has doubts about their relationship due to their class difference. Another man, Eddie, tries to woo Louise away from Alvin, with tragic consequences.\n• 1925's Body and Soul is about a criminal who passes himself off as a reverend. Jenkins, along with another criminal, use their job to swindle money out of church goers. Jenkins falls for a woman named Isabelle, however she's in love with Jenkins' long-lost twin brother. Jenkins steals money from Isabelle's mother Martha and frames her for it. Isabelle ends up dying, and as she's dying she tells her mother that Jenkins raped her and stole the money. The censors didn't like the film's villainous minister character, forcing the director to quickly make a new ending where it turns out to be All Just a Dream of Martha's. Of the original nine reels, the final version only contains five.\n• The Blood of Jesus (also known as The Glory Road) is a Christian-themed race film from 1945. In a rural village, a Baptist woman named Martha is baptized, however not soon afterwards her husband accidentally shoots her. Martha's spirit is taken by an angel to the Crossroads between Heaven and Hell. The meat of the film involves Martha being tempted by an agent of Satan into going to Hell. Ultimately, Martha wakes up from her Adventures in Comaland at home after viewing a vision of Jesus. Martha's husband has turned from an atheist to a Christian since she was shot. The angel that took Martha then blesses her marriage. The Blood of Jesus was the first race film to be added into the National Film Registry.\n• Comedian Bert Williams signed by to star, direct, produce, and write two short 1916 films. These films were A Natural Born Gambler and Fish. In both films, Williams was made to wear \"darkie\" makeup and he played up racist stereotypes for white audiences, however his leadership role was rare for a black lead. A Natural Born Gambler is about a man who is busted for gambling and thrown into jail. He dreams of playing poker, but even in his dream he fails. In Fish he played as a boy who wants to fish instead of do chores.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/RaceFilm", "media_links": ["/pmwiki/pmwiki.php/Film/WithinOurGates", "/pmwiki/pmwiki.php/Film/TheBirthOfANation1915", "/pmwiki/pmwiki.php/Film/TheSymbolOfTheUnconquered", "/pmwiki/pmwiki.php/Film/TheScarOfShame", "/pmwiki/pmwiki.php/Film/TheBloodOfJesus"], "non_media_links": ["/pmwiki/pmwiki.php/Main/HeritageDisconnect", "/pmwiki/pmwiki.php/Main/AuthorTract", "/pmwiki/pmwiki.php/Main/Mammy", "/pmwiki/pmwiki.php/Main/UncleTomfoolery", "/pmwiki/pmwiki.php/Main/MissingEpisode", "/pmwiki/pmwiki.php/Main/RaceRecord", "https://en.wikipedia.org/wiki/Race_record", "/pmwiki/pmwiki.php/Main/Blaxploitation", "/pmwiki/pmwiki.php/Main/MinorityShowGhetto", "/pmwiki/pmwiki.php/Main/SportsStories", "/pmwiki/pmwiki.php/Main/TakeThat", "/pmwiki/pmwiki.php/Main/NearRapeExperience", "/pmwiki/pmwiki.php/Main/MixedRace", "/pmwiki/pmwiki.php/Main/SurpriseIncest", "/pmwiki/pmwiki.php/Main/TakeThat", "/pmwiki/pmwiki.php/Main/MistakenForMurderer", "/pmwiki/pmwiki.php/Main/VeryLooselyBasedOnATrueStory", "/pmwiki/pmwiki.php/Main/AbusiveParents", "/pmwiki/pmwiki.php/Main/AlcoholicParent", "/pmwiki/pmwiki.php/Main/RescueRomance", "/pmwiki/pmwiki.php/Main/DrivenToSuicide", "/pmwiki/pmwiki.php/Main/AllJustADream", "/pmwiki/pmwiki.php/Main/AdventuresInComaland", "/pmwiki/pmwiki.php/UsefulNotes/NationalFilmRegistry", "/pmwiki/pmwiki.php/Main/DawsonCasting"]}