{"title": "It's a Wonderful Failure", "content": "\n• The player gets a particularly special Bad Ending if they join Father Elijah at the end of the DLC Dead Money:\n\nIn the years that followed, the legend of the Sierra Madre faded, and there were no... new visitors to the city. Years later, when a mysterious blood red cloud began to roll across the Mojave, then West toward the Republic, no one knew where it had come from. Only that it brought death in its wake. Attempts to find the source of the toxic cloud failed. The Mojave was cut off. Through the Cloud, lights were seen from HELIOS One. There were stories of ghosts immune to gunfire, who struck down anyone they saw with rays of light. The last chapter of the Mojave came when a modified REPCONN rocket struck Hoover Dam, releasing a blood-red cloud, killing all stationed there. All attempts to penetrate the Cloud and re-take the Dam failed, and both the NCR and Legion finally turned away from it, citing the place as cursed. In the years that followed, communities across the West began to die as traces of the Cloud began to drift over lands held by the NCR. Only two remained alive in the depths of the Cloud, at the Sierra Madre, waiting for their new world to begin again.\n• Another example is a cut ending from Old World Blues, in which the player would have joined the think tank.\n\nIn the decades following the Battle of Hoover Dam, the Big Empty remained a desolate stretch of wasteland, where few travelers dared venture. In time, however, a strange blue field began to grow, slowly spreading across the Big Empty. Lightning-blue fields of force danced on the horizon, like electrical storms. People whispered of floating spheres flickering like a rainbow of torches in the desert like Old World wisps. Then communities began to vanish. Goodsprings was crushed beneath bizarre hexcrete blocks that stacked to the sky. The inhabitants of Primm winked out, flesh-fried into X-ray silhouettes, their arms raised in surrender. A satellite fell on Jacobstown, beaming a kaleidoscope of bright blue equations into the deranged Nightkin minds, driving some berserk, paralyzing others. Black Mountain Radio began broadcasting a strange staccato static as hordes of giant man-eating battle Brahmin began to swarm from its peak. Camp Searchlight became a garden of giant carnivorous plants, and the Colorado river... \"shrugged\" one day, drowning several communities as its contours adjusted themselves. The Gomorrah became home to a particularly virulent vegetation-based STD that grew like a fungus within victim's genitalia until their bodies burst open like pods. The Legion East were systematically brain-scrubbed and rebuilt so that all the inhabitants believed they were in ancient Rome... on the moon. The human cattle of NCR were re-educated into believing they existed in perpetuity in a nation-wide version of someplace called \"Tranquility Lane.\" In the end, no one was sure who had cracked the Dome of the Big Empty, although it was clear someone had been playing with forces they did not understand. Throughout all this, the Think Tank was industrious, confident these experiments were all for the best, the results of the data they obtained - incredible. They marveled that all of this had been waiting for them to come along and experiment since the war. Humanity certainly was persistent, no matter what experiments, nuclear holocaust or otherwise, it inflicted on itself.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/ItsaWonderfulFailure", "media_links": ["/pmwiki/pmwiki.php/VideoGame/FalloutNewVegas"], "non_media_links": ["/pmwiki/pmwiki.php/Main/BadEnding"]}