{"title": "Spammer", "content": "\"Warning: This is without a doubt the most depraved, foul, insidious and malevolent of all possible evil professions. If you choose this job you will be hated by good and evil-doers alike , becoming the lowest of all possible lows, with vigilantes hunting you and entire religions springing up devoted to your destruction. And not without good reason.\n\nWe won't actually go into the details of this job as it's far too disgusting , even for us. Nevertheless, as a spammer you will now honestly be able to say your downfall from humanity is complete, that your eternal damnation is assured and that none exist who can surpass you in vileness.\n\nIn email slang, spam is when an email user sends the same message to a large number of people using an automated list, generally for scam or advertisement purposes. The Nigerian email scams of recent years are a good example. In order to spam an email account, the spammer must first get the email address by using a phishing site, spyware, hacking, or simply by buying it from a website you trusted more than you should have. Once they have your address, you can receive spam from them for years. However, none of that matters because this entry is about the other kind of spammer.\n\nIn message board slang, a spammer is someone who makes short, meaningless posts that add nothing to a thread besides making one scroll down farther. These can come in a variety of forms and for a number of reasons. These are:\n• Post Count raising: Most message boards will record your number of posts and a person's post count is often a sign of how active they are in the community. Therefore, a person who wants to appear more active than they really are will make a large number of junk posts to artificially increase their number. Most message boards refer to this as \"post count whoring\" and actively discourage it, but it is still a common occurrence on many boards. On some forums linked with certain websites, desirable content is only available to those who have more than a certain post count.\n• Trolling: Many Trolls will make a few junk posts to make themselves seem like real posters as a lead up to their attack. Others will spam as part of their attack. This can include posting one or two word messages in response to everyone's posts to infuriate them, or simply flooding the board with the same offensive message over and over again. Either way, it's seriously annoying.\n• They don't have anything to say: Often spamming is a simple result of people lacking a good internal censor and simply disgorging the first meaningless phrase that enters their heads. This is the most common form of spamming and can involve everything from the insipid habit of the first person to reply to a thread posting nothing but \"First Post\" to the hated Me Too!. Either way, it's the forum equivalent of a half-empty can of diet coke.\n• Bumping: They're trying to keep a thread at the top of the page by \"bumping\" it. Less subtle spammers will simply post \"bump\" ad nauseam.\n• There's also the ones who don't trim the post they're quoting, even if the quote contains large pictures or is itself a quote-of-a-quote-of-a-quote. Or, in really bad cases, both.\n• Spambots: They aren't a person at all, but a program. Dropped off considerably recently, once forums started putting in special security measures like registration codes. Used for multiple purposes, such as making spam ads outside of the increasingly unreliable email, or - in a scary case - by criminal organizations trying to spread their influence. Various messages in middle-eastern language(s) translatable as threats, as well as threats in English originating from similar sources, were made around the time of Saddam Hussein's execution on BBS and imageboard sites.\n• Quite a lot of forums have 'spam boards' these days, in which you'll usually find nothing but spam posts. Often, but not always, the posts in these boards don't count to your total. On these boards, the term 'spammer' is at least a compliment, at best a badge of honor.\n\nNote that sometimes a spammer is actually The Shill or Sock Puppet in disguise. Therefore, it is a good idea to totally ignore all spammers, just to be safe. Unfortunately, a website called Social Toaster is encouraging fans of various musicians and artists to spam for them in ways that haven't been seen in a long time, creating fandom armies of unwitting (or in some cases thoroughly willing) human spam bots.\n• Freedom(TM), the sequel to Daemon, takes a brief moment out from the main plot to portray the brutal, Frank Castle-style Vigilante Execution of several men running an email spam server out of a rented office. This was presumably a bit of Author Appeal at work, as Daniel Suarez's day job is computer security.\n• Loudness's 2006 song \"Don't Spam Me\" is a rant about spammers and spam e-mail.\n• Deus Ex: Human Revolution features spam as an inbox item. The spam even appears in secret black-ops networks.\n• This storyline in Angband - Tales from the Pit.\n• In Schlock Mercenary, spamming is a capital offense. As early as the 21st century spammers were already less popular than defense attorneys, door-to-door fragrance salesmen, and the French. By the late 31st century they were held in the same regard as pedophiles and telemarketers. \n\nThe stigma was so powerful that Hormel was forced to rename their increasingly unpopular luncheon meat to \"SPHLEGM\" (Salted, Processed Ham and Lard. Edible? Gag a Maggot!) \n\nSales skyrocketed.\n• Rather logical in this setting. Even it remains a misdemeanor, when you spam a galaxy-spanning internet — and therefore have TRILLIONS of counts thereof — the only way you can pay the resulting cumulative fines is by having your execution televised to all your victims. Spammers, Take That!", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/Spammer", "media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/Literature/HeartOfDarkness", "https://tvtropes.org/pmwiki/pmwiki.php/Literature/Daemon", "https://tvtropes.org/pmwiki/pmwiki.php/ComicBook/ThePunisher", "https://tvtropes.org/pmwiki/pmwiki.php/Music/Loudness", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/DeusExHumanRevolution", "https://tvtropes.org/pmwiki/pmwiki.php/Webcomic/Nodwick", "https://tvtropes.org/pmwiki/pmwiki.php/Webcomic/AngbandTalesFromThePit", "https://tvtropes.org/pmwiki/pmwiki.php/Webcomic/SchlockMercenary"], "non_media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/Main/EvenEvilHasStandards", "https://tvtropes.org/pmwiki/pmwiki.php/Main/FellOffTheBackOfATruck", "https://tvtropes.org/pmwiki/pmwiki.php/Main/TheSoulless", "https://tvtropes.org/pmwiki/pmwiki.php/Main/ImprobablyLowIQ", "https://tvtropes.org/pmwiki/pmwiki.php/Main/YouDoNOTWantToKnow", "http://evil-guide.tripod.com/career.html", "https://tvtropes.org/pmwiki/pmwiki.php/Main/PostCount", "https://tvtropes.org/pmwiki/pmwiki.php/Main/AstroTurf", "https://tvtropes.org/pmwiki/pmwiki.php/Main/Troll", "https://tvtropes.org/pmwiki/pmwiki.php/Main/HanlonsRazor", "https://tvtropes.org/pmwiki/pmwiki.php/UsefulNotes/FirstPost", "https://tvtropes.org/pmwiki/pmwiki.php/Main/MeToo", "https://tvtropes.org/pmwiki/pmwiki.php/Main/TheShill", "https://tvtropes.org/pmwiki/pmwiki.php/Main/SockPuppet", "https://tvtropes.org/pmwiki/pmwiki.php/Main/VigilanteExecution", "https://tvtropes.org/pmwiki/pmwiki.php/Main/AuthorAppeal", "https://tvtropes.org/pmwiki/pmwiki.php/Main/Music", "https://tvtropes.org/pmwiki/pmwiki.php/Main/VideoGames", "https://tvtropes.org/pmwiki/pmwiki.php/Main/Webcomics", "http://nodwick.humor.gamespy.com/gamespyarchive/index.php?date=2005-06-23", "http://angband.calamarain.net/view.php?date=2006-08-25", "https://www.schlockmercenary.com/2003-02-24", "https://tvtropes.org/pmwiki/pmwiki.php/Main/TakeThat"]}