{"title": "Rap Metal", "content": "Rap Metal is a fusion of rap and metal. What, you want more? Fine. Rap metal's roots can be found in both of its parent genres. On the hip-hop side, you had artists such as the Run\u0096D.M.C., Beastie Boys, Cypress Hill and Esham sampling metal songs while on the metal/heavier rock front, bands such as Body Count and Rage Against the Machine were being fronted by rappers.\n\nHowever, the genre gained prominence with two songs released in the early 90's. The first was the legendary collaboration between Thrash Metal band Anthrax and the Political Rap group Public Enemy for a reworking of the latter's hit, \"Bring the Noise\". People first laughed at them for thinking they could pull something like this off, but fast forward half a decade later and everybody and their decrepit grandmother were eating up the genre. It's interesting to note that both Anthrax and Public Enemy tried fusing rap and metal before ever working with each other, with Anthrax recording the comedic and Beastie Boys-esque \"I'm the Man\" and Public Enemy rapping over \"Angel of Death\" for \"She Watch Channel Zero?!\".\n\nWhat's the second song? \"Epic\", of course! Faith No More was no stranger to mixing different influences and this song was just another notch in their belt. However, the song exploded, putting FNM and rap metal in the limelight. Unfortunately, Faith No More became regarded as one hit wonders in America and whether you like it or not, the success of \"Epic\" paved the way for Nu Metal.\n\nHerein lies the problem with the genre: the overlap with Nu Metal. While the latter genre was massively popular on the charts during the late 90's and early millennium, it eventually lost favor with rock audiences and hardly anybody wanted to combine the two genres again, possibly fearful of the derision they faced and comparisons to \"fly\" frat boys rapping over murky, down-tuned guitars. Due to this the genre is very, very rarely done today; the closest thing that you'll generally find is slam, which tends to utilize a lot of hip hop-flavored grooves, pseudo-rapped vocals (albeit totally unintelligible ones), and often involves hip-hop-inspired aesthetic choices. This trend was likely kicked off by the likes of Suffocation, Dying Fetus, Pyrexia, Internal Bleeding, and Dehumanized, all of whom had noticeable hip-hop elements that later acts expanded upon. It has seen some use in The New '10s, particularly by the nu metal revival bands, but it's too soon to be saying there's a revival.\n\nThis genre is often called Rapcore, which is incorrect. Rapcore is a subgenre of Punk Rap.\n\nA more common version does not tie the band to the genre of Rap Metal but simply has one song like this (or one chorus in one song) or the like.\n• Attila (a 2010s example mixed with deathcore, and a rather infamous example of this genre)\n• Candiria (a Genre-Busting example that mixes it with progressive metal, jazz fusion, and ambient)\n• dälek (Trope Codifier for industrial hip-hop, and a strange Genre Mashup example, fusing rap and industrial with enough distortion to make them a borderline metal group; they are definitely one of the heaviest examples, with many of their songs reaching 10 or even 11 on the Mohs Scale of Rock and Metal Hardness)\n• Emmure (their post-Felony era, mixed with metalcore and deathcore, also can count as one of the heaviest examples)\n• From Ashes to New (a rare 2010s example)\n• Hacktivist (a rather unusual example, mixing djent with grime; also a rare 2010s example)\n• Issues (occasionally, but more often their sound can described as \"R&B Metal\")\n• Linkin Park\n• 2007 - Minutes to Midnight (began to move away from their rap metal/nu metal designation here)\n• Papa Roach (earlier material, though their later work saw the return of rapping in some songs)\n• Prophets Of Rage (a supergroup consisting of rappers Chuck D and B-Real as well as the three instrumentalists of Rage Against the Machine, along with turntables provided by DJ Lord)\n• Proyecto Eskhata, who mix it with progressive rock.\n• Tech N9ne (Therapy EP and the occasional song outside of it)\n• Thousand Foot Krutch (first album and the occasional song thereafter)\n• Winds Of Plague (intermittently, but it's most pronounced on their third album)", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/RapMetal", "media_links": ["/pmwiki/pmwiki.php/Music/Anthrax", "/pmwiki/pmwiki.php/Music/RunDMC", "/pmwiki/pmwiki.php/Music/BeastieBoys", "/pmwiki/pmwiki.php/Music/CypressHill", "/pmwiki/pmwiki.php/Music/Esham", "/pmwiki/pmwiki.php/Music/BodyCount", "/pmwiki/pmwiki.php/Music/RageAgainstTheMachine", "/pmwiki/pmwiki.php/Music/Anthrax", "/pmwiki/pmwiki.php/Music/PublicEnemy", "/pmwiki/pmwiki.php/Music/Slayer", "/pmwiki/pmwiki.php/Music/FaithNoMore", "/pmwiki/pmwiki.php/Music/Suffocation", "/pmwiki/pmwiki.php/Music/DyingFetus", "/pmwiki/pmwiki.php/Music/BodyCount", "/pmwiki/pmwiki.php/Music/Candiria", "/pmwiki/pmwiki.php/Music/Clawfinger", "/pmwiki/pmwiki.php/Music/CypressHill", "/pmwiki/pmwiki.php/Music/BlackSundayAlbum", "/pmwiki/pmwiki.php/Music/Dalek", "/pmwiki/pmwiki.php/Music/DeathGrips", "/pmwiki/pmwiki.php/Music/DVSR", "/pmwiki/pmwiki.php/Music/Emmure", "/pmwiki/pmwiki.php/Music/FromAshesToNew", "/pmwiki/pmwiki.php/Music/Hacktivist", "/pmwiki/pmwiki.php/Music/Issues", "/pmwiki/pmwiki.php/Music/KidCrusher", "/pmwiki/pmwiki.php/Music/KidRock", "/pmwiki/pmwiki.php/Music/DevilWithoutACause", "/pmwiki/pmwiki.php/Music/LimpBizkit", "/pmwiki/pmwiki.php/Music/ThreeDollarBillYall", "/pmwiki/pmwiki.php/Music/SignificantOther", "/pmwiki/pmwiki.php/Music/ChocolateStarfishAndTheHotDogFlavoredWater", "/pmwiki/pmwiki.php/Music/TheUnquestionableTruth", "/pmwiki/pmwiki.php/Music/GoldCobra", "/pmwiki/pmwiki.php/Music/LinkinPark", "/pmwiki/pmwiki.php/Music/HybridTheory", "/pmwiki/pmwiki.php/Music/Meteora", "/pmwiki/pmwiki.php/Music/MinutesToMidnight", "/pmwiki/pmwiki.php/Music/Necro", "/pmwiki/pmwiki.php/Music/Otep", "/pmwiki/pmwiki.php/Music/POD", "/pmwiki/pmwiki.php/Music/PapaRoach", "/pmwiki/pmwiki.php/Music/PublicEnemy", "/pmwiki/pmwiki.php/Music/CypressHill", "/pmwiki/pmwiki.php/Music/RageAgainstTheMachine", "/pmwiki/pmwiki.php/Music/ProyectoEskhata", "/pmwiki/pmwiki.php/Music/RageAgainstTheMachine", "/pmwiki/pmwiki.php/Music/Slapshock", "/pmwiki/pmwiki.php/Music/TechN9ne", "/pmwiki/pmwiki.php/Music/ThousandFootKrutch", "/pmwiki/pmwiki.php/Music/UrbanDanceSquad"], "non_media_links": ["/pmwiki/pmwiki.php/Main/SubvertedRhymeEveryOccasion", "/pmwiki/pmwiki.php/Main/PissTakeRap", "/pmwiki/pmwiki.php/Main/HipHop", "/pmwiki/pmwiki.php/Main/GangstaRap", "/pmwiki/pmwiki.php/Main/PoliticalRap", "/pmwiki/pmwiki.php/Main/HeavyMetal", "/pmwiki/pmwiki.php/Main/AlternativeMetal", "/pmwiki/pmwiki.php/Main/ThrashMetal", "/pmwiki/pmwiki.php/Main/FunkMetal", "/pmwiki/pmwiki.php/Main/HardcorePunk", "/pmwiki/pmwiki.php/Main/HardRock", "/pmwiki/pmwiki.php/Main/AlternativeRock", "/pmwiki/pmwiki.php/Main/GrooveMetal", "/pmwiki/pmwiki.php/Main/Reggae", "/pmwiki/pmwiki.php/Main/ExactlyWhatItSaysOnTheTin", "/pmwiki/pmwiki.php/Main/ThrashMetal", "/pmwiki/pmwiki.php/Main/PoliticalRap", "/pmwiki/pmwiki.php/Main/GenreBusting", "/pmwiki/pmwiki.php/Main/OneHitWonder", "/pmwiki/pmwiki.php/Main/NuMetal", "/pmwiki/pmwiki.php/Main/DeaderThanDisco", "/pmwiki/pmwiki.php/Main/PrettyFlyForAWhiteGuy", "/pmwiki/pmwiki.php/Main/PissTakeRap", "/pmwiki/pmwiki.php/Main/DeathMetal", "/pmwiki/pmwiki.php/Main/TheNewTens", "/pmwiki/pmwiki.php/Main/PunkRap", "/pmwiki/pmwiki.php/Main/RapMetal", "/pmwiki/pmwiki.php/Main/Deathcore", "/pmwiki/pmwiki.php/Main/GenreBusting", "/pmwiki/pmwiki.php/Main/Metalcore", "/pmwiki/pmwiki.php/Main/TropeCodifier", "/pmwiki/pmwiki.php/Main/GenreMashup", "/pmwiki/pmwiki.php/Main/MohsScaleOfRockAndMetalHardness", "/pmwiki/pmwiki.php/Main/Supergroup", "/pmwiki/pmwiki.php/Main/GangstaRap"]}