{"title": "Goofy Feathered Dinosaur", "content": "\"[Scientists], stop ruining everyone's fun when it comes to dinosaurs! I've never met a dinosaur that a scientist hasn't tried to ruin; Jurassic Park comes out and everyone's enjoying the T. rex and the velociraptors, but then Johnny Scientist jumps up and goes, \"Um, actually, we did a little bit more science, and we've learned that velociraptors were 2' tall and feathered and could be trained to fetch slippers. Also, the T. rex was more of a scavenger than a hunter, and all the other dinosaurs used to bully it and knock its schoolbooks out of its tiny, pathetic arms.\"\n\nFor centuries, dinosaurs were seen as reptilian animals and were often treated as little more than giant, hulking monsters, especially within the sci-fi community. Within the last few decades, researchers have re-evaluated these ideas. Newer research has revealed that dinosaurs were overall much more like birds than lizards — in fact, birds are themselves considered to be very specialized dinosaurs.\n\nThis, however... hasn't gone well with the mainstream media. People like their big, scary, roaring and sulking lizard creatures, even if the actual animals were anything but hulking monsters (in fact, most dinosaurs are small). Even many dinosaur enthusiasts (many who grew up on media such as Jurassic Park, despite it actually set out to dispute the image of din although it was inaccurate even at the time) are averse to the idea. Dinosaurs in media still tend to be based on older reconstructions, either because the artists didn't care enough to make them accurate, because they didn't know better, or because they simply don't like the contemporary reconstructions.\n\nFeathered dinosaurs were hit hard with this stigma.\n\nThe idea of feathered dinosaurs tends to be mocked and scoffed at in media. Contrary to common belief, not all dinosaurs are considered to probably have some level of feathering. Many, if not most, but not all. It's also perfectly possible for dinosaurs to have had both scales and feathers. However, the popular view of feathered dinosaurs is a giant fluffy dinosaur with brightly coloured feathers. Tyrannosaurus rex has received most of the brunt of this issue. Due to its popularity, it's the poster-child for feathered dinosaurs. Paleontologists aren't quite sure whether they were fully feathered or not (or even if it had feathers), but the mainstream image is that tyrannosauruses are now \"cute and cuddly\". Feathered dinosaurs bring to mind fowl like chickens and ducks, rather than the equally-feathered-but-frightening hawks or terror birds. Large ratites such as ostriches and emus, also feathered-but-frightening, tend to be ignored in the subject of feathered dinosaurs as well, despite being the closest things to living prehistoric dinosaurs not to mention many dinosaurs resembling them such as Ornithomimus, Struthiomimus (whose name literally means \"ostrich mimic\"), and Gallimimus.\n\nFeathered dinosaurs in media tend to be joke characters; they're goofy looking and often goofy acting, particularly making failed attempts at flying which frequently happens with Archaeopteryx, arguably the most famous of all feathered dinosaurs. The biggest exception to this rule is the dromaeosaurs a.k.a. raptors, which definitely had feathers due to fossil evidence. This may be because raptors are almost always portrayed as small, screeching Lightning Bruisers as a counteract to the \"giant, roaring brutes\" image — in fact, they were the very dinosaurs to break that stereotype and revive the bird-dinosaur connection theory. Feathered dromaeosaurs in media will usually be bizarre-looking than goofy, but even they will fall into the latter from time to time (and they won't be accurately feathered anyways).\n\nIn Japanese media, however, feathered dinosaurs are more common and less likely to be depicted as goofy, with a feathered T. rex being just as much of a threat as a scaly one. This may be due to dinosaurs and other prehistoric creatures being more popular in Japan than in America, therefore more willingness to strive for accuracy.\n\nNaturally, a subtrope of Artistic License \u0096 Paleontology. Contrast Feathered Fiend. Compare Feathered Dragons, which are usually not seen as goofynote The fact that artists have far more freedom with feather and body designs probably helps though.\n• In the Viz Media manga Dinosaur Hour!, two Protoceratops learn about the concept of a feathered Velociraptor and try to add plumage to a drawing of a raptor in the most ridiculous way possible. As for the real feathered Velociraptor itself, it is overly fluffy and resembles a cartoonish duckling. That doesn't stop them from viciously attacking the Protoceratops.\n• The only feathered dinosaurs in The Good Dinosaur are the raptors going after the T. rex's herd. Although fearsome, they are depicted as goofy rednecks, with their feathered crests resembling mullets.\n• The Land Before Time does this with Guido the Microraptor from the 12th movie, who is a nervous and awkward Plucky Comic Relief; the goofy Yellow Bellies (Beipiaosaurus) from the 13th movie, who are pretty much scaredy cat comic relief types; and the neurotic and panicky Nothronychus Wild Arms from the 14th movie. The 14th movie, however, also averts this with the menacing Yutyrannus.\n• Ice Age 5: Collision Course has a trio of feathered, flying dromaeosaurids as the main antagonists. They appear to be somewhat smarter than the scaly dinosaurs seen in Ice Age 3: Dawn of the Dinosaurs, as they talk fluent English, but also goofier and less monstrous.\n• Ice Age 3: Dawn of the Dinosaurs also had a goofy-looking Archaeopteryx which falls victim to Black Comedy.\n• You Are Umasou averts this with the feathered Troodon from the beginning of the film, which are portrayed as a threat to the Maiasaura nesting grounds.\n• Ironically, since it has become the poster child of dinosaur depictions in media, the Jurassic Park franchise actually tends to avert this trope (after all, it is the very movie that introduced the Dinosaur Renaissance to mainstream media). The male Velociraptor in Jurassic Park III, the Indominus rex in Jurassic World, and the Indoraptor in Jurassic World: Fallen Kingdom have crests of quill-like feathers and are presented as feathered fiends. More properly feathered dinosaurs have recently made their way into the video games and comics, most of which are hardly presented as goofy.\n• Paul Gilligan draws Pooch Café, wherein one strip has Boomer mention to Poncho that birds evolved from dinosaurs. Poncho envisions a T. rex with ridiculously small wings excreting onto a car. The weight of the discharge crushes the vehicle. Poncho agrees that the notion is difficult to believe.\n• A Muse Magazine dinosaur issue featured a Kokopelli & Company comic featuring Koko showing off various feathered theropods. Among them a feathered T. rex that clucked like a chicken.\n• Defied with Ixalan's dinosaurs in Magic: The Gathering. The dinosaurs on this plane are depicted with feathers, but are portrayed as dangerous predators in the wild and noble mounts and symbols of the powerful Sun Empire.\n• Club Penguin averts this with the Raptors from the Prehistoric Parties. They are depicted with feathers, but are treated as ferocious and cunning predators.\n• Defied with the feathered dinosaurs in Ark Survival Evolved, most of which are portrayed as Feathered Fiends. Yutyrannus in particular is The Dreaded.\n• King Rexxtopher from Mighty Magiswords is a rare case of a feathered T. rex. It fits the overall wacky tone of the show.\n• Defied by TREY The Explainer. He goes with whatever the scientific research suggests but he is especially fond of feathered dinosaurs. He has several videos discussing them.\n• Frequently discussed on Two Best Friends Play. Any time the topic of dinosaurs came up in their Seinfeldian Conversations, at least one of them would rant about how scaly dinosaurs are so much cooler and scarier than feathered ones—and they would also insult fans who, in the past, tried to convince them otherwise. Of the crew, Matt seemed to feel particularly strongly about the issue. And if they're playing a game with actual dinosaurs in it, expect them to say something along the lines of \"Look, this game has dinosaurs the way they should be — with no feathers!\"\n• In Manly Guys Doing Manly Things, the trained velociraptors are chubby-cheeked, tropical-coloured, fluffy, and friendly. Justified in that it was a side effect of the genetic engineering and breeding that made them trainable, while the unmodified velociraptors had sleeker plumage and nastier tempers — the genes that made them friendly and trainable were also the ones that made them fluffy and cute.\n• xkcd has many, many comics pushing back against the supposed goofiness of feathered dinosaurs. One suggests that anyone who finds them unthreatening has never fought an ostrich; another imagines a world where aliens are similarly disappointed to find out that humans weren't \"cooler\" and cling to wildly inaccurate understandings of our physiology.\n• Defied in one Sandra and Woo strip where Sandra expresses her frustration at Velociraptor being depicted without feathers. The feathered Velociraptor model in the comic is portrayed very realistically.\n• Schlock Mercenary: Somewhat applies, in that the dinosaurs are significantly less threatening than anyone remembers now that they know they were intelligent enough to get past the Medieval age before having to be rescued from the comet by a passing precursor worldship. Even the T. rex turns out to have become a domesticated hunting animal more adorable than terrifying .\n• Munro Ferguson directed How Dinosaurs Learned To Fly for the National Film Board of Canada. It's a six minute cartoon about a rotund dinosaur named Dip that amuses himself by jumping off cliffs. Though the sensation while falling approximates flying, the sudden stop at the end dulls Dip's enjoyment. However, Dip developed feathers (and lost weight) until he could fly. Some of his fellow dinosaurs developed similarly, spawning the myriad variety of birds we see today.\n• The Simpsons:\n• \"Forgive and Forget\" has a new version of Truckasaurus designed with feathers \"in conformance with the latest paleontological theories about dinosaurs\". The crowd ends up hating it and destroying it.\n• Subverted in \"Days of Future Future\", where some (partially-)feathered raptors tear apart a live goat fed to them during a show.\n• Gigantosaurus has Archie the Archaeopteryx, who is the only feathered dinosaur in the cast. He also has an awkward personality and is always on the receiving end of slapstick humor. Ironically, the raptors Cror and Totor are also depicted as goofy, but they are stereotypically featherless.\n• Averted in the Bunnicula episode \"Jurassicnula\" where the titular vampire bunny briefly transforms into a menacing-looking Archaeopteryx.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/GoofyFeatheredDinosaur", "media_links": ["/pmwiki/pmwiki.php/Film/JurassicPark", "/pmwiki/pmwiki.php/WesternAnimation/TheGoodDinosaur", "/pmwiki/pmwiki.php/WesternAnimation/TheLandBeforeTime", "/pmwiki/pmwiki.php/WesternAnimation/IceAge5CollisionCourse", "/pmwiki/pmwiki.php/WesternAnimation/IceAge3DawnOfTheDinosaurs", "/pmwiki/pmwiki.php/WesternAnimation/IceAge3DawnOfTheDinosaurs", "/pmwiki/pmwiki.php/Anime/YouAreUmasou", "/pmwiki/pmwiki.php/Franchise/JurassicPark", "/pmwiki/pmwiki.php/Film/JurassicParkIII", "/pmwiki/pmwiki.php/Film/JurassicWorld", "/pmwiki/pmwiki.php/Film/JurassicWorldFallenKingdom", "/pmwiki/pmwiki.php/TabletopGame/MagicTheGathering", "/pmwiki/pmwiki.php/VideoGame/ClubPenguin", "/pmwiki/pmwiki.php/VideoGame/ArkSurvivalEvolved", "/pmwiki/pmwiki.php/Webcomic/ManlyGuysDoingManlyThings", "/pmwiki/pmwiki.php/Webcomic/Xkcd", "/pmwiki/pmwiki.php/Webcomic/GirlGenius", "/pmwiki/pmwiki.php/Webcomic/DumbingOfAge", "/pmwiki/pmwiki.php/Webcomic/SandraAndWoo", "/pmwiki/pmwiki.php/Webcomic/SchlockMercenary", "/pmwiki/pmwiki.php/WesternAnimation/HowDinosaursLearnedToFly", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/Creator/StevenSpielberg", "/pmwiki/pmwiki.php/WesternAnimation/Gigantosaurus", "/pmwiki/pmwiki.php/WesternAnimation/Bunnicula"], "non_media_links": ["/pmwiki/pmwiki.php/WebAnimation/ZeroPunctuation", "/pmwiki/pmwiki.php/Main/PrehistoricMonster", "/pmwiki/pmwiki.php/Main/ScienceMarchesOn", "/pmwiki/pmwiki.php/Main/ArtisticLicensePaleontology", "/pmwiki/pmwiki.php/Main/AmazingTechnicolorWildlife", "/pmwiki/pmwiki.php/Main/TyrannosaurusRex", "/pmwiki/pmwiki.php/Main/LightningBruiser", "/pmwiki/pmwiki.php/Main/RaptorAttack", "/pmwiki/pmwiki.php/Main/ArtisticLicensePaleontology", "/pmwiki/pmwiki.php/Main/FeatheredFiend", "/pmwiki/pmwiki.php/Main/FeatheredDragons", "/pmwiki/pmwiki.php/Main/AnimeAndManga", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/PluckyComicRelief", "/pmwiki/pmwiki.php/Main/BlackComedy", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/FeatheredFiend", "/pmwiki/pmwiki.php/Main/NewspaperComics", "/pmwiki/pmwiki.php/ComicStrip/PoochCafe", "/pmwiki/pmwiki.php/Main/PrintMedia", "/pmwiki/pmwiki.php/Magazine/MuseMagazine", "/pmwiki/pmwiki.php/Main/CluckingFunny", "/pmwiki/pmwiki.php/Main/TabletopGames", "/pmwiki/pmwiki.php/Main/Mayincatec", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/FeatheredFiend", "/pmwiki/pmwiki.php/Main/TheDreaded", "/pmwiki/pmwiki.php/Main/WebOriginal", "/pmwiki/pmwiki.php/WebAnimation/MightyMagiswords", "/pmwiki/pmwiki.php/WebVideo/TREYTheExplainer", "/pmwiki/pmwiki.php/WebVideo/TwoBestFriendsPlay", "/pmwiki/pmwiki.php/Main/SeinfeldianConversation", "/pmwiki/pmwiki.php/Main/Webcomics", "http://thepunchlineismachismo.com/archives/comic/clearly-they-ride-minibikes-and-wear-tiny-tuxedos", "http://www.girlgeniusonline.com/comic.php?date=20181031", "http://www.sandraandwoo.com/2013/02/28/0459-velociraptor/", "/pmwiki/pmwiki.php/Main/WesternAnimation"]}