{"title": "House Inspection", "content": "Inspectors are going to visit and rate your house; either because you're taking part in a contest, or they're from a magazine and want to have photos and a description of your flat in their periodical.\n\nYou are prepared as well as possible. All messes are tidied up, the year-old potato chips from the couch are thrown away, an interior decorator is deciding on best ways to redecorate your house, and you hang nice pictures on walls.\n\nThen disaster strikes. Maybe the decorator turned your house into a nightmare. Maybe a freak kitchen accident flooded it with melted cheese and popcorn. Maybe an earthquake messed everything up. Whatever the cause, your house is now terrible.\n\nThen - Ding dong! The inspectors come this very moment.\n\nThere are about three different ways this scenario can play out:\n• The inspectors are disgusted with the look of the flat, and you lose.\n• The inspection team absolutely love the look of the house, since it is so fresh, original and artistic (since modern art is weird).\n• The person at the door isn't actually the inspector, but you tend to indulge him as if he were.\n• The fake inspector may not catch on to the situation until the real McCoy arrives; if he does catch on, you may expect him to play out one of the other scenarios as a prank.\n\nThe business variant is The Inspector Is Coming.\n• Applejack and the Honest-to-Goodness Switcheroo has Blue Ribbon to inspect Sweet Apple Acres for the Best of Equestria awards by Friday. Applejack tries her best to get the farm looking perfectly by then, her friends and family not being much help. In the end, Blue Ribbon appeared unimpressed by the results. But, as it turns out, Blue Ribbon had been secretly stopping by the orchard all week, watching them work. He was so inspired by their work that he just had to give them the prize, which Applejack couldn't even believe she won in the end.\n• In Fawlty Towers, Basil hears that three Hotel Inspectors are in town, and immediately begins fawning on a guest with an officious manner and a vast professional experience of hotels. He then finds out that his target sells spoons. When another guest mentions he has two colleagues, Basil switches to fawning over him and even resorts to attempting bribery for a favourable report after he witnesses Basil's fight with the first guest. This one is in town for the regatta, though, at which Basil brightens up considerably, and disappears. He appears minutes later to thoroughly humiliate the first guest (who's leaving in disgust), in full view of the real inspectors who have just arrived.\n• In the House episode \"Painless\" Cuddy is very worried about a Child Services inspection which she needs to pass in order to keep her adopted daughter. Naturally, when the inspector arrives, the house is a complete mess due to her cleaning lady arriving late and the inspector arriving an hour early. The inspector finds a messy house, a dirty diaper hastily hidden in an attaché case and ants on the floor...and passes Cuddy anyway due to her having a steady income, being apparently loving and actually worried about her messy house, all of which makes her better than most of the applicants he visits.\n• In Buffy the Vampire Slayer Buffy finds herself entirely unprepared for a home inspection by a social worker come to check on whether it's appropriate for Dawn. She encounters a mess, Spike, who does his best but doesn't exactly come across as wholesome, and Willow with a bag of \"magic herbs\" (actual magical herbs). To make it worse, Buffy knew the inspector was coming ahead of time, but failed to realize what day it was (Buffy's life is hectic, but it's hard to explain in any meaningful way to the inspector.)\n• Used for just a quick gag on Home Improvement, as the inspector was supposed to go to their neighbor Wilson's but got the wrong house. He still showed up right when the Taylors had a dead rat in one of their walls. \"Hi, I'm the home inspector from the bank [catches the smell of the rat for a beat] ...and right now, I'm thinking low.\"\n• Animal Crossing has the HRA, who are never seen actually rating your house, but leave you a message in the mail with your score. City Folk has an actual building for them, where you can get a more detailed score plus a view of a house/room that can currently get you more points. The trope's commonly used plot point is sometimes lampshaded by the townsfolk.\n• In The Sims 2, getting your child into private school requires undergoing House Inspection by the headmaster. This is one of the more challenging things to do in the game; not only should your house be good-quality and clean, but the kid and all house residents need to be on their best behavior. Being rejected from private school is the most likely outcome.\n• Futurama, \"How Hermes Requisitioned His Groove Back\". Hermes' office is all cleaned up for the inspector from the Central Bureaucracy, but it gets trashed. He attempts suicide, but the inspector talks him out of it by telling him he hasn't done the required paperwork.\n• On an episode of Spongebob Squarepants, Squidward wants to show up his high school rival Squilliam by having his house on a TV show. Naturally, SpongeBob shows up to help and makes a mess of Squidward's home. Then the show host compliments him on his daring sense of style.\n• A similar situation occurs in the first season. Squidward wants to move and to keep SpongeBob out of the way, so he tells him that it's \"Opposite Day\", assuming that will mean that SpongeBob will stay quiet and out of the way. Instead he takes it to mean that he should act like Squidward, and proceeds to do so when the realtor arrives.\n• In Pepper Ann, one of mom's old friends has a TV show calls \"This Gorgeous House\", and wants to feature their home. Of course, mom goes nuts decorating and dressing up the place like a classic farm stead. But when the old friend and her film crew arrive, the friend is saddened and upset. \"I've been covering unrealistic, dolled up houses for years. Just once I wanted to do a show on a REAL, living house with a real family.\"\n• The Backyardigans: In the episode \"What's Bugging You?\", Tasha's house is being inspected by Mr. Spiffy (Pablo) so she can join the Spiffy Club. When she finds out a worman is in her house, she calls Uniqua and Tyrone from Best Pest Control. Unfortunately, everything Uniqua and Tyrone do seem to attract even more wormans. Then Mr.Spiffy arrives, which means that Tasha, Uniqua, and Tyrone not only have to do their jobs quickly, they also have to do it in secret. Thus the \"Fawlty Towers\" Plot.\n• In The Simpsons episode \"Home Sweet Homediddily-Dum-Doodily\", Principal Skinner is convinced that something wrong is going on at the Simpson place after seeing Bart in a burlap sack and Lisa shoeless, covered in mud, and lisping and sends Child Services to look in. They find the house is a mess, stacks of decades-old newspapers, Maggie drinking from the dog's water dish, and Grandpa asleep on the sofa in his own filth. Of course, the whole thing is an insane coincidence, but they still take the kids away and put them with the Flanders.\n• King of the Hill had a similar premise for its pilot episode. A DCS worker catches wind of perceived abuse, as well as a poorly timed injury from Peggy and hearing Bobby exaggerate Hank's blustered threats to someone who had angered him, and sends an investigator out. In an aversion of the Simpsons episode, the investigator find zero evidence of abuse, and the Worker gets chewed out by his boss for jumping to conclusions and taking matters into his own hands, getting shilled off to some far off place he can't embarrass his company any more.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/HouseInspection", "media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/WesternAnimation/MyLittlePonyFriendshipIsMagic", "https://tvtropes.org/pmwiki/pmwiki.php/Series/FawltyTowers", "https://tvtropes.org/pmwiki/pmwiki.php/Series/House", "https://tvtropes.org/pmwiki/pmwiki.php/Series/BuffyTheVampireSlayer", "https://tvtropes.org/pmwiki/pmwiki.php/Series/HomeImprovement", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/AnimalCrossing", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/TheSims2", "https://tvtropes.org/pmwiki/pmwiki.php/WesternAnimation/Futurama", "https://tvtropes.org/pmwiki/pmwiki.php/WesternAnimation/SpongebobSquarepants", "https://tvtropes.org/pmwiki/pmwiki.php/WesternAnimation/PepperAnn", "https://tvtropes.org/pmwiki/pmwiki.php/WesternAnimation/TheBackyardigans", "https://tvtropes.org/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "https://tvtropes.org/pmwiki/pmwiki.php/WesternAnimation/KingOfTheHill"], "non_media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/Main/TrashOfTheTitans", "https://tvtropes.org/pmwiki/pmwiki.php/Main/TrueArtIsIncomprehensible", "https://tvtropes.org/pmwiki/pmwiki.php/Main/MistakenForSpecialGuest", "https://tvtropes.org/pmwiki/pmwiki.php/Main/TheInspectorIsComing", "https://tvtropes.org/pmwiki/pmwiki.php/Main/LiveActionTV", "https://tvtropes.org/pmwiki/pmwiki.php/Main/WakeUpGoToSchoolSaveTheWorld", "https://tvtropes.org/pmwiki/pmwiki.php/Main/TheMasquerade", "https://tvtropes.org/pmwiki/pmwiki.php/Main/VideoGames", "https://tvtropes.org/pmwiki/pmwiki.php/Main/WesternAnimation", "https://tvtropes.org/pmwiki/pmwiki.php/Main/SchoolyardBullyAllGrownUp", "https://tvtropes.org/pmwiki/pmwiki.php/Main/FawltyTowersPlot", "https://tvtropes.org/pmwiki/pmwiki.php/Main/ReassignedToAntarctica"]}