{"title": "Married Animals", "content": "In fiction, sometimes animals are referred to as if they're married, even if their species is non-monogamous by nature note Birds such as swans, geese, eagles, doves, and pigeons, and canids such as foxes, grey foxes, coyotes, and wolves are naturally monogamous.. At times human characters refer to themselves as married for convenience's sake and other times the animals themselves refer to each other as married.\n\nNo actual marriage has to even be shown. It can be an In Name Only title with no legal bearing (if the series even has laws). Animals will very often be considered \"married\" as soon as they become mates.\n\nMarriage between animals is most prevalent in children's works and Beast Fables. Instead of being referred to as mates, animals will be referred to as \"married\". Often times this is shorthanded to by referring to them as \"Mrs. [x]\" and \"Mr. [x]\" (often using a Species Surname) in animal characters hailing from Anglophone countries, \"Sra. [x]\" and \"Sr. [x]\" (often with a Species Surname) in those hailing from Hispanohablante countries, or whatever their given country's language's equivalent is.\n\nThis trope can also explain the works with animal characters that have implications or explications of having out-of-wedlock births.\n\nThis trope can apply to polygynous and polyandrous marriages, but as polygamous marriages are illegal in most Western countries (except for South Africa) and polyandrous marriages are not widely accepted by many human societies, most trope examples are monogamous.\n\nThis trope applies to the Nearly Normal Animal, Speech-Impaired Animal, Talking Animal, and Partially Civilized Animal. It also applies to the somewhat anthropomorphic Civilized Animal. This applies to Funny Animal characters that are treated as the animals they are in the work's verse or are more Beast Fable in nature, but not to those treated as humans in-universe or those that have a Furry Lens on them. This doesn't apply to Beast Men, as they're usually treated on par with humans.\n\nAnimals that live and are treated like humans, such as World of Funny Animals types, don't apply to this trope.\n• Bunya the male cat and Noisy the female cat from the 2016 CGI Chi's Sweet Home, a work with non-anthropomorphic or barely anthropomorphic animal characters, are referred to as married.\n• The first appearances of Rocket Raccoon (his debut in a The Incredible Hulk story and his 1985 mini-series) shows Rocket romantically related to Lylla Otter, treating each other as husband and wife and living together in Halfworld, in which Lylla is also a Damsel in Distress being rescued by Rocket.\n• In All My Kittens, Duchess' owner refers to Duchess' stud mate as a \"husband\".\n• In The Lion King characters are not referred to as \"husband\" or \"wife\", but the concept of marriage still exists. Simba and Nala are mentioned to be betrothed to each other as cubs and the word \"married\" is even used. In real life lions are not monogamous, however all lions in the series seems to be. This leaves Nala's parentage all the more confusing, but allows the series to cleanly subvert Brother\u0096Sister Incest or Kissing Cousins by not having Simba and Nala be related like real lion cubs from the same pride would.\n• The geese twins from The Aristocats get mad at Thomas when they learn that he isn't married to Duchess. It's unclarified if Thomas and Duchess do ever marry, but the film ends with Thomas being adopted by Duchess' owner.\n• One of the main characters in Home on the Range is a Partially Civilized Animal cow named \"Mrs. Calloway\". There's never any mention of a \"Mr. Calloway\" though.\n• In Dumbo, the mother elephant is named Mrs. Jumbo. Although the name suggests she's married to a Mr. Jumbo, he's not mentioned in the film, and her son is brought by a Delivery Stork.\n• At the end of The Princess and the Frog, Mama Odie gets Naveen and Tiana married, pronouncing them \"frog and wife\". Although they are humans in frog form, there are a bunch of Woodland Creatures attending the wedding, implying this is a normal ceremony for them.\n• In 101 Dalmatians Perdita and Pongo get married along with their owners.\n• Lady and the Tramp: Lady's friends, Jack and Trusty, offer to marry her in case her owners kick her out.\n• The widow protagonist of Mrs. Frisby and the Rats of NIMH Mrs. Frisby (renamed \"Mrs. Brisby\" in the animated film) actually has no known given name. She is either known as \"Mrs. Frisby\" or \"Mrs. Jonathan Frisby\". Most of the animals in the series are Partially Civilized Animals living in a Mouse World.\n• In the Dick King-Smith story \"A Narrow Squeak\", mice Hedley and Ethel have an anniversary coming up. The writer goes on to explain that, because mice's lives are so uncertain, they celebrate anniversaries in days, not years.\n• InCryptid: Timpani recognizes that two Aeslin mice have mated because they've built themselves a house, and the female appears to be pregnant. She refers to their relationship as a mouse honeymoon.\n• The mother of the winged cats in Catwings is called \"Mrs. Jane Tabby\".\n• The children's book Dear Hound is about a Deerhound puppy who gets lost in the woods. He is helped by a pair of foxes, Sunset and her husband Fixit.\n• In the Cat Pack series, Timothy the mouse mentions that he has a wife.\n• In Tailchaser's Song, cats refer to being in committed relationship similarly to a marriage as a \"Joining\". Joinings are rare amongst cats as most are noncommittal. Prior to Joining, cats do a special dance called the Dance of Acceptance.\n• In The Cold Moons, badgers are referred to both as mates and spouses. It's even mentioned that they have a wedding-like ceremony.\n• My Little Pony: G1 is somewhere on the sliding scale between Partially Civilized Animal and Civilized Animal, depending on the year. An early figurine depicts Moondancer and a male Glory as married. A later set features families consisting of two parents and their foal.\n• In Cattails, the player cat can propose to and marry another cat by bringing a ring to them.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/MarriedAnimals", "media_links": ["/pmwiki/pmwiki.php/Manga/ChisSweetHome", "/pmwiki/pmwiki.php/ComicBook/RocketRaccoonClassic", "/pmwiki/pmwiki.php/ComicBook/TheIncredibleHulk", "/pmwiki/pmwiki.php/Disney/TheLionKing", "/pmwiki/pmwiki.php/Disney/TheAristocats", "/pmwiki/pmwiki.php/Disney/HomeOnTheRange", "/pmwiki/pmwiki.php/Disney/Dumbo", "/pmwiki/pmwiki.php/Disney/ThePrincessAndTheFrog", "/pmwiki/pmwiki.php/Disney/OneHundredAndOneDalmatians", "/pmwiki/pmwiki.php/Disney/LadyAndTheTramp", "/pmwiki/pmwiki.php/Literature/MrsFrisbyAndTheRatsOfNIMH", "/pmwiki/pmwiki.php/WesternAnimation/TheSecretOfNIMH", "/pmwiki/pmwiki.php/Creator/DickKingSmith", "/pmwiki/pmwiki.php/Literature/InCryptid", "/pmwiki/pmwiki.php/Literature/CatPack", "/pmwiki/pmwiki.php/Literature/TailchasersSong", "/pmwiki/pmwiki.php/Literature/TheColdMoons", "/pmwiki/pmwiki.php/Franchise/MyLittlePony", "/pmwiki/pmwiki.php/VideoGame/Cattails"], "non_media_links": ["/pmwiki/pmwiki.php/Main/MetaphoricalMarriage", "/pmwiki/pmwiki.php/Main/CommonLawMarriage", "/pmwiki/pmwiki.php/Main/InNameOnly", "/pmwiki/pmwiki.php/Main/BeastFable", "/pmwiki/pmwiki.php/Main/SpeciesSurname", "/pmwiki/pmwiki.php/Main/SpeciesSurname", "/pmwiki/pmwiki.php/Main/MostWritersAreHuman", "/pmwiki/pmwiki.php/Main/NearlyNormalAnimal", "/pmwiki/pmwiki.php/Main/SpeechImpairedAnimal", "/pmwiki/pmwiki.php/Main/TalkingAnimal", "/pmwiki/pmwiki.php/Main/PartiallyCivilizedAnimal", "/pmwiki/pmwiki.php/Main/CivilizedAnimal", "/pmwiki/pmwiki.php/Main/FunnyAnimal", "/pmwiki/pmwiki.php/Main/BeastFable", "/pmwiki/pmwiki.php/Main/FurryLens", "/pmwiki/pmwiki.php/Main/BeastMan", "/pmwiki/pmwiki.php/Main/WorldOfFunnyAnimals", "/pmwiki/pmwiki.php/Main/Anime", "/pmwiki/pmwiki.php/Main/Manga", "/pmwiki/pmwiki.php/Main/ComicBooks", "/pmwiki/pmwiki.php/Main/DamselInDistress", "/pmwiki/pmwiki.php/Main/FanWorks", "/pmwiki/pmwiki.php/Fanfic/AllMyKittens", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/ArrangedMarriage", "/pmwiki/pmwiki.php/Main/DisappearedDad", "/pmwiki/pmwiki.php/Main/BrotherSisterIncest", "/pmwiki/pmwiki.php/Main/KissingCousins", "/pmwiki/pmwiki.php/Main/FromStrayToPet", "/pmwiki/pmwiki.php/Main/PartiallyCivilizedAnimal", "/pmwiki/pmwiki.php/Main/DeliveryStork", "/pmwiki/pmwiki.php/Main/BewitchedAmphibians", "/pmwiki/pmwiki.php/Main/WoodlandCreatures", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/AdaptationNameChange", "/pmwiki/pmwiki.php/Main/NoNameGiven", "/pmwiki/pmwiki.php/Main/PartiallyCivilizedAnimal", "/pmwiki/pmwiki.php/Main/MouseWorld", "/pmwiki/pmwiki.php/Main/Toys", "/pmwiki/pmwiki.php/Main/PartiallyCivilizedAnimal", "/pmwiki/pmwiki.php/Main/CivilizedAnimal", "/pmwiki/pmwiki.php/Main/Genderflip", "/pmwiki/pmwiki.php/Main/VideoGames"]}