{"title": "Bad to the Bone", "content": "You're watching a movie and abruptly you hear a familiar song. From the cue you know that shit is going to go down and it is going to go down hard. This trope is humbly dedicated to any song that has been used in so many movies that playing it in a new movie tells the audience exactly what's going to happen in the scene (and often draws groans of \"Not that one again!\").\n\nSimilar in spirit to Ominous Latin Chanting or Standard Snippet, but using modern songs. Compare Suspiciously Apropos Music.\n\nNot to be confused with Bad with the Bone.\n• The Trope Namer is George Thorogood's \"Bad to the Bone\" , a traditional badass blues-rock song commonly used to underscore a \"cool\" outlaw character. The best-known instance of this is as the Terminator emerges Hell-Bent for Leather in Terminator 2: Judgment Day.\n• A movie reviewer for Entertainment Weekly once quipped in his review of 3000 Miles to Graceland (which, yes, once again has \"Bad to the Bone\" on its soundtrack, while boasting a conspicuous paucity of Elvis) that Thorogood must be fabulously rich from the royalties from that song alone.\n• \"Bad to the Bone\" is used amusingly in Married... with Children, whenever Al's about to do something badass. For example, eating a bunch of burritos in order to do horrible things to Peg's decorated bathroom.\n• You mean, Al heroically reclaiming his beloved bathroom after Peggy took it away from him.\n• Preparing himself for the Labor Day backyard grilling.\n• Preparing to fight a medieval knight in his Polk High football uniform.\n• It's also more or less Junior's leitmotif in Problem Child.\n• Used at the beginning of Major Payne. Take a guess at what the titular Major's personality is like.\n• It was also used at the very top of the film version of Christine. It's the only non-'50s song on the soundtrack record.\n• Occurs in the remake of The Parent Trap, when one of the girls challenges the other at cards.\n• Ironically, not used in the Made-for-TV Movie Bad to the Bone, which is actually a straight crime drama and whose Villain Protagonist is not likable in any way (OK, maybe one way...).\n• Rare literary example — Cold Days mentions it twice — once, the First-Person Smartass narrator imagines it playing, then later on his apprentice hums the opening bars.\n• Briefly used in Yu-Gi-Oh! The Abridged Series when Tristan shows up on a motorbike—because in the future, card games will be played on motorbikes.\n• The great irony of all this is that \"Bad to the Bone\" has become so cliched as a leitmotif that it's now very hard to consider it all that \"bad\"...\n• ...which may be why Michael Jackson's \"Bad\" is starting to replace it as the \"badass\" theme tune on YouTube videos.\n• Many AC/DC songs are used for this.\n• \"Back in Black\" , as seen in most action movies. Bonus points if it is at the beginning of the movie. Or in the first episode of a TV show.\n• \"Shoot to Thrill\" has become Iron Man's signature arrival song.\n• Battleship uses \"Thunderstruck\" during Let's Get Dangerous! scene.\n• \"TNT \" and \"Dirty Deeds Done Dirt Cheap \" also show up here and there.\n• \"Welcome to the Jungle\" by Guns N' Roses has a slow but distinctive buildup to an epic opening. Expect a cool entrance.\n• Cinematic use of the song made its first appearance in Lean on Me (in 1988, just one year after its original release) in the opening sequence, to show how Eastside High School has gone to hell.\n• It was used for the climax fight of Megamind.\n• Also appeared in one of the trailers for Grand Theft Auto: San Andreas.\n• Spoofed in The Simpsons episode \"Marge on the Lam\" in which Marge and her feminist neighbor go on a rebellious spree down the highway in a stolen Ford Thunderbird (obvious Thelma & Louise parody) and the neighbor goes to put in a tape of this song but mistakenly puts on Lesley Gore's \"Sunshine, Lollipops & Rainbows\" instead. (Made doubly funny later on when Chief Wiggum and Homer make the same mistake, but end up enjoying the Lesley Gore song.)\n• An '80s Hair Metal tune of some sort is popular whenever a Hello, Nurse! character shows up, and almost obligatory if she's a performer in a strip club. \"Rock You Like a Hurricane\" by Scorpions, Def Leppard's \"Pour Some Sugar On Me\" and \"Here I Go Again\" by Whitesnake seem to be common. Warrant's \"Cherry Pie\" is often used instead if it's a rural setting.\n• \"Bodies\" by Drowning Pool, with its chorus of \"Let the bodies hit the floor!\", often crops up when a scene is about to get violent. WWE's ECW on SciFi had this as their theme song for an entire year, until the untimely deaths of Chris Benoit and his wife and son forced them to switch to something that didn't feature the word \"bodies\" on it.\n• \"Down with the Sickness\" by Disturbed is also popular as fight music (South Park did it). Amusingly subverted in Dawn of the Dead (2004), which uses a lounge cover by Richard Cheese... and then double subverted in The Stinger , which uses the original version as the survivors get overrun by zombies .\n• \"Welcome Home\" by Coheed and Cambria. When that theme starts playing, watch out.\n• \"Breaking the Law\" by Judas Priest, which Beavis And Butthead love to sing after doing outlandish things.\n• Otto plays it while releasing the boy students from the school bus in the \"Girls Just Want to Have Sums\" episode of The Simpsons.\n• \"Cobrastyle\" by Teddybears is used in a lot of movies with a suave protagonist, and also in Chuck.\n• \"Eye of the Tiger\" by Survivor is used is many, many fight sequences and Training Montages. Considering it comes from Rocky III, not surprising.\n• Joe Cocker and The Who will surely live out their days comfortably on the royalties from \"Feelin' Alright\" and \"Won't Get Fooled Again\" on Every. Single. Movie. Trailer.\n• \"Fortunate Son\" by Creedence Clearwater Revival from Willy and the Poor Boys in any Vietnam movie or game.\n• Hell, it even showed up in the Vietnam segment of Forrest Gump.\n• Pretty much all their well-known songs are associated with that the era or the war specifically. If you hear CCR in a movie, it's probably 'Nam.\n• Ironically, \"The Midnight Special,\" another famous song associated with CCR, was first recorded in the 1930s.\n• Similarly, \"All Along the Watchtower\" from Jimi Hendrix' Electric Ladyland will probably both be in any given 'Nam movie.\n• Buffalo Springfield's \"For What It's Worth\" usually plays as background to protests, but the intro to Lord of War made good use of the lyrics.\n• Jacques Offenbach's \"Gallope\" from Orpheus in the Underworld (more commonly known as the can can music) being used for comedy movies when the wacky hijinks start getting out of control. Think overflowing washing machine, tangled electrical wires and stray parrots.\n• The Rolling Stones have many songs ripe for this. Martin Scorsese in particular likes using \"Gimme Shelter\".\n• \"19th Nervous Breakdown\" has shown up in way too many comedy trailers...\n• Filter's \"Hey Man Nice Shot\" in movie trailers. See, for instance, the first Iron Man trailer... Likewise, \"Hell Above Water\" by Curve, which was used in Iron Man, Spider-Man and about a bazillion other trailers.\n• \"I Got You (I Feel Good)\" by James Brown is used in many scenes with really happy people. It also appeared in a lot of comedy trailers, which was parodied in a Saturday Night Live skit where people suffer through an onslaught of previews, and all of the ones for comedies use this song.\n• Village People songs and \"I Will Survive\" will show up in every comedy involving homosexuals. Also \"Relax\" by Frankie Goes to Hollywood. And \"Gonna Make You Sweat\" by C+C Music Factory.\n• \"Iron Man\" by Black Sabbath is also used by badasses (including the Marvel Comics hero, of course). Irony moment: the original song's lyrics were written by Geezer Butler specifically to avoid being sued by Marvel; as a result the song is about a time-traveler who attempts to save mankind but ends up destroying it. Which are not necessarily motives and superpowers associated with Tony Stark.\n• \"I Won't Back Down\", by Tom Petty, means that our hero, believe it or not, isn't going to back down.\n• \"Let's Get it On\" by Marvin Gaye. The title explains it all. Helps that it has a distinctive opening wah-wah guitar lick that sounds a bit porn-ish.\n• \"Magic Moments\" by Perry Como, specifically the whistling at the beginning.\n• Dick Dale's version of \"Miserlou\" from Surfers Choice, especially after Pulp Fiction.\n• \"Psycho Killer\" from Talking Heads: 77 by Talking Heads, for any tongue-in-cheek movie about a serial killer. Also, \"Take Me To The River\", \"Once In A Lifetime\", and \"Burning Down The House\"\n• \"Right Here, Right Now\" By Fatboy Slim has also been used in actions movies for Awesome Moments.\n• Gary Glitter's \"Rock And Roll Part Two\" (the one with the instantly recognizable \"shouting-groan\" chorus) is ridiculously common in sports movies. It's somewhat justified by the fact that both marching bands and loudspeakers often do play that song at games, but in the movies the song will just as likely be heard during moments when the crowd is supposed to be remaining silent. Humorously, it's even used in Happy Gilmore for golf, hardly a macho sport.\n• Seth MacFarlane deliberately chose Del Amitri's \"Roll to Me\" for a spoof Romantic Comedy trailer in an episode of Family Guy, because he believes that song is always used in rom com trailers. He's at least 85% right.\n• Alice Cooper's \"School's Out\" is the go-to song whenever schoolkid characters go wild.\n• To the extent that Richard Linklater was a little hesitant to use it for the final bell scene in Dazed and Confused because it seemed way too obvious (he did anyway).\n• \"Spirit in the Sky\" by Norman Greenbaum for movies about astronauts and space travel.\n• Thin Lizzy's \"The Boys Are Back In Town\" for, well, scenes in which there are some boys, and they are back. In a town. Was also used as a pun in early trailers of Toy Story: \"The toys are back in town.\"\n• Expect cool stuff to happen when \"The Name of the Game\" by Crystal Method starts playing.\n• Snap's \"The Power\" used for characters using a superpower in a generally non-serious way.\n• Natasha Bedingfield's \"Unwritten\" is another, being played for pretty much any product marketed to women for pretty much all of 2007.\n• \"Walking On Sunshine\" by Katrina and the Waves was used in pretty much every trailer for family comedies in the 1990s and 00s. It's also a popular choice for a Good-Times Montage.\n• \"We Are the Champions\" from News of the World by Queen, used to herald in really dramatic moments. Also, sports victories.\n• \"We Will Rock You\", the companion song to \"Champions\", for sports-related badassery.\n• \"Another One Bites the Dust\". Suits the determinator, a suiting-up scene, or displays of badassery. Used in Small Soldiers.\n• The entire soundtrack of Highlander and Flash Gordon (1980).\n• \"Somebody To Love\" is also pretty popular for when a romantic song is needed.\n• Twisted Sister's \"We're Not Gonna Take It\" has become semi-obligatory for acts of rebellion (usually of the juvenile variety). At least justified in Rock of Ages, where the \"good guys\" are all diehard fans of '80s pop/rock music.\n• Kid Rock's \"Bawitdaba\" for less sympathetic and nastier acts of rebellion, or just general proletarian violence.\n• \"White Rabbit\" by Jefferson Airplane whenever someone is under the influence of a mind-altering substance and/or hallucinating. Alternatives include \"Incense and Peppermints\" by Strawberry Alarm Clock and \"In-A-Gadda-Da-Vida\" by Iron Butterfly from In-A-Gadda-Da-Vida.\n• \"Who Let The Dogs Out\" by the Baha Men will be used in any children's movie featuring talking dogs, and it will be used in a scene where the aforementioned canines escape from a pet pound/locked room/generally do something cool that involves knocking down something or someone.\n• Gioachino Rossini's \"Wilhelm Tell Overture\" is always the sign of someone being extremely busy, or just moving comically fast. Used for ironic effect for a sex scene in Stanley Kubrick's A Clockwork Orange.\n• Similarly, Beethoven's \"Ode to Joy\", which is used multiple times in A Clockwork Orange, has become fashionable as Awesome Music for epic action scenes.\n• \"Wipe Out\" by The Surfaris is pretty popular for chase scenes.\n• The Benny Hill Show's \"Yakety Sax\" as well, with an added comedic effect. Bonus points if the film is sped up during the duration of the song.\n• The Monkees' \"Pleasant Valley Sunday \" gets used in this way a lot, too, as lampshaded by The Cinema Snob.\n• Der Schuh des Manitu gives us \"Straight to Hell\" as the Big Bad's theme. You know what's going to happen.\n• If shit goes down in Slow Motion, there's always \"Chariots of Fire\" Vangelis. Or his theme from 1492: Conquest of Paradise.\n• If shit goes down and there's a large army or Big Damn Heroes moment involved, you might hear Europe's \"The Final Countdown\" if the work in question is a comedy or IN SPACE!\n• \"Get Ready for This\", by 2 Unlimited, is used for just about every competition or comedy trailer.\n• Technotronic's \"Pump Up the Jam\" for either preparation or party sequences.\n• \"La Grange\" by ZZ Top is used in pretty much any bar fight scene.\n• And \"Sharp Dressed Man,\" whenever a male character gets dressed up sharply (or, if its a comedy, not so sharply).\n• Married... with Children, when Al has to get glasses.\n• \"Tom Sawyer\" by Rush. Lampshaded in the Futurama episode \"Anthology of Interest 2\" when Fry mentions his \"all-Rush mixtape.\"\n• Is something big about to blow up? (Usually with multiple explosions?) Then the music absolutely must be the finale of \"The 1812 Overture\". It helps that cannon fire is part of the composition.\n• You can always count on Louis Armstrong's \"What A Wonderful World\" for a bitterly ironic counterpoint to horrific destruction.\n• \"Dueling Banjos\" will often play to imply hillbillies or male rape, a Shout-Out to Deliverance (If you're a Genre Savvy character in a film or show and you start hearing those banjos, it's time to start worrying.) Though it's also used in a more lighthearted tone when there's a tit-for-tat contest between two characters. The most appropriate use may have been the drywall taping contest between Tim and Al on Home Improvement, in which they used dispensers actually known as \"banjos\".\n• Steppenwolf's \"Born To Be Wild\" is often used to show the seemingly-sweet character (usually female) has a rougher, edgier side that only comes out during a moment of crisis, or any time characters drive off in a vehicle to go save the day. Herbie, Fully Loaded comes to mind.\n• Also, any Badass Biker (due to Easy Rider).\n• This is parodied in The Simpsons, where \"Born to be Wild\" plays as Grandpa (along with Bart) takes Homer's car to go to Vegas only to shut it off the radio.\n• Married... with Children, when Al and Steve buy the classic Mustang.\n• \"Going Up the Country\" by Canned Heat is pretty common for road trips (particularly if there are any New Age Retro Hippies on board).\n• When a character in a comedy (usually male) swaggers down the street, you might hear The Bee Gees' \"Stayin' Alive\" (a tribute to John Travolta's similar scene in Saturday Night Fever).\n• \"Hot Blooded\" by Foreigner is always good for male characters with a womanizing streak.\n• The Nostalgia Critic has for moments like this \"The T-Rex Song\" (warning: innapropriate language), originally made for the one in Jurassic Park.\n• Richard Strauss' Also sprach Zarathustra can signify a great breakthrough or discovery, as it did most famously in 2001: A Space Odyssey in the monolith scenes.\n• Strauss' \"Blue Danube Waltz\", also used in 2001: A Space Odyssey during the intricate docking scene, is used to signify a smooth, graceful clockwork motion or choreography.\n• Richard Wagner's \"Flight of the Valkyries\" is almost certain to signify imminent badassery, often from above — as in the Apocalypse Now surfing beach helicopter scene.\n• \"Saber Dance\" by Aram Khachaturian is a popular shenanigans song, and thanks to Pee-wee's Big Adventure, is almost synonymous with the phrase \"Breakfast machine\", though it often extends to any other kind of Rube Goldberg Device as well.\n• \"In the Hall of the Mountain King\" by Edvard Grieg is similarly loved, mostly for its slow-build up to an absolutely bombastic finish.\n• The Heavy's popularity is practically built on this trope. They see near-zero airplay for their music, and their album sales are dismal. Yet, they're all over advertisements, movie credits, and video game soundtracks. The two particular songs that see the most use are \"How You Like Me Now?\" and \"Short Change Hero.\" To list them all would take up the whole page, but just look here to give you an idea.\n• In a similar case to The Heavy, the song \"High\" by Young Rising Sons has been used in countless commercials (for Hulu, Pepsi, a special Snapchat story, the list goes on and on) that have a fun and carefree nature, and is getting close to 1 million views on YouTube, yet has received pretty much zero-to-none airplay on radio.\n• Taylor Swift's \"Bad Blood\" has become one for when relationships turn sour, with the audience often getting to see the exact moment it turns into a vendetta before the music rolls.\n• When a comedy demands a romantic scene, expect Frankie Valli's\u007f\"Can't Take My Eyes Off You\" to commence, often through a cover by the protagonist (usually male) to confess his love.\n• Toby Fox's \"Megalovania\" is one of his most renowned piece. If you hear it play during a boss battle, know that you are going to have a very bad time.\n• Kill Bill introduced Western audiences to Japanese musician Tohei's \"Battle Without Honor or Humanity \" as O-Ren Ishii and the Crazy 88 do a slow-motion strut into the House of the Blue Leaves before the climactic showdown at the end of Volume I. Ever since, the song has been used to indicate that the Badass Bad Guys have arrived, or to underscore how utterly un-badass a character appears.\n• The Zombies' \"Time of the Season\" for any late-60s flashback.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/BadToTheBone", "media_links": ["/pmwiki/pmwiki.php/Franchise/Terminator", "/pmwiki/pmwiki.php/Film/Terminator2JudgmentDay", "/pmwiki/pmwiki.php/Film/ThreeThousandMilesToGraceland", "/pmwiki/pmwiki.php/Music/ElvisPresley", "/pmwiki/pmwiki.php/Series/MarriedWithChildren", "/pmwiki/pmwiki.php/Film/ProblemChild", "/pmwiki/pmwiki.php/Film/MajorPayne", "/pmwiki/pmwiki.php/Film/Christine", "/pmwiki/pmwiki.php/WesternAnimation/Megamind", "/pmwiki/pmwiki.php/Film/TheParentTrap1998", "/pmwiki/pmwiki.php/Literature/TheDresdenFiles", "/pmwiki/pmwiki.php/Anime/YuGiOh5Ds", "/pmwiki/pmwiki.php/Music/MichaelJackson", "/pmwiki/pmwiki.php/Music/Bad", "/pmwiki/pmwiki.php/Music/ACDC", "/pmwiki/pmwiki.php/Film/IronMan", "/pmwiki/pmwiki.php/Series/Supernatural", "/pmwiki/pmwiki.php/Film/Battleship", "/pmwiki/pmwiki.php/Music/GunsNRoses", "/pmwiki/pmwiki.php/Film/LeanOnMe", "/pmwiki/pmwiki.php/WesternAnimation/Megamind", "/pmwiki/pmwiki.php/VideoGame/GrandTheftAutoSanAndreas", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/Film/ThelmaAndLouise", "/pmwiki/pmwiki.php/Music/Scorpions", "/pmwiki/pmwiki.php/Music/DefLeppard", "/pmwiki/pmwiki.php/Music/Whitesnake", "/pmwiki/pmwiki.php/Music/DrowningPool", "/pmwiki/pmwiki.php/Music/Disturbed", "/pmwiki/pmwiki.php/WesternAnimation/SouthPark", "/pmwiki/pmwiki.php/Film/DawnOfTheDead2004", "/pmwiki/pmwiki.php/Music/RichardCheese", "/pmwiki/pmwiki.php/Music/CoheedAndCambria", "/pmwiki/pmwiki.php/Music/JudasPriest", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/Series/Chuck", "/pmwiki/pmwiki.php/Music/Survivor", "/pmwiki/pmwiki.php/Film/RockyIII", "/pmwiki/pmwiki.php/Music/JoeCocker", "/pmwiki/pmwiki.php/Music/TheWho", "/pmwiki/pmwiki.php/Music/CreedenceClearwaterRevival", "/pmwiki/pmwiki.php/Music/WillyAndThePoorBoys", "/pmwiki/pmwiki.php/VideoGame/CallOfDutyBlackOps", "/pmwiki/pmwiki.php/Film/ForrestGump", "/pmwiki/pmwiki.php/Music/JimiHendrix", "/pmwiki/pmwiki.php/Music/ElectricLadyland", "/pmwiki/pmwiki.php/Film/LordOfWar", "/pmwiki/pmwiki.php/Music/JacquesOffenbach", "/pmwiki/pmwiki.php/Music/TheRollingStones", "/pmwiki/pmwiki.php/Creator/MartinScorsese", "/pmwiki/pmwiki.php/Music/LetItBleed", "/pmwiki/pmwiki.php/Music/Filter", "/pmwiki/pmwiki.php/Film/IronMan1", "/pmwiki/pmwiki.php/Music/Curve", "/pmwiki/pmwiki.php/Film/IronMan1", "/pmwiki/pmwiki.php/Film/SpiderMan1", "/pmwiki/pmwiki.php/Music/JamesBrown", "/pmwiki/pmwiki.php/Series/SaturdayNightLive", "/pmwiki/pmwiki.php/Music/VillagePeople", "/pmwiki/pmwiki.php/Music/BlackSabbath", "/pmwiki/pmwiki.php/ComicBook/IronMan", "/pmwiki/pmwiki.php/Music/MarvinGaye", "/pmwiki/pmwiki.php/Music/PerryComo", "/pmwiki/pmwiki.php/Music/DickDale", "/pmwiki/pmwiki.php/Music/SurfersChoice", "/pmwiki/pmwiki.php/Film/PulpFiction", "/pmwiki/pmwiki.php/Music/TalkingHeads77", "/pmwiki/pmwiki.php/Music/TalkingHeads", "/pmwiki/pmwiki.php/Music/FatboySlim", "/pmwiki/pmwiki.php/Film/HappyGilmore", "/pmwiki/pmwiki.php/Creator/SethMacFarlane", "/pmwiki/pmwiki.php/Music/DelAmitri", "/pmwiki/pmwiki.php/WesternAnimation/FamilyGuy", "/pmwiki/pmwiki.php/Music/BeastieBoys", "/pmwiki/pmwiki.php/Music/AliceCooper", "/pmwiki/pmwiki.php/Creator/RichardLinklater", "/pmwiki/pmwiki.php/Film/DazedAndConfused", "/pmwiki/pmwiki.php/Music/LynyrdSkynyrd", "/pmwiki/pmwiki.php/Music/ThinLizzy", "/pmwiki/pmwiki.php/WesternAnimation/ToyStory", "/pmwiki/pmwiki.php/Music/CrystalMethod", "/pmwiki/pmwiki.php/Music/Snap", "/pmwiki/pmwiki.php/Music/NatashaBedingfield", "/pmwiki/pmwiki.php/Music/KatrinaAndTheWaves", "/pmwiki/pmwiki.php/Music/NewsOfTheWorld", "/pmwiki/pmwiki.php/Music/Queen", "/pmwiki/pmwiki.php/Film/SmallSoldiers", "/pmwiki/pmwiki.php/Film/Highlander", "/pmwiki/pmwiki.php/Film/FlashGordon1980", "/pmwiki/pmwiki.php/Music/TwistedSister", "/pmwiki/pmwiki.php/Theatre/RockOfAges", "/pmwiki/pmwiki.php/Music/KidRock", "/pmwiki/pmwiki.php/Music/SurrealisticPillow", "/pmwiki/pmwiki.php/Music/JeffersonAirplane", "/pmwiki/pmwiki.php/Music/StrawberryAlarmClock", "/pmwiki/pmwiki.php/Music/IronButterfly", "/pmwiki/pmwiki.php/Music/InAGaddaDaVida", "/pmwiki/pmwiki.php/Music/GioachinoRossini", "/pmwiki/pmwiki.php/Creator/StanleyKubrick", "/pmwiki/pmwiki.php/Film/AClockworkOrange", "/pmwiki/pmwiki.php/Series/TheBennyHillShow", "/pmwiki/pmwiki.php/Music/TheMonkees", "/pmwiki/pmwiki.php/Film/DerSchuhDesManitu", "/pmwiki/pmwiki.php/Film/FourteenNinetyTwoConquestOfParadise", "/pmwiki/pmwiki.php/Music/Chic", "/pmwiki/pmwiki.php/Music/ZZTop", "/pmwiki/pmwiki.php/Series/MarriedWithChildren", "/pmwiki/pmwiki.php/Music/Rush", "/pmwiki/pmwiki.php/WesternAnimation/Futurama", "/pmwiki/pmwiki.php/Music/LouisArmstrong", "/pmwiki/pmwiki.php/Music/TheRamones", "/pmwiki/pmwiki.php/Film/Deliverance", "/pmwiki/pmwiki.php/Series/HomeImprovement", "/pmwiki/pmwiki.php/Music/Steppenwolf", "/pmwiki/pmwiki.php/Film/EasyRider", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/Series/MarriedWithChildren", "/pmwiki/pmwiki.php/Music/CannedHeat", "/pmwiki/pmwiki.php/Music/TheBeeGees", "/pmwiki/pmwiki.php/Creator/JohnTravolta", "/pmwiki/pmwiki.php/Film/SaturdayNightFever", "/pmwiki/pmwiki.php/Music/Foreigner", "/pmwiki/pmwiki.php/Film/JurassicPark", "/pmwiki/pmwiki.php/Music/AlsoSprachZarathustra", "/pmwiki/pmwiki.php/Film/TwoThousandOneASpaceOdyssey", "/pmwiki/pmwiki.php/Music/RichardWagner", "/pmwiki/pmwiki.php/Film/ApocalypseNow", "/pmwiki/pmwiki.php/Film/PeeWeesBigAdventure", "/pmwiki/pmwiki.php/Music/TheHeavy", "/pmwiki/pmwiki.php/Website/YouTube", "/pmwiki/pmwiki.php/Music/JoanJett", "/pmwiki/pmwiki.php/Music/TaylorSwift", "/pmwiki/pmwiki.php/Music/FrankieValliandtheFourSeasons", "/pmwiki/pmwiki.php/Music/TobyFox", "/pmwiki/pmwiki.php/Film/KillBill", "/pmwiki/pmwiki.php/Music/TheZombies"], "non_media_links": ["/pmwiki/pmwiki.php/Main/PetPeeveTrope", "/pmwiki/pmwiki.php/Main/PetPeeveTrope", "/pmwiki/pmwiki.php/Main/PetPeeveTrope", "/pmwiki/pmwiki.php/Main/OminousLatinChanting", "/pmwiki/pmwiki.php/Main/StandardSnippet", "/pmwiki/pmwiki.php/Main/SuspiciouslyAproposMusic", "/pmwiki/pmwiki.php/Main/BadWithTheBone", "/pmwiki/pmwiki.php/Main/TropeNamers", "https://www.youtube.com/watch?v=OlwRNCnsbUg", "/pmwiki/pmwiki.php/Main/CoolPeopleRebelAgainstAuthority", "/pmwiki/pmwiki.php/Main/HellBentForLeather", "/pmwiki/pmwiki.php/Main/MundaneMadeAwesome", "/pmwiki/pmwiki.php/Main/ItMakesSenseInContext", "https://www.youtube.com/watch?v=t9VpVQ1sMfk", "/pmwiki/pmwiki.php/Main/TheFifties", "/pmwiki/pmwiki.php/Main/AvertedTrope", "/pmwiki/pmwiki.php/Main/AvertedTrope", "/pmwiki/pmwiki.php/Main/MadeForTVMovie", "/pmwiki/pmwiki.php/Main/VillainProtagonist", "/pmwiki/pmwiki.php/Main/EvilIsSexy", "/pmwiki/pmwiki.php/Main/EvilIsSexy", "/pmwiki/pmwiki.php/Main/EvilIsSexy", "/pmwiki/pmwiki.php/Main/FirstPersonSmartass", "/pmwiki/pmwiki.php/Main/TheApprentice", "/pmwiki/pmwiki.php/WebVideo/YuGiOhTheAbridgedSeries", "/pmwiki/pmwiki.php/Main/Badbutt", "https://www.youtube.com/watch?v=pAgnJDJN4VA", "https://www.youtube.com/watch?v=Rw7w2b_FTC8", "https://www.youtube.com/watch?v=8d7OBluielc", "/pmwiki/pmwiki.php/Main/LetsGetDangerous", "https://www.youtube.com/watch?v=kR6pxe8jaMs", "https://www.youtube.com/watch?v=onE43h_TUUY", "https://www.youtube.com/watch?v=kr8-E8may2Y", "/pmwiki/pmwiki.php/Recap/TheSimpsonsS5E6MargeOnTheLam", "/pmwiki/pmwiki.php/Main/TheEighties", "/pmwiki/pmwiki.php/Main/HairMetal", "/pmwiki/pmwiki.php/Main/HelloNurse", "https://www.youtube.com/watch?v=Kw_Lf-JhdSU", "https://www.youtube.com/watch?v=fNo4jGKvDzY", "https://www.youtube.com/watch?v=5JZ9djZa180", "/pmwiki/pmwiki.php/Wrestling/WWE", "/pmwiki/pmwiki.php/Wrestling/ChrisBenoit", "/pmwiki/pmwiki.php/Main/TooSoon", "https://www.youtube.com/watch?v=Fq3QmtV8vT0", "https://www.youtube.com/watch?v=aBOpk33VlSg", "/pmwiki/pmwiki.php/Main/DoubleSubversion", "/pmwiki/pmwiki.php/Main/TheStinger", "/pmwiki/pmwiki.php/Main/KillEmAll", "https://www.youtube.com/watch?v=abJYXY3mPjs", "https://www.youtube.com/watch?v=XPhPbTbjYM0", "/pmwiki/pmwiki.php/Westernanimation/BeavisAndButthead", "https://www.youtube.com/watch?v=mBTSG_Tryhc", "/pmwiki/pmwiki.php/Main/SubvertedTrope", "https://www.youtube.com/watch?v=QEjgPh4SEmU", "/pmwiki/pmwiki.php/Main/TrainingMontage", "/pmwiki/pmwiki.php/Main/PunctuatedForEmphasis", "/pmwiki/pmwiki.php/UsefulNotes/TheVietnamWar", "/pmwiki/pmwiki.php/Main/OlderThanTheyThink", "/pmwiki/pmwiki.php/Main/IsntItIronic", "/pmwiki/pmwiki.php/Main/EpilepticTrees", "/pmwiki/pmwiki.php/Main/ExactlyWhatItSaysOnTheTin", "/pmwiki/pmwiki.php/SugarWiki/MomentOfAwesome", "/pmwiki/pmwiki.php/Main/RomanticComedy", "/pmwiki/pmwiki.php/Main/ExactlyWhatItSaysOnTheTin", "/pmwiki/pmwiki.php/Main/MundaneUtility", "/pmwiki/pmwiki.php/Main/GoodTimesMontage", "/pmwiki/pmwiki.php/Main/SiameseTwinSongs", "/pmwiki/pmwiki.php/Main/Determinator", "/pmwiki/pmwiki.php/Main/CoolPeopleRebelAgainstAuthority", "/pmwiki/pmwiki.php/Main/LowerClassLout", "/pmwiki/pmwiki.php/Main/PoundsAreAnimalPrisons", "/pmwiki/pmwiki.php/SugarWiki/AwesomeMusic", "/pmwiki/pmwiki.php/Main/TheSurfaris", "/pmwiki/pmwiki.php/Main/ChaseScene", "/pmwiki/pmwiki.php/Main/FastForwardGag", "https://www.youtube.com/watch?v=GUYKlQ7UvDQ", "/pmwiki/pmwiki.php/WebVideo/TheCinemaSnob", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/SlowMotion", "/pmwiki/pmwiki.php/Main/BigDamnHeroes", "/pmwiki/pmwiki.php/Main/RecycledInSpace", "/pmwiki/pmwiki.php/Main/ExactlyWhatItSaysOnTheTin", "/pmwiki/pmwiki.php/Main/SubvertedTrope", "/pmwiki/pmwiki.php/Main/StuffBlowingUp", "/pmwiki/pmwiki.php/Main/EverythingIsAnInstrument", "/pmwiki/pmwiki.php/SoundtrackDissonance/WhatAWonderfulWorld", "/pmwiki/pmwiki.php/Main/ShoutOut", "/pmwiki/pmwiki.php/Main/GenreSavvy", "/pmwiki/pmwiki.php/Main/OhCrap", "https://www.youtube.com/watch?v=rMbATaj7Il8", "/pmwiki/pmwiki.php/Main/BadassBiker", "/pmwiki/pmwiki.php/Main/LeftTheBackgroundMusicOn", "/pmwiki/pmwiki.php/Main/NewAgeRetroHippie", "/pmwiki/pmwiki.php/WebVideo/TheNostalgiaCritic", "http://tgwtg.bandcamp.com/track/the-t-rex-song", "/pmwiki/pmwiki.php/Main/ClusterFBomb", "/pmwiki/pmwiki.php/Main/TyrannosaurusRex", "/pmwiki/pmwiki.php/Main/RubeGoldbergDevice", "https://en.wikipedia.org/wiki/The_Heavy_(band)#In_media", "/pmwiki/pmwiki.php/Main/Tsundere", "/pmwiki/pmwiki.php/Main/ThatOneBoss", "https://www.youtube.com/watch?v=DjUi-P4gm6k&ab_channel=ThatOneGuy", "/pmwiki/pmwiki.php/Main/LadyOfWar", "/pmwiki/pmwiki.php/Main/Mooks", "/pmwiki/pmwiki.php/Main/PowerWalk", "/pmwiki/pmwiki.php/Main/EvilIsCool"]}