{"title": "Let's Just See What WOULD Have Happened", "content": "Okay, you're on a Game Show, and you've won a substantial pile of cash and prizes. The host offers you the chance to walk away with your pile of loot, or go for broke and play one question for One Million Dollars. You elect to walk away, and the audience supports you. You're celebrating your cool collection, and the host congratulates you, reminding you that it's all yours to keep...but he wants you to play out the final question anyway, because he has at least two more minutes of show to fill. Unfortunately, this can result in extreme disappointment if you would have won.\n\nAnd how does he justify this? By saying \"Let's just see what would have happened...\"\n\nAlso known as a Proveout. For games that rely on the house's honesty like Deal or No Deal, this is also used to demonstrate that it was in fact possible to win the big prize.\n• Are You Smarter Than a 5th Grader?: Happened in the event of a bailout, especially with the final question (Million-Dollar Question during the FOX era, 10x Bonus Question during the syndicated run).\n• Cash Cab: Averted, in that if the players don't accept the double-or-nothing video bonus question, Ben simply hands over the amount they won and they get out of the cab. Neither they nor the audience have any idea what the question would've been. Since the video screen is controlled by the producers, and Ben is fed the questions through an earpiece, there's good reason to believe that even he doesn't know what it would've been.\n• The Canadian version does sometimes show the question. Quite a few people have been grateful when they find out they wouldn't have gotten the answer at all.\n• Deal or No Deal: Oh, does it ever in some countries, and especially prevalent if they take a commercial break while doing so. Often, they'll inflate the hypothetical offers by 10%, which means that's not what truly would've happened had the contestant played on.\n• Other versions avert this by occasionally inviting a player to forfeit their deal and open their case/box anyway, if the two numbers left on the board are on opposite ends of the spectrum. It's most commonly done in the UK, where it's called a \"Banker's Gamble\".\n• Catch 21: If a contestant quits before busting out.\n• Let's Make a Deal: Quite often, and half the point of the show, really.\n• Pyramid (Dick Clark's versions): Dick would come out and try to give clues; quite often, he gave the perfect clue due to having plenty of time to think about it and hindsight regarding what clues didn't work, leaving the actual celebrity dumbfounded (and, in the case of Vicki Lawrence, visibly pissed). Occasionally, though, even he whiffed (either by the contestant still failing to guess, or the judges buzzing him out).\n• Averted on the Donny Osmond version; 99% of the time, he just ran onstage and screamed \"OH! OH! OH! OH!\" before the audience yelled out whatever the missed box was. And given how difficult some of the boxes were on that version, that may have been on purpose.\n• The Joker's Wild: If a contestant stopped during the bonus game.\n• The Price Is Right: Usually happens following a bailout in Punch-A-Bunch, Pass The Buck, Temptation, It's In The Bag, Step Up, Spelling Bee, and Pay The Rent.\n• Russian Roulette: When a player won $10,000 in the bonus round, but decided not to go for the $100,000. They would pull the handle, step off the Drop Zone, and after finding out what would've happened walks off with Mark down the corridor as the credits roll.\n• Sale of the Century: During the Instant Cash era, if a contestant declined to gamble his entire lead for a 1:3 shot at the jackpot, host Jim Perry would sometimes ask the contestant what box he/she would have picked. It was about 50-50 as to good or not-so-good decisions.\n• (The New) Treasure Hunt (Geoff Edwards' versions): You're gonna quit and take the money? Great, but we're still doing the skit anyway!\n• Since the early 2000s, Wheel of Fortune has had two Mystery Wedges. These can be taken for their cash value of $1,000 (originally $500) per letter, or flipped over. One has a Bankrupt on the other side, while the other has a $10,000 cash prize (originally a compact car). If a contestant opts not to flip over a Mystery Wedge and solves immediately afterward, Pat will often ask the contestant if he or she wants to see what was on the other side. When the wedges were first introduced, he would often flip over the other one if one had already been flipped.\n• ...Until the show began adopting the Show the Folks at Home tactic of revealing the other side of the Mystery Wedge while Pat gives the contestant their options.\n• Early in the show's NBC daytime run (or at least on June 7, 1976), host Chuck Woolery sometimes told a player who had solved the last puzzle but ended up losing to spin the Wheel one last time.\n• Whether or not the player solves the bonus puzzle, Pat will reveal the prize in the envelope. If the player fails to solve the puzzle, it counts as this trope. Sajak has said before that the contestants are perfectly welcome to look away if they want to, though it's not clear if anyone ever has. Also, the audience's reaction is a good clue-in anyway as to whether or not it's something really big.\n• Who Wants to Be a Millionaire?: Turned out to be especially heartbreaking during the Tournament Of Ten, where nearly all of the contestants walked...and nearly all of them would've gotten it right.\n• However, other times it turns out to be a great relief when the contestant finds out that they would've lost a lot of money if they had answered the question. One notable case is Lyn Payne whose gut was strongly leaning towards one answer for the million-dollar question and almost half of the audience agreed with her, but she chose to walk away because she thought it was still too risky...and found out that if she had gone with her gut, she would have lost $475,000.\n• Cricket is another unlikely example, but with Hawkeye technology this happens with close LBW decisions with the simulation showing whether the ball would have hit the stumps or not. Very important, since the LBW laws have a degree of subjectivity.\n• 1 vs. 100: If the player opts for the money over the Mob, both the correct answer and the number of Mob members who would've been eliminated are revealed. Inverted in the Xbox 360 era, as players were only offered Money Or Mob after the answer and eliminations were revealed.\n• In Poker, when one player wins a pot by way of everyone else folding before the final showdown, sometimes one or more players request that the dealer invoke this Trope by dealing out the remainder of the hand anyway. In Poker parlance, this is called \"rabbit hunting\". A variation involves the winner showing some but not all of his cards and letting the opponent's imagination run wild.\n• Bullseye UK had a notoriously cruel variation of this where, if the players failed to win the big prize, Jim Bowen would say \"Let's see what you could've won!\" and they would bring out the speedboat accompanied by a sad remix of the usual victory music.\n• On Survivor, Jeff Probst often fills time at the reunion show by asking how the jury would have voted had so-and-so appeared before them instead in place of one of the final two or three who generally did. This is often lamented by many fans as so much nonsense, since hindsight is 20/20 and things can change once the players get in front of the actual jury.\n• Tipping Point, a game show based entirely around a penny pusher, has a finale where the player must put a Jackpot counter into the machine, whereby they win said jackpot by pushing it back out again. They can answer questions to win counters to do so, but if they run out of questions and counters, they are allowed to gamble what they have earned already (£50 per counter pushed out throughout the course of the show)and buy 3 more counters in an all-or-nothing shot at the jackpot. This trope is invoked when the player opts out of the jackpot and keeps their winnings - they still go for the three counters, but they can't win the jackpot. Usually accompanied by cheering or crying.\n• On the FOX game show Beat Shazam, for the final song to try to guess of the bonus round, the contestants can choose to try to guess it to double their winnings, but risk losing half. If they walk away, they keep what they have, but the song will be played anyway and they'll be made to do this.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/LetsJustSeeWhatWouldHaveHappened", "media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/Series/DealOrNoDeal", "https://tvtropes.org/pmwiki/pmwiki.php/Series/AreYouSmarterThanAFifthGrader", "https://tvtropes.org/pmwiki/pmwiki.php/Series/CashCab", "https://tvtropes.org/pmwiki/pmwiki.php/Series/DealOrNoDeal", "https://tvtropes.org/pmwiki/pmwiki.php/Series/Gambit", "https://tvtropes.org/pmwiki/pmwiki.php/Series/LetsMakeADeal", "https://tvtropes.org/pmwiki/pmwiki.php/Series/Pyramid", "https://tvtropes.org/pmwiki/pmwiki.php/Series/TheJokersWild", "https://tvtropes.org/pmwiki/pmwiki.php/Series/ThePriceIsRight", "https://tvtropes.org/pmwiki/pmwiki.php/Series/RussianRoulette", "https://tvtropes.org/pmwiki/pmwiki.php/Series/SaleOfTheCentury", "https://tvtropes.org/pmwiki/pmwiki.php/Series/TreasureHuntUS", "https://tvtropes.org/pmwiki/pmwiki.php/Series/WheelOfFortune", "https://tvtropes.org/pmwiki/pmwiki.php/Series/WhoWantsToBeAMillionaire", "https://tvtropes.org/pmwiki/pmwiki.php/Series/OneVersusAHundred", "https://tvtropes.org/pmwiki/pmwiki.php/TabletopGame/Poker", "https://tvtropes.org/pmwiki/pmwiki.php/Series/BullseyeUK", "https://tvtropes.org/pmwiki/pmwiki.php/Creator/PeterKay", "https://tvtropes.org/pmwiki/pmwiki.php/Series/Survivor", "https://tvtropes.org/pmwiki/pmwiki.php/Series/BeatShazam"], "non_media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/Main/GameShow", "https://tvtropes.org/pmwiki/pmwiki.php/Main/EpicFail", "https://tvtropes.org/pmwiki/pmwiki.php/Main/Troll", "https://tvtropes.org/pmwiki/pmwiki.php/Main/Whammy", "https://tvtropes.org/pmwiki/pmwiki.php/Main/ShowTheFolksAtHome", "https://www.youtube.com/watch?v=iIzjWsn62hw"]}