{"title": "Hitscan", "content": "In many early video games, the game engine did not have enough computational power to actually keep track of all moving projectiles (like the bullets fired from the player's gun), let alone incorporate realistic physical factors like aerodynamics or gravity. In some games, this was mediated by implementing a limit of One Bullet at a Time. In others, developers implemented Hitscan weapons.\n\nHitscan weapons do not actually fire anything; instead, when the player pulls the trigger, the weapon traces a trajectory in front of the player and instantly affects whatever the line intersects with first. This differs from a projectile weapon, whose bullets are independent data objects with a known position and speed (be it fast or slow) that the game actively tracks and checks against potential collisions. Hitscan can be useful in situations where the projectile is either particularly difficult to track or is moving so fast over a short enough distance that an instantaneous straight line is a practically exact approximation of the projectile's actual path. It is, in essence, a beam/laser \"attack\" disguised as a projectile one.\n\nIt should be noted that hitscans can overlap with projectile tracking: In some cases, the actual attack is hitscan, but the game will still animate a fake projectile moving from point A to B. This allows Every Bullet Is a Tracer to play together with hitscan weapons. This can become particularly obvious if the tracer is too slow or the game supports Bullet Time, as you can see enemies react before the \"bullet\" strikes them.\n\nIn older shooters this was used for any bullet-based weapon, on the assumption that bullets moved too fast to evade or dodge anyway, and are smaller than most projectiles (thus hard to see, unless Every Bullet Is a Tracer) and also to balance them against more powerful projectile-based weapons, which were trickier to aim. For example, in Doom, the pistol, shotguns and chaingun were hitscan, while the plasma rifle and rocket launcher fired projectiles. The BFG fired both projectiles as well as a form of delayed hitscan tracers. Hitscan enemies are often Goddamn Bats, since the player is more or less incapable of dodging their attacks.\n\nNote that lacking or averting this trope does not necessarily mean that bullet projectiles behave realistically; for example, the game may still destroy projectiles once they reach an Arbitrary Maximum Range rather than having them follow a ballistic arc until they hit something. Gravity is also often not applied to projectiles; many (perhaps most) engines approximate the scanned trajectory as a straight line rather than a parabolic arc. It's also worth noting that many more recent games using projectile physics for bullets, especially sniper rifles, tend to be unrealistic in another way - by making the bullet only drop rather than (apparently) rise and fall and moving much, much slower than an actual bullet would move. Presumably, this is for game balance purposes to make sniper rifles Difficult, but Awesome.\n\nParadoxically, while bullets are often implemented as a hitscan, energy weapons are usually portrayed as Painfully Slow Frickin' Laser Beams. See also Homing Boulders.\n• Wolfenstein 3D. Any shot in the general direction of an enemy (or vice versa) was an immediate hit or miss, regardless of range.\n• Doom featured hitscan detection for all bullet weapons and the secondary tracer rays of the BFG originally-fired direction from the player's current physical position (if you fire facing north, then move and face west, the tracers will still head north from where you currently are when the plasma hits something). There are 20 of these tracers spread equally in an arc centered on the originally-fired direction, and these tracers are responsible for most of the weapon's actual damage output (totaled up it almost always exceeds three thousand; it named the The BFG is a special case; its visible plasma ball is a normal projectile and deals plenty of damage. However, when the plasma ball hits something, the weapon then immediately releases invisible hitscan \"tracer rays\" in thefrom the player's current physical position (if you fire facing north, then move and face west, the tracers will still head north from where you currently are when the plasma hits something). There are 20 of these tracers spread equally in an arc centered on the originally-fired direction, and these tracers are responsible for most of the weapon's actual damage output (totaled up it almost always exceeds three thousand; it named the BFG trope for a reason). By luck or cunning, this mash of undocumented illogical functions encourages daring play far more effectively than sensible mechanics would have .\n• Quake has the shotgun, super shotgun and lightning gun as hitscan, but the rapidfire weapons do fire visible projectiles, as befits their nature - they're nailguns rather than machine guns.\n• Quake II follows the trope, with bullet weapons being hitscan and energy weapons firing visible luminous projectiles. Notably, this game has the distinction of having brought to the world the railgun, which was probably the first example of a hitscan sniper rifle whose instant-hit nature wasn't a grudgingly accepted trope but an outward design feature, replete with a very visible spiraling trail. Justified in lore as the projectile traveling at a significant fraction of lightspeed, the concept struck gamers' favour and following games in the series all included one or another version of the railgun. Many other games borrowed the concept as well.\n• Medal of Honor did this with fake tracers, resulting in the infamous Scrappy Level from Allied Assault, \"Sniper's Last Stand\", where the player had to face off against eerily prescient hidden snipers with hitscan rifles. Worse, it also means that enemies' shots can continue to hit you while they're flinching or aiming the wrong way, and they can even hit you around corners or from behind objects that are supposedly too high for them to shoot over.\n• GoldenEye and Perfect Dark both have fake tracers. In Perfect Dark even crossbow bolts are hitscan.\n• Deus Ex, where you can bind keys to slow time down and see bullets travel faster than the visible tracer does.\n• Far Cry makes the fakeness of tracers obvious due to very long ranges in the outdoor levels; firing a weapon at water from long range will cause a splash long before the tracer arrives.\n• Call of Duty does it for all bullets, except for the realistic sniping sequence in \"One Shot, One Kill\" from Modern Warfare. Since the hitscan line is projected from the character's head rather than their gun, there is the frequent side-effect of enemy shots glitching around obstacles to hit the player, leading to cases in multiplayer like \"head glitching\" (where a player is able to shoot along a wide field of view over a piece of cover, but is nearly untouchable from the other side of it except for a small portion of his head).\n• The Turok games do this up until 3 with bullet weapons and some enemy weapons; the fake tracers were particularly irritating in the latter case, since you couldn't dodge attacks which appeared to be relatively slow-moving.\n• In Killer7, all of the Smiths' weapons do this, even Kevin and MASK's, who use throwing knives and grenade launchers respectively.\n• Fallout 3 weapons appear to be all hitscan when not using VATS. This is most obvious when, through mods, using a scope on a normally unscoped weapon. The enemy will drop almost a full half-second before the tracer projectile reaches them at long ranges.\n• The Laser weapons you can use are in fact Hit Scan weapons, due to them being Frickin' Laser Beams. This is their major advantage over the more damaging plasma weapons, whose Painfully Slow Projectiles have a very hard time hitting moving or distant targets, at least without VATS.\n• 3 and New Vegas do somewhat avert this for killing shots with the cinematic camera, however; for example, take aim and fire at an unaware Powder Ganger from far enough away with a scoped rifle, if it hits him the game will do a Max Payne-style bullet cam towards him before he drops dead from the critical sneak attack bonus. Of course, you don't have to actually compensate for the Powder Ganger in question moving before you took the shot.\n• In Halo, most human weapons fire bullets and are hitscan. On the other hand, most Covenant and Promethean guns are projectile weapons. Though it seems that the hitscan does take speed into account - this can be most easily seen with the shotgun, as firing it at the end of a wall causes the impact sparks on the near wall to appear noticeably before the far wall. In addition, bullets are affected by the movements of the user.\n• In Unreal I, all of the gunpowder weapons are hitscan, but they have other drawbacks:\n• The Automag is the only weapon in the game that needs reloading.\n• The Sniper Rifle has the slowest firing rate.\n• The Minigun has a slow ramp up and can still be dodged by your opponents in-game.\n• The Combat Assault Rifle in the Expansion Pack Return to Na Pali has no drawbacks whatsoever, making it the most powerful weapon in the game.\n• Unreal Tournament's version of the ASMD energy weapon is hitscan, but the tracer is particularly noticeable as not being so - because of the small shockwave that appears wherever the weapon hits, you see a small expanding circle of energy that is later joined by the tracer itself. This weapon is also used in the popular InstaGib mutator, whereupon it becomes very clear that the instant you shoot something, it dies. The gibs from the body you hit will likely be scattered everywhere before the tracer actually makes it to the location where the body once was.\n• The pistol in La-Mulana is a hitscan weapon in a Platform Game. It's also Awesome, but Impractical.\n• The older Rainbow Six games did this, allowing terrorists to get an insta-death shot from any range. And their accuracy wasn't affected by recoil or movement, unlike yours.\n• The Pistol, Shotgun, Plasma Rifle, and Firestorm Cannon in Turok 2, the latter in particular suffering badly from tracers hitting the target long after the bullet itself. But not with the Bow, where the arrows are affected by gravity, just like real arrows.\n• Robo War originally had lasers do hitscan damage, but only 1/5 of power input, weaker even than rubber bullets. Lasers were later removed from the documentation (but left in the code for backward compatibility) and banned from tournament play.\n• Warzone 2100, in spite of animating and tracking individual projectiles, flagged every attack using a hitscan: If the attack was declared a hit, the target would receive damage when the projectile reached the target's location, regardless of whether the target was still there, or how long it actually took for the projectile to get there.\n• Team Fortress 2: All bullet and melee weapons are hitscan, it is just the graphical tracer effect that looks slower. Stand at a distance and fire one of these weapons at a wall. The bullet hole decal appears instantly, with the tracer hitting half a second later. One can also turn on damage feedback to see it in numbers. Realizing this quirk will greatly increases a player's efficiency, as attempting to Lead the Target (to compensate for the non-existent travel time) will actually cause Hero-Tracking Failure.\n• Also, while melee weapons initiate a short ranged hitscan attack, they do so only after a quarter-second delay to ensure that hits aren't made before the melee animation completes. The two exceptions to this rule are the Spy's backstab and when the Engineer uses his wrench on any of his buildings.\n• The original Team Fortress had a few mods like MegaTF that, among others, changed nailguns to be Hit Scan, in an attempt to lower ping and latency rates.\n• Overwatch: Some weapons that fire projectiles such as McCree's Peacekeeper, Tracer's Pulse Pistols or Soldier 76's Heavy Pulse Rifle use hitscan detection. Others, like Mercy's Cadeceus Blaster, Pharah's Rocket Launcher or Torbjorn's Rivet Gun, require leading the target instead. (One hero, Ana, has a sniper rifle that is hitscan when scoped in but non-hitscan when unscoped.)\n• Lasers in MechWarrior 4 are hitscan. This, along with good damage and range, made the Clan ER Large Laser the primary weapon of choice for online play for quite some time, well after the Expansion Pack (and later, MW4: Mercenaries) were released. Later attempts by the fans to balance this only partially overcame this advantage, as lag issues (including the \"No Damage Bug\") tended to cause some players to miss with other, non-hitscan weaponry. Lasers are also hitscan in the other games of the franchise, except except for MechWarrior 2 and its spinoffs - see the example in the exceptions below.\n• In The Elder Scrolls V: Skyrim, shock magic spells (e.g. Lightning Bolt) are hitscan.\n• The blaster in Earthworm Jim has a muzzle flash but fires no visible projectiles ... which is kind of bizarre in a 16-bit sprite-based platformer with minimal physics.\n• Bullets in FEAR are obviously hitscan, as they hit instantly even when in Bullet Time, and their impact points often don't match up with the visible tracers, sometimes hitting the player around corners.\n• MapleStory had a (now fixed) bug in which projectile attacks would register as hits before the projectile got to the target. Also, arrows and throwing stars are known to \"follow\" an enemy like a heat seeking missile (especially jumping ones).\n• Tribes: Ascend originally had mostly hitscan weapons during the game's beta. Acting on player feedback, before the game's release Hi-Rez slowly phased out hitscan weaponry until only sniper rifles, shotguns, and two types of pistol remained hitscan weapons. Assault rifles, SMGs, and other pistols were changed to projectile weapons.\n• This is the main advantage of the Nitemare 3D's pistol; the plasma gun and the magic wand both emit relatively slow-moving particles.\n• In Mass Effect series, gun bullets are tiny shavings of metal that are first significantly reduced in mass by the local Phlebotinum, \"element zero\", and then propelled electromagnetically to such ludicrous speeds that hitscan is pretty well justified.\n• Most of your powers have to be at least somewhat aimed because they follow a trajectory towards the nominated target, letting you do things like drop an Incinerate, Warp or Cryo Blast behind cover, and Shockwave takes a few seconds to reach the quarry, but the only delay in using Overload is the gesture you make while activating it; once it goes off, it hits the target instantly, so long as they're visible.\n• Resident Evil uses this trope for most guns, at least prior to Resident Evil 4. Because you don't really aim in those games, the guns appear to use a rather generous cone of damage in which firing will damage zombies - as long as you're facing the right direction, you'll usually hit. Presumably your character handles the fine aim control him or herself. This is what makes modes like Invisible Enemy feasible (along with the fact that you rarely NEED to kill enemies, though it is helpful).\n• Metroid Prime: Hunters uses hitscan for exactly one weapon: the Imperialist, a laser sniper rifle.\n• In Robocraft the SMG weapons and the railguns are both hitscan, however there is a cosmectic projectile fired from the barrel. This is particularly obvious when you see a plane seemingly dodge an anti-air fire barrage but still take damage in the process.\n• In Mega Man Battle Network, MegaMan.EXE's arm cannon works by hitscan, as do many common chips like Cannon and Spreader. Same goes for the sequel series Mega Man Star Force. (This contrasts sharply with the rest of the Mega Man franchise — see below.)\n• In Super Smash Bros., Bayonetta's Bullet Arts (and not her neutral special, which work as regular projectiles) and Joker's Gun don't actually count as projectiles, and work in-engine as invisible melee hitboxes with a long (though not indefinite) range. This also means that, unlike normal projectile attacks, they can't be reflected or absorbed by specials like PSI Magnet, the Star Fox cast's reflectors, or Kirby and Dedede's Inhale.\n• The early Delta Force games by Novalogic did this, despite their other attempts at realism — bullets have drop-off and you have to zero your scope to keep your shots impacting at the center of your crosshair past a couple hundred meters, but except for a few silenced weapons like the PSG-1 in Land Warrior, they'd still instantly hit what they're supposed to hit.\n• In Mortal Kombat, Stryker's gun is the only hitscan ranged attack. Abuse of it is required in some of the Challenge Tower levels because of how ridiculous the winning requirements/opponent qualities are.\n• Uncharted is an interesting case. While all bullet-based weapons use Hit Scan, starting with the second game they all had visible tracer rounds so the player can more easily see where an enemy is shooting from. For the player this can result in the odd case where hitting a moving target will damage them even though the visible tracer round completely missed half a second later.\n• In Iji, small firearms such as Iji's shotgun shoot projectiles that hit whatever they faced on the same frame they were shot. Powerful projectiles that deal direct hitpoint damage are slower and can be dodged in time.\n• Kurt Hectic from MDK uses a chain-gun that instantly hits whatever he aims it at. He can also attach it to his helmet, turning it into a Sniper Rifle that has no hitscan bullets, frequently requiring him to Lead the Target. Max joins the fun in MDK2 with an assortment of hitscan firearms. Both he and Kurt can also find and shoot Frickin' Laser Beams which, ironically, are not hitscan.\n• Most firearms in Warframe, especially those produced by Tenno and Grineer, use instant-hit bullets. The Corpus, enamoured with Frickin' Laser Beams, mostly produce firearms shooting plasma bolts that take time to reach the target and frequently miss because of this. They also produce continous beam weapons which are hitscan, but cease to hit anything further than about 20 metres.\n\nNote: For the sake of brevity, this is a list of games which do not contain hitscan weaponry at all. Projectile modeling was common even in Doom 's time for certain weaponry (such as rocket launchers, which are never hitscan).\n• Borderlands uses projectile modeling for every weapon in the game (with the Siren class having a special ability that jacks up bullet velocity, even!) Also, just because you don't see the projectile doesn't mean it is not there. There's a noticeable \"delay\" in a great majority of sniper guns, specially when you really need to snipe.\n• Except for one. The Eridian Lightning hits instantaneously at all ranges.\n• In the second game, bullets from certain weapons (usually Torque's explosion shooting guns) take this to the point of being Painfully Slow Projectiles that you'll have to noticeably lead for human-sized targets less than ten feet away.\n• Max Payne was one of the first games to make a big deal of not using hitscan weaponry at all; in Bullet Time, every round fired can be seen as it travels towards the target. Particularly notable is that every round on every weapon is fully rendered even when not in Bullet Time. The player can sometimes get a glimpse of bullets traveling past the player and towards the camera even in real time. To show this off, on-target shots from the Sniper Rifle let you ride the bullet to the target. It occasionally triggers for a miss however, so presumably it's supposed to trigger when the game thinks there's a high probability of a hit.\n• Battlefield 1942 and all subsequent games in the series (excluding Battlefield Heroes) also had realistic ballistics as a selling point; bizarrely, even the knife was a projectile weapon which \"fired\" a slow-moving instant death projectile fixed to the centre of the player's viewpoint.\n• S.T.A.L.K.E.R. modeled projectile flight from all bullets, and weapon mods exist to make them fly straighter. It's also particularly helpful that Every Bullet Is a Tracer if you're sniping, as the bullets visibly drop over distance.\n• The Gauss Rifle is functionally a hitscan weapon, as it's firing bullets at a much greater speed than the other guns.\n• Operation Flashpoint and ArmA: If it goes bang, then the projectile behaves according to the rule of physics. Starting from ARMA II: Operation Arrowhead you even have the option to adjust the zeroing of whatever sights are attached to your gun to compensate for the bullet drop\n• Sniper Elite is about keeping bullet and shooting mechanics as realistic as possible, at least without being overly aggravating. The player must account for flight time, bullet drop due to gravity, wind, and even the character's physical state. All of these can be toggled except flight time. The only jarring thing though is that certain effects like spalling from when the bullet hits a wall, tends to happen instantaneously.\n• Most flight combat games (Ace Combat, H.A.W.X., etc.) require you to lead your shots when using the airplane's main cannons.\n• It's only apparent at longer ranges, but every bullet weapon in Red Faction has an actual projectile, and the rocket weapons have fuel, meaning that they will drop after a certain distance.\n• Star Wars: Battlefront averts this by necessity, as the nature of blaster bolts (glowing brightly and moving rather more slowly than most bullets) would make Hit Scan weapons very, very obvious.\n• Dark Forces even lowers the damage of blasters the farther the bolt has to travel.\n• Jedi Knight: Dark Forces II included a form of collision damage (something like falling damage applied for any high-speed impact with a surface, not taking damage from simply touching enemies like in a platformer or something), which resulted in some oddities: using Force Speed and running into a shot from a blaster weapon would result in more damage than if you'd been hit while standing still. It seems like a decent amount of the damage caused by rockets (especially noticeable with the ones that latch onto you and wait for a few seconds before detonating) was purely from the impact.\n• However, one of the many technical books describing how the universe works describes that blaster bolts \"hit instantly\", and that the visible laser is really harmless. Of course, it's really just someone else's interpretation and not Word of God.\n• Marathon. All bullets, including those fired from rapid-fire weapons like the assault rifle, are tracked as regular projectiles, showing up on the player's motion sensor in the process. They generally weren't affected by gravity, although grenades were. Also, the speeds Bungie set for most bullets were quite a bit slower than is realistic.\n• In Silent Scope your bullet's trajectories are affected by gravity, by movement while on a vehicle, the wind, etc., requiring you to Lead the Target. One of the few arcade lightgun games to do this.\n• Police 911, where the bullets were painfully slow.\n• Unlike its predecessor Far Cry, Crysis has no hit scan weaponry.\n• Viewtiful Joe bullets and tank shells travel instantly unless you activate Slow Motion before they fire. In Slow Mo you can see the projectile and punch them back.\n• The first two Descent games had an engine that did not support hitscan weapons at all, and used invisible projectiles instead for the Vulcan and Gauss cannons. However, they were so fast (around 10 times the speed of your ship) that it was just about impossible to dodge them.\n• Jagged Alliance and its sequels all model the ballistics of each and every projectile fired. However, the \"Chance to Hit\" system determines whether the bullet will be fired at the \"perfect\" trajectory required to strike its target dead-center, before the bullet ever leaves the gun. It is still possible for such a bullet to end up striking the scenery nonetheless.\n• The JA2 v1.13 community patch adds a new system that works entirely with ballistics.\n• In the X-Universe games, beam weapons such as Kha'ak kyon emitters look Hit Scan, but modders have discovered that the game engine treats beam weapons as very fast projectile ones. This is normally transparent to the player because the projectiles are invisible, but occasionally — typically while fighting very fast ships — it can happen that the beam graphic crosses your target but the projectile isn't there yet, resulting in an irritatingly damage-free enemy.\n• Averted by all weapons in BLOODCRUSHER II except for laser-shooting guns.\n• All kinetic weapons in Vanquish have visible projectiles that can be dodged in Bullet Time.\n• In a rare case for video games in the 90s, the PC sci-fi game Outwars averts using Hitscanning for all weaponry, even for what amounted to a man-portable railgun.\n• All projectiles in Total Annihilation were modeled as moving projectiles, even (oddly) ones that would justifiably be hitscan such as lasers.\n• Joint Operations: Typhoon Rising incorporates bullet flight time and trajectory (as well as effects of wind on those), which is especially noticeable when shooting with sniper rifle at long range, but can also be noticed even with assault rifles at longer ranges (cca 50-100 m).\n• PlanetSide 1 and its sequel have travel times on almost all weapons, with only excessively short range weapons (i.e. shotguns) being hitscan in the first game. Planetside 2 adds ballistic trajectories to all weapons, requiring players to aim above their target at long range; certain Vanu Sovereignty weapons have no bullet drop in exchange for slower projectiles.\n• The Mega Man franchise has an abiding love of visible projectiles. There are hundreds of obtainable weapons in the franchise, but hardly any are hitscan-based (except, as noted above, in the Battle Network and Star Force series).\n• MechWarrior 2 and its spinoffs are some of the first games to avert this trope entirely and animate everything, including attacks by machine guns, autocannons and even long-range guns like the gauss cannon, in both single and multiplayer. You can see this if you activate thermal view, which replaces the scenery with a dark background and lets you clearly identify the dots of the bullets as they hurtle toward their destination.\n• Projectiles in System Shock 2 are not hitscan and are actually quite slow, gun bullets taking a noticable fraction of a second to hit a target that is dozen of metres away.\n• Bullets in 8Bit Killer are tracked as objects that move across the map at noticable speeds.\n• In Ghost Recon Wildlands, bullets are modeled with finite velocity and ballistic trajectories, requiring the player to compensate accordingly at long range. The subsonic rounds used by suppressed weapons are also noticeably slower.\n• Brutal Doom managed to remove hitscan. Yet bullets still travel as fast as you expect.\n• So does Demonsteele, although only for the bad guys.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/Hitscan", "media_links": ["/pmwiki/pmwiki.php/VideoGame/Doom", "/pmwiki/pmwiki.php/VideoGame/Wolfenstein3D", "/pmwiki/pmwiki.php/VideoGame/Doom", "/pmwiki/pmwiki.php/VideoGame/Quake", "/pmwiki/pmwiki.php/VideoGame/QuakeII", "/pmwiki/pmwiki.php/VideoGame/MedalOfHonor", "/pmwiki/pmwiki.php/VideoGame/MedalOfHonorAlliedAssault", "/pmwiki/pmwiki.php/VideoGame/GoldenEye1997", "/pmwiki/pmwiki.php/VideoGame/PerfectDark", "/pmwiki/pmwiki.php/VideoGame/DeusEx", "/pmwiki/pmwiki.php/VideoGame/FarCry", "/pmwiki/pmwiki.php/VideoGame/CallOfDuty", "/pmwiki/pmwiki.php/VideoGame/ModernWarfare", "/pmwiki/pmwiki.php/VideoGame/Turok", "/pmwiki/pmwiki.php/VideoGame/Killer7", "/pmwiki/pmwiki.php/VideoGame/Fallout3", "/pmwiki/pmwiki.php/VideoGame/FalloutNewVegas", "/pmwiki/pmwiki.php/VideoGame/MaxPayne", "/pmwiki/pmwiki.php/Franchise/Halo", "/pmwiki/pmwiki.php/VideoGame/UnrealI", "/pmwiki/pmwiki.php/VideoGame/UnrealTournament", "/pmwiki/pmwiki.php/VideoGame/LaMulana", "/pmwiki/pmwiki.php/VideoGame/RainbowSix", "/pmwiki/pmwiki.php/VideoGame/Turok", "/pmwiki/pmwiki.php/VideoGame/RoboWar", "/pmwiki/pmwiki.php/VideoGame/Warzone2100", "/pmwiki/pmwiki.php/VideoGame/TeamFortress2", "/pmwiki/pmwiki.php/VideoGame/Overwatch", "/pmwiki/pmwiki.php/VideoGame/MechWarrior", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsVSkyrim", "/pmwiki/pmwiki.php/VideoGame/EarthwormJim", "/pmwiki/pmwiki.php/VideoGame/FirstEncounterAssaultRecon", "/pmwiki/pmwiki.php/VideoGame/MapleStory", "/pmwiki/pmwiki.php/VideoGame/Tribes", "/pmwiki/pmwiki.php/VideoGame/Nitemare3D", "/pmwiki/pmwiki.php/Franchise/MassEffect", "/pmwiki/pmwiki.php/Franchise/ResidentEvil", "/pmwiki/pmwiki.php/VideoGame/ResidentEvil4", "/pmwiki/pmwiki.php/VideoGame/MetroidPrimeHunters", "/pmwiki/pmwiki.php/VideoGame/SuperSmashBros", "/pmwiki/pmwiki.php/VideoGame/Bayonetta", "/pmwiki/pmwiki.php/VideoGame/Persona5", "/pmwiki/pmwiki.php/VideoGame/Mother", "/pmwiki/pmwiki.php/VideoGame/StarFox", "/pmwiki/pmwiki.php/Franchise/Kirby", "/pmwiki/pmwiki.php/VideoGame/DeltaForce", "/pmwiki/pmwiki.php/Franchise/MortalKombat", "/pmwiki/pmwiki.php/VideoGame/Uncharted", "/pmwiki/pmwiki.php/VideoGame/Iji", "/pmwiki/pmwiki.php/VideoGame/MDK", "/pmwiki/pmwiki.php/VideoGame/MDK2", "/pmwiki/pmwiki.php/VideoGame/Warframe", "/pmwiki/pmwiki.php/VideoGame/Doom", "/pmwiki/pmwiki.php/VideoGame/Borderlands", "/pmwiki/pmwiki.php/VideoGame/MaxPayne", "/pmwiki/pmwiki.php/VideoGame/Battlefield", "/pmwiki/pmwiki.php/VideoGame/STALKER", "/pmwiki/pmwiki.php/VideoGame/OperationFlashpoint", "/pmwiki/pmwiki.php/VideoGame/ArmA", "/pmwiki/pmwiki.php/VideoGame/SniperElite", "/pmwiki/pmwiki.php/VideoGame/AceCombat", "/pmwiki/pmwiki.php/VideoGame/HAWX", "/pmwiki/pmwiki.php/VideoGame/RedFaction", "/pmwiki/pmwiki.php/VideoGame/StarWarsBattlefront", "/pmwiki/pmwiki.php/VideoGame/DarkForces", "/pmwiki/pmwiki.php/VideoGame/JediKnightDarkForcesII", "/pmwiki/pmwiki.php/VideoGame/Marathon", "/pmwiki/pmwiki.php/VideoGame/SilentScope", "/pmwiki/pmwiki.php/VideoGame/Police911", "/pmwiki/pmwiki.php/VideoGame/Crysis", "/pmwiki/pmwiki.php/VideoGame/ViewtifulJoe", "/pmwiki/pmwiki.php/VideoGame/Descent", "/pmwiki/pmwiki.php/VideoGame/JaggedAlliance", "/pmwiki/pmwiki.php/VideoGame/X", "/pmwiki/pmwiki.php/VideoGame/BloodCrusher2", "/pmwiki/pmwiki.php/VideoGame/Vanquish", "/pmwiki/pmwiki.php/VideoGame/TotalAnnihilation", "/pmwiki/pmwiki.php/Franchise/MegaMan", "/pmwiki/pmwiki.php/VideoGame/MechWarrior", "/pmwiki/pmwiki.php/VideoGame/SystemShock2", "/pmwiki/pmwiki.php/VideoGame/EightBitKiller", "/pmwiki/pmwiki.php/VideoGame/GhostReconWildlands"], "non_media_links": ["/pmwiki/pmwiki.php/Main/OneBulletAtATime", "/pmwiki/pmwiki.php/Main/PainfullySlowProjectile", "/pmwiki/pmwiki.php/Main/EveryBulletIsATracer", "/pmwiki/pmwiki.php/Main/BulletTime", "/pmwiki/pmwiki.php/Main/EveryBulletIsATracer", "/pmwiki/pmwiki.php/Main/BFG", "/pmwiki/pmwiki.php/Main/GoddamnBats", "/pmwiki/pmwiki.php/Main/ArbitraryMaximumRange", "/pmwiki/pmwiki.php/Main/NoArcInArchery", "/pmwiki/pmwiki.php/Main/DifficultButAwesome", "/pmwiki/pmwiki.php/Main/PainfullySlowProjectile", "/pmwiki/pmwiki.php/Main/FrickinLaserBeams", "/pmwiki/pmwiki.php/Main/HomingBoulders", "/pmwiki/pmwiki.php/Main/BFG", "/pmwiki/pmwiki.php/Main/ScrappyLevel", "/pmwiki/pmwiki.php/Main/KnockBack", "/pmwiki/pmwiki.php/Main/FrickinLaserBeams", "/pmwiki/pmwiki.php/Main/PainfullySlowProjectile", "/pmwiki/pmwiki.php/Main/ExpansionPack", "/pmwiki/pmwiki.php/Main/PlatformGame", "/pmwiki/pmwiki.php/Main/AwesomeButImpractical", "/pmwiki/pmwiki.php/Main/BoomHeadshot", "/pmwiki/pmwiki.php/Main/TheComputerIsACheatingBastard", "http://wiki.teamfortress.com/wiki/Hitscan", "/pmwiki/pmwiki.php/Main/LeadTheTarget", "/pmwiki/pmwiki.php/Main/HeroTrackingFailure", "/pmwiki/pmwiki.php/Main/LeadTheTarget", "/pmwiki/pmwiki.php/Main/ExpansionPack", "/pmwiki/pmwiki.php/Main/GameMod", "/pmwiki/pmwiki.php/Main/BulletTime", "/pmwiki/pmwiki.php/Main/Phlebotinum", "/pmwiki/pmwiki.php/Videogame/Robocraft", "/pmwiki/pmwiki.php/Videogame/MegaManBattleNetwork", "/pmwiki/pmwiki.php/Videogame/MegaManStarForce", "/pmwiki/pmwiki.php/Videogame/MortalKombat9", "/pmwiki/pmwiki.php/Main/EveryBulletIsATracer", "/pmwiki/pmwiki.php/Main/SniperRifle", "/pmwiki/pmwiki.php/Main/LeadTheTarget", "/pmwiki/pmwiki.php/Main/FrickinLaserBeams", "/pmwiki/pmwiki.php/Main/MegaCorp", "/pmwiki/pmwiki.php/Main/FrickinLaserBeams", "/pmwiki/pmwiki.php/Main/PainfullySlowProjectile", "/pmwiki/pmwiki.php/Main/BulletTime", "/pmwiki/pmwiki.php/Main/BulletTime", "/pmwiki/pmwiki.php/Main/SniperRifle", "/pmwiki/pmwiki.php/Main/ArrowCam", "/pmwiki/pmwiki.php/Main/EveryBulletIsATracer", "/pmwiki/pmwiki.php/Main/NotTheFallThatKillsYou", "/pmwiki/pmwiki.php/Main/WordOfGod", "/pmwiki/pmwiki.php/Main/EnemyDetectingRadar", "/pmwiki/pmwiki.php/Main/LeadTheTarget", "/pmwiki/pmwiki.php/Main/PainfullySlowProjectile", "/pmwiki/pmwiki.php/Main/SlowMotion", "/pmwiki/pmwiki.php/Main/BulletTime", "/pmwiki/pmwiki.php/Videogame/PlanetSide", "/pmwiki/pmwiki.php/Videogame/BrutalDoom", "/pmwiki/pmwiki.php/Videogame/Demonsteele"]}