{"title": "Hard Mode Perks", "content": "Some video games may reward their players for choosing harder difficulties. However, merely getting Cosmetic Awards may often seem unfair, so gamers may receive some actually gameplay-affecting bonuses to keep up with the challenge. It's often bonus experience or better equipment, especially when the player may select difficulties for particular missions. These rewards sometimes cause Early Game Hell: the starting conditions for the harder difficulties are undeniably harder, but as the game goes on, the bonuses kick in noticeably.\n\nIf overdone, the harder difficulties may become easier than the easy ones, similar to the issues with Unstable Equilibrium. Contrast Easy-Mode Mockery, though Hard Mode Perks can be seen as a subtle form of it as the benefits are locked out on easier difficulties. Some players take offense to Hard Mode Perks, considering them unfair to players who cannot play on the harder difficulty settings.\n\nAnother reason these bonuses sometimes appear, especially in RPGs, is to offset the way a higher difficulty would otherwise slow the pace of the game - giving more experience and gold per fight, for instance, because a higher difficulty makes them take longer and might otherwise force the player into lengthy Level Grinding.\n\nCompare Bragging Rights Reward, when you don't need the reward because you already beat the hardest part of the game, and Golden Ending, which is sometimes reserved for hard mode.\n• Most Castlevania games have a version of this.\n• In Castlevania: Harmony of Despair, the players rely mostly on equipment found during the levels in order to power up the characters. Upon defeating Dracula for the first time, it's possible to play in the Hard version of the levels, in which enemies inflict much more damage, are faster and have drastically increased HP, as well as placing more enemies on the maps and making the hazards considerably harder to avoid. However, treasure chests will provide much better equipment.\n• In both Aria/Dawn and Portrait there are certain items that are only seen in hard mode - if you're playing on normal their map locations will be bare.\n• In Castlevania: Order of Ecclesia, starting a fresh game in Hard Mode gives you the Glyph Sleeve accessory (which allows you to store three glylph combinations to switch on the fly instead of using the Pause menu) right away instead of somewhere mid-game, as well as several glyph-dropping enemies who normally won't appear until later in the game. In addition, beating the Hard difficulty with a level 1 cap gets you the best helmet in the game that halves heart consumption and raises the normal level cap to 255 (your level carries over through even the lower cap Hard runs and any experience you earned during them carries over).\n• Castlevania: Bloodlines went one further and added in more areas and bosses on the hardest mode, making for a meatier, more satisfying playing experience, with the full ending —only available on hard mode— serving as the after-dinner mint. Since Hard mode is a bit more challenging but lacks anything in the way of Fake Difficulty, it's essentially an extended New Game+ edition (it's not available by default and you have to unlock it).\n• Castlevania The Adventure Rebirth on Classic mode gives you the classical stiff jump physics, but it also removes the knife and stopwatch, two of the least effective subweapons in the game, so you always get one of the \"big three\" subweapons (Axe, Cross, and Holy Water).\n• The Forza Motorsport series has bonuses for players that disable driver assists (traction control, anti-lock brakes, racing/braking lines, et cetera). The more assists that are turned off, the more money you get a bonus at the end of races; disabling all the assists and setting the AI on the hardest setting will give you 165% more credits at the end of the race, on top of the regular winnings. Using the Manual + Clutch transmission grants the user a small boost of torque when upshifting to reward advanced players.\n• Granblue Fantasy: In general, higher difficulty raids and battles will award more EXP, RP, Rupies, and items. However, there are still notable parts where this trope takes effect:\n• Arcarum Extreme has a chance of spawning special bosses that drop crafting materials used in forging an Arcarum summon to 4★. And unlike Normal and Hard, the Extreme Difficulty also rewards players with thousands of EXP and RP per battle.\n• Impossible Difficulty Raids and other special raids can provide the players with blue chests. During events and Rotating Showdowns, even the Maniac and Nightmare difficulty raids can also drop Damascus Grains and Gold Bricks, two of the rarest items in the game.\n• In Star Wolves, harder difficulties grant experience bonus, and the experience is extremely important in the game.\n• In World of Warcraft, heroic versions of dungeons are harder but give much better loot, as well as currency with which to buy raid-quality gear.\n• Later raids also have a heroic mode. The currency awards is the same, but the loot is of higher quality than in the regular mode. Ulduar is different in that its Hard Mode causes the boss to drop extra items of higher quality, in addition to the guaranteed drops.\n• Recent expansions also added \"heroic only\" phase to some raid boss's battle (Ragnaros, Garrosh Hellscream)or even exclusive bosses that only appear if you played hard (Sinestra, Ra-den).\n• Many pets and mounts that drop in dungeons and raids either have increased drop rates on higher difficulties or only drop on those difficulties. Notably, mounts that drop off the end boss of raid tiers have a 100% drop rate on the highest difficulty while the tier is current content.\n• Legion introduced the Mythic+ difficulty system for dungeons. Each plus level increases the health and damage of enemies while also introducing up to three new mechanics. The reward for completing such a dungeon is significantly stronger armor and a bonus reward each week based on the highest level of difficulty.\n• Battle For Azeroth added the War Mode feature for leveling. In War Mode, you're flagged for PvP 24/7, making you vulnerable to getting attacked by enemy players, and you can only turn it on and off in your faction's capital city. However, you get a passive 10% XP buff in War Mode, making this a fast, if risky, way to level alts.\n• All Diablo games give much better Random Drops on higher difficulties. As your enemies are a lot harder on those difficulties, you will need them.\n• Diablo III originally had harder difficulty levels as a glorified New Game+, since you had to start over from the beginning to play them. However, when Reaper of Souls came out, difficulty levels were changed so that enemies now scaled to your level; higher difficulties just made the scale go up exponentially more. In any case, higher difficulties give better loot drops and more experience points.\n• There are also some pieces of equipment that will only drop in the \"Torment\" modes, which scale from Torment I to Torment XIII. In addition, the legendary items that drop have a higher chance to be \"Ancient Legendary,\" which provide even more bonuses and have higher stats. Finally, patch 2.5.0 introduced the chance for a legendary item to be a \"Primal Ancient\" item that has perfect stats (i.e. the highest possible rating for all of its bonuses), but a player has to beat a Greater Rift equivalent to the hardest difficulty before Primal Ancient equipment will even start having a chance to drop.\n• Sacred gives an experience bonus based on difficulty.\n• In Disney's Magical Quest for the SNES, harder modes make you start with less Hearts, but you can find more Heart Containers than in easy mode. You still have to deal with more enemies and tougher bosses, and the bonus containers are hidden.\n• Vindicators gives you a bigger number of starting stars (ie: money) for the harder difficulties.\n• This applies to most of the Dynasty Warriors series. Depending on the exact game, playing on harder difficulties will get you better weapon-drops, better stat-increase drops, or just faster experience-gain. In most cases, the best weapons can only be acquired while playing on Hard Mode or higher.\n• This also applies to Samurai Warriors, and for that matter, Warriors Orochi. The Dueling Games series Sengoku Basara works in the same way.\n• Kingdom of Loathing has quite a few of these:\n• Beating the final boss on Hardcore mode gives you more karma you can use to carry skills and special astral equipment and consumables into your next ascension. It also drops a piece of Stainless Steel equipment related to your class, which is decent for aftercore.\n• Taking a dietary restriction also adds karma, and the final boss will drop a consumable item related to the restriction: players who go without booze will get a high-quality food item, players who go without food get a very nice drink, and players who go without both will get cans of really good air. And if you're also on Hardcore, you'll get three of them instead of just one.\n• Combining the above two, taking the no-food no-booze path and playing on Hardcore will also replace the Stainless Steel drop with Plexiglass , which is even better.\n• Playing the Bad Moon special path will give you a piece of Brimstone gear, all of which provide a major boost to one stat at the cost of a large-but-not-quite-as-major penalty to another stat, as well as a second bonus related to the class which earns it. Each piece equipped also provides a hidden bonus, which increases exponentially as you add the rest of the set.\n• Playing the current special challenge path will give you extra karma every time you complete it, as long as you started it while it was its season - and the karma bonus gets doubled if you play on Hardcore. Otherwise, you get the regular karma bonus only the first time you complete the path, regardless of difficulty.\n• Mass Effect offers higher exp (or more exp opportunities) on higher difficulties. In addition, a handful of Achievements require a character level too high to reach in one playthrough.\n• In Mass Effect 2, completing a certain character's recruitment mission on Hardcore or Insanity yields the Geth Pulse Rifle, an extremely accurate Assault Rifle Though you can just change the difficulty for that level and then change it back, and you'll still have the gun .\n• In Valkyrie Profile, getting every character at level 1 on Hard might not seem like this (and probably wasn't intended to be), but it lets you level up new characters more carefully, such as by equipping them with accessories which boost their HP and skill points at each level up. In practice, it ends up giving your characters a significant boost in power at a lower level.\n• A straighter version would be that the dungeons exclusive to hard mode contain top tier equipment that just isn't available in normal or easy difficulties. The net result between this and the above point is that Hard Mode is significantly easier if you know what you're doing, while Easy Mode can be much more difficult—and it doesn't let you get the Golden Ending. Also, you get more periods (time slots that are used up when you enter a town or a dungeon, recruit characters, etc) on higher difficulties, which just further ramps up how much tougher Easy Mode can be.\n• Almost all of the Touhou games have some method of scaling your score to the difficulty chosen. A few of them grant extra lives based on score. This means that playing on harder difficulties gets you lives earlier in these games, and the point barriers can be high enough that you can miss them if you're playing poorly.\n• Additionally, Ten Desires gives more spirits on the higher difficulties. Spirits are used to fill the trance gauge, and trance is not only a powerful attack and defense, but can be used to double the effect of bomb and life fragments.\n• The way Fairy Wars works is that you have the ability to freeze bullets, and get lives, bombs, power, and score based on the area frozen. The increased amount of bullets on the higher difficulties is a natural help. The higher difficulties also have death-bullets, which can be used to greatly extend a freeze by a clever player.\n• Simplifying things a bit, to get more bombs in Legacy of Lunatic Kingdom you need to graze bullets. The thing here is that the number of bullets needed is the same for all difficulties, meaning that you effectively have more bombs on higher difficulties.\n• In Double Dealing Character, playing as Marisa-B turns the higher difficulty levels into this. Since her bomb scoops up bullets to turn them into Power-Up items that can then be picked up through auto-pickup for point bonuses, bomb fragments, and life fragments, a good Marisa-B player can take advantage of bullet-dense sections to keep themselves at full power and maximum lives.\n• The \"hard mode\" of the original Super Mario Bros. replaces all Goombas with Buzzy Beetles (whose intended form of extra difficulty is that they're immune to Mario's fireballs), which allows the player to get as many lives as they want by having their shells being kicked repeatedly against certain structures, much like a Koopa shell. It also makes clearing a whole row of enemies much easier - stomping a Beetle and kicking it to take out all the others is effortless compared to stomping all Goombas individually.\n• Space Rangers has several sliders adjusting difficulty of various parts of the game, thus making the difficulty go from 50% to 200% - it's actually a quotient to multiply points by for the record table. Aside from that, more enemies means more experience and money once you get moderately good weapons, and the Enemy Mine becomes much easier to utilize. Also, you may pick either additional units or bonus armor for planetary fights, or deny both and get bonus experience and money.\n• In XCOM, there are more aliens per UFO and more UFOs on the higher difficulties. During the early game, when you actually have to worry about money, most of your money will come from selling alien equipment. While you'll have higher overheads from your higher death rate, this extra cash will still speed up your progress considerably (assuming you survive).\n• Super Smash Bros.:\n• Playing on higher difficulties gives you bigger bonus points for completing the game on said harder difficulties.\n• In Melee, you can only fight Crazy Hand in Classic and Giga Bowser in Adventure if you're playing on Normal difficulty or higher.\n• In Super Smash Bros. Brawl, more stickers and trophies appear in harder difficulties, especially stickers in the Adventure Mode. Duon's missiles will do more damage to himself the harder the difficulty is, should you successfully direct them back at him.\n• Super Smash Bros. for 3DS and Super Smash Bros. for Wii U introduce a scaling difficulty system similar to Kid Icarus: Uprising for Classic Mode. Spending coins to raise the difficulty gives you a chance at bigger rewards like rare trophies and customization items, and you can only face the True Final Boss on higher difficulties.\n• A number of Western RPGs including the Dungeon Siege series allow the player to begin a New Game+ with all the enemies in the game at a much higher level or scaled to the level at which the initial playthrough was ended. Needless to say, the experience, gold and loot scale as well.\n• Kingdom Hearts\n• Many of the games have a secret ending video that can be unlocked by completing specific tasks, with the number of tasks decreasing if the difficulty is higher. Beginner Mode doesn't let you access the video at all, Standard Mode forces you to get 100% Completion, and Proud Mode and Critical Mode just require beating the Bonus Bosses (in some cases), some optional areas, and other miscellaneous things depending on the game (e.g. in the Final Mix versions of II you have to beat all of the Mushroom XII challenges Although these are listed as being \"minigames\". ).\n• If playing on Critical Mode in Kingdom Hearts II: Final Mix, you are granted an initial AP of 50, subsequent AP increases are now 3 instead of 2, and several of the later abilities are granted on Day 3 of the prologue: Reaction Boost, Finishing Plus, Draw, 2 Lucky Lucky abilities, MP Hastera and EXP Zero (referred to as \"No Experience\" in the English versions).\n• In Kingdom Hearts: Birth by Sleep, the bonus for playing on Critical Mode is starting off with five Command Deck slots instead of the standard three. You also get the optional EXP Zero ability, which negates any EXP earned from defeating enemies and makes low-level runs of the game easier to pull off.\n• Mushihimesama Futari Black Label's God mode allows the multiplier counter to go up to 30,000, as opposed to Maniac's 9,999. As a result it's much easier to score high (once you tame the Bullet Hell), to the point where you can get the extends earlier than you would in Maniac if you know what you're doing. In fact, if you play with both player slots active, it's possible to max out the score counter.\n• Many classic arcade games—particularly those of the endless variety—allow the player to choose their starting stage. Choosing higher stages often will grant the player a bonus at the beginning of the game. Examples of games that do this:\n• Klax (also allows more dropped pieces)\n• Newer releases of beatmania IIDX have Hazard mode, an offshoot of Free Mode (a mode that guarantees 2 stages regardless of whether you fail the first one). In Hazard, breaking your combo will result in stage failure. However, you are guaranteed four stages instead of two.\n• Hard and EX-Hard gauges instant-fail you if you hit 0%, but eliminate the need to have 80% or more at the end of the song. The former is often used to get around Difficulty Spike endings. Clearing a chart with these gauge types will also award more DJ Points than a normal-gauge clear, though less than a Full Combo.\n• Jak II and Jak 3 have \"Hero Mode\", in which the enemies are more powerful, but you start with all of the guns. This makes Hero Mode easier at first, except in turret sections and others where you can't use your guns.\n• You can however unlock unlimited ammo, Dark Jak and invulnerability with less orbs than usual and before the game ends. And considering you need orbs to unlock Hero Mode it's not too much trouble to just go out and nab a few.\n• Orb placements are completely reset as well, allowing you to stack orbs from your previous playthrough to unlock new things from the secrets menu without having to kill yourself trying to beat some of the more difficult minigames.\n• In Ratchet: Deadlocked, the difficulty determines the number of stars the player will receive after completing a mission (to a maximum of 5 on Exterminator), which are used to get 100% Completion and allows you to unlock Ratchet's alternate skins far faster. Thankfully, anyone who's beaten one of the other games in the series on Challenge Mode will be able to breeze through the higher difficulties.\n• In the Super Robot Wars games, achieving bonus objectives on each mission scales up the difficulty. If you keep this up long enough, however, the game often rewards you with very powerful bonus equipment in the later stages.\n• In the adventure mode of the 1999 version of Qbert, you get double points on normal (compared to easy) and triple points on hard. This does have an in-game use: getting better high scores on early levels increases your rank faster, which lets you access optional areas (those normally-impassable \"2\" and \"3\" blocks). It should be noted that the only difference between the difficulties is how many lives you start with.\n• In DoDonPachi DaiFukkatsu Black Label, playing on Power Style (though not Strong Style) will force you onto the hidden stage paths, instead of requiring you to \"earn\" them. This is normally a bad thing as some of the midbosses you end up encountering are That One Boss, but for those playing for score, it's also a chance to rack up easy points due to the longer stage lengths without worrying about meeting the conditions for the hidden paths.\n• If you play Bomb or Strong Style, and turn off Auto-Bomb, you'll be able to use Hyper Counter even if your Hyper gauge is not full, by using a bomb stock instead. This is very advantageous for two reasons: Going into Hyper does not kill your combo like bombing does, and while in Hyper Counter mode, your shots will cancel enemy bullets (although those bullets will fire suicide bullets in Strong Style), so you get about 10-15 seconds of protection vs. the 2-5 that a bomb gives you.\n• Playing The World Ends with You on harder difficulties will yield different enemy drops, which most of the time are better than the ones for Easy or Normal.\n• Additionally, you have the ability to change your level after you've leveled up at least once. Playing as a lower level limits your health, but gives you a better chance at getting pins after the fight.\n• Another variant involves chaining encounters, where you fight multiple encounters sequentially without the chance to take a break between them. Each subsequent encounter beyond the first gives stat bonuses to the enemies, but it also improves the drop rate for enemy drops. Further, once the game is beaten, the ability to chain encounters increases from four to sixteen, dramatically increasing the drop rate. This does stack with level adjustment, too.\n• DJMAX Portable 2 and Fever normally require you to play a few hundred songs to unlock 8-Button Mode. If you change the options difficulty to Hard, you'll be able to use 8-Button regardless of playcount.\n• DJMAX Portable 3 is similar. To unlock 6.2 Tracks mode in Easy and Normal, you need to reach level 50 through a LOT of Level Grinding. And THEN, you have to unlock it through a 3-item \"pick a ? box and uncover the mystery prize\" Mini-Game that only appears whenever you level up. If you set the difficulty to Hard, however, 6.2 Tracks is available from the get go...if you can stand the stricter timing windows and the batshit insane Life Meter (we're talking death after only 2 or 3 misses).\n• Fallout:\n• Fallout 3 allows you to change the difficulty, which ramps up enemy HP and damage resistance to ludicrous levels, in exchange for more XP from killing them. The next game did away with this system, partly to prevent players from exploiting it, Turn up the difficulty just before you kill an enemy, then turn it back down. and partly so that players could effectively play Hardcore mode (in which the Player Character will die without food, water, and sleep) on the easier difficulty levels without a penalty to experience.\n• Higher difficulty in Fallout 4 causes more enemies to be Legendary, which will be harder to deal with but also give you items with unique, often extremely powerful effects. Survival difficulty specifically (which can only be turned on and then back off once per game) also doubles XP from enemies while increasing damage with consecutive kills between sleeping.\n• Rainbow Six: Vegas 2 allows the player to gain more experience by increasing the difficulty. This ends up making the Easy setting almost not worth playing, as every kill is only worth a single experience point on that mode, compared to 5 per every kill you make and 3 for every one your teammates make on Normal.\n• The best materials won't spawn in Terraria until the Wall of Flesh is killed, turning on Hard Mode for the entire world.\n• Also, in Expert Mode introduced in 1.3, where enemy health and attack is doubled, bosses drop Treasure Bags, which, along with containing much more standard loot than you would get from Normal, also always have a unique item ONLY available from these Treasure Bags. Some of these are incredible, with one even going as far as to permanently give you an extra accessory slot. In addition, many frustrating and rare drops in the game will have their chance to drop doubled.\n• The Tales Series ups the Grade earned in harder difficulties, which in turn can be traded in for nice items and New Game+ perks. Some games also increase the amount of experience points earned for playing on harder difficulties and may have the enemies drop rare items more often, depending on the game.\n• Tales of Symphonia increases the amount of Grade, gald and EXP earned for playing on harder difficulties, which is useful for getting the higher levels of New Game+ Grade items - the highest costs 3000 Grade, which isn't possible on a normal playthrough at lower difficulties without serious amounts of grinding.\n• Tales Of Graces F takes this up to eleven by upping the drop rate of certain items on higher difficulties. This results in many people trying to play the higher difficult even if they're not prepared for it.\n• Fire Emblem:\n• Most Fire Emblem games that have individual difficulties will give recruitable characters a stat boost, since they start as enemies that naturally have them.\n• Fire Emblem: The Binding Blade buffs up the starting stats of quite a few recruitable characters on Hard Mode, and almost all of the affected characters are good in the first place. In some cases, they gain the equivalent of ten extra levels. You'll need it.\n• Blazing Blade in particular has a subtle one: playing Lyn's story passes on whatever stat boosts and equipment that recruits gained in her story to the main story no matter what, but if you play hers on Hard, you can have one of your cavaliers take Wallace's Knight Crest, a promotion item (or even just keep the Knight Crest to boost your Funds ranking). Since Lyn's Story on Normal is a Forced Tutorial, you use his Knight Crest to forcibly promote him, which won't happen on Hard since the tutorial is turned off.\n• Fire Emblem Fates includes the ability to capture generic units and recruit them, depending on the difficulty your capturable enemies can have skills normally impossible for them to get. An example is on Lunatic, as all enemies have capped weapon ranks in their current class.\n• Playing on Hard in BIT.TRIP FLUX (on SAGA or COMPLETE) increases the amount of Beats required to go up and down - perfect for players who can get to META, but can't stay there for long on Normal.\n• Resident Evil 3: Nemesis has an extra optional challenge on Hard mode. Nemesis will relentlessly track down Jill until you avoid him long enough or pump enough bullets into him to knock him down for a while. Shooting down Nemesis on Easy won't change anything, but doing it on Hard will make Nemesis drop unique items like gun parts or reusable first-aid spray cases. If you managed to stop Nemesis on every single encounter, the final item he drops in the clock tower is either an assault rifle on the first run in the save file or, in subsequent playthroughs, an ammo case that gives any one weapon infinite ammo.\n• Resident Evil 4 unlocks professional mode and several difficult minigames after beating the main campaign on normal. Every single game unlocks a different weapon or upgrade, but by far the most lethal weapon is the PRL-412 energy weapon, which in every version but the original GameCube version (it was introduced later on in the Playstation 2 port), fires several homing lasers that instantly kill anything they touch without fail, allowing you to plow through the game while destroying everything in your way. It is unlocked by completing Professional Mode. It's also totally free, and can be bought on any save after beating said save at least once.\n• Parasite Eve 2 has various challenges based on difficulty level. Bounty Mode forces you to fight stronger enemies a lot earlier than you usually do but beating them gets you better items and guns sooner than normally would. Nightmare mode does the same thing but with the additional stipulation that you can't use some of the items until later in the game. Scavenger mode subverts this by being a straight difficulty increase but for all modes sans Replay (Easy), your overall BP and EXP when you beat the game gets multiplied by a difficulty bonus and you get to use the leftover points for New Game+.\n• In the Streets of Rage series, playing on a harder difficulty level meant enemies not only had more health, but they would also come in bigger waves. However, more enemies also means more points to your score and if you were really good, you could rack up a huge score and net several extra lives as you played. In 3, this also means more chances to net 40,000 points for stars that improve your running attack.\n• In Bastion, invoking the gods creates all sorts of negative effects that power up the monsters you fight. However, you also gain bonus experience and money per kill.\n• The limiters in Transistor, another game made by Supergiant Games, also function in a similar manner, minus the currency since there's none in it.\n• In Kid Icarus: Uprising, you can wager hearts at the beginning of each chapter to increase or decrease its \"intensity level\". At higher levels, the enemies shoot more often and some take more damage. On the other hand, it opens up sections of levels that are closed off on lower difficulties, and you receive more powerful weapons if you're able to clear the chapter.\n• It also inverts this: making the intensity lower than normal costs you hearts outright instead of returning them to you for succeeding, reduces the number of enemies present, and reduces the heart drops of what enemies there are, effectively costing you hearts both ways.\n• Mega Man Legends contains a hard mode unlocked after beating the game once. All enemies have gigantic health bars while they do extra damage making certain sections far harder, you lose your shield at the slightest provocation of damage, and defending Roll in any chapter she is in is an absolute nightmare. Push forward, however, and you unlock Easy Mode. All enemies have absolutely pitiful health bars while doing embarrassingly low damage, the game becomes exceedingly easy in every section, and you are given a special buster part called BUSTER MAX, which maxes out your attack power, firing speed, energy, and range. Outside of the Shining Laser, it is the best upgrade you could possibly get, and absolutely mauls everything in seconds. The best part: it's totally free, starting in your inventory from the beginning.\n• Mega Man Legends 2 starts you off with an SS-class digger license on Very Hard mode, allowing you to enter any ruin in the game without having to take those digger tests beforehand.\n• On higher difficulties all enemies drop more of the game's currency, which is used for buying and upgrading sub-weapons. As a result, the higher difficulties actually become easier as you can max out your sub-weapons earlier and easier.\n• Completing a mission on a higher difficulty on Ghost Recon: Shadow Wars will give you more stars to level up your units as opposed to the easier difficulty.\n• Future Soldier likewise gives players a greater bonus to their Ghost score at the end of a mission on harder difficulties.\n• Hard Mode in Guild Wars is unlocked at level 20 after finishing a campaign; completing the campaign again in Hard Mode will yield extra money. The quality and amount of loot will also increase in this mode, and killing every enemy in explorable zones will yield a Vanquish bonus of money.\n• Tribulation Mode in the Super Adventure Box of Guild Wars 2 grants additional rewards. Most notably each zone completed awards a token that is needed to craft weapon skins which can otherwise only be obtained via a rare boss drop.\n• Playing on Tribulation Mode also has the bonus of letting the player switch to a fantastic rock cover of the Retraux 8-bit music.\n• The PAYDAY series has several difficulty levels that adjust how powerful the cops are and how often the special units appear. Higher difficulty levels usually give out more money and if you are skilled enough to play on harder levels, you could level up faster than you would on an easier difficulty.\n• Hero Mode in The Legend of Zelda: Skyward Sword doubles the amount of damage enemies do to you, halves the amount you do to them and makes it so that hearts no longer randomly appear, but the Skyward Strike starts off at full strength, meaning it charges up quickly and does about as much damage as a swing from the fully-powered sword and once you get the actual fully-powered sword, it charges up literally instantly. You also carry over your collected materials and insects, making upgrading your items easier.\n• Gain Ground, one of the slightly more obscure Sega Genesis games, handles its difficulty levels in an interesting way: if you play on Easy, you start up with 3 basic characters but most levels have another character that you can rescue and use afterwards. Hard on the other hand starts you off with every character in the game, but none of the levels have any additional characters for you to rescue: the reason this makes the game more difficult is because when a character gets hit, they're left behind where they died to be rescued but if the character rescuing them gets killed as well, the previous character is killed for good. Naturally, this is in addition to the more numerous and aggressive enemies present on higher difficulty levels as well.\n• Another thing that makes managing a large roster difficult is that you can finish levels in 2 different ways: either you walk each individual character to the exit, or you kill all enemies in the level. Since you have 20 characters from the very start and there's often a strict time limit, doing the former isn't an option for most of the time.\n• In addition to being required for the Golden Ending, Contra 4 changes the stage 1 music on Hard Mode to a remix of the original Contra theme. It's generally agreed that Hard Mode has better music, but YMMV.\n• The first Marvel Ultimate Alliance game, upon hitting hard mode, expands the skill slots to 15 among a few other things.\n• In the early Doom games, Nightmare mode gives the player twice as much ammo for item pickups - a bonus that otherwise only applies to \"I Don't Want To Die\", the easiest difficulty. This is pretty much a necessity, as enemies in Nightmare are so tough and numerous that you'd otherwise run out of ammo even if with perfect accuracy.\n• For the First and Second \"Encounters\" of Serious Sam, playing on Serious or Mental difficulty would double ammo gained from pickups just like in Doom, as well as doubling the maximum amount of ammo that can be carried. Of course, considering the large amounts of damage the enemies in the game can take and dish out on those difficulties, it's still fairly balanced. Another bonus is the score multiplier, and in the HD additions difficulties can be further customized by removing health and/or armor drops from the game as well as giving enemies varying degrees of bonus health.\n• Giving yourself infinite ammo will reduce the score multiplier, for obvious reasons.\n• While the first sequel plays entirely differently, Serious Sam 3 is essentially the same game as the first one, albeit with some new enemies and reloads. However, the one other change is that the ammo bonus for Serious and Mental difficulties has been removed. Don't fret, though: the enemies still have all the advantages they had before, and you can even give yourself multiplayer bonus enemies without actually playing cooperatively with anyone.\n• Choosing Revengeance difficulty in Metal Gear Rising: Revengeance results in your Parry Counter doing around 10 times as much damage as normal. If a player mastered this mechanic by this point, they will find many battles (some bosses included) easier than on Very Hard difficulty, which shares Revengeance's advanced enemy layout. This merely helps even the odds as most enemy attacks do absurd amounts of damage on this difficulty.\n• Drakensang:\n• The Zant demon encountered in the sequel can be weakened by employing up to five magical seals the player finds. This fight is nearly impossible to win for the average player without using any seals. However these seals can also be turned in for additional rewards, if they are not used in the fight.\n• Similarly, the expansion's Disc One Final Boss , which can be made easier by employing up to three of six elemental crystals. The reward for using less/no crystals is not very significant, though.\n• In the Dawn of War II campaigns, Random Drops come in three categories of increasing quality. The gear in the higher categories drops more often in higher difficulties, and not at all in the lower difficulties.\n• In Devil May Cry series, the Heaven or Hell and Hell or Hell difficulty, Dante (or Nero in 4) will die in one hit, period. However, the game is kind enough to give you several Golden Orbs from the get-go (revive lifeline) to compensate.\n• The first Devil May Cry game had a small perk for Dante Must Die mode. Lesser demons have less health than on Normal difficulty, but they can devil trigger (getting way more health and in turn, harder to stun) when a timer reaches zero (sometimes the timer is never displayed). The player has to be careful, because enemies can kill Dante in 2-4 hits if you are not careful, even without devil trigger.\n• Way of the Samurai does this in terms of sword drops, starting from 3. Not only better swords drop in higher difficulties, the Last Lousy Point is often unavailable at difficulties other than Instant-Kill Mode (which is strangely absent in 4). Most of the bonus swords are usually Continuity Cameo swords that debuted in previous games.\n• Armored Core 4's Hard Mode is quite different from the previous games. Instead of having, like, a smaller FCS box, each mission amps up the difficulty by adding or removing something. The very first mission for example, deprives you of your Primal Armor, making your AC quite brittle against more than three Normals you have to face. The only thing that's consistent is that the end mission of every chapter adds an enemy Next to the fray alongside whatever it is you're up against at the end, or in the case of Marche Au Supplie, all four Next with your own allies already killed from the get-go. In return, though, completing each mission in its Hard version rewards you additional tuning points for your schematics and even newer parts.\n• Tyrian rewards you in different ways, such as letting you see more levels or levels with altered layout, giving better items early on, but the best way is... After you beat Tyrian on ENGAGE mode. Rewards you with the code for Nort-Ship Z, the best Super Tyrian ship in the game. .\n• The original Halo: Combat Evolved had an interesting variant of this. At the beginning, Johnson's speech about the ring and the aliens changes slightly, but it is always a humorous concept or idea. Also, only finishing the game on Legendary gives a different, and much funnier and heartwarming ending.\n• In Double Dragon Neon's Dragon (Hard) and Double Dragon mode, enemies get a higher HP and do way more damage, even if you have a maxed out mix-tape. Especially on Double Dragon difficulty. But in return you get more money and mithril from fallen enemies and bosses respectively. Which means you'll have an easier time maxing out your special abilities.\n• Hellsinker:\n• Playing with your Way of Life set to Drastic (5 lives) allows you to get to max lives faster. At max lives on any setting, getting an Extend will give you bonus Spirits.\n• Cranking up the Stella generally raises the Spirit values of enemies and laser grazing. So if you're very competent at survival, and want a large Spirit count, you'll want to keep the Stella at A as long as possible.\n• GHOST Squad allows you to set the difficulty level of each mission from 1 to 4 on the arcade cardless version, 16 on the arcade version with cardslots and GHOST Squad Evolution, and 20 on the Wii port. Higher difficulty levels open up more branching paths; some are simply there to challenge the player, but some paths provide higher scores than ones only available on the lower difficulties.\n• Expert mode in Star Fox 64 makes your wings extremely fragile and the enemies stronger and more numerous. However, the score targets for medals do not change, so if you're adept at staying alive, it's much easier to get medals as well as to score more points than you would on \"normal\" difficulty.\n• In Popn Music versions prior to pop'n music fantasia, Cho-Challenge mode forces the COOL judgement on, doesn't let you play 5-button charts, and removes the guarantee of getting to your second stage even if you fail your first. However, unlike in regular Challenge mode, Ojamas in Cho-Challenge mode won't trigger the horrendously distracting \"DANGER\" background. Also, while Challenge mode restricts you to one Ojama if you set it to always-on (rather than at intervals, as per the default), Cho-Challenge allows you to set two Ojamas and have them always-on, which not only allows you to set even greater Self Imposed Challenges but allows you to get more Challenge Points.\n• Non-video game example: The game show The Chase allows players to choose between three difficulties in their personal chases, with the standard difficulty (5 questions) offering the amount of money they raised in the cash builder, and easy (4 questions) and hard (6 questions) respectively offering much smaller or much larger prize amounts relative to the standard amount. Each difficulty sets the distance between the players and the Chaser; for 6 questions, the player can only afford to miss one question. The amounts are arbitrarily set by the Chaser and differ wildly on many variables from how the player performed in the previous round. Almost all players go for the standard amount, with a few going for easy and hard. Few choose the larger amount, and even fewer still make for awesome moments by winning them. Of course, they then have to actually win the Final Chase regardless...\n• Crimzon Clover on Unlimited mode provides a few perks:\n• New music, though this is a subjective point.\n• You can cancel bullets by using a full lock-on or a full lock-on minus one and killing at least one enemy with it. The canceled bullets will add to your multipliers.\n• Scores can go much higher than on Original.\n• Elemental Gearbolt has this via Difficulty by Region. When Working Designs released it in English, they changed the easy mode into a training mode that ends after three levels.\n• Disgaea games allow you to pass bills (or as of D2, simply adjust with a \"Cheat Shop\") to increase or decrease enemy level, causing them to grant more XP, money, and mana. The games fully expect you to do this, with certain stages designed specifically as Level Grinding spots where you can beat enemies with beneficial Geo Effects, ratchet up the difficulty, and then do it again. A lot of post-game content is downright inaccessible without doing this.\n• Disgaea Dimension 2 changed this to a cheat shop where you can adjust a slider bar of stars to determine your enemy level. While you can never drop the level below the standard, you can always raise it as high as you want to train, then drop it back down to allow your trained warrior to deliver whatever smackdown on whatever boss is holding it back. Additionally, finishing some of the bonus chapters in the game nets extra units and special cheat shop options. None of them make the game particularly easier, but are a reward for getting that far.\n• Disgaea 2: Cursed Memories introduced the Land of Carnage, where the enemies are given a massive level and stat increase (2000% of the map's base level, plus 200 levels added, then double stats), but they also give much more experience, making grinding stages much more rewarding. Also, the Land of Carnage is where the game's best equipment can be obtained. The above-mentioned Dimension 2 added in its own perk: defeating enemies while the Carnage option is enabled in the above-mentioned cheat shop will allow you to absorb their stats, which are permanent and stack with your equipment and natural stats. And then, it added Rasetsu Mode, increasing the stat limits even further and allowing items to be empowered in the Item World even further.\n• Disgaea 5: Alliance of Vengeance has its own set of equipment to obtain in the Carnage Dimension, which are exponentially more powerful than their standard versions. The Carnage Dimension version of the weakest weapon in the game is stronger than the regular world's Infinity +1 Sword.\n• In Final Fantasy XIII-2, Normal Mode triples the enemy drop rate upon achieving a five-star battle ranking (and it stacks separately from the boost of equipped items). This is absent in Easy Mode.\n• Replaying Lightning Returns: Final Fantasy XIII on Hard in a New Game+ gives all enemies a large overall stat boost and greatly reduces the amount of EP you get from killing them, but there's some garbs that are only available on Hard and enemies drop better items and higher-leveled commands. The weapon drop for the Final Boss is also tripled, although a boost from 5% to 15% isn't saying much.\n• In One Way Heroics, better items are only available on the harder difficulties.\n• Daytona USA gives you a higher top speed if you choose manual transmission rather than automatic.\n• X3: Terran Conflict's Xtended Terran Conflict Game Mod has multiple difficulties which affect the spawn rate for Hard-Coded Hostility mooks and the upgrades their ships have. Cranking up the difficultly all the way up to XTREME - an irreversible decision - causes mooks to spawn in overdrive with ships far superior to yours or neutral NPCs. As the mooks rampage uncontrolled through sectors, you can follow at a distance and salvage the wrecks they leave behind; in fact, this is encouraged, because XTREME removes corvettes and capital ships from sale at shipyards along with removing jump drives, making this one of the few ways to get them without pissing off the locals.\n• The School Mascot's talent in Citizens of Earth is this. When used, it brings up a slider that you can use to increase all enemies' stats, but also providing a multiplier to experience and money received. Increasing the difficulty to certain levels also gives extra boosts such as increased talent EXP (which is separate from normal EXP) and a 100% item drop rate. You can also reduce the difficulty, which reduces experience and money and can stop you from getting item drops, talent EXP, or auto-winning battles by hitting enemies from behind.\n• Used as a game mechanic in Dying Light; during the in-game night, extremely fast-moving, hard-hitting Boss in Mook's Clothing zombies called Volatiles begin to swarm all over the city. A player who dares to run around at night finds their Agility and Power experience points doubled, and spending time at night outside of the safe zone results in a number of Survivor experience points based on how long. Additionally, there's a much more valuable air drop that occurs at night which is worth a lot more Survivor exp when handed in.\n• In Sonic Adventure 2, the Hard Mode versions of Knuckles and Rouge's stages puts the objectives in harder to reach areas but also puts them in fixed locations instead of randomizing them. This might not sound like a great benefit at first, until you realize getting a perfect score rating on Hard is by far easier than any other challenge since you can zip from spot-to-spot and just grab them rather than play Where's Waldo? with the shards.\n• In SATAZIUS, playing on Hard or Insane gives you an extra boss on the stage 5 Boss Bonanza and an extra Final Boss form on top of what you encounter on Normal difficulty.\n• Digital Devil Saga: The second game includes a Hard Mode accessible by either importing save data from the first game or beating the second game to get into New Game+. One special extra is added: a brutal optional fight with Satan, one of the main antagonists of Shin Megami Tensei II .\n• By playing Hard Mode in Digimon Story: Cyber Sleuth battles will award more money and items compared to Normal Mode.\n• CROSS×BEATS and crossbeats REV. award a Rank Point bonus for clearing a track with one of the harder gauge types: 10% for the REV.-exclusive Survival gauge and 20% for the Ultimate gauge.\n• In Minecraft villagers killed by zombies are guaranteed to turn into another zombie when they would be killed on easy. It is then possible to cure the zombie, thus turning it back into a villager.\n• Hostile mobs are more likely to spawn being able to pick up dropped items. Not so much fun if one kills you and uses your own gear against you when you try to collect it. But mobs holding items won't despawn so the player could give something to a zombie villager they wish to cure or create a mob zoo if they don't have a name tag handy.\n• They are also more likely to spawn with armour and weapons, making it easier to get uncraftable chainmail armour.\n• Skeleton trap horses have the highest possible spawn rate. If you manage to kill the skeleton riders but not the horses you get already tamed mounts without having to look for horses. The only drawback is that the skeletal horses can't breed.\n• Blue Revolver has four point-based extra lives on each of the first two difficulty levels, but on Parallel mode the game will give out an extra life every 15 million points, and will continue to give extra lives even after your fourth one (at 60 million points) as long as you can earn the points for them.\n• Hard Mode in Dragon's Dogma (which was added to the game with the Dark Arisen DLC) doubles enemy damage and increases your Player Character's stamina consumption, but compensates for it by doubling Experience Point & Discipline Point gains. Playing through the entire game in Hard Mode is also the only way to acquire the very powerful \"Set of Duke's Clothing\" armor piece.\n• In Agents of Mayhem, the harder difficulties come attached with a money and experience multiplier whereas playing on the easier difficulties give you a money and experience penalty.\n• Choosing the Hard setting of Rakenzarn Frontier Story lets you view a bonus secret ending on top of the one for playing on Normal. Choosing the difficulty above that will grant around 20% more XP and money from fights, so you can get your levels and gear in better condition earlier.\n• Ristar grants more continues when playing on Hard Mode compared to Normal Mode. The secret 'Super Hard' difficulty which turns you into a One-Hit-Point Wonder, sets you lives to 1, and removes all 1UPs, takes it further and gives you unlimited continues.\n• The Legend of Zelda: Breath of the Wild's Master Mode (as part of the first DLC pack) makes weapons with bonus modifiers (such as increased attack strength, durability, throwing range, etc.) more likely to appear early on than they might in Normal Mode. As well as this, many bridges and tall cliff areas are now guarded by floating platforms manned by enemy archers in Master Mode, many of which also carrying treasure chests that have a high chance of containing a weapon with a modifier. The archers themselves also frequently drop all types of arrows (except Ancient Arrows) if you can beat them, making them a nice source of the more powerful arrow types. On top of that, all enemies also drop nearly double the amount of arrows and monster parts compared to Normal Mode (and not just the Master Mode exclusive mooks). Of course, you're likely to need them given that each enemy is moved up a colour level (which dictates how much HP and base attack power they have) from their forms in Normal Mode.\n• If you want anything resembling a happy ending in the Fatal Frame series, you need to play on hard difficulties. Sadly, at least for the first two games, the Downer Endings are the canon ones.\n• Ni no Kuni II: Revenant Kingdom originally did not have any hard modes, but added Hard and Expert modes in its version 1.03 patch. The higher difficultly levels provide better treasures from both monster drops and certain chests as a reward, as well as rare accessories with two skill slots.\n• Ys VI: The Ark of Napishtim: The Catastrophe modifier, despite being more difficult overall, does have some advantages over the standard item system. The auto-consume gimmick can be useful if the boss summons item dropping enemies, which wouldn't work on the standard item system unless Adol equipped the same kind of consumable that was dropped. Additionally, there are more Capla Waters available, which can be sold for thousands of gold. Finally, Croix will sell stat boosting seeds on Catastrophe, allowing the player to stat grind in the endgame.\n• Super Robot Wars X had the Expert Mode setting that makes enemies harder to defeat especially at the start of the game where your party consists of either the Glass Cannon type or the Fragile Speedster type and anyone who dies is an instant game over until the players get the Megafauna battleship and even the, the game doesn't get any easier until Simon and the Gurren Lagann join in the game. However, what makes Expert Mode special is that the SR points that players need to fulfill are obtained automatically as long as the player clears the stage without having to restart it. This allows players to easily get the Platinum Emblem (an item that gives you an extra turn after movement) compared to doing the SR point objective when the game is done on Standard Mode (and extra 10,000 cash).\n• Normally, Marathon puts a limit on the amount of ammunition you can carry at once. Playing on the hardest difficulty level removes this restriction.\n• Sacred Earth - Promise: Nightmare mode, the highest difficulty, will multiply EXP gain by 1.5, allowing characters to level up and learn skills faster. However, enemies give less EXP to higher-leveled party members, making this perk less impressive than it sounds.\n• Eternal Twilight has Hell mode, which is the highest difficulty, but gives bonus AP from both AP items and battles.\n• In Sushi Striker: The Way Of Sushido, equipping the Training Black Belt halves Musashi's HP. Indirectly, it also occupies Musashi's hold-item slot, preventing the use of any power-ups that could take that place. In return, however, any stages cleared holding the Training Black Belt will multiply the score earned in that stage by 1.5, making it much easier to gain S-Ranks and Rainbow S-Ranks. In addition, the Training Black Belt is tied to a lot of milestones in the game's Achievement System, which are necessary to increasing Musashi's Striker Rank to make it easier to recruit Sushi Sprites. Most of the late-game Sushi Sprites also have a minimum Striker Rank to be recruited at all.\n• In the Scholar of the First Sin edition of Dark Souls II, while it doesn't have difficulty settings per se, one Covenant causes enemies to constantly respawn instead of having a maximum number of spawns — which removes the strategic option of clearing out an area so you can just walk to the boss, but also allows significantly more grinding to be done.\n• In Rhythm Heaven Megamix, the Gatekeeper Trio's challenges cost less to attempt on harder difficulties, but require a higher score and give you less lives per attempt, so unless you can win them on your first try, you'll probably end up spending more on multiple hard mode attempts than one easy mode attempt.\n• In Just Shapes & Beats, playing on Hardcore difficulty doubles the amount of Beat Points you get.\n• Copy Kitty's Hard mode is effectively an entire second campaign (chronologically set after the first,) with remixed levels, new bosses, new solo weapons and a True Final Boss in the form of Isotope, Boki's first battle against a Cyber.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/HardModePerks", "media_links": ["/pmwiki/pmwiki.php/Franchise/Castlevania", "/pmwiki/pmwiki.php/VideoGame/CastlevaniaHarmonyOfDespair", "/pmwiki/pmwiki.php/VideoGame/CastlevaniaChroniclesOfSorrow", "/pmwiki/pmwiki.php/VideoGame/CastlevaniaPortraitOfRuin", "/pmwiki/pmwiki.php/VideoGame/CastlevaniaOrderOfEcclesia", "/pmwiki/pmwiki.php/VideoGame/CastlevaniaBloodlines", "/pmwiki/pmwiki.php/VideoGame/CastlevaniaTheAdventureRebirth", "/pmwiki/pmwiki.php/VideoGame/GranblueFantasy", "/pmwiki/pmwiki.php/VideoGame/StarWolves", "/pmwiki/pmwiki.php/VideoGame/WorldOfWarcraft", "/pmwiki/pmwiki.php/VideoGame/Diablo", "/pmwiki/pmwiki.php/VideoGame/DiabloIII", "/pmwiki/pmwiki.php/VideoGame/Sacred", "/pmwiki/pmwiki.php/VideoGame/DisneysMagicalQuest", "/pmwiki/pmwiki.php/VideoGame/DynastyWarriors", "/pmwiki/pmwiki.php/VideoGame/SamuraiWarriors", "/pmwiki/pmwiki.php/VideoGame/WarriorsOrochi", "/pmwiki/pmwiki.php/VideoGame/SengokuBasara", "/pmwiki/pmwiki.php/VideoGame/KingdomOfLoathing", "/pmwiki/pmwiki.php/VideoGame/MassEffect1", "/pmwiki/pmwiki.php/VideoGame/MassEffect2", "/pmwiki/pmwiki.php/VideoGame/ValkyrieProfile", "/pmwiki/pmwiki.php/VideoGame/Touhou", "/pmwiki/pmwiki.php/VideoGame/SuperMarioBros", "/pmwiki/pmwiki.php/VideoGame/SpaceRangers", "/pmwiki/pmwiki.php/VideoGame/XCOM", "/pmwiki/pmwiki.php/VideoGame/SuperSmashBros", "/pmwiki/pmwiki.php/VideoGame/SuperSmashBrosBrawl", "/pmwiki/pmwiki.php/VideoGame/KidIcarusUprising", "/pmwiki/pmwiki.php/VideoGame/DungeonSiege", "/pmwiki/pmwiki.php/Franchise/KingdomHearts", "/pmwiki/pmwiki.php/VideoGame/KingdomHeartsII", "/pmwiki/pmwiki.php/VideoGame/KingdomHeartsBirthBySleep", "/pmwiki/pmwiki.php/VideoGame/Mushihimesama", "/pmwiki/pmwiki.php/VideoGame/Columns", "/pmwiki/pmwiki.php/Franchise/StarWars", "/pmwiki/pmwiki.php/VideoGame/Tempest", "/pmwiki/pmwiki.php/VideoGame/Klax", "/pmwiki/pmwiki.php/VideoGame/BeatmaniaIIDX", "/pmwiki/pmwiki.php/VideoGame/JakIIRenegade", "/pmwiki/pmwiki.php/VideoGame/Jak3Wastelander", "/pmwiki/pmwiki.php/VideoGame/RatchetDeadlocked", "/pmwiki/pmwiki.php/VideoGame/SuperRobotWars", "/pmwiki/pmwiki.php/VideoGame/Qbert", "/pmwiki/pmwiki.php/VideoGame/DonPachi", "/pmwiki/pmwiki.php/VideoGame/TheWorldEndsWithYou", "/pmwiki/pmwiki.php/VideoGame/DJMAX", "/pmwiki/pmwiki.php/VideoGame/Fallout", "/pmwiki/pmwiki.php/VideoGame/Fallout3", "/pmwiki/pmwiki.php/VideoGame/FalloutNewVegas", "/pmwiki/pmwiki.php/VideoGame/Fallout4", "/pmwiki/pmwiki.php/VideoGame/RainbowSix", "/pmwiki/pmwiki.php/VideoGame/Terraria", "/pmwiki/pmwiki.php/VideoGame/TalesSeries", "/pmwiki/pmwiki.php/VideoGame/TalesOfSymphonia", "/pmwiki/pmwiki.php/VideoGame/TalesOfGracesF", "/pmwiki/pmwiki.php/VideoGame/FireEmblem", "/pmwiki/pmwiki.php/VideoGame/FireEmblemTheBindingBlade", "/pmwiki/pmwiki.php/VideoGame/FireEmblemTheBlazingBlade", "/pmwiki/pmwiki.php/VideoGame/FireEmblemFates", "/pmwiki/pmwiki.php/VideoGame/BitTrip", "/pmwiki/pmwiki.php/VideoGame/ResidentEvil3Nemesis", "/pmwiki/pmwiki.php/VideoGame/ResidentEvil4", "/pmwiki/pmwiki.php/VideoGame/ParasiteEve2", "/pmwiki/pmwiki.php/VideoGame/StreetsOfRage", "/pmwiki/pmwiki.php/VideoGame/Bastion", "/pmwiki/pmwiki.php/VideoGame/Transistor", "/pmwiki/pmwiki.php/VideoGame/KidIcarusUprising", "/pmwiki/pmwiki.php/VideoGame/MegaManLegends", "/pmwiki/pmwiki.php/VideoGame/MegaManLegends", "/pmwiki/pmwiki.php/VideoGame/GhostRecon", "/pmwiki/pmwiki.php/VideoGame/GuildWars", "/pmwiki/pmwiki.php/VideoGame/GuildWars2", "/pmwiki/pmwiki.php/VideoGame/PAYDAYTheHeist", "/pmwiki/pmwiki.php/VideoGame/PAYDAY2", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaSkywardSword", "/pmwiki/pmwiki.php/VideoGame/GainGround", "/pmwiki/pmwiki.php/VideoGame/Contra", "/pmwiki/pmwiki.php/VideoGame/MarvelUltimateAlliance", "/pmwiki/pmwiki.php/VideoGame/Doom", "/pmwiki/pmwiki.php/VideoGame/SeriousSam", "/pmwiki/pmwiki.php/VideoGame/MetalGearRisingRevengeance", "/pmwiki/pmwiki.php/VideoGame/Drakensang", "/pmwiki/pmwiki.php/VideoGame/DawnOfWar", "/pmwiki/pmwiki.php/VideoGame/DevilMayCry", "/pmwiki/pmwiki.php/VideoGame/DevilMayCry4", "/pmwiki/pmwiki.php/VideoGame/DevilMayCry1", "/pmwiki/pmwiki.php/VideoGame/WayOfTheSamurai", "/pmwiki/pmwiki.php/VideoGame/ArmoredCore", "/pmwiki/pmwiki.php/VideoGame/Tyrian", "/pmwiki/pmwiki.php/VideoGame/HaloCombatEvolved", "/pmwiki/pmwiki.php/VideoGame/DoubleDragonNeon", "/pmwiki/pmwiki.php/VideoGame/Hellsinker", "/pmwiki/pmwiki.php/VideoGame/GHOSTSquad", "/pmwiki/pmwiki.php/VideoGame/StarFox64", "/pmwiki/pmwiki.php/VideoGame/PopnMusic", "/pmwiki/pmwiki.php/Series/TheChase", "/pmwiki/pmwiki.php/VideoGame/CrimzonClover", "/pmwiki/pmwiki.php/VideoGame/ElementalGearbolt", "/pmwiki/pmwiki.php/Creator/WorkingDesigns", "/pmwiki/pmwiki.php/Franchise/Disgaea", "/pmwiki/pmwiki.php/VideoGame/DisgaeaDimension2", "/pmwiki/pmwiki.php/VideoGame/Disgaea2CursedMemories", "/pmwiki/pmwiki.php/VideoGame/Disgaea5AllianceOfVengeance", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyXIII2", "/pmwiki/pmwiki.php/VideoGame/LightningReturnsFinalFantasyXIII", "/pmwiki/pmwiki.php/VideoGame/OneWayHeroics", "/pmwiki/pmwiki.php/VideoGame/DaytonaUSA", "/pmwiki/pmwiki.php/VideoGame/X", "/pmwiki/pmwiki.php/VideoGame/CitizensOfEarth", "/pmwiki/pmwiki.php/VideoGame/DyingLight", "/pmwiki/pmwiki.php/VideoGame/SonicAdventure2", "/pmwiki/pmwiki.php/Literature/WheresWally", "/pmwiki/pmwiki.php/VideoGame/SATAZIUS", "/pmwiki/pmwiki.php/VideoGame/DigitalDevilSaga", "/pmwiki/pmwiki.php/VideoGame/DigimonStoryCyberSleuth", "/pmwiki/pmwiki.php/VideoGame/CrossBeats", "/pmwiki/pmwiki.php/VideoGame/Minecraft", "/pmwiki/pmwiki.php/VideoGame/BlueRevolver", "/pmwiki/pmwiki.php/VideoGame/DragonsDogma", "/pmwiki/pmwiki.php/VideoGame/RakenzarnFrontierStory", "/pmwiki/pmwiki.php/VideoGame/Ristar", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaBreathOfTheWild", "/pmwiki/pmwiki.php/VideoGame/FatalFrame", "/pmwiki/pmwiki.php/VideoGame/NiNoKuniIIRevenantKingdom", "/pmwiki/pmwiki.php/VideoGame/SuperRobotWarsX", "/pmwiki/pmwiki.php/Anime/GundamReconguistaInG", "/pmwiki/pmwiki.php/Anime/TengenToppaGurrenLagann", "/pmwiki/pmwiki.php/VideoGame/Marathon", "/pmwiki/pmwiki.php/VideoGame/SacredEarthPromise", "/pmwiki/pmwiki.php/VideoGame/EternalTwilight", "/pmwiki/pmwiki.php/VideoGame/SushiStrikerTheWayOfSushido", "/pmwiki/pmwiki.php/VideoGame/DarkSoulsII", "/pmwiki/pmwiki.php/VideoGame/RhythmHeaven", "/pmwiki/pmwiki.php/VideoGame/JustShapesAndBeats", "/pmwiki/pmwiki.php/VideoGame/CopyKitty"], "non_media_links": ["/pmwiki/pmwiki.php/Main/CosmeticAward", "/pmwiki/pmwiki.php/Main/EarlyGameHell", "/pmwiki/pmwiki.php/Main/NonIndicativeDifficulty", "/pmwiki/pmwiki.php/Main/UnstableEquilibrium", "/pmwiki/pmwiki.php/Main/EasyModeMockery", "/pmwiki/pmwiki.php/Main/LevelGrinding", "/pmwiki/pmwiki.php/Main/BraggingRightsReward", "/pmwiki/pmwiki.php/Main/GoldenEnding", "/pmwiki/pmwiki.php/Main/Cap", "/pmwiki/pmwiki.php/Main/FakeDifficulty", "/pmwiki/pmwiki.php/Main/NewGamePlus", "/pmwiki/pmwiki.php/Videogame/ForzaMotorsport", "/pmwiki/pmwiki.php/Main/DrivingStick", "/pmwiki/pmwiki.php/Main/RandomDrops", "/pmwiki/pmwiki.php/Main/NewGamePlus", "/pmwiki/pmwiki.php/Main/HitPoints", "/pmwiki/pmwiki.php/Main/HeartContainer", "/pmwiki/pmwiki.php/Main/HarderThanHard", "/pmwiki/pmwiki.php/Main/DuelingGames", "http://kol.coldfront.net/thekolwiki/index.php/Ascension#Rewards", "/pmwiki/pmwiki.php/Main/NewGamePlus", "http://kol.coldfront.net/thekolwiki/index.php/Unblemished_Uniform", "/pmwiki/pmwiki.php/Main/ExtendedGameplay", "http://kol.coldfront.net/thekolwiki/index.php/Transparent_Trappings", "http://kol.coldfront.net/thekolwiki/index.php/Blasphemous_Bedizenment", "/pmwiki/pmwiki.php/Main/GoldenEnding", "/pmwiki/pmwiki.php/Main/SuperMode", "/pmwiki/pmwiki.php/Main/PowerUp", "/pmwiki/pmwiki.php/Main/SmartBomb", "/pmwiki/pmwiki.php/Main/OneUp", "/pmwiki/pmwiki.php/Main/DifficultButAwesome", "/pmwiki/pmwiki.php/Main/EnemyMine", "/pmwiki/pmwiki.php/Main/MisguidedMissile", "/pmwiki/pmwiki.php/Main/TrueFinalBoss", "/pmwiki/pmwiki.php/Main/NewGamePlus", "/pmwiki/pmwiki.php/Main/EasyModeMockery", "/pmwiki/pmwiki.php/Main/OneHundredPercentCompletion", "/pmwiki/pmwiki.php/Main/HarderThanHard", "/pmwiki/pmwiki.php/Main/BonusBoss", "/pmwiki/pmwiki.php/Main/UpdatedRerelease", "/pmwiki/pmwiki.php/Main/SelfImposedChallenge", "/pmwiki/pmwiki.php/Main/LowLevelRun", "/pmwiki/pmwiki.php/Main/HarderThanHard", "/pmwiki/pmwiki.php/Main/BulletHell", "/pmwiki/pmwiki.php/Main/EveryTenThousandPoints", "/pmwiki/pmwiki.php/Main/Cap", "/pmwiki/pmwiki.php/Main/EndlessGame", "/pmwiki/pmwiki.php/Main/VideoGameLives", "/pmwiki/pmwiki.php/Main/OneHitPointWonder", "/pmwiki/pmwiki.php/Main/DifficultySpike", "/pmwiki/pmwiki.php/Main/HundredPercentCompletion", "/pmwiki/pmwiki.php/Main/NewGamePlus", "/pmwiki/pmwiki.php/Main/DynamicDifficulty", "/pmwiki/pmwiki.php/Main/VideoGameRemake", "/pmwiki/pmwiki.php/Main/HarderThanHard", "/pmwiki/pmwiki.php/Main/ThatOneBoss", "/pmwiki/pmwiki.php/Main/SuperMode", "/pmwiki/pmwiki.php/Main/LevelGrinding", "/pmwiki/pmwiki.php/Main/MiniGame", "/pmwiki/pmwiki.php/Main/LifeMeter", "/pmwiki/pmwiki.php/Main/PlayerCharacter", "/pmwiki/pmwiki.php/Main/BossInMookClothing", "/pmwiki/pmwiki.php/Main/NintendoHard", "/pmwiki/pmwiki.php/Main/NewGamePlus", "/pmwiki/pmwiki.php/Main/NewGamePlus", "/pmwiki/pmwiki.php/Main/NintendoHard", "/pmwiki/pmwiki.php/Main/ForcedTutorial", "/pmwiki/pmwiki.php/Main/RecurringBoss", "/pmwiki/pmwiki.php/Main/BottomlessMagazines", "/pmwiki/pmwiki.php/Main/BraggingRightsReward", "/pmwiki/pmwiki.php/Main/NewGamePlus", "/pmwiki/pmwiki.php/Main/PlatformHell", "/pmwiki/pmwiki.php/Main/GameWithinAGame", "/pmwiki/pmwiki.php/Main/Retraux", "/pmwiki/pmwiki.php/Main/SwordBeam", "/pmwiki/pmwiki.php/UsefulNotes/SegaGenesis", "/pmwiki/pmwiki.php/Main/FinalDeath", "/pmwiki/pmwiki.php/Main/GoldenEnding", "/pmwiki/pmwiki.php/Main/EasyModeMockery", "/pmwiki/pmwiki.php/Main/EnforcedTrope", "/pmwiki/pmwiki.php/Main/IdiosyncraticDifficultyLevels", "/pmwiki/pmwiki.php/Main/CounterAttack", "/pmwiki/pmwiki.php/Main/RandomDrop", "/pmwiki/pmwiki.php/Main/RandomlyDrops", "/pmwiki/pmwiki.php/Main/LastLousyPoint", "/pmwiki/pmwiki.php/Main/ContinuityCameo", "/pmwiki/pmwiki.php/Main/HarderThanHard", "/pmwiki/pmwiki.php/Main/HarderThanHard", "/pmwiki/pmwiki.php/Main/VideoGameLives", "/pmwiki/pmwiki.php/Main/Every10000Points", "/pmwiki/pmwiki.php/Main/ScoringPoints", "/pmwiki/pmwiki.php/Main/DynamicDifficulty", "/pmwiki/pmwiki.php/Main/Cap", "/pmwiki/pmwiki.php/Main/MercyMode", "/pmwiki/pmwiki.php/Main/InterfaceScrew", "/pmwiki/pmwiki.php/Main/SelfImposedChallenge", "/pmwiki/pmwiki.php/Main/EasyModeMockery", "/pmwiki/pmwiki.php/SugarWiki/MomentOfAwesome", "/pmwiki/pmwiki.php/Main/GoldenSnitch", "/pmwiki/pmwiki.php/Main/DifficultyByRegion", "/pmwiki/pmwiki.php/Main/LevelGrinding", "/pmwiki/pmwiki.php/Main/GeoEffects", "/pmwiki/pmwiki.php/Main/InfinityPlusOneSword", "/pmwiki/pmwiki.php/Main/NewGamePlus", "/pmwiki/pmwiki.php/Main/PowersAsPrograms", "/pmwiki/pmwiki.php/Main/FinalBoss", "/pmwiki/pmwiki.php/Main/GameMod", "/pmwiki/pmwiki.php/Main/HardCodedHostility", "/pmwiki/pmwiki.php/Main/HarderThanHard", "/pmwiki/pmwiki.php/Main/EasyModeMockery", "/pmwiki/pmwiki.php/Main/BossInMooksClothing", "/pmwiki/pmwiki.php/Main/HarderThanHard", "/pmwiki/pmwiki.php/Main/BossBonanza", "/pmwiki/pmwiki.php/Main/FinalBoss", "/pmwiki/pmwiki.php/Main/NewGamePlus", "/pmwiki/pmwiki.php/Main/ContinuingIsPainful", "/pmwiki/pmwiki.php/Main/CommonplaceRare", "/pmwiki/pmwiki.php/Main/DemonicSpider", "/pmwiki/pmwiki.php/Main/ShmuckBait", "/pmwiki/pmwiki.php/Main/EveryTenThousandPoints", "/pmwiki/pmwiki.php/Main/HarderThanHard", "/pmwiki/pmwiki.php/Main/PlayerCharacter", "/pmwiki/pmwiki.php/Videogame/AgentsOfMayhem", "/pmwiki/pmwiki.php/Main/EasyModeMockery", "/pmwiki/pmwiki.php/Main/OneHitPointWonder", "/pmwiki/pmwiki.php/Main/LawOfChromaticSuperiority", "/pmwiki/pmwiki.php/Main/DownerEnding", "/pmwiki/pmwiki.php/Main/HarderThanHard", "/pmwiki/pmwiki.php/Videogame/YsVITheArkOfNapishtim", "/pmwiki/pmwiki.php/Main/NoItemUseForYou", "/pmwiki/pmwiki.php/Main/RareCandy", "/pmwiki/pmwiki.php/Main/GlassCannon", "/pmwiki/pmwiki.php/Main/FragileSpeedster", "/pmwiki/pmwiki.php/Main/RankInflation", "/pmwiki/pmwiki.php/Main/AchievementSystem", "/pmwiki/pmwiki.php/Main/DefeatMeansFriendship", "/pmwiki/pmwiki.php/Main/TrueFinalBoss"]}