{"title": "Last Minute Project", "content": "Bart: Hey, I didn't know this park was here. \n\nLisa: You wrote a report on it last week. \n\nBart: The Internet wrote it. I just handed it in. Hey, I didn't know this park was here.You wrote a report on it last week.The Internet wrote it. I just handed it in.\n\nExactly What It Says on the Tin.\n\nWhen a school project or other work that requires research is so bad, it's plainly seen that the character didn't even try to study, or in some cases didn't get a chance to study. Usually they either make up some random and awfully incorrect nonsense or plagiarize from the internet within 24 hours of the project being due.\n• Calvin and Hobbes: Calvin writes a report about bats in which he calls them bugs, uses a lot of vampire myths, and includes an \"illustration\" consisting of the Batman logo with fangs added. He thinks that having a professional binder will cover up for his lack of research, but it backfires when everyone in the class calls him out for saying bats are bugs.\n• Another time, Calvin and Susie had to do a joint presentation about the planet Mercury. Despite regular reminders from Susie, Calvin failed to do any research for his part of the talk, tried to stall for time by launching into a Stand-Up Comedy routine, and in the end simply made up outrageous things on the spot. Cue Susie advancing toward him with her fist.\n• Then there was the infamous insect collection project. Calvin had an entire month to put together a collection of 50 arthropods and scientifically label them, which he completely forgot about until the morning it was due. He then frantically starts trying to get whatever he can on what little time he has left. All he gets is a drowned worm, a smashed fly, a live ant, and a piece of lint that looks like a bug.\n• And, of course, there was the time he had to write a short story. After goofing off most of the afternoon, Calvin finally gets an idea: he'll use Time Travel to get the completed project from himself two hours in the future! Hilarity Ensues, but eventually Calvin returns empty-handed. Luckily, Hobbes had written a story in the meantime, which Calvin happily accepts. However, Calvin doesn't actually read Hobbes' story until he has to read it out loud to the entire class the next day... at which point he discovers it's Hobbes mocking the whole situation (though to his credit, he gets an A+ on it).\n• Calvin once tries to justify his tendency to do this. When Hobbes points out that he should be working on the project instead of goofing off, Calvin says he's not in the right mood. Hobbes: What mood is that? \n\nCalvin: Last-minute panic.\n• Peter has a habit of doing this in FoxTrot, including writing an essay on Moby-Dick in two and a half hours on the morning of the day it was due.\n• One early strip forced Jason to do this; he did put real effort into his project (a scale replica of the Statue of Liberty made out of toothpicks), but then he made the mistake of 1) giving it a firecracker as a torch, and 2) lighting it the night before in order to show off to Peter. Miss Grinchley: And now, Jason Fox will present his model on... \n\nJason: Chicago, circa 1871.\n• Syngenesophobia: Chapter 31 contains a rare positive example. During art class, while his classmates are all well into their projects, Lincoln doesn't even know what to draw. He panics when he sees that the teacher, who has been making his way around the room student to student, is now at Ronnie Anne, who is the student next to him. Desperate to have something for his teacher to see so not to get punished, he draws what he has been seeing in his dreams. He ends up creating a large, incredibly complex and high quality drawing in the space of a few minutes. When his teacher sees it, he is so impressed he doesn't even stop to tell Lincoln where to improve his work before moving onto the next student.\n• Holden from The Catcher in the Rye, wrote a hilarious and definitely unresearched exam essay on the Egyptians.\n• Almost EVERY report in Diary of a Wimpy Kid. Including one biology project on whether or not plants sneeze.\n• A young Shawn from Psych did a book report on Charlotte's Web without reading to the end. Failure ensued.\n• On an early Boy Meets World episode, Feeny assigns the class a project on what their future might be like. Cory just shows up in a baseball uniform and claims he'll be a pro ballplayer. Feeny's line of questioning shows that Cory hasn't put much thought into it, and he is given a chance to try again.\n• Brick from The Middle often has to do these - paradoxically, he's probably the smartest of the Heck kids, but he gets distracted easily at school, and thus is not paying attention when the assignment is handed out. One notable example is when he's elected class historian and has one whole year to do a slideshow for graduation day. He doesn't remember to do it until a week before.\n• Sam on iCarly once turned in an orange for a project about environmental efficiency. She got an A. Inverted in the same episode when Freddie and Carly each do elaborate projects (Carly created an electric scooter, Freddie a large composter) and they both fail, having to go on a root and berry trip with their teacher.\n• Happens in the Even Stevens episode ''Influenza''. To her horror Ren realizes that she isn't prepared to give her project on the US moon landing and only knows what year it occurred. She tries to save face... in song: \"We went to the moon in 1969/Not 1968 but the year after...\" and proceeds to sing about what celestial bodies NASA didn't visit that year. She failed the project. Lucky for her it was All Just a Dream\n• There's a Saved by the Bell episode in which Zack needs to do a family heritage project. All he knows is that he is part Native American, so he just uses a whole bunch of stereotypes (and Screech) to present his project. You bet your life he's forced to redo his project.\n• Played with and subverted in The Troop: Jake forgot to do his potato clock for school, but Felix didn't. It would obviously be identified as a Felix project if it was perfect, so he \"Jaked it up\" a little to get Jake a passing grade but not an A.\n• One of the more famous Strong Bad e-mails on Homestar Runner involved Strong Bad writing one of these for a student. Naturally, he hung a lampshade by including a sentence about sitting and playing video games for several hours.\n• There was also his diorama, \"The whimsical world of school supplies.\"\n• The Lord of the Rings webpage \"Your Homework Done For Free \" is an intentional trap for people who try to rip their book report off the Internet. It comprises a completely inaccurate summary of the novels, and a list of suggested report topics that focuses on the bits they've made up. Amusingly, the Sunday Times fell for it.\n• The infamous and awesome How to Kill a Mockingbird in its entirety.\n• In Kingdom Hearts II, Hayner, Pence, Olette, and Roxas put off a summer independent study until they only have three days of summer vacation left. At Pence's suggestion, they decide to investigate seven rumors surrounding Twilight Town. With the exception of \"The Spooky Steps\" (which was the result of Rai miscounting them), all of them had something to do with organization XIII.\n• Any report Bart has done on The Simpsons.\n• Another time on The Simpsons in \"Lisa the Simpson\" Lisa forgot about a school agriculture project, so she makes a pig by sticking some pushpins into an eraser.\n• Which was done earlier in Simpsons Comics. Ralph Wiggum entered the same thing in a school art show. He didn't place.\n• From a Halloween episode: Bart: From 'A' apple to 'Z' zebra, Baby's First Popup Book is 26 pages of alphabetical adventure! \n\nMs. Krabappel: Bart, you mean to tell me you read a book intended for preschoolers? \n\nBart: Well, most of it.\n• Arthur: Arthur, Buster, and Binky are teamed up for a report on an exhibit at the art museum. Binky is convinced that one of the abstract art pieces was hung sideways and wants to do the report on that. Arthur and Buster think that will make them look like a bunch of idiots. They finally agree to let Binky work on his project while Arthur and Buster do a different exhibit. Only they waste so much time worrying about Binky's project that they forget to write the report and copy it from the museum's brochure. The other kids in the class literally follow along as they read it. They are only saved when Binky's half turns out to involve masses of research, a letter to the artist, and a video of the museum re-hanging the painting in response to his project.\n• A Robot Chicken skit begins with an elaborate battle between costumed heroes and villains, one of whom is called Mockingbird. The skit then cuts to a classroom, revealing the whole thing was a kid's attempt at a book report on \"To Kill a Mockingbird\". The teacher sighs, \"Couldn't even spring for the Cliff's Notes, huh?\"\n• In Osmosis Jones, during a Flashback to a science fair, a struggling student was given a project about using oysters to filter water. The teacher remarks that the student most likely just started the project the morning of the science fair, but that she was going to give him an A anyway to give him a leg up. Mr. DiTorre ate one of the oysters, and Ozzy made him puke. Which got Ozzy \"suspended for use of unnecessary force.\"\n• In The Kids From Room 402 episode \"The One Man Committee\", Jessie is preparing a report on Christopher Columbus with two other kids. The entire extent of his studying is reading a single sentence (\"Christopher Columbus, the discoverer of America, was born in Genoa\"), and during the presentation he leaves it to his partners to answer every question, leading to all three of them receiving C's. To make up for it, Jessie is allowed to prepare another report... except this time, all of his studying consists of watching 1492: Conquest of Paradise. Or rather, reading a review of the film, because he didn't feel like watching it all the way through.\n• In the Sonic Boom episode, \"Mombot\", Lady Walrus' Son's science project is revealed to be a rock. Comedy Chimp, who is the judge, sees it and asks him if he waited until the last minute.\n• Brian Regan has a famous bit in his stand-up about his \"Cup of Dirt \" in the science fair.\n• Dave Barry wrote a column about these , including his own example of one on the Monroe Doctrine.\n• Dave Barry has a few columns about this. In one, he describes one of his projects as being entitled \"The Phases of the Moon\", consisting of a styrofoam ball, half of it scribbled black with a pen, on a string. He goes on to say that his fellow students found it amusing to use the ball in their own projects, so he ended up with a big Official Science Fair Project Cardboard and nothing else. His wife's project (Movement of the Waves) was described as a pan of water in which a pen was swished around, causing waves.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/LastMinuteProject", "media_links": ["/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/Franchise/Batman", "/pmwiki/pmwiki.php/Literature/MobyDick", "/pmwiki/pmwiki.php/Literature/TheCatcherInTheRye", "/pmwiki/pmwiki.php/Literature/DiaryOfAWimpyKid", "/pmwiki/pmwiki.php/Series/Psych", "/pmwiki/pmwiki.php/Literature/CharlottesWeb", "/pmwiki/pmwiki.php/Series/BoyMeetsWorld", "/pmwiki/pmwiki.php/Series/TheMiddle", "/pmwiki/pmwiki.php/Series/ICarly", "/pmwiki/pmwiki.php/Series/EvenStevens", "/pmwiki/pmwiki.php/Series/SavedByTheBell", "/pmwiki/pmwiki.php/Series/TheTroop", "/pmwiki/pmwiki.php/Literature/TheLordOfTheRings", "/pmwiki/pmwiki.php/VideoGame/KingdomHeartsII", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/WesternAnimation/Arthur", "/pmwiki/pmwiki.php/WesternAnimation/RobotChicken", "/pmwiki/pmwiki.php/Literature/ToKillAMockingbird", "/pmwiki/pmwiki.php/Film/OsmosisJones", "/pmwiki/pmwiki.php/WesternAnimation/TheKidsFromRoom402", "/pmwiki/pmwiki.php/Film/FourteenNinetyTwoConquestOfParadise", "/pmwiki/pmwiki.php/WesternAnimation/SonicBoom", "/pmwiki/pmwiki.php/Creator/BrianRegan", "/pmwiki/pmwiki.php/Creator/DaveBarry", "/pmwiki/pmwiki.php/Creator/DaveBarry"], "non_media_links": ["/pmwiki/pmwiki.php/Main/ExactlyWhatItSaysOnTheTin", "/pmwiki/pmwiki.php/Main/BookDumb", "/pmwiki/pmwiki.php/Main/CriticalResearchFailure", "/pmwiki/pmwiki.php/Main/RidiculousProcrastinator", "/pmwiki/pmwiki.php/Main/CreatorsApathy", "/pmwiki/pmwiki.php/Main/ComicStrips", "/pmwiki/pmwiki.php/ComicStrip/CalvinAndHobbes", "/pmwiki/pmwiki.php/Main/StandUpComedy", "/pmwiki/pmwiki.php/Main/TimeTravel", "/pmwiki/pmwiki.php/Main/HilarityEnsues", "/pmwiki/pmwiki.php/Main/ThrowTheDogABone", "/pmwiki/pmwiki.php/ComicStrip/FoxTrot", "/pmwiki/pmwiki.php/Main/FanWorks", "/pmwiki/pmwiki.php/Fanfic/Syngenesophobia", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/Series", "/pmwiki/pmwiki.php/Main/GettingCrapPastTheRadar", "/pmwiki/pmwiki.php/Main/MusicalEpisode", "/pmwiki/pmwiki.php/Main/ShapedLikeItself", "/pmwiki/pmwiki.php/Main/AllJustADream", "/pmwiki/pmwiki.php/Main/WebOriginal", "http://www.homestarrunner.com/sbemail64.html", "/pmwiki/pmwiki.php/WebAnimation/HomestarRunner", "/pmwiki/pmwiki.php/Main/LampshadeHanging", "http://flyingmoose.org/tolksarc/homework.htm", "http://flyingmoose.org/tolksarc/blanchett.htm", "/pmwiki/pmwiki.php/WebAnimation/HowToKillAMockingbird", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/TheDitz", "/pmwiki/pmwiki.php/Main/Foreshadowing", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/TheSimpsons", "/pmwiki/pmwiki.php/Main/GeniusDitz", "/pmwiki/pmwiki.php/Main/Flashback", "/pmwiki/pmwiki.php/Main/NoGoodDeedGoesUnpunished", "/pmwiki/pmwiki.php/Recap/SonicBoomS2E21Mombot", "https://www.youtube.com/watch?v=f4XSgLMEFoc", "http://community.seattletimes.nwsource.com/archive/?date=19951211&slug=2157084"]}