{"title": "Rules Are For Humans", "content": "In a computer adaptation of an existing game, the AI may have the ability to pull off moves which are against the rules of the game.\n\nNote that this does not include simple extra rules. For example, a chess variant in which the queens can move as knights isn't cheating if applied consistently. However, if the AI's queen can move as a knight but the player's queen can't, then that's cheating.\n\nCompare My Rules Are Not Your Rules and The Computer Is a Cheating Bastard.\n• A certain chess program, when it was close to losing, would actually flash the message \"The [piece] has escaped!\" and one of the captured pieces would reappear on the board. Obviously, only the computer's pieces ever 'escaped'. One hopes that this isn't how Deep Blue beat Garry Kasparov (judging by the fact that Deep Blue wasn't smashed to pieces under mysterious circumstances shortly afterward, it probably wasn't).\n• National Lampoon's Chess Maniac 5 Billion and 1 (yes, there was such a thing) cheated constantly, though this was part of the point.\n• The final boss of the Microprose Magic: The Gathering PC game has an absurd amount of health, in addition to starting with several permanents in play. However, by the time you fight him, you've already foiled his plans; win or lose, you win, and the amount of damage you rack up simply determines how long he's banished from your world. Additionally, his five-color deck is quite impractical, so it's very possible to run down his health as he tries to get the proper types of mana to cast his spells.\n• Yu-Gi-Oh video games are fond of this all around:\n• The final boss in Yu-Gi-Oh! Reshef of Destruction starts with 40,000 life points, when the rules say players start with 8,000. He also appears immediately after a similarly tough boss (who begins with 20,000 LP), and the player's Life Points (which are likely depleted from the previous fight) carries over between duels. That, and both bosses can and will use multiple copies of game-breaking cards which the player can normally use only 1 of.\n• Yu-Gi-Oh Online Duel Evolution provides you with NPCs to duel as well as other humans. The game imposes the current ban/restricted lists of the card game on your deck, meaning there's certain cards you can't use even though you may own them. The NPCs are not under these restrictions, leaving you saying, \"Boy, I wish I could play Pot of Greed/Snatch Steal/Ring of Destruction.\"\n• In the Tag Force series, the appropriate sentiment would be: \"Boy, I wish I could play three copies of a card that's limited to one\".\n• The final boss of the first chapter of Digimon Digital Card Battle cheats as a plot device.\n• In the Dragon Ball Z CCG video game, Cell gets extra benefits from cards that normally only apply if you declare a Favorite Fighting Style Advantage. Partially justified in that he's a DNA composite of all the heroes — but he can't do this in the card game the video game is based on.\n• A computer version of Avalon Hill's board game Diplomacy allows fleets to support attacks into adjacent inland provinces or coastal provinces that share only a land border, though this is more likely a programming glitch than deliberate cheating. The interface does not allow a human player to submit such an order.\n• Inverted in Neverwinter Nights 2, with the Frenzied Berserker. In the Dungeons & Dragons rules, that class gets an ability called \"Deathless Frenzy\" which means the berserker can not die as long as his frenzy lasts. Players in the video game are mysteriously missing this power, but a boss enemy does have it— meaning that in this case it's the computer who follows the rules.\n• There was once an electronic Tic Tac Toe game in the Sydney Powerhouse Museum, which was literally impossible to win, thanks to this trope. The computer's flawed programming meant that it could override a box you had put your \"O\" in with one of its own \"X\"s, meaning that the computer would always win in three or four moves, no matter what you did.\n• Baldur's Gate is based on the 2nd edition AD&D rules of Dungeons & Dragons and generally follows a Pragmatic Adaptation of the rules. Enemy mages, however, break the system. They're able to put spells into Spell Triggers and Contingencies that are not legal for player characters in tabletop or the game, they're able to have multiple Spell Triggers and Contingencies (which is also illegal) and finally they have the ability to use an ability called the 'tattoo of power' to grant them an extra layer of instant defence, which does not exist in Pen-And-Paper and is inaccessible to the party. This may be intended to represent the buffs they set up earlier in the day, since the game's engine doesn't normally allow them to cast until the fight begins.\n• The new Dorn companion in the Enhanced Edition is a breach — in 2E and consequently Baldur's Gate, only humans could be paladins. Dorn is a non-human paladin (of the Blackguard kit, but kits as implemented in Baldur's Gate can only change allowed alignments, not allowed races).\n• Not that the base game was entirely free of this either. Coran and Kagain had impossibly high ability scores (only doable using special tomes), Edwin can cast two more spells per day than any player-created wizard can, and Aerie is an elven mage/cleric, which is a multiclass only permitted by gnomes and half-elves. On the other hand, the restriction of paladins to humans is a significant element of one party member's backstory.\n• AI players in the 2010 Blood Bowl adaptation randomly acquire traits, which can lead to AI players with the grab + frenzy combo. This combo is outright stated to be illegal in the Blood Bowl rulebook, and in both traits' descriptions in-game.\n• In World of Warcraft, the Chess event in the Karazhan raid has Medivh cheat every so often by doing things like setting your pieces on fire. The game explicitly tells you that Medivh is cheating. This is by design - in the original version of this event, Medivh did not cheat and as a result, the event was extremely easy. Characters capable of stealth soon discovered they were able to creep directly to this event, solo it and collect free loot. Medivh's cheating prevented this and ensured that a full party was required to complete the event.\n• Crash Bash had the crystal challenges, where special rules were placed on the humans. Depending on the mini game that could mean the stage hazard was a one hit kill for you or you couldn't use a certain ability (as such picking up crates in Three Round Deathmatch stages). Computers would exploit them constantly.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/RulesAreForHumans", "media_links": ["/pmwiki/pmwiki.php/TabletopGame/Chess", "/pmwiki/pmwiki.php/VideoGame/MagicTheGathering", "/pmwiki/pmwiki.php/VideoGame/YuGiOhReshefOfDestruction", "/pmwiki/pmwiki.php/VideoGame/DigimonDigitalCardBattle", "/pmwiki/pmwiki.php/Manga/DragonBall", "/pmwiki/pmwiki.php/VideoGame/NeverwinterNights2", "/pmwiki/pmwiki.php/TabletopGame/DungeonsAndDragons", "/pmwiki/pmwiki.php/VideoGame/BaldursGate", "/pmwiki/pmwiki.php/TabletopGame/DungeonsAndDragons", "/pmwiki/pmwiki.php/TabletopGame/BloodBowl", "/pmwiki/pmwiki.php/VideoGame/WorldOfWarcraft", "/pmwiki/pmwiki.php/VideoGame/CrashBash"], "non_media_links": ["/pmwiki/pmwiki.php/Main/VideoGameAI", "/pmwiki/pmwiki.php/Main/MyRulesAreNotYourRules", "/pmwiki/pmwiki.php/Main/TheComputerIsACheatingBastard", "http://i.imgur.com/bvNpg.jpg", "/pmwiki/pmwiki.php/Main/GameBreaker", "/pmwiki/pmwiki.php/Main/ImplacableMan", "/pmwiki/pmwiki.php/Main/PragmaticAdaptation", "/pmwiki/pmwiki.php/Main/UpdatedRerelease", "/pmwiki/pmwiki.php/Main/ObviousRulePatch", "/pmwiki/pmwiki.php/Main/ThreeRoundDeathmatch"]}