{"title": "Down to the Last Match", "content": "When fictional characters desperately need to light something with a match, they will likely find only three or so remaining in the matchbook or box. All but the last will be duds or blow out, and the last will probably do its share of flickering but stay lit.\n\nSubtrope of Hard-to-Light Fire. See also Going by the Matchbook, Tentative Light, One Bullet Left.\n\nNot to be confused with Down to the Last Play, an analogous trope about sports competition.\n• In The Fifth Element, Dallas gets down to one chance to activate the Fire stone.\n• Sam Vimes of Discworld really wants a cigar. He also realizes that he is running low on matches and will absolutely need a fire to survive. He has a cigar.\n• Subverted in the short story \"To Build a Fire\" by Jack London. He has plenty of matches, but after his first fire goes out he winds up lighting all the rest of them at once, due to his hands being completely frozen. This second fire also goes out, and the man proceeds to freeze to death.\n• The Little Match Girl by Hans Christian Andersen. She still freezes to death.\n• In Family Matters when Steve and Carl are lost in the woods when cutting down a Christmas tree. Steve has three matches in his survival kit. When Carl lights the first, Steve sneezes it out, but got the firewood lighted on the second try.\n• In Monkey Island 2: LeChuck's Revenge, Guybrush uses the last match to blow a hole in the ground so he can find Big Whoop.\n• There's a brain teaser about this, which was used in Professor Layton and the Curious Village but has appeared elsewhere: \"You are stuck in a remote cabin in the woods, with only one match. You see a stove, an oil lamp, a fireplace and a candle in the cabin. What should you light first?\" The answer, of course:\n• This was done a few times in Looney Tunes.\n• Subverted in Toy Story when Woody realizes that they need to light the rocket taped to Buzz Lightyear's back. A passing car blows out that one and only match, leading to (temporary) despair. But Woody is able to light the rocket after remembering how Sid used the sun to set him on fire using a magnifying glass.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/DownToTheLastMatch", "media_links": ["/pmwiki/pmwiki.php/Film/TheFifthElement", "/pmwiki/pmwiki.php/Literature/Discworld", "/pmwiki/pmwiki.php/Literature/ToBuildAFire", "/pmwiki/pmwiki.php/Creator/JackLondon", "/pmwiki/pmwiki.php/Literature/TheLittleMatchGirl", "/pmwiki/pmwiki.php/Creator/HansChristianAndersen", "/pmwiki/pmwiki.php/Series/FamilyMatters", "/pmwiki/pmwiki.php/VideoGame/MonkeyIsland2LeChucksRevenge", "/pmwiki/pmwiki.php/VideoGame/ProfessorLaytonAndTheCuriousVillage", "/pmwiki/pmwiki.php/WesternAnimation/LooneyTunes", "/pmwiki/pmwiki.php/WesternAnimation/ToyStory"], "non_media_links": ["/pmwiki/pmwiki.php/Main/HardToLightFire", "/pmwiki/pmwiki.php/Main/GoingByTheMatchbook", "/pmwiki/pmwiki.php/Main/TentativeLight", "/pmwiki/pmwiki.php/Main/OneBulletLeft", "/pmwiki/pmwiki.php/Main/DownToTheLastPlay", "/pmwiki/pmwiki.php/Main/ShootTheShaggyDog"]}