{"title": "The Body Parts That Must Not Be Named", "content": "This trope is when it's not only considered Not Safe for Work/kids/etc to show the genitals, but to say the words for them too.\n\nThe exact levels of censorship vary: sometimes, only technical terms like \"penis\", \"scrotum\", \"vagina\", and \"vulva\" are censored, while casual terms like \"willy\" and \"vajayjay\" are allowed. On the other hand, sometimes, clinical terms are allowed while slang terms aren't. Sometimes, no words that actually mean the genitals are allowed, so euphemisms such as \"down there\" and \"you-know-what\" are said instead, sometimes writers just make euphemisms up.\n\nWhen this trope is in play, it may also extend to the inner reproductive anatomy, such as the uterus and prostate, but not always.\n\nMany kids' shows are not allowed to say the words, not even in child-friendly contexts, unless it's meant to be educational, and sometimes not even then. In fact, this trope is often why works which try to teach about \"good and bad touches\" end up being clumsily-written.\n\nSome \"Nannybots\" meant to censor online profanity will censor anatomical words as well, which may lead to the Scunthorpe Problem.\n\nHowever, this trope isn't limited to child-friendly works: some M-rated works censor anatomical words too, even though their target audience is usually way too old for that to be a problem. Heck, even Hentai uses this trope sometimes.\n\nIt must be noted that this isn't any instance of the use of euphemisms or words like \"wiener\". Sometimes, euphemisms and slang might be played solely for comedy, and the use of euphemisms might be just appropriate dialogue for a character who's a prude. Ditto for slang and characters who tend to use it in general. Signs that it is this trope include:\n• The work does not have an Everyone Rating.\n• Alternatively, the work does have an Everyone rating, but the censorship is for a word in a non-sexual situation, e.g. \"I hurt my penis.\"\n• The work mentions sex, contains profanity, deals with heavy topics, or even a combination.\n• A translation of a work removes or changes a non-profane word for the genitals.\n• A work or scene had to be removed or edited solely due to featuring an anatomical word.\n• The euphemism or whatever sounds unnatural and it would make more sense to just say the word and this unnatural effect doesn't make sense in-universe.\n\nA subtrope of Bowdlerize if the prohibition on terms comes from an external source (probably Moral Guardians). Compare Nipple and Dimed and Never Say \"Die\" for other taboos. Also compare Sexual Euphemism for ways of avoiding saying what you might do with those bathing suit parts. For extra fun, may be combined with IKEA Erotica.\n\nDespite the name similarity, The Disease That Shall Not Be Named is only partially related to this trope because censorship is only one reason that the disease shall not be named. See Speak of the Devil and The Scottish Trope for other things some people want to avoid naming.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/TheBodyPartsThatMustNotBeNamed", "media_links": ["/pmwiki/pmwiki.php/Manga/MissKobayashisDragonMaid", "/pmwiki/pmwiki.php/Franchise/SailorMoon", "/pmwiki/pmwiki.php/LightNovel/Shimoneta", "/pmwiki/pmwiki.php/Creator/VertigoComics", "/pmwiki/pmwiki.php/Creator/DCComics", "/pmwiki/pmwiki.php/ComicBook/TheSandman", "/pmwiki/pmwiki.php/Creator/NeilGaiman", "/pmwiki/pmwiki.php/Literature/HarryPotter", "/pmwiki/pmwiki.php/Series/StarTrekTheOriginalSeries", "/pmwiki/pmwiki.php/VideoGame/KingdomHearts", "/pmwiki/pmwiki.php/WesternAnimation/HeavyMetal", "/pmwiki/pmwiki.php/WesternAnimation/TheRugratsMovie", "/pmwiki/pmwiki.php/Film/AustinPowers", "/pmwiki/pmwiki.php/Franchise/WinnieThePooh", "/pmwiki/pmwiki.php/Literature/GulliversTravels", "/pmwiki/pmwiki.php/Literature/ItsOKToSayNo", "/pmwiki/pmwiki.php/Literature/LittleZizi", "/pmwiki/pmwiki.php/Literature/Wicked", "/pmwiki/pmwiki.php/Series/DharmaAndGreg", "/pmwiki/pmwiki.php/Series/MadTV", "/pmwiki/pmwiki.php/Series/MontyPythonsFlyingCircus", "/pmwiki/pmwiki.php/Franchise/StarTrek", "/pmwiki/pmwiki.php/Series/StarTrekTheNextGeneration", "/pmwiki/pmwiki.php/Series/StarTrekVoyager"], "non_media_links": ["/pmwiki/pmwiki.php/Fanfic/MyImmortal", "/pmwiki/pmwiki.php/Main/NotSafeForWork", "/pmwiki/pmwiki.php/Main/UnusualEuphemism", "/pmwiki/pmwiki.php/Main/TooSmartForStrangers", "/pmwiki/pmwiki.php/Main/CluelessAesop", "/pmwiki/pmwiki.php/Main/ScunthorpeProblem", "/pmwiki/pmwiki.php/Main/Hentai", "/pmwiki/pmwiki.php/Main/EveryoneRating", "/pmwiki/pmwiki.php/Main/Bowdlerize", "/pmwiki/pmwiki.php/Main/MoralGuardians", "/pmwiki/pmwiki.php/Main/NippleAndDimed", "/pmwiki/pmwiki.php/Main/NeverSayDie", "/pmwiki/pmwiki.php/Main/SexualEuphemism", "/pmwiki/pmwiki.php/Main/IKEAErotica", "/pmwiki/pmwiki.php/Main/TheDiseaseThatShallNotBeNamed", "/pmwiki/pmwiki.php/Main/SpeakOfTheDevil", "/pmwiki/pmwiki.php/Main/TheScottishTrope", "/pmwiki/pmwiki.php/Main/GenderBender", "/pmwiki/pmwiki.php/Main/InUniverse", "/pmwiki/pmwiki.php/Main/SubvertedTrope", "/pmwiki/pmwiki.php/Main/DoubleSubversion", "/pmwiki/pmwiki.php/FanFic/MyImmortal", "/pmwiki/pmwiki.php/Fanfic/ThoseLackingSpines", "/pmwiki/pmwiki.php/Main/Seme", "/pmwiki/pmwiki.php/Main/Uke", "/pmwiki/pmwiki.php/Main/TheSmurfettePrinciple", "/pmwiki/pmwiki.php/Fanfic/EmpathTheLuckiestSmurf", "/pmwiki/pmwiki.php/Main/AmazingTechnicolorPopulation", "/pmwiki/pmwiki.php/Main/SuddenlyShouting", "/pmwiki/pmwiki.php/Main/RoboSexual", "/pmwiki/pmwiki.php/Main/DoubleStandard", "/pmwiki/pmwiki.php/Main/PoliticalCorrectnessGoneMad"]}