{"title": "Talk Show with Fists", "content": "\"Never before have two chairs and a potted plant so transformed the wrestling ring!\"\n\nThis is very frequent in Professional Wrestling . Say Promotion A doesn't have enough actual wrestling to fill the entire show, what do they do? Give some wrestler, often a Heel or a smart-mouthed Face , his own talk show, of course. The talk show isn't really a talk show as much as it is a few chairs, or a couch, in the ring and the host simply runs his mouth.\n\nThe thing about these talk shows is that they seem to always end violently. Usually the host calls out a wrestler and proceeds to either insult the wrestler directly or brag his ass off while at the same time insulting the guest. At this point, the guest's finishing move is often applied to the host's face. Sometimes, however, the guest decides to say something to the host and then, inexplicably, take his eye off of the host. Which is frequently followed by the host taking the guest's head off.\n\nIn short, regardless of the wrestlers involved, who's hosting, who's the guest, and the specifics of who is beating on whom, they always end in violence.\n\nWas incredibly popular in the early 90s, when just about every heel in WWE got one.\n\nNot to be confused with Jerry Springer, Jeremy Kyle, and their ilk. Any wrestling there is only incidental.\n• Piper's Pit, hosted by \"Rowdy\" Roddy Piper, was the Trope Codifier in the 1980s and included incidents such as Piper cracking Jimmy Snuka over the head with a coconut, beating up a jobber named Frankie Williams, spraying Morton Downey Jr. with a fire extinguisher, and himself getting Super Kicked by Shawn Michaels.\n• In an episode of Chris Jericho's show, The Highlight Reel, Jeff Hardy responded to Jericho's bragging by hitting him with a Twist of Fate. Strangely enough, for all the ridiculous lampshading it gets, the \"Obscenely Expensive Jeritron 5000\" had yet to be used in a violent confrontation — until the final edition, where Jericho committed a Face\u0096Heel Turn and sent Shawn Michaels through it, paralleling a years ago scene where Michaels' singles career took off after he basically did this (with a barbershop window) to Marty Jannetty.\n• Speaking of, that would be Brutus \"The Barber\" Beefcake's show, The Barber Shop. Its most famous moment was the segment where Shawn Michaels turned heel (by launching Marty Jannetty through the glass door), and it is this segment that began Michaels' run to the superstardom stratosphere.\n• Two months after the Rockers' break-up, the final episode of the Barber Shop involved Sid Justice smashing up the Barber Shop set with a steel chair as his way of sending a message to Hulk Hogan.\n• Jake \"The Snake\" Roberts hosted The Snake Pit, where the most famous segment was the Honky Tonk Man smashing Roberts over the back after Roberts told Honky that he was not interested in his music. (Interestingly, André the Giant was once a visitor to the Snake Pit, and never showed any fear of snakes.)\n• The incident with Honkytonk Man is notable because Roberts was legitimately injured; instead of using a cheap guitar designed to smash apart on impact, Honky used a real guitar, and the only thing that smashed apart were several vertebrae in Roberts' neck, something that he never fully recovered from.\n• In 1986, Adrian Adonis began using an effeminate \"cross-dresser\" gimmick and began hosting a segment called \"The Flower Shop.\" The violence came when Roddy Piper came to shut the Flower Shop down. After a week of threats against one another, both The Flower Shop and Piper's Pit sets were set up ... and Adonis got a temporary victory by (with the help of Don Muraco and Bob Orton) destroying Piper.\n• A week later, Piper got his revenge by taking his fists (and a bat) to the \"Flower Shop\" set!\n• A show hosted by Edge called The Cutting Edge, ended with his guest, Batista, Power Bombing him in response to Edge taunting him by arranging to have the lights go off in the arena, as if The Undertaker were entering, even though he wasn't.\n• Carlito's Cabana, hosted by Carlito Colón & later his brother Primo Colón to become an example of a Talk Show With Fists hosted by a Tag Team family.\n• MVP's VIP Lounge. Incidentally, MVP would later be \"revealed\" to have a \"brother\" named Victor...\n• Homestar Runner: Parodied in the Strong Bad Email yes, wrestling, where Strong Bad sets up one of these apparently for the sole purpose of hitting Homestar with a folding chair. Strong Bad: Never before had two chairs and a potted plant so transformed the wrestling ring.\n• The Abraham Washington Show starring Abraham Washington on ECW. Notable for having Tony Atlas in the Ed McMahon position (and laugh), and for putting an APPLAUSE sign on the Titan Tron when Abe gets introduced.\n• Paul E. Dangerously had the Danger Zone in WCW and ECW.\n• Miz TV by, um, Alex Riley? The Miz's segment's name is a slight parody off of MTV where he first became famous, but during the late PG era and into the \"New Era\", MizTV became WWE's go-to segment for most angles, as well as celebrity guests. Incidentally, MizTV was the first Talk Show to air after Piper's passing in 2015, and he took time to credit all of the various shows through the years to Piper's Pit.\n• The Street corner, hosted by \"Exotic\" Adrian Street, of course\n• The Jerry Lawler Show used to be a thing before he went to the WWF, where he started doing \"The King's Court\"\n• Jesse \"The Body\" Ventura's Body shop. Later, Sweet And Sour Larry Sweeney's Sweet Shop.\n• Averted by the Aksana show, which once led into a match but was free of fistfights while in progress.\n• ODB had \"Talkin' Trash With ODB]] in TNA", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/TalkShowWithFists", "media_links": ["/pmwiki/pmwiki.php/Series/TheJerrySpringerShow", "/pmwiki/pmwiki.php/Series/TheJeremyKyleShow"], "non_media_links": ["/pmwiki/pmwiki.php/WebAnimation/HomestarRunner", "/pmwiki/pmwiki.php/Main/ProfessionalWrestling", "/pmwiki/pmwiki.php/Main/Heel", "/pmwiki/pmwiki.php/Main/Face", "/pmwiki/pmwiki.php/Main/FisticuffProvokingComment", "/pmwiki/pmwiki.php/Wrestling/WWE", "/pmwiki/pmwiki.php/Wrestling/RoddyPiper", "/pmwiki/pmwiki.php/Main/TropeCodifier", "/pmwiki/pmwiki.php/Wrestling/ShawnMichaels", "/pmwiki/pmwiki.php/Wrestling/ChrisJericho", "/pmwiki/pmwiki.php/Wrestling/JeffHardy", "/pmwiki/pmwiki.php/Main/FaceHeelTurn", "/pmwiki/pmwiki.php/Wrestling/ShawnMichaels", "/pmwiki/pmwiki.php/Wrestling/MartyJannetty", "/pmwiki/pmwiki.php/Wrestling/BrutusBeefcake", "/pmwiki/pmwiki.php/Wrestling/ShawnMichaels", "/pmwiki/pmwiki.php/Main/SoftGlass", "/pmwiki/pmwiki.php/Wrestling/JakeRoberts", "/pmwiki/pmwiki.php/Wrestling/AndreTheGiant", "/pmwiki/pmwiki.php/Wrestling/AdrianAdonis", "/pmwiki/pmwiki.php/Wrestling/DonMuraco", "/pmwiki/pmwiki.php/Wrestling/Edge", "/pmwiki/pmwiki.php/Wrestling/Batista", "/pmwiki/pmwiki.php/Wrestling/TheUndertaker", "/pmwiki/pmwiki.php/Wrestling/CarlitoColon", "/pmwiki/pmwiki.php/Main/TagTeam", "/pmwiki/pmwiki.php/Main/WrestlingFamily", "/pmwiki/pmwiki.php/Wrestling/MontelVontaviousPorter", "/pmwiki/pmwiki.php/Wrestling/Christian", "/pmwiki/pmwiki.php/Wrestling/BrucePrichard", "/pmwiki/pmwiki.php/Wrestling/PaulBearer", "/pmwiki/pmwiki.php/Wrestling/RicFlair", "/pmwiki/pmwiki.php/WebAnimation/HomestarRunner", "/pmwiki/pmwiki.php/WebAnimation/StrongBadEmail", "/pmwiki/pmwiki.php/Recap/StrongBadEmailE183YesWrestling", "/pmwiki/pmwiki.php/Wrestling/ShawnMichaels", "/pmwiki/pmwiki.php/Wrestling/TerryFunk", "/pmwiki/pmwiki.php/Wrestling/WCW", "/pmwiki/pmwiki.php/Wrestling/PaulHeyman", "/pmwiki/pmwiki.php/Wrestling/ECW", "/pmwiki/pmwiki.php/Wrestling/TheMiz", "https://www.youtube.com/watch?v=LwdGSHLIXxk", "/pmwiki/pmwiki.php/Wrestling/BeulahMcGillicutty", "/pmwiki/pmwiki.php/Main/GettingCrapPastTheRadar", "/pmwiki/pmwiki.php/Wrestling/NewWorldOrder", "/pmwiki/pmwiki.php/Wrestling/EricBischoff", "/pmwiki/pmwiki.php/Wrestling/ExoticAdrianStreet", "/pmwiki/pmwiki.php/Wrestling/HerbAbramsUWF", "/pmwiki/pmwiki.php/Wrestling/CaptainLouAlbano", "/pmwiki/pmwiki.php/Wrestling/JerryLawler", "/pmwiki/pmwiki.php/Wrestling/DustyRhodes", "/pmwiki/pmwiki.php/Wrestling/JesseVentura", "/pmwiki/pmwiki.php/Wrestling/LarrySweeney", "/pmwiki/pmwiki.php/Wrestling/Aksana", "/pmwiki/pmwiki.php/Wrestling/DeanAmbrose", "/pmwiki/pmwiki.php/Wrestling/JessicaKresa", "/pmwiki/pmwiki.php/Wrestling/ImpactWrestling"]}