{"title": "Quest for the Rest", "content": "The hero is a magical being (or alien species) and no one else in his village is like him. No one knows whether he really is the Last of His Kind. He wants to find others like him, so he goes on a quest to search for them. In the end, he may find a hidden community made up of beings like them... or not.\n\nWhat might seem odd is that the character is usually very pleased to be unique (as Tigger declares in his theme song), until he reflects that it also means being surrounded by people who can't possibly relate. Another oddity is that, if The Rest actually show up, the character often sides with them by merit of being one of them, in the face of any other logic (e.g., that they are bad guys). In the end, though, the character will oftentimes find he has no real connection to The Rest other than biological; The Power of Friendship means that he really belongs with the main cast — at least, in more idealistic stories.\n\nSee also There Is Another.\n• After the quest to rescue Yuria ends, Kenshiro spends much of Fist of the North Star looking for his other three Hokuto Brothers and fighting various evil bastards along the way.\n• ElfQuest is, as the title indicates, about elves looking for other elves.\n• A stock plot in X-Men, as finding lonely and helpless mutants is essential to Professor X's mission.\n• During the Time Skip between the classic Christopher Reeve Superman films and Superman Returns, Kal-El left Earth to search for any sign that other Kryptonians survived the catastrophe that destroyed their homeworld. He failed to find any, and disappearing for several years while he searched cost him his reputation and his relationship with Lois Lane in return for accomplishing pretty much nothing. The rest of the film is about him dealing with the fallout from that.\n• In C. J. Cherryh's The Faded Sun trilogy, most of the mri, a Proud Warrior race, are massacred with the collusion of humanity. The two survivors search for others of their kind with the help of a sympathetic human. Eventually they find them, and their race's hidden planet of origin.\n• Tony and Tia in Alexander Key's Escape to Witch Mountain. They try to find other people with their special powers.\n• In the Earth's Children series Ayla is looking for more of the Others.\n• Inverted in the Acorna Series: Acorna discovers she's not alone when her Aunt (who was searching for her brother and his family) finds her.\n• Odo in the first couple of seasons of Star Trek: Deep Space Nine, and particularly in the Expanded Universe novels written before The Reveal.\n• This is Naija's starting motivation to venture out into the world of Aquaria since she's lonely and fears she's the last of her kind.\n• The initial plot of Spyro: A New Beginning centers around Spyro's attempt to find out why his egg was abandoned years ago (when some helpful insects adopted it) and whether there are others like him He doesn't even know the word dragon until meeting Ignitus . Later plotlines involve rescuing the many dragons captured by Cynder and her orc army.\n• Ratchet's motivations in Ratchet & Clank Future: Tools of Destruction are to find where the Lombaxes went after they fled to another dimension. By Into the Nexus, he has accepted that any method to bring them back would be too dangerous, and that \"there's more for me here than over there\". In a subversion to most examples, Ratchet discovered this motivation six games into the franchise, and after having met another Lombax in the second game and not thinking anything of it.\n• Futurama had Leela's long search for other one-eyed aliens, which almost led to a disastrous marriage to a shapeshifting con artist before her true background was revealed.\n• Sesame Street had an animated segment about a lower case \"n\" that was like this.\n• Finn in Adventure Time is believed to be the last human, not counting mutated or magically-altered former humans . In one episode, he comes across a subterranean clan of humans, until they take off their hoods and turn out to be fish-people, possibly mutated former humans . This all led up to the \"Islands\" miniseries, where Finn, Jake, BMO and Susan Strong, who turns out to be a cybernetically enhanced human , take to the seas beyond Ooo to find other humans, culminating in them finding a whole island society of them, led by the A.I. backup of Finn's mother.\n• Predaking's plot thread in the Transformers: Prime Grand Finale movie begins with this, when he learns from the Autobots that two other Predacons attacked them, and sets off to investigate.\n• Gargoyles had this going during the \"World Tour\" arc, as Goliath (who believed that he and his clan were the last gargoyles left) and Elisa met Angela and her clan of gargoyles in Avalon, and later met gargoyles in London, Japan and the Amazon rainforest. Upon returning to Manhattan, Goliath was able to joyfully tell his clan, \"We are no longer alone.\"", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/QuestForTheRest", "media_links": ["/pmwiki/pmwiki.php/Manga/FistOfTheNorthStar", "/pmwiki/pmwiki.php/ComicBook/ElfQuest", "/pmwiki/pmwiki.php/ComicBook/XMen", "/pmwiki/pmwiki.php/Disney/TheTiggerMovie", "/pmwiki/pmwiki.php/WesternAnimation/IceAge2TheMeltdown", "/pmwiki/pmwiki.php/Film/MuppetsFromSpace", "/pmwiki/pmwiki.php/Film/SupermanReturns", "/pmwiki/pmwiki.php/Creator/CJCherryh", "/pmwiki/pmwiki.php/Literature/TheFadedSun", "/pmwiki/pmwiki.php/Literature/EscapeToWitchMountain", "/pmwiki/pmwiki.php/Literature/TheLastUnicorn", "/pmwiki/pmwiki.php/Literature/EarthsChildren", "/pmwiki/pmwiki.php/Literature/AcornaSeries", "/pmwiki/pmwiki.php/Series/StarTrekDeepSpaceNine", "/pmwiki/pmwiki.php/VideoGame/Aquaria", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfSpyro", "/pmwiki/pmwiki.php/VideoGame/RatchetAndClankFutureToolsOfDestruction", "/pmwiki/pmwiki.php/VideoGame/RatchetAndClankIntoTheNexus", "/pmwiki/pmwiki.php/WesternAnimation/Futurama", "/pmwiki/pmwiki.php/Series/SesameStreet", "/pmwiki/pmwiki.php/WesternAnimation/AdventureTime", "/pmwiki/pmwiki.php/WesternAnimation/TransformersPrime", "/pmwiki/pmwiki.php/WesternAnimation/Gargoyles"], "non_media_links": ["/pmwiki/pmwiki.php/Main/LastOfHisKind", "/pmwiki/pmwiki.php/Main/ASharedSuffering", "/pmwiki/pmwiki.php/Main/ThePowerOfFriendship", "/pmwiki/pmwiki.php/Main/SlidingScaleOfIdealismVsCynicism", "/pmwiki/pmwiki.php/Main/ThereIsAnother", "/pmwiki/pmwiki.php/Main/ComicBooks", "/pmwiki/pmwiki.php/Main/TimeSkip", "/pmwiki/pmwiki.php/Main/SubvertedTrope", "/pmwiki/pmwiki.php/Main/AllForNothing", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/ProudWarriorRaceGuy", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/ExpandedUniverse", "/pmwiki/pmwiki.php/Main/TheReveal", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/PlotHole", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/LastOfHisKind", "/pmwiki/pmwiki.php/Main/BrainUploading", "/pmwiki/pmwiki.php/Main/GrandFinale", "/pmwiki/pmwiki.php/Main/YouAreNotAlone"]}