{"title": "Play Every Day", "content": "A Yin-Yang Bomb of Anti Poop-Socking and Just One More Level, this is when a game encourages you to play every day.\n\nThis is the case with pretty much any browser-based persistent world. As well as daily rewards to encourage regular play, you get punished for being offline too long in any of the following ways:\n• You accumulate turns, adventures, action points or whatever the game calls them, which cap once they reach a certain value\n• You accumulate resources over time; by allowing them to build up, you're making yourself a juicy target for attack\n• In addition to either of the above, other people are progressing while you're not.\n\nCompare the non-interactive equivalent: Appointment Television, where you have to watch every episode when it airs or as soon as possible after you've recorded it.\n• Many, many Mobile Phone Games and Free-to-Play games. Usually to balance the nature of the Allegedly Free Game, Bribing Your Way to Victory, and Loot Box that is ubiquitous to them.\n• Temporary version: Some MMORPGs have events, usually lasting a month or two, where you receive one or more items each day, with better rewards for logging in each day (some of them reset the list if you miss a day, starting you off with the first day's reward again if you miss any days, while others base the item you receive on the total number of days you've logged in during the event, in which case you can only receive the best reward if you log in at least once every single day).\n• Afterzoom for DSiWare is all about capturing microscopic bacteria with the built-in camera. The catch is having to feed these creatures with different substances every period of time (which can be very short, as in hours), or else they begin to die.\n• Angry Birds Epic gives double EXP in the first five battles fought every day.\n• Tom Nook's shop in Animal Crossing restocks every day. He might have that spaceship you want, and if you don't check, who knows when it'll be in stock again? More mundanely, the game rewards loyal players with more loyalty from the local resident animals that manifests in them being less likely to move out and more likely to give the player presents. Miss more than a couple of days, though, and you'll get teased and scolded for being gone so long. Further, the town itself requires a little near-daily maintenance: saplings and flowers need watering, weeds need pulling, etc. And in Wild World for the DS, you sometimes get a random letter that gives you little tidbits of wisdom, one of which is \"avoid boredom by playing an hour a day\". New Leaf alters this a bit with the \"Keep Your Town Beautiful\" town ordinance, which makes your town \"decay\" more slowly when you're not playing...so now it's \"play like twice a week or something\". It's an optional Anti-Frustration Feature for people who like the game but don't have the time to play every single day. Playing every day also allows a diligent player to keep track of villagers about to move, instead of coming back to town after a week with one of their friends missing.\n• Anti-Idle: The Game:\n• The Daily Bonus feature, including Blue Coin bonuses as well as up to 9 otherwise difficult-to-obtain items such as Fertilizers and the Daily Bonus-exclusive Attendance Box. Additionally, the Daily Bonus screen offers a special deal not available anywhere else, and that special deal changes daily.\n• One other feature is the Dragon, who can be fed to increase your Boost. However, each time you feed him, the cost for the next feeding increases. Once midnight hits, the cost to feed him resets back to initial value.\n• There are quests that can be repeated once a day, including an Attendance quest that rewards you for attendence streak.\n• Bad Piggies has three new loot crates in random levels every day.\n• Battlerite gives you 50 Battlecoins each day for logging in, which can be used to buy Silver Chests or new Champions. You also get a daily quest that awards you with more coins. And upon reaching account level 5, you can choose a sponsor, who will give you even more rewards upon completing enough daily quests.\n• Like so much else, this kind of thing is parodied in BoxxyQuest: The Gathering Storm. At one point, there\u0092s a chef who gives you some free food, then tells you she\u0092ll give you some more if you come back tomorrow before realizing that the game lacks an internal clock, so she\u0092ll never be able to tell when tomorrow comes.\n• Brain Age gives you a stamp for the first brain-training game you play each day. It also makes the stamp larger if you play three games in a day.\n• Dandy Dungeon has, true to his wacky nature, Yamada cleaning up his apartment. Not only he will find useful game items in the trash (...just go with it), but he also takes note of it every day with Cleaning Stamps, and every few days of stamps will net him extremely rare items, including some gear that can't be found anywhere else.\n• Dissidia Final Fantasy will reward you for checking your Mognet every day for 15 days. There's also a reward for getting 200 messages via Mognet. The most you can get is two per day (and you only get the second one if you haven't been playing for more than three days) so checking every day is the best way to do it.\n• In Dragon Quest IX, the online store changes its inventory every (realtime) day.\n• The Earth 2025 browser-based game give you bonus turns the longer you go without logging in, but after a day or two you'll hit your maximum amount, with diminishing returns in the process, leading to the player playing once a day as the optimum amount.\n• Equin The Lantern gives bonuses on certain days of each month. For example, every day 9 boosts the Thief class and every weekend lets you pick one more starting item.\n• Everybody Edits has energy that the player gets every 150 seconds, with the Cap being anywhere from 200 to 400, depending on the player's class. Technically, it was possible to get over this cap with the old magic coins and contest rewards, but this feature is now lost The currency is used to purchase smileys, blocks, potions, and worlds.\n• Fallen London gives you twenty actions at a time (forty if you pay for a subscription), which recharge at a rate of one every eight minutes or so It varies; it can be as high as ten minutes or as low as five, but eight is typical , capping at twenty (or forty). So it's more like Play Every Three Hours.\n• FarmVille: The crops take a few hours to a couple days to grow, and if you don't harvest them in the time that it took for them to grow, they die. The only way to avoid this trope is to (literally) buy time. This is how Zynga makes its money - they call this \"Appointment Gaming\", and quite a few Facebook games have taken this mechanic and run with it. For example, The Sims Social refilled your energy bar every 45 minutes. Now you can Play Every Hour. (Farmville is the Genre Popularizer and Trope Codifier for the Facebook Casual Game.)\n• Final Fantasy Record Keeper gives you two items every day. One of them is guaranteed to be 1 Mythril. The other can be either another Mythril, additional Gil, or an item that'll significantly increase any common equipment's stats. (Unlike most other games, these rewards do not reset if you skip a day or two.) In addition, there is a set of dungeons that open every day, with varying rewards that depend on the current weekday.\n• The Forza games have something called Forzathon where every weekend, occasionally at other times to celebrate special events, you will be offered specific challenges with oft times substantial rewards: smash the record on a Surfers event to gain cash and XP, win a race in a Ford to unlock a specially modified version, play a event that ends in a certain location to be gifted a valuable machine you otherwise have to download and pay real money for, play these online events for something from the new car pack, and such.\n• Similarly, Fruit Ninja gives x5 EXP in the first five games played every day, whether they be Classic, Arcade or Zen games.\n• Most of Gameloft's games give a bonus to your currency (and sometimes EXP, depending on the game) every consecutive day, up to a total of five days. If any day is missed in those five days, the rewards reset and they have to play five more consecutive days.\n• Ghost in the Shell: First Assault Online has a 10-day daily log-in system that rewards with steadily increasing XP and GP boosters every day.\n• Godus as Freemium game has long wait times for construction and slowly regenerating resources. Of course you can make things go fasted if you pay. Oddly this carries over onto the PC version where you don't/can't pay money but instead can pay gems. In both cases its best just to wait half a day between hour sessions.\n• Granblue Fantasy has an absurd amount of things restricted to daily, weekly and monthly caps. You get a free item or currency of some kind whenever you open the game once a day; certain quests that are great for farming (like every Maniac difficulty event quest) can only be completed two or three times a day; there are 3 Co-Op missions to be completed each day to win a Blue Sky Crystal (a somewhat rare item used in upgrading); if your account is bound to Twitter, you can only post there once a day to recharge AP and EP; you can draw low-value items for Rupies only 100 times a day; you can only buy Half-Elixirs up to a certain daily cap depending on the currency used or items traded for them; you can win a maximum of 1000 Renown pendants daily and 2000 weekly, alongside a maximum of 500 Prestige pendants weekly. In short, the game really gives you a lot of homework if you try to be efficient at it, which has earned it the Fan Nickname of Grindblue Fantasy among long time fans.\n• Gwent: The Witcher Card Game: Win rewards each day are somewhat front-loaded, spaced out such that your first three wins will average about 45 ore/game, the next six are 25 ore/game, the next twelve are 10 ore/game, and anything beyond that is about 2 ore/game. This is approximate as the rewards randomly include scraps or free cards.\n• Hearthstone: Heroes of Warcraft has an interesting variation: Every day whether you log in or not, you are given a random daily quest that you can either complete that day, or save it up in your quest log to complete some other time. However, you can only keep up to three quests in your log before you must clear them to receive additional quests. Additionally, you are also given one option per day to reroll one quest that you don't like to get another quest, although this is just as randomized.\n• Heroes of the Storm, being made by the same company, offers the same gimmick, although the option to reroll quest is absent.\n• Halo: Reach offers extra credits for completing challenges of varying difficulty each day, and one per week as well\n• Ingress has the Sojourner medal, which revolves around the player's \"Hacking Streak\" that is incremented by performing at least one hack every 24-hour period The game has a daily check in which it checks every single player to see if they have hacked at least once since the last check. The player's hacking streak is incremented by one if they've done so, reset back to zero otherwise. This means you don't have to actually hack every 24 hours or less — you could hack once one second after a check, and then wait 47 hours, 59 minutes, and 58 seconds to hack again, and still be in the running — but since the exact time of the check is deliberately hidden from players, you effectively have to just to be safe. . The lowest level of the badge is at 15 days and the highest level is at 360 days (i.e. almost a full year).\n• Idolish 7 gives out a log-in bonus every day, and there are special daily lessons as well.\n• Many mobile romance games, including Ikemen Sengoku and the Shall We Date? series, operate on a ticket system that gives you free tickets to read the story (usually 5 per day or 1 every 4 hours). Thing is, you can only have a maximum of 5 of these tickets at once, so you'll need to make sure to use them daily to avoid wasting them. These games also usually give you rewards for logging in daily and a free spin every day of a gacha system that can give you items or clothes for your in-game avatar.\n• In Kingdom Hearts χ, you get rewards for each day you log in, typically in the form of the premium currency of jewels. So not so much play every day as \"log in every day.\" Played more straight with the daily missions added in a late 2017 update, which grant 30 jewels each (a total of 300 if all completed) for fairly simply objectives such as gathering a certain amount of lux or defeating a couple of raid bosses. If you're in a party, there are also weekly challenges that grant 100 jewels each for a possible total of 1,000. Additionally, there are event challenges which tend to change from day-to-day that can grant various bonuses and perks.\n• In Kingdom of Loathing, players automatically receive forty adventures at the start of each day, with a Cap of 200. Players can gain extra adventures by consuming food, booze, and a handful of miscellaneous items. There is a maximum amount of these you can consume each day, and every day you don't fill up is wasted turns. Given that a player with decent resources can obtain around 150 turns in a day after consumption, this means that you can only skip one day (Assuming you log on long enough to eat on the off day) before you start missing out on potential turns.\n• Also, there are many one per day, use it or lose it things, like the 4000-5000 free meat from completing the optional Organic Produce Stand sidequest, or the use of the He-Boulder's yellow ray (One-Hit Kill that leaves all of the things a monster Randomly Drops). A list of more examples can be found here . You find yourself logging in daily just for these things. Note that many of these are offered as rewards for completing a quest, or are unique benefits associated with Mr. Store, the place where real-life money is the standard currency.\n• One of the strongest incentives to log in every day is filthy lucre. You earn filthy lucre by completing bounties, which involves defeating a certain number of a specific monster, usually enough that it would take around 40 adventures to complete. Filthy lucre can be traded in for unique and valuable items, including (non-tradeable) high-end equipment to boost item drops, a familiar that raises combat frequency and boosts item drops more than any other, and a special skill that lets you increase the likelihood of encountering a specific monster. You can only get three assignment per day, and you'd need 345 filthy lucre to collect all five of the rewards, so you'd need to play seriously every day for four months just to be able to get them.\n• The webgames created by fifth planet games (Legacy of a Thousand Suns, Legacy Of Heroes,...) offer a daily reward on a 7-days basis: for the best reward, you have to play 7 days in a row.\n• Downplayed with the amiibo functionality in The Legend of Zelda: Hyrule Warriors: they can be used to receive a random reward each day (rare materials, weapons, or a random amount of Rupees), but there is no real punishment for not bothering.\n• League of Legends offers a bonus 150 influence points for your first win of the day. Winning this sets a 22 hour countdown until it becomes available again.\n• Love Live! School Idol Festival:\n• You get a reward for every day that you log in; said reward can either be Love Gems (used for Honor Scouting, recharging LP, and continuing a song after the Life Meter is depleted), G (used for Practice), or Friend Points (for Regular Scouting).\n• The B-Sides folder, which, aside from special limited-time songs, includes songs that only available on a particular day of the week.\n• Love Nikki - Dress Up Queen runs on this. The \"Nikki's Month Sign in\" allows the player to claim a new reward every day (ranging from Gold, Diamonds, Stamina, and Starlight Coins to clothing items). Stamina, which is required to play story levels, regenerates over time and eventually caps based on Nikki's Character Level. The Association Commission stages, Pavilion free pulls, and Princess retries also reset each day.\n• Mass Effect:\n• The DLC Lair Of The Shadow Broker for Mass Effect 2 offers free resources (and sometimes upgrades) every day, encouraging players to go back and accumulate them. It can be tricked by manipulating your system clock and restarting the game.\n• Mass Effect 3: In the single-player campaign, your task is to accumulate War Asset points which represent the sum of galactic armies. However, their effective number is multiplied by the Galactic Readiness level, which defaults to 50% (so you only get to use half of what you earn). Winning multiplayer matches raises the Galactic Readiness but it becomes gradually reduced by a small amount every day (down to 50% again) unless you play again (and you can't go over 100%). The game also encourages players to play every weekend for challenges that award a few extra goodies for your multiplayer loadout, most notably a series of N7 weapons that can only be found and upgraded this way.\n• Mega Man 9 has the \"Daily Dose\" achievement, for completing the game once per day for three days in a row.\n• Miitomo encourages you to check in each day in a variety of ways, like login bonuses, rotating shop stock, and daily missions to earn My Nintendo Platinum Points.\n• Moco Moco Friends has you gain free items from Neko every day that you play. In addition, the game has a changing roster of bonus dungeons that is different every time you play, and the secret Glittery versions of the five box-art Plushkins can be fought once a day.\n• Mortal Kombat X has various daily challenges that players can complete as well as living towers that change hourly, daily and weekly with a few event towers cropping up every now and then.\n• MouseHunt gives out a daily bonus. Returning on successive days gives an increasingly better bonus on days 2-5, after which the bonus resets. The hunting horn (chance to catch a mouse and get gold or points) usually sounds automatically once an hour, but it will slow down significantly after 24 hours idle.\n• The smartphone visual novel Mystic Messenger operates in real-time and basically requires you to play every day so you can read the chats and in turn, follow a certain route. The NPCs WILL send messages during midnight. You can pay to read (and partake in) conversations you didn't get to see before, but that costs \"hourglasses\" and to get more, you are charged in actual cash. There are also \"phone calls\" you have to listen to and e-mails to respond. You don't necessarily have to participate in all conversations, but there is a minimum threshold (at least 50%). As you can see, it takes a lot of time and dedication to finish the story, especially if you want to see all the endings and CGs.\n• Neko Atsume has a daily codeword that will get you a bonus of fish. Filling the sheet with five passwords nets you a can of Ritzy Bitz free of charge and gives you a new sheet to fill.\n• Neopets has a lot of freebies that are given only once per day, ranging from the savings interest yes, the site doesn't credit your interest directly to your virtual bank account; you must login and collect the interest manually. , freebies found in certain locations in-game, allowing you to earn Neopoints from games three times a day per game etc.\n• Neverwinter has the Ardent/Celestial Coin system. Ardent coins can be gotten one every day by praying in specific locations, and can be used to buy a number of special things. Celstial coins work and are gotten the same way (with different things that can be bought)... except that the ones you've already gotten disappear if you don't pray again within a day.\n• NIER uses this with the 'cultivation' section - though it isn't really very obvious about it, so it might take you a bit of time to even realize it. Basically, you can plant various crops on a field next to your home, but unlike everything else in the game, these crops grow in 'real time', which means that the best way to get a quick harvest is to plant, go to sleep, and return to your field the next day. On the other hand, if you leave your crops standing for more than a day or two, they'll wither - causing you to lose whatever seeds and fertilizer you put into the project, without any harvest to show for it. ...on the bright side, this means that you can greatly accelerate any cultivation-project you might have by moving the console's clock forwards in steps. You can even use it to make fast money... and, if you DO end up leaving your crops around long enough to wither, you can turn back time and harvest them anyway.\n• The Nintendo 3DS rewards you for walking by giving you 1 Play Coin per 100 steps registered with the 3DS's accelerometer, up to 10 Play Coins for 1,000 steps in one day. This is the only way to earn Play Coins, which can be used in a number of games for many different features. The full stock of 300 Play Coins requires walking 1,000 steps per day for 30 days. (Or, you could, you know, shake it to game the accelerometer that tracks your steps...)\n• Nintendo Badge Arcade has this with its practice crane. Once per day, you can play it to gather practice badges that can earn you free plays at the real machines.\n• Onmyōji plays this differently from most. While you do get rewards for logging in multiple days (logging in for a whole first year gives you a free SSR and a shiny icon embellishment), skipping will not reset the counter. Additionally, being absent for extended periods of time gives you welcome-back gifts!\n• Overwatch awards an XP bonus for your first victory of the day.\n• Phantasy Star Online 2 has several levels of rewarding daily play. Simply logging in nets you some minor rewards, with milestone rewards every few days. Logging in every day without missing any increases those rewards slightly. Finally, there are daily client orders that net you extra experience and money. You only have a day to accept them before they change over to a new set, though the game is kind enough to give you unlimited time to complete them and turn them in once accepted, so it is possible to login, grab the ones you want, and complete them during a longer binge of gameplay when you have the time to play properly.\n• PlanetSide 2 gave players a free certification point (used to unlock weapons and upgrades) every two hours whether they were actively playing or not. You can only backlog twelves certs (24 hours worth) before they stop accumulating, so you want to get on at least once a day if only to collect your passives. Later became a part of the Membership subscription program, with Members accumulating 48 certs per day.\n• Plants vs. Zombies 2: It's About Time has a new Pinata Party challenge game every day, with extra rewards for playing them every day.\n• Pokémon has been doing this since Pokémon Gold and Silver, which debuted the Real Time Game Clock. The clock affects berry growth, when lottery numbers are drawn, and other special events. Different Pokemon also come out at different times of day and, in Pokémon Black and White different (real-world) months.\n• A later update to Pokémon GO introduced daily streak bonuses, in which your first Pokéstop visit and first catch of the day will net you an additional 500 XP, 500 additional Stardust from the Pokémon caught, and additional items from the Pokéstop. If you maintain the streak for seven days, the seventh day will increase the bonus XP/Stardust to 2000 and the items from the Pokéstop will be greatly increased (including at least one evolution-related item, which are otherwise extremely rare). The cycle repeats after that. Missing a day resets the cycle. This encourages players to at least visit one Pokéstop and catch at least one Pokémon daily.\n• The music-based browser game Popmundo, being a persistent world, requires you to log in at least once a week to take care of business. You set an activity (e.g. record a music video) and after a while, the game will get updated and the action will get completed. You can busk on the streets but that is not recommended since it can make your character ill if they do it long enough. It is also possible to rest too much but that isn't as detrimental. If you neglect your character they will get sick and their mood will drop, and they will eventually die. You can have a premature death as a 16-year old teenager for no reason other than not logging in regularly. You age every in-game year, by the way, something which takes a few real life months to pass. There are hospitals in case you get a disease like chlamydia. (Yes, that exists). What if you go to a vacation and don't have Internet? Best you can do is leave your character at a safe place (like their own apartment) and let them rest until you're back home.\n• You can now choose your starting age, meaning if you'd rather die at age 30, that's available right off the bat without any waiting. The oldest you can get ever is about 55 and you do eventually die of old age. The oldest characters are usually veterans who have played for a long time. For some odd reason, it is possible for a 20-year old to adopt a 50 year old.\n• The incentive to log in every day is working hard to reach the charts and turn into one of the top music acts in-game. Since you can have relationships with other players and even get pregnant, there is also a caring potential and roleplaying aspect.\n• There's a spin-off called The Great Heist, which operates on the same basis... although there is less content and players than Popmundo, which has been running since 2003. It's also slower due to reconnaissance you have to do. This means it's a bit less demanding. You can also get taken to jail so you'll have to wait a while (or, if you're impatient, there's an option to plan an escape, but there are high chances of failure). In both games there is an option to have multiple characters to manage and that is quite stressful.\n• Professor Layton and the Azran Legacy gives you trophies for solving daily downloadable puzzles for 5, 10, 20, and 50 days in a row. (However, they don't have to be the puzzles released on those days, nor do they even have to be ones you haven't already solved.)\n• Puzzle Craft 2 gives you free coins, influence or runes every day you log into the game and logging in 30 days in a row unlocks a special cattle type that can't be unlocked in any other manner.\n• Shadowverse: Achievements aside, the player's main source of rupie income is via daily missions and login bonuses. There can be up to three daily missions active at a time, and new ones (along with the ability to reroll one of them) come in every 21 hours.\n• Slime Forest Adventure, seeing as how it is an edutainment game, encourages good study habits by taking your gold if you wait too long between games and limiting your health refills if you play too long.\n• Solforge has three normal daily rewards and one special that you can only obtain daily; One is obtained when you login, another when you win a match, and another when you win three matches that day. In addition, winning your first PvP match of the day gives you an event ticket, which you can spend for tournament entries; subsequent PvP wins of the day only give you Silvers (in-game currency).\n• The Sonic Gems Collection unlocks demos of Sonic's various Genesis games in the \"museum\" if you play every day for X days... Of course, before you can do that, you have to unlock the museum page they appear on.\n• Spiral Knights likes this trope:\n• Everything important you can do in Spiral Knights is linked to Energy. Crystal Energy is bought (from players using in-game currency or with real world cash), while Mist Energy slowly recharges itself over time; both are interchangeable and the game will prioritize the use of Mist Energy when it's available. Your Mist Energy takes twenty-two hours to recharge fully, and is capped at 100, so if you don't play every day that free energy goes to waste.\n• Further encouraging frequent play is the fact that the dungeons are semi-randomly generated according to player actions, and the seven dungeon gates rotate every two days, with the one at the bottom of the queue disappearing to make room for a new gate. If one dungeon gate leads to a stratum you're particularly fond of, you've got a maximum of two weeks to reap as many rewards from it as possible.\n• There are several shops in town and between dungeons with rotating inventories, refreshed daily. Though several low-level items will always be available to you, higher-level items are only available randomly and in limited quantity.\n• This is Tamagotchi's main shtick, as not attending to the creature's needs on a daily basis will eventually result in its death.\n• Terra Battle:\n• You earn an automated gift for every day that you log in. The more consecutive days you log in, the better the reward.\n• The Hunting Zone quests rotate daily in a weekly cycle, in order to encourage this trope.\n• In Tomodachi Life all the island is dynamic, from new clothes/hats daily on the shops (although not always), to events that only open at a specific time of the day (Example: A BBQ at 14:00). In addition, your islanders will donate money every day. Changing the console's clock will cancel all events until the next day.\n• Trickster Online has several quests that are only available one per day. The vast majority of these give TM (skill) experience. Others have a chance of giving the coveted Star Card Pack Number 5, which is guaranteed to give you one of three items that can increase your drop rate.\n• Virtual Villagers. The game is real good at having your villagers starve to death if you don't check in on them every day.\n• One of Wajas games invokes selecting 1 of 3 blacked out pears (It Makes Sense in Context, sorta). You receive a money reward regardless of which one you pick, but the amount varies depending on the one you pick, and the reward starts low and stacks for each consecutive day you play the game. Play it long enough, and the reward can get very high, which makes it annoying when the streak is finally broken.\n• Warframe gives players a random reward (credits, real money currency discounts, etc; formerly a couple thousand XP) every day they log in. Before Update 18 the rewards scaled up 'til the the player has continuously logged in for a week. Nowadays the rewards run on two tables, common and rare, with special rewards at 50 day intervals — and no penalty for missing a day besides having your 50 day special reward postponed by one day.\n• War Thunder gives players a random box of loot every day they log in, generally containing small single-use boosters for XP, research, or money. The rewards get larger the more you play.\n• Webkinz gives a daily gift, daily log-in bonuses, and reward games that can be played daily (Wishing Well 2, Wheel of WOW). In fact, the game encourages checking back every hour by having a \"Today's Activities\" list of potential rewards players can receive if logged in at certain times.\n• Wii Fit's anthropomorphic Balance Board tries to guilt-trip you if you don't do the body test every day.\n• The World Ends with You, at a certain point early in the game, gives you the ability to level up your pins by not playing the game. The PP earned this way starts diminishing after 24 hours, though, so if you really need that SDPP, you'll want to load up your file every day. Also, the food system. 24 bytes per day (sort of). Until you get the Hollow Leg, then you can eat as much as you want.\n• World of Tanks gives players double experience for the first winning match in each tank every day.\n• World of Warcraft offers daily quests, which provide you with gold. There are also daily random heroic dungeons, and a weekly raid boss kill which provides you with gold and Frost emblems, a hard to get currency used to buy high level gear. If you don't do the daily heroic every day, you'll miss out on some very nice gear. Technically, you can still get Frost Emblem gear without doing a daily random heroic or the weekly. However this requires that you get involved in raiding, which many people opt not to do.\n• The 2014 expansion, \"Warlords of Draenor\", introduced Garrisons, which allows you to have your minions perform tasks for you. In many cases, you can queue up several days worth of \"work orders\", but for the Garrison Supplies you need most, you'll be sending your minions on their own daily missions (usually 8 hours real-time), visiting your Trading Post (which accepts a different resource every day) or collecting \"free\" supplies (which can hold a maximum of 500 supplies, so if you don't keep it cleared every day, you'll end up wasting potential supplies.)\n• Exaggerated to the point of being rather obnoxious in Wurm Online. Crops have to be maintained daily; go more than 24 hours without logging in to tend them and the plot will die. Buildings, particularly the wooden ones that are all you can build without a subscription, will decay completely within a week or so. Having a title deed slows this dramatically, but they also cost money to buy and maintain. And this isn't a game you can play on a tablet either.\n• Every game in the Yo-Kai Watch series has bonuses for playing every day. The Crank-a-Kai gives you a number of \"cranks\" each day to earn items and rare Yokai from it, and certain items in the shops come in limited stock that replenishes every real-world day. Certain rare Yokai can also only be fought once each real-world day.\n• Browser game Legends of Zork gives a player 30 action points to use for exploring a day. Once they run out, there is nothing else they can do for the day.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/PlayEveryDay", "media_links": ["/pmwiki/pmwiki.php/VideoGame/AnimalCrossing", "/pmwiki/pmwiki.php/VideoGame/AntiIdleTheGame", "/pmwiki/pmwiki.php/VideoGame/BadPiggies", "/pmwiki/pmwiki.php/VideoGame/Battlerite", "/pmwiki/pmwiki.php/VideoGame/BoxxyQuestTheGatheringStorm", "/pmwiki/pmwiki.php/VideoGame/BrainAge", "/pmwiki/pmwiki.php/VideoGame/DandyDungeon", "/pmwiki/pmwiki.php/VideoGame/DissidiaFinalFantasy", "/pmwiki/pmwiki.php/VideoGame/DragonQuestIX", "/pmwiki/pmwiki.php/VideoGame/EverybodyEdits", "/pmwiki/pmwiki.php/VideoGame/FallenLondon", "/pmwiki/pmwiki.php/Website/Facebook", "/pmwiki/pmwiki.php/VideoGame/TheSims", "/pmwiki/pmwiki.php/Website/Facebook", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyRecordKeeper", "/pmwiki/pmwiki.php/VideoGame/Forza", "/pmwiki/pmwiki.php/VideoGame/FruitNinja", "/pmwiki/pmwiki.php/Creator/Gameloft", "/pmwiki/pmwiki.php/VideoGame/GhostInTheShellFirstAssaultOnline", "/pmwiki/pmwiki.php/VideoGame/Godus", "/pmwiki/pmwiki.php/VideoGame/GranblueFantasy", "/pmwiki/pmwiki.php/Website/Twitter", "/pmwiki/pmwiki.php/VideoGame/GwentTheWitcherCardGame", "/pmwiki/pmwiki.php/VideoGame/HearthstoneHeroesOfWarcraft", "/pmwiki/pmwiki.php/VideoGame/HeroesOfTheStorm", "/pmwiki/pmwiki.php/VideoGame/Ingress", "/pmwiki/pmwiki.php/VideoGame/Idolish7", "/pmwiki/pmwiki.php/VisualNovel/IkemenSengoku", "/pmwiki/pmwiki.php/VisualNovel/ShallWeDate", "/pmwiki/pmwiki.php/VideoGame/KingdomHeartsX", "/pmwiki/pmwiki.php/VideoGame/LegacyOfAThousandSuns", "/pmwiki/pmwiki.php/VideoGame/LegacyOfHeroes", "/pmwiki/pmwiki.php/Franchise/TheLegendOfZelda", "/pmwiki/pmwiki.php/VideoGame/HyruleWarriors", "/pmwiki/pmwiki.php/Franchise/LoveLive", "/pmwiki/pmwiki.php/VideoGame/LoveNikkiDressUpQueen", "/pmwiki/pmwiki.php/Franchise/MassEffect", "/pmwiki/pmwiki.php/VideoGame/MassEffect2", "/pmwiki/pmwiki.php/VideoGame/MassEffect3", "/pmwiki/pmwiki.php/VideoGame/MegaMan9", "/pmwiki/pmwiki.php/VideoGame/Miitomo", "/pmwiki/pmwiki.php/VideoGame/MocoMocoFriends", "/pmwiki/pmwiki.php/VideoGame/MortalKombatX", "/pmwiki/pmwiki.php/VisualNovel/MysticMessenger", "/pmwiki/pmwiki.php/VideoGame/NekoAtsume", "/pmwiki/pmwiki.php/VideoGame/Neopets", "/pmwiki/pmwiki.php/VideoGame/Neverwinter", "/pmwiki/pmwiki.php/VideoGame/NintendoBadgeArcade", "/pmwiki/pmwiki.php/VideoGame/Onmyoji", "/pmwiki/pmwiki.php/VideoGame/Overwatch", "/pmwiki/pmwiki.php/VideoGame/PhantasyStarOnline2", "/pmwiki/pmwiki.php/VideoGame/PlanetSide", "/pmwiki/pmwiki.php/VideoGame/PlantsVsZombies2ItsAboutTime", "/pmwiki/pmwiki.php/Franchise/Pokemon", "/pmwiki/pmwiki.php/VideoGame/PokemonGo", "/pmwiki/pmwiki.php/VideoGame/ProfessorLaytonAndTheAzranLegacy", "/pmwiki/pmwiki.php/VideoGame/Shadowverse", "/pmwiki/pmwiki.php/VideoGame/SlimeForestAdventure", "/pmwiki/pmwiki.php/VideoGame/Solforge", "/pmwiki/pmwiki.php/VideoGame/SonicTheHedgehog", "/pmwiki/pmwiki.php/VideoGame/TerraBattle", "/pmwiki/pmwiki.php/VideoGame/TomodachiLife", "/pmwiki/pmwiki.php/VideoGame/TricksterOnline", "/pmwiki/pmwiki.php/Website/Wajas", "/pmwiki/pmwiki.php/VideoGame/Webkinz", "/pmwiki/pmwiki.php/VideoGame/TheWorldEndsWithYou", "/pmwiki/pmwiki.php/VideoGame/YokaiWatch", "/pmwiki/pmwiki.php/VideoGame/Zork"], "non_media_links": ["/pmwiki/pmwiki.php/Main/YinYangBomb", "/pmwiki/pmwiki.php/Main/AntiPoopSocking", "/pmwiki/pmwiki.php/Main/JustOneMoreLevel", "/pmwiki/pmwiki.php/Main/AppointmentTelevision", "/pmwiki/pmwiki.php/Main/MobilePhoneGame", "/pmwiki/pmwiki.php/Main/FreeToPlay", "/pmwiki/pmwiki.php/Main/AllegedlyFreeGame", "/pmwiki/pmwiki.php/Main/BribingYourWayToVictory", "/pmwiki/pmwiki.php/Main/LootBox", "/pmwiki/pmwiki.php/Main/MMORPG", "/pmwiki/pmwiki.php/UsefulNotes/DSiWare", "/pmwiki/pmwiki.php/Videogame/AngryBirdsEpic", "/pmwiki/pmwiki.php/Main/AntiFrustrationFeature", "/pmwiki/pmwiki.php/Main/Lootbox", "/pmwiki/pmwiki.php/Main/EquinTheLantern", "/pmwiki/pmwiki.php/Main/EnergyEconomy", "/pmwiki/pmwiki.php/Main/Cap", "/pmwiki/pmwiki.php/Main/CharacterLevel", "/pmwiki/pmwiki.php/Main/TemporaryOnlineContent", "/pmwiki/pmwiki.php/Main/DigitalAvatar", "/pmwiki/pmwiki.php/Main/BribingYourWayToVictory", "/pmwiki/pmwiki.php/Videogame/FarmVille", "/pmwiki/pmwiki.php/Main/BribingYourWayToVictory", "/pmwiki/pmwiki.php/Main/AppointmentTelevision", "/pmwiki/pmwiki.php/Main/FollowTheLeader", "/pmwiki/pmwiki.php/Main/GenrePopularizer", "/pmwiki/pmwiki.php/Main/TropeCodifier", "/pmwiki/pmwiki.php/Main/HarderThanHard", "/pmwiki/pmwiki.php/Main/SocializationBonus", "/pmwiki/pmwiki.php/Main/FictionalCurrency", "/pmwiki/pmwiki.php/Main/LongList", "/pmwiki/pmwiki.php/Main/FanNickname", "/pmwiki/pmwiki.php/Videogame/HaloReach", "/pmwiki/pmwiki.php/Main/RomanceGame", "/pmwiki/pmwiki.php/Main/VirtualPaperDoll", "/pmwiki/pmwiki.php/Videogame/KingdomOfLoathing", "/pmwiki/pmwiki.php/Main/Cap", "/pmwiki/pmwiki.php/Main/OneHitKill", "/pmwiki/pmwiki.php/Main/RandomlyDrops", "http://kol.coldfront.net/thekolwiki/index.php/Daily_Activities", "/pmwiki/pmwiki.php/Main/BribingYourWayToVictory", "/pmwiki/pmwiki.php/Main/RandomlyDrops", "/pmwiki/pmwiki.php/Main/WebGame", "/pmwiki/pmwiki.php/Videogame/LeagueOfLegends", "/pmwiki/pmwiki.php/Main/LifeMeter", "/pmwiki/pmwiki.php/Main/CharacterLevel", "/pmwiki/pmwiki.php/Videogame/MouseHunt", "/pmwiki/pmwiki.php/Main/BribingYourWayToVictory", "/pmwiki/pmwiki.php/Videogame/NIER", "/pmwiki/pmwiki.php/UsefulNotes/Nintendo3DS", "/pmwiki/pmwiki.php/Main/Cap", "/pmwiki/pmwiki.php/Main/ComicallyMissingThePoint", "/pmwiki/pmwiki.php/Videogame/PokemonGoldAndSilver", "/pmwiki/pmwiki.php/Main/RealTime", "/pmwiki/pmwiki.php/Main/InUniverseGameClock", "/pmwiki/pmwiki.php/Videogame/PokemonBlackAndWhite", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Main/VideoGameCaringPotential", "/pmwiki/pmwiki.php/Main/EdutainmentGame", "/pmwiki/pmwiki.php/Main/AntiPoopSocking", "/pmwiki/pmwiki.php/Main/PlayerVersusPlayer", "/pmwiki/pmwiki.php/Main/CompilationRerelease", "/pmwiki/pmwiki.php/Main/DoubleUnlock", "/pmwiki/pmwiki.php/Videogame/SpiralKnights", "/pmwiki/pmwiki.php/Main/BribingYourWayToVictory", "/pmwiki/pmwiki.php/Videogame/Tamagotchi", "/pmwiki/pmwiki.php/Main/NoFairCheating", "/pmwiki/pmwiki.php/Videogame/VirtualVillagers", "/pmwiki/pmwiki.php/Main/ItMakesSenseInContext", "/pmwiki/pmwiki.php/Main/FictionalCurrency", "/pmwiki/pmwiki.php/Videogame/Warframe", "/pmwiki/pmwiki.php/Main/RandomDrops", "/pmwiki/pmwiki.php/Videogame/WarThunder", "/pmwiki/pmwiki.php/Videogame/WiiFit", "/pmwiki/pmwiki.php/Main/SubvertedTrope", "/pmwiki/pmwiki.php/Videogame/WorldOfTanks", "/pmwiki/pmwiki.php/Videogame/WorldOfWarcraft", "/pmwiki/pmwiki.php/Videogame/WurmOnline", "/pmwiki/pmwiki.php/Main/AllegedlyFreeGame"]}