{"title": "Bluff the Impostor", "content": "\n• From Dave, where Dave has ben hired to stand in for the President after a stroke renders him comatose. Ellen (The President's Wife): Reminds me of when you were in the state legislature. \n\nDave: Yeah... me too. \n\nEllen: You weren't in the state legislature. (stands up and offers her hand) Hi, I'm Ellen Mitchell. Who are you?\n• In The Spiderwick Chronicles movie, the main character's father seems to appear and he (the kid) asks his dad what it was he wanted to tell him. He's actually the villain, and the kid finds this out because his father was supposed to tell him they (the parents) were getting a divorce.\n• Used in The Return of the Pink Panther: Clouseau: What is your code name? \n\nDreyfus: I don't have a code name! I never had a code name, lunatic! \n\nClouseau: I understand sir, but you see, only the real Inspector Dreyfus would know he did not have a code name.\n• In The Numbers Station, after finding out that the station's one-way operator has also been compromised, Emerson confirms it by phoning and getting the code-phrase slightly wrong on purpose. Operator: Hello? \n\nEmerson: That wasn't the right password. \n\nOperator: What? \n\nEmerson: That wasn't the right password. \n\n[beat] \n\nOperator: Tell me you killed the girl before you figured that out. \n\n[Emerson hangs up]\n• In Captain Marvel, after Nick Fury's boss calls him \"Nicholas\", Fury realises he's been replaced by a Skrull. He confirms it by claiming their current situation is \"just like our mission in Havana\", to which the Skrull agrees. Gets a Call-Back later on when the same Skrull, now disguised as a Kree guard, uses the same line to let Fury know who he is.\n• In American Psycho: Lady: Did you see the ad in the Times? \n\nPatrick: Uh, yeah. \n\nLady: There was no ad in the Times.\n• In The One, when Gabe's Evil Twin tries to take his place: T.K.: That first time we met at the bookstore, did you ever imagine we'd end up in a mess like this? \n\nYulaw: Even if I had known, I still would have done it. \n\nT.K.: (turns gun on Yulaw) It wasn't a bookstore.\n• In Ronin, Sean Bean's Spence character is revealed to be a wannabee fraud of a spy when he is asked, by Sam ( Robert De Niro ), what the color of the boathouse at Hereford is (the main British SAS base), and is unable to provide an answer. After a shamed Spence shuffles away, Sam is asked what the color of the boathouse actually is, and he replies, \"Hell if I know.\"\n• In A Series of Unfortunate Events, Uncle Monty exposes Count Olaf (pretending to be a herpetologist named Stefano) as an imposter by asking him to milk Petunia the snake. \"Stefano\" started looking for udders. Unfortunately, while Monty realizes Stefano is an imposter, he doesn't realize that he's Count Olaf, which leads to his death.\n• Major Marquis Warren and Bob the Mexican go back-and-forth with each other throughout the first half of The Hateful 8. Warren takes an instant dislike to Bob and doubts his claim that Minnie is visiting her mother and left Bob in charge while she's gone. Eventually Warren stops pressing the point because Bob manages to correctly respond to the traps that Warren lays out to catch him (The first one being able to identify the type of tobacco Minnie smokes) It turns out that Bob is lying, and had helped kill Minnie before Warren arrived. He was able to dodge Warren's questions because he heard Minnie talk a bit before the rest of the gang killed her, but he still gets shot, because Minnie was notoriously racist towards Mexicans and would not let Bob in if she knew who he really is .", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/BluffTheImpostor?from=Main.BluffTheImposter", "media_links": ["/pmwiki/pmwiki.php/Film/Terminator2JudgmentDay", "/pmwiki/pmwiki.php/Film/LiveFreeOrDieHard", "/pmwiki/pmwiki.php/Film/Darkman", "/pmwiki/pmwiki.php/Film/DarkmanIITheReturnOfDurant", "/pmwiki/pmwiki.php/Film/Dave", "/pmwiki/pmwiki.php/Film/TheMasterOfDisguise", "/pmwiki/pmwiki.php/Film/TheSpiderwickChronicles", "/pmwiki/pmwiki.php/Film/TheReturnOfThePinkPanther", "/pmwiki/pmwiki.php/Film/TheNumbersStation", "/pmwiki/pmwiki.php/Film/CaptainMarvel2019", "/pmwiki/pmwiki.php/Film/AmericanPsycho", "/pmwiki/pmwiki.php/Film/TheOne", "/pmwiki/pmwiki.php/Film/InvasionUSA1952", "/pmwiki/pmwiki.php/Series/MysteryScienceTheater3000", "/pmwiki/pmwiki.php/Film/TheNegotiator", "/pmwiki/pmwiki.php/Film/EyesWideShut", "/pmwiki/pmwiki.php/Film/Ronin", "/pmwiki/pmwiki.php/Creator/RobertDeNiro", "/pmwiki/pmwiki.php/Film/AloneWithHer", "/pmwiki/pmwiki.php/Creator/JetLi", "/pmwiki/pmwiki.php/Film/BlackMask", "/pmwiki/pmwiki.php/Film/ThereWillBeBlood", "/pmwiki/pmwiki.php/Film/Stalag17", "/pmwiki/pmwiki.php/Film/MenInBlack", "/pmwiki/pmwiki.php/Creator/GeneHackman", "/pmwiki/pmwiki.php/Film/NarrowMargin", "/pmwiki/pmwiki.php/Film/TheFamousJettJackson", "/pmwiki/pmwiki.php/Creator/MichaelIronside", "/pmwiki/pmwiki.php/Film/ASeriesOfUnfortunateEvents", "/pmwiki/pmwiki.php/Film/DiamondsAreForever", "/pmwiki/pmwiki.php/Film/Midnight1939", "/pmwiki/pmwiki.php/Film/GodzillaFinalWars", "/pmwiki/pmwiki.php/Film/TheHatefulEight", "/pmwiki/pmwiki.php/Film/FaceOff"], "non_media_links": ["/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/DoubleTake", "/pmwiki/pmwiki.php/Main/CallBack", "/pmwiki/pmwiki.php/Main/EvilTwin", "/pmwiki/pmwiki.php/Main/SuperSoldier", "/pmwiki/pmwiki.php/Main/TheMole", "/pmwiki/pmwiki.php/Main/ShowWithinAShow", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/VoluntaryShapeshifting", "/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/RoomDisservice"]}