{"title": "Humanity Is Young", "content": "\"Yeah, I've heard about humans \u0097 think you're the center of the universe.\"\n\nSo, you're a human, and you've just met a never-before-seen race of extraterrestrials, and chances are you feel quite insignificant compared to the hyper-advanced culture in front of you. Often, the species will appear Younger Than They Look, in order to make the surroundings feel more comfortable. The being will then kneel down in front in you and say, in a gentle, soothing voice something to the effect of \"You humans are so young, yet in your short lifetime you have accomplished so much.\" In other cases, when confronted with multiple races, one group, usually a Five-Man Band, will be willing to accept the human, while the rest of the race dish out doses of Fantastic Racism. Contrast Earth Is Young, where the planet, not the species has been in existence for a short time, and We Are as Mayflies, which is about humans being young as individuals.\n\nIf there are interstellar alien races out there they are most likely to be several thousand if not millions of years older than our civilization, but for all we know we are the only extant sapient life in the universe.\n\nThis can also occur in the fantasy genre when there are multiple races. As opposed to Humans are Average humans will be the youngest race in terms of individual life span or time on the planet. Starting with the elves present in Lord of the Rings, almost any fantasy book that incorporates elves or some elf equivalent has humans in contrast being a young species.\n\nThis may exist because humans in Real Life have existed for a small fraction of the evolutionary, geologic, and cosmic timescales. Having humans be young gives an author the ability to point out human flaws in relation to a much older race.\n• In The Movie of Green Lantern, Tomar-Tu calls Hal Jordan's species young, trying to encourage Hal to prove his worth to the other Lanterns. The other Lanterns, and the Immortals, however, see his humanity as a weakness and treat him as a member of a lower species.\n• In the Transformers Film Series, this is the sole reason why Optimus Prime must protect the humans, and why Megatron must destroy them.\n• Q in Star Trek: The Next Generation. Although he tends to lean more towards borderline Fantastic Racism, and thus has to conduct the ever-increasingly difficult tests in order to prove, quote, \"humanity's worth\".\n• As are the Vulcans, but with Fantastic Racism that declines from Star Trek: Enterprise to Star Trek: Deep Space Nine. Even in Deep Space Nine, at least one Vulcan captain apparently built his entire academic career out of this (and taunting Sisko in particular).\n• In Babylon 5, humans are relatively new to interstellar travel: The first other race they met was the Centauri (who were, from the interstellar perspective, the ones who discovered them), and the Minbari have reportedly been a spacefaring race for millennia.\n• In Mass Effect, humans are one of the most recent races to make first contact. Also overlaps with Humans Are Diplomats, since we're also essentially taking over the universe.\n• Ask the other \"older\" races, particularly the Batarians, and they may instead say Humans Are the Real Monsters.\n• The termites of Professor Mmaa's Lecture state humanity to be a species as young as a nymph (termite young).\n• In Animorphs it is noted that humans are a lot younger than other species. Ax, however, expresses astonishment at how quickly they manage to do things; apparently it took his species three times as long to get from heavier-than-air flight to space exploration. (Another book reveals the primitive version of his species were around millions of years ago, and also that the Ellimist gave them their boost to sentience.) The Howlers are also mentioned as being thousands of years old but more or less stagnant, which makes sense if you know their origins.\n• In Uplift humanity and earth-based species are the new kids on the block and belittled, laughed at and hated for \u0097 even though humans are young \u0097 gaining some clout in the ranks of the galaxy. Since we already helped two species along on the way to conscience, sapience and intelligence, which is a great and honourable feat in the intergalactic society, the haters can't wipe us immediately out without incurring the wrath of other, more benevolent races. Thus humanity is young and very much a playball of older races, some of whom treat humanity with a chuckling respect while others barely keep in their rage.\n• In The Silmarillion humans are made last by the Valar. First Iluvatar made the Valar (demigods), one of which made the dwarves before Iluvatar had planed to awaken the elves, so Iluvatar told the Valar to keep the Dwarves in hibernation until he had released the Elves. Only once those two races had existed for a long time did Iluvatar finally create or awaken men. They have the least life-span of any race of middle earth (hobbits and dwarves make it to the hundreds, Elves on forever) and are seen to be coming into their own only in the third age.\n• Mostly played straight in Warhammer40000, though on somewhat greater timescales than is usual. The Imperium of Man may well be ten thousand years old, and humanity may well have had interstellar travel for the last 37,000 years, yet the Eldar, Orks and Necrons are many times older still. However, the situation is reversed with the Tau, who were primitive hunter-gatherers just 6,000 years ago, in fact they would have been wiped out by the Imperium if a freak warp storm hadn't destroyed the colonization fleet. Culturally the Tau embody a kind of naive youthful optimism - their society is bright, hopeful, scientifically-minded and technologically advanced, compared to the stagnant, superstitious and highly xenophobic Imperium of Man that dominates the galaxy. It's also played with in that humanity is in serious decline; the modern tech is obviously below the Eldar and Necrons, but the few times we've seen technology from humanity's height at full power it utterly curb stomped them.\n• In Orion's Arm Terragen life (not just humans) has only been space-faring for 10,600 years or so. Of the Xenosophont races that have been contacted the Silent Ones have been at their present state for at least 150,000 while Muuh civilization is millions of years old. On the other hand we did bootstrap a number of less advanced races such as the To'ul'h.\n• In Schlock Mercenary, humanity has been a part of galactic civilization for a millennium. That civilization is around 20,000 years old, and there are a handful of species with roots that go back for thousands of millennia.\n• Child of the Storm has this as something of the general Asgardian attitude towards humanity - we're young and still finding our way, while they're the undisputed heavyweight champions of the universe that was civilised while humanity was still evolving from monkeys, but they like our style and see our potential. Furthermore, some of the more self aware Asgardians (Thor, for example) note that 'more advanced' does not mean 'better'.\n• Everyone else, meanwhile, sees Earth as Insignificant Blue Planet that is barely civilised at best and too much trouble for its own good, and a manifestation of Asgardian eccentricity. Others who get a closer look at Earth, however, like Mar-Vell and the late Jor-El, saw a certain something in humanity.\n• Occasionally brought up in Stargate SG-1, when humanity meets the Nox and the Asgard, two of the Four Races that were the most advanced civilizations in the local galactic group. The Nox are rather patronizing and condescending about it, while the Asgard see potential in humanity and are willing to help the species along in its development, saying that one day, human civilization could stand among the Four as equals... as a Fifth Race.\n• In Andre Norton's SF universe, not only are there species with recorded histories many times humanity's entire existence, these species have no records of the Forerunner civilizations that flourished before them.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/HumanityIsYoung", "media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/Film/GreenLantern", "https://tvtropes.org/pmwiki/pmwiki.php/Film/TransformersFilmSeries", "https://tvtropes.org/pmwiki/pmwiki.php/Series/StarTrekTheNextGeneration", "https://tvtropes.org/pmwiki/pmwiki.php/Series/StarTrekEnterprise", "https://tvtropes.org/pmwiki/pmwiki.php/Series/StarTrekDeepSpaceNine", "https://tvtropes.org/pmwiki/pmwiki.php/Series/BabylonFive", "https://tvtropes.org/pmwiki/pmwiki.php/Franchise/MassEffect", "https://tvtropes.org/pmwiki/pmwiki.php/Literature/ProfessorMmaasLecture", "https://tvtropes.org/pmwiki/pmwiki.php/Literature/Animorphs", "https://tvtropes.org/pmwiki/pmwiki.php/Literature/Uplift", "https://tvtropes.org/pmwiki/pmwiki.php/Literature/TheSilmarillion", "https://tvtropes.org/pmwiki/pmwiki.php/TabletopGame/Warhammer40000", "https://tvtropes.org/pmwiki/pmwiki.php/Webcomic/SchlockMercenary", "https://tvtropes.org/pmwiki/pmwiki.php/Series/StargateSG1", "https://tvtropes.org/pmwiki/pmwiki.php/Creator/AndreNorton"], "non_media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/Main/InsignificantLittleBluePlanet", "https://tvtropes.org/pmwiki/pmwiki.php/Main/YoungerThanTheyLook", "https://tvtropes.org/pmwiki/pmwiki.php/Main/FiveManBand", "https://tvtropes.org/pmwiki/pmwiki.php/Main/FantasticRacism", "https://tvtropes.org/pmwiki/pmwiki.php/Main/EarthIsYoung", "https://tvtropes.org/pmwiki/pmwiki.php/Main/WeAreAsMayflies", "https://tvtropes.org/pmwiki/pmwiki.php/Main/HumansAreAverage", "https://tvtropes.org/pmwiki/pmwiki.php/Main/TheMovie", "https://tvtropes.org/pmwiki/pmwiki.php/Main/FantasticRacism", "https://tvtropes.org/pmwiki/pmwiki.php/Main/FantasticRacism", "https://tvtropes.org/pmwiki/pmwiki.php/Main/FantasticRacism", "https://tvtropes.org/pmwiki/pmwiki.php/Recap/StarTrekDeepSpaceNineS07E04TakeMeOutToTheHolosuite", "https://tvtropes.org/pmwiki/pmwiki.php/Main/HumansAreDiplomats", "https://tvtropes.org/pmwiki/pmwiki.php/Main/HumansAreTheRealMonsters", "https://tvtropes.org/pmwiki/pmwiki.php/Main/TokenNonHuman", "https://tvtropes.org/pmwiki/pmwiki.php/Main/CurbStompBattle", "https://tvtropes.org/pmwiki/pmwiki.php/WebOriginal/OrionsArm", "https://tvtropes.org/pmwiki/pmwiki.php/Fanfic/ChildOfTheStorm", "https://tvtropes.org/pmwiki/pmwiki.php/Main/HumansAreWarriors", "https://tvtropes.org/pmwiki/pmwiki.php/Main/HumansAreSurvivors", "https://tvtropes.org/pmwiki/pmwiki.php/Main/Determinator", "https://tvtropes.org/pmwiki/pmwiki.php/Main/HumansAreSpecial", "https://tvtropes.org/pmwiki/pmwiki.php/Main/InsignificantBluePlanet"]}