{"title": "Russia Called; They Want Alaska Back", "content": "Ah, Alaska, America's 49th state and the Last Frontier. The home of salmon, gold, oil, and many kinds of wildlife. And a potential place of origin for World War III.\n\nWhen we talk about an Alaskan land rush here, we usually mean vast armies rushing across the landscape.\n\nIn 1867, the Russian Tsar sold the territory of Russian America to the United States. The territory wasn't doing the Tsar much good, never really turning a profit, and proving to be an unnecessary thorn in the Empire's already strained relationship with the UK (which owned Canada), so the Russian government was open to any reasonable opportunity to offload it. Russia and the US being rather buddy-buddy in the 1850s and '60s (the US had backed up the Russians diplomatically during the Crimean War, and Russia had run interference in Europe on the Union's behalf during The American Civil Warnote by subtly threatening to engage Prussia (it's a long story, much of it to do with the Balkans, but suffice it to say Russia and Prussia were also on good terms in the days of Bismarck) in an attack on France and the UK should either recognize and assist the Confederacy), the Tsar made the obvious decision once the US sent a decent offer. The U.S. named their new territory Alaska (long a colloquial name for the region), and 92 years later in 1959 it became the 49th state. But what happens if the Russians with Rusting Rockets decide to renege on the deal?\n\nThis is a sister trope to Mexico Called; They Want Texas Back, with Russia in place of Mexico and Alaska in place of Texas and the Southwestern U.S. Like with Texas, this is also a localized version of Invaded States of America.\n\nFiction has produced no shortage of works depicting this scenario. It began gaining popularity during the Cold War, when there was real fear of the Soviet Union invading. However, it has remained common in the post-Soviet era, usually with a resurgent Russia, or even some other enemy like China invading. This is because Alaska has so many resources that are important for America and it also occupies a strategic place on the globe so it could be a tempting target for any enemy with the power to go up against the Yanks with Tanks. In 1935, General Billy Mitchell testified before Congress about Alaska's importance, saying: \"I believe that in the future, whoever holds Alaska will hold the world. I think it is the most important strategic place in the world.\"\n\nThe reasons for the Russians invading will often vary depending on the work, but usually they are....\n• Genuinely trying to reconquer and reannex the state,\n• They are not actually trying to take Alaska back, but just trying to distract the United States military from a battle taking place elsewhere in the world (and maybe damage/destroy some of the important resources in the state while their at it). Usually happens in World War III settings.\n• They are using Alaska as a \"bridge\" to invade the continental U.S. and Canada.\n\nSome more humorous works might have two or more sides fighting over a fictional \"deed\" to Alaska left over from the original purchase. (Note: Such a deed doesn't exist in real life.)\n\nIn Real Life, Alaska has only been invaded once, not by Russia, but by Imperial Japan during World War II when they seized two Aleutian Islands as a diversion from their planned attack on Midway in 1942; it didn't work out like they planned.\n\nA Russian assault would be unlikely at present because doing so would almost certainly start World War III, provoking a response from America's allies as well as the U.S, itself. There is also the fact that both sides of the Bering Strait are severely lacking in the infrastructure needed to move and supply any invading force. The nearest Russian railhead is roughly 2,000 miles away, meaning any effort would be by sea, and the US Navy currently outclasses the Russian Navy, especially in the Pacific. So such concerns or discussions of this happening in the real world are minor at the moment unless an actual World War III suddenly breaks out.\n\nOverlaps with Invaded States of America and sometimes Russia Takes Over the World.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/RussiaCalledTheyWantAlaskaBack", "media_links": ["/pmwiki/pmwiki.php/Film/RedDawn1984", "/pmwiki/pmwiki.php/Series/Sliders", "/pmwiki/pmwiki.php/Series/CoryInTheHouse", "/pmwiki/pmwiki.php/Series/StargateSG1", "/pmwiki/pmwiki.php/VideoGame/BattlefieldBadCompany", "/pmwiki/pmwiki.php/WesternAnimation/GIJoeARealAmericanHero"], "non_media_links": ["/pmwiki/pmwiki.php/UsefulNotes/Alaska", "/pmwiki/pmwiki.php/Main/WorldWarIII", "/pmwiki/pmwiki.php/UsefulNotes/ImperialRussia", "/pmwiki/pmwiki.php/UsefulNotes/CrimeanWar", "/pmwiki/pmwiki.php/UsefulNotes/TheAmericanCivilWar", "/pmwiki/pmwiki.php/UsefulNotes/RussiansWithRustingRockets", "/pmwiki/pmwiki.php/Main/MexicoCalledTheyWantTexasBack", "/pmwiki/pmwiki.php/Main/InvadedStatesOfAmerica", "/pmwiki/pmwiki.php/UsefulNotes/ColdWar", "/pmwiki/pmwiki.php/Main/MakeTheBearAngryAgain", "/pmwiki/pmwiki.php/UsefulNotes/YanksWithTanks", "/pmwiki/pmwiki.php/Main/WorldWarIII", "/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/Main/WorldWarIII", "/pmwiki/pmwiki.php/Main/InvadedStatesOfAmerica", "/pmwiki/pmwiki.php/Main/RussiaTakesOverTheWorld", "/pmwiki/pmwiki.php/Main/HilarityEnsues", "https://youtu.be/2WSgI5DwL4U", "/pmwiki/pmwiki.php/Main/MiddleEasternCoalition", "/pmwiki/pmwiki.php/Videogame/ShatteredUnion", "/pmwiki/pmwiki.php/Main/DividedStatesOfAmerica", "/pmwiki/pmwiki.php/Main/GratuitousEnglish", "/pmwiki/pmwiki.php/Main/DontExplainTheJoke", "/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/UsefulNotes/KoreanWar", "https://en.wikipedia.org/wiki/14th_Army_(Soviet_Union)", "http://www.vice.com/read/the-best-of-vladimir-zhirinovsky-russias-craziest-politician", "http://factcheck.org/2012/03/alaskan-island-giveaway/"]}