{"title": "Technicolor Ninjas", "content": "These ninja don't quite get \"camouflage means colors that blend in.\" They wear bright, obvious outfits, and common sense dictates that they shouldn't be stealthy at all. And yet... they are. They rarely use any magical powers, Applied Phlebotinum, or other fiction-specific cheats. They're just that good, and are skilled enough at sneaking around that however highly visible they might appear to be, in practice they're extremely hard to spot and harder to catch.\n\nThese ninjas are most frequently seen in Comic Books, Anime, and Animated Shows, though it sometimes turns up in Live-Action TV as well.\n\nFor Comic Books, the trope likely came to be because until about 25-30 years ago, the process used to print comics was only a four color process. The Animation Age Ghetto may also have some culpability here because bright colors attract the attention of children.\n\nNinjas whose costumes are black or other dark colors but can sneak around unseen in civilian clothing also fit this trope. Unlike the Highly Visible Ninja, they don't necessarily travel in packs of 20. They don't make those Funny Bruce Lee Noises, nor do they twirl their weapons and pose at great distances from the enemy unless they have a weapon or superpower that makes it worth it to do so. They don't tend to worry about the Conservation of Ninjutsu, either; alone or in pairs, these ninjas are good enough to take out lesser ninja without wrinkling that costume. And if they do get spotted? Well, too bad for the spotter.\n\nTechnically speaking, it is possible for someone not trained as a ninja to be so stealthy they're unnoticeable even in garish colors, but it is rarer.\n\nSomewhat Truth in Television; A ninja dressed all in black would stick out like a sore thumb against a starlit sky. Anytime actual ninjas suited up for nighttime espionage, they would wear navy blue.\n\nThey are the result of a natural ability or developed skill of people who start out and are always basically humanoid shaped (or whatever passes for same on their world of origin).\n• Shapeshifters who can take on a shape no one will notice.\n• Speedsters also don't count, as any streaks or afterimages are mainly for the benefit of the audience/viewer so they can tell where the character is who can move faster than the human eye can detect. Plus, it makes a better looking scene setting.\n• People who can naturally turn invisible are actually opposite the point. These ninjas can't turn invisible yet the people around them behave as if they are.\n\nContrast with Highly Visible Ninja, who is quickly noticed, often Lampshaded, and subsequently attacked (and who, assuming they survive, may evolve into this trope).\n• Science Ninja Team Gatchaman (aka Battle of the Planets aka Eagle Riders aka G Force) wore garishly colored bird themed uniforms that came with their own \"swish!\" sound effect. Said suits were activated by Transformation Trinkets, and they still could sneak practically into the heart of the Big Bad's Humongous Mecha of the Week before the Mooks noticed them.\n• Mazinger Z: Blazas S1 and S2, two humanoid, blue-and-yellow Mecha-Mooks were capable to infiltrate stealthily into the Home Base and planting two bombs without being unseen.\n• Lafitte of One Piece. His costume doesn't stand out quite as much as some of the other characters mentioned here, but he snuck into what is arguably one of the most heavily guarded buildings in the world and went completely unnoticed before he intentionally revealed himself, all the while wearing tap dancing shoes.\n• He seems to have eaten a bird devils fruit as he can sprout wings, so he probably just flew to the window where he appeared.\n• Mobile Fighter G Gundam: Apparently, being dressed like his nation's incredibly colorful flag doesn't prevent German ninja Schwarz Bruder from practically turning invisible when he wants to.\n• Despite his bright orange outfit and loud personality, Naruto can be pretty darn stealthy when he wants to be. A couple of different takes on Naruto himself give his reasons as wearing his \"Safety Orange\" outfit as either stealth training or it was the only thing he could get to wear. Post-Time Skip, Naruto does incorporate a large amount of black into his outfit. Based on his recent proclamation to it seems he chooses orange just because he likes it.\n• Notable occasions of Naruto displaying stealth include:\n• Covering a monument with graffiti in broad daylight without any of the people present noticing until he was done.\n• Breaking into the Hokage tower and stealing a top-secret document with only one person discovering him. Even more notable in that the one person was the Hokage himself, who found Naruto by accident, and Naruto took him out of action with a Sexy No Jutsu. He took out the leader of his village and its most powerful ninja, while on a mission that wasn't meant to involve confrontations in the first place.\n• Successfully hiding a dozen clones of himself in a small room in such a manner that the best student of his year didn't notice them.\n• Evading the notice of Haku and Zabuza, experts at tracking opponents in a heavy mist, while attempting to link up with Sasuke.\n• Replacing a hostage held by Iruka, the man who knows all of Naruto's tricks and abilities.\n• Using one of his clones feigning unconsciousness and hiding the hole when he hides himself under the ground, and then defeats Neji with a surprise upper cut from the ground.\n• It should also be noted that considering how an average person dresses in the Naruto-verse, an orange jumpsuit is infinitely better for blending into a crowd than a black stagehand uniform. It may well be that the standard ninja strategy is to just look like normal civilians once their take their headbands off... which is what real ninjas did.\n• Ranma ½'s Konatsu the Kunoichi. Even though his uniform is bright red, he's incredibly stealthy, surprising even the most sensitive martial arts masters in the series. Also exhibited, surprisingly enough, by Sasuke, who despite his cringingly obvious ninja outfit often manages to be incredibly stealthy even though he's totally incompetent at anything else.\n• The Marvel Universe:\n• X-Men is an egregious offender, and that's without taking into consideration the telepaths who can shield their presence from others, or people who turn invisible or can fly.\n• Wolverine wears bright yellow and frequently sneaks by the Mooks. Several of Wolverine's girlfriends are capable of the same:\n• Yuriko is almost not a ridiculously stealthy ninja, except she likes to shout \"GOTCHA!\" at people she's sneaked up on.\n• Viper is ridiculously stealthy, despite wearing a bright green patent leather catsuit and spiked heels.\n• Gambit has been known to wear a color somewhere between fuchsia and hot pink, and also is sneaky enough to go unnoticed in this color combination.\n• Kitty Pryde is a trained ninja and tends to go unnoticed in the yellow and black \"bumblebee\" costume. And this is without taking into account that she can phase.\n• Nightcrawler, whose costume is largely red and white, turns invisible (except for his eyes) in shadow, and can Wall Crawl like Spider-Man. As long as he doesn't teleport and give himself away, he's super stealthy. (He does have a \"secondary mutation\" of camouflaging while wearing a suit of unstable molecules. If there's any shadows at all, he can blend into them. But this is virtually never mentioned.)\n• Deadpool is a borderline Cloudcuckoo Lander example. If he's concentrating enough to stop the constant stream of crazed, manic, fourth-wall breaking babble, he can be quite stealthy. Of course sometimes he is stealthy because of the constant stream of crazed, manic, and fourth-wall breaking behavior. The Skrulls were not looking for a Super 'hero' hidden dressed as a baseball mascot.\n• Spider-Man comes close because of No Peripheral Vision and the fact that he's got faster reflexes than normal humans. Apparently no one in the Marvel Universe ever looks up (which is an important point made in the superhero comic Invincible that heroes have a tendency to move above the populace who never look up but often look up themselves which separates them from the average civilian).\n• The ever present Hand clan (originally from Daredevil, but now they're everywhere) wear bright red costumes. And let's not forget former Hand disciple Elektra's revealing leotard and loin-cloth... thing.\n• The DCU:\n• Robin from Batman. The original Robin grows out of it; as Nightwing, he has the sense to wear a mostly black costume. But in his civilian clothing he can still pull off ridiculous stealth. Successive Robins have had more muted red and greens in their costumes (also pants). Tim Drake's second costume is dark red and black, and both of his costumes had a black cape with relatively muted yellow lining inside, which he uses to cloak himself. Damian Wayne has added a hood, presumably for extra stealth, but returned to the bright yellow cape.\n• Anyone in the Bat Family can pull this off, no matter how eye-catching their outfit might be. The master would have to be Jean-Paul Valley, who somehow managed to be stealthy in both his AzBats armor and in his Azrael costume, which included flaming swords.\n• David Mack's Kabuki has a brief appearance of the preppy ninjas. Ninjas who wear golfing duds on their missions. Doesn't make them any less deadly.\n• The Teenage Mutant Ninja Turtles are, out of necessity, stealthier than your average Ninja. They are anthropomorphic turtles in a world not widely populated by anthropomorphic animals.\n• The various \"ninjasploitation\" movies by Chinese director Godfrey Ho featured a myriad of multi-colored ninjas, often wearing headbands with the word \"Ninja\" on them. Probably the most memorable example is Pierre Kirby's character in Full Metal Ninja, who is dressed in bright pink.\n• Super Sentai/Power Rangers:\n• The ninja-based incarnations feature rangers in such non-stealthy colors as bright pink, yellow, red, and blue. The last two form an almost subversion, there was a pair of \"crimson and navy\" rangers whose suits were dark colored. Still too bright to be stealthy, but much better than their neon-red-and-sky-blue counterparts. Even better, Shurikenger from Hurricaneger changed to the Green Samurai Ranger in Ninja Storm calls himself \"ninja of ninja\"...while wearing a bright green costume with lots of gold accents including an armored vest.\n• Shuriken Sentai Ninninger averts this on a technicality. The trope is about people who manage to be stealthy in spite of being eye-catching, but as stated by their catchphrase \"We are the shinobi that don't hide!\" the Ninningers aren't even trying.\n• In the Ninja Hero adventure Ninja Mountain, the PCs at one point must penetrate a \"training compound\" for ninjas, which is really just a rip-off school and naturally features these. The text notes that the stealth training is remarkably effective: if you can sneak around in a light forest wearing a day-glow \"ninja outfit\" you can sneak around anywhere.\n• Warhammer 40K: Ork kommandoz are seven-foot-tall green killing machines belonging to a species who's first, last and favorite strategy involves running straight at the enemy while yelling and shooting. And yet, kommandoz actually manage to stay sneaky long enough to plant bombs or jump out of hiding to resume the aforementioned chopping, yelling and shooting. As orks hold colors to hold special properties (black is tougher, blue is lucky, Red Ones Go Faster) fanon holds that they paint themselves lurid colors like purple and orange for maximum sneakiness. Why? Well, have you ever seen a purple-and-orange-painted ork? Of course not: that's how sneaky it makes them.\n• Ezio from Assassin's Creed. While the white and red hooded Assassin's robe allowed Altair to blend in with monk and scholar uniform during the Crusades, it makes much less sense in Renaissance Italy where it was the exact opposite of Renaissance era fashion (people favored big fancy hats, baggy coats and trousers, and dark \"royal\" colors). Plus, Ezio would walk around Templar controlled cities wearing a giant Assassin insignia on this sash. It's surprising that the Templars didn't just put a hit on the guy wearing the Assassin uniform. Later protagonists would tone down the colors, and replace the robe with a large coat though the conspicuous hood remains.\n• In fact, many Assassin's Creed characters can qualify as Technicolor Ninjas, especially those with armor and costume customization. Many are able to be equipped with brightly-colored outfits that would provide no advantage to them while they sneak around stabbing Templars.\n• The ninja characters from the Mortal Kombat series, though strictly speaking, the only ninja of the bunch is Scorpion - the others just happen to use similar uniforms (a practice largely eschewed by the time of Deadly Alliance). The funny thing is that, in the MK universe, ninja are considered a Japanese offshoot of the Lin Kuei clan (to which Sub-Zero, mutually Palette Swapped with Scorpion, belongs).\n• The \"Stalker\" Character Type in City of Villains who had such high stealth that even allies weren't necessarily sure the character was there, regardless of what kind of ridiculous costume combo a player came come up with. There was at least one mission where they turned their heads in confusion and ask, \"Is that you [Name of Character]?\"\n• Similar in World of Warcraft. A Rogue's \"Stealth\" skill is so effective that the rogue can be wearing a bright green outfit with Spikes of Villainy on Shoulders of Doom and that constantly trails a sickly yellow-green smoke without ever being noticed by his enemies. Even his allies will find him hard to spot unless he's close enough.\n• Sam Fisher from Splinter Cell, at first glance. He's incredibly stealthy, he sticks to the shadows picking off his targets without anyone knowing about it, he has three bright green lights on his head and another on his back. Word of God states those lights are just for player benefit. The lights don't show up in the mirrors, nor do they show up in multiplayer from the mercenary perspective. Parodied by Penny Arcade.\n• Espio the Chameleon, but only in Shadow the Hedgehog. Usually when having to sneak as part of the plot, he has the ability to go invisible, which renders him an exception. However, the ability was absent in this game, thus he was simply running around Mad Matrix in his bright purple colours. Worse when you consider that Shadow was probably camouflaged better given his black fur and almost neon-esque stripes. Even worse when you consider that he can sometimes tell Shadow to stop attacking lest they get caught when he's homing a robot to pieces himself, which arguably draws more attention to them than firing some quick and long-range bullets. And even worse than that when you consider that he can sometimes say that when in full view of Eggman and his Egg Breaker in the level's boss fight. There might be a reason why his ninja status is surprisingly downplayed in the games...\n• Gale from Virtua Cop 3. He mostly avoids being caught after being defeated in a boss fight since he has stealth camouflage.\n• The Hero of The Elder Scrolls IV: Oblivion and Dragonborn of The Elder Scrolls V: Skyrim can be this, as long as your stealth skill is high enough you can creep around in giant spiky armor that glows in the dark and still kill bandits ten feet away from their buddies without them noticing. In both games, the Light Armour tree beneficial for sneaking include things like Elven Armour which is Golden full plate, and Glass Armour with is vivid green.\n• Fallout: New Vegas and Fallout 3 allow you to do this. While the clothing/armor that gives bonuses to your stealth skill is generally darker, none of the clothing gives penalties to stealth. This includes a set of Power Armor with running tesla coils all over it, Roman-esque metal armor with bright red and gold highlights, and a set of leopard print pajamas. Despite this, having your flashlight on will make you more noticeable. Even the Stealth Suit Mk2 which provides a bonus to sneek despite having large fluorescent white stripes.\n• The Strider series has Hiryu running around in a bright red scarf with a glowing plasma sword. While he's much closer to a Private Military Contractor than a ninja, per se, he still makes a point of using the ninja aesthetic, and then not being spotted by all of the guards despite the aforementioned red scarf and glowing sword.\n• Persona 5: Party member Ann Takamaki. Wearing a candy apple red catsuit with neon pink gloves (in contrast to her teammates, who wear mostly black) might not be the best choice for someone who calls themselves a Phantom Thief.\n• The Ranger from XCOM 2 and the Shinobi from XCOM: Long War 2 are the respective Stealth Experts of their games and are equally capable of being stealthy even if wearing brightly-coloured armour. The Reapers introduced in War of the Chosen wear huge dark longcoats with hoods and masks with bright lights, and yet they're even sneakier \u0096 their regular detection radius is so small, an alien would have to move within two meters of them to notice something wrong.\n• The Sheikah of The Legend of Zelda are typically portrayed from Ocarina of Time onward as wearing a bright purple outfit, while the Yiga Clan in Breath of the Wild are shown wearing crimson outfits with black highlights. But they both have various magical techniques to keep out of sight, while the purple Stealth Armor from Breath of the Wild is stated to be specifically designed to reduce the sound one makes rather than one's visibility.\n• Ada Wong from Resident Evil is a master Femme Fatale Spy that makes a living infiltrating top secret facilities and military strongholds. She also has a tendency towards Combat Stilettos and flashy, bright red dresses. Her clothing choices never seem to cause her any issues, in spite of rarely being appropriate for a stealth-and-combat based mission.\n• We can probably add Quill from Dan and Mab's Furry Adventures to the folder. She's the 8-foot tall giraffe towering over the cast, and a combat teacher at SAIA (that one is her first appearance, though she was already mentioned in supplementary files). This is her second\n• The Bob and George ninjas wear bright yellows, reds, greens and blues.\n• Dark Maze Studios' Ninja the Mission Force is an Affectionate Parody of the Godfrey Ho Ninja Movies. When a ninja in military camouflage is one of the least noticeable ninjas out there, you know what time it is.\n• In We Are All Pokémon Trainers, Bastion is a ninja (his ninja costume consists of his normal attire with a blue mask and blue knuckledusters) who wears mainly blue clothing.\n• The Bots Master had Ninjzz, a three-armed robot ninja on rollerblades, who was still so stealthy nobody noticed him unless he wanted it so.\n• Kim Possible has bright red hair and a bumbling Side Kick. Nonetheless, she has been known to successfully sneak unnoticed while in her purple and orange cheerleader uniform. Shego can also be pretty sneaky, even though half her outfit is bright green.\n• Pretty much every \"ninja\" in G.I. Joe other than Snake Eyes, Storm Shadow, and Firefly. Of course, even they got some odd repaints (to the point that Storm Shadow, counterintuitively, is most known for wearing a bright white uniform with highly visible Cobra symbols). And Snake Eyes was actually purple in the cartoon. However the winners are the Cobra ninjas — the Night Creepers (after the new toys changed their appearance). Before they were dressed in dull maroon and purple with ninja masks and visors, relatively loud for their job. But after the movie, when the series relaunched in 1993, they came back sporting bright purple armor, with neon blue helmets and gloves. And while they were mooks (even Night Creeper Leader couldn't square off very well against any other named character) they were known for being able to sneak into highly secured areas.\n• All over the place in Ninjago. Four of the main ninjas wear bright red, green, blue and white costumes. Cole has a black ninja suit, but it's accented with flashy sliver shoulder pads. Yet they can all be pretty stealthy when the need arises. Zig-Zagging Trope in one episode when Zane's white outfit is accidentally dyed pink. He complains about is being ridiculous, but he's still very stealthy wearing it and it actually helps him camouflage against a pink poster in the climax of the episode.\n• Young Justice has Robin (Dick Grayson) again, able to Stealth Hi/Bye in the middle of the desert while wearing red and yellow. Noticeably the rest of the team gets stealth-suits that can change color to a dark grey/black, while he uses his normal outfit. It should be noted however, that his outfit is far darker than that of his comics' counterpart. The third Robin, Tim Drake, is also shown to be exceptionally good at stealth, yet despite having an even darker costume than Dick's, he apparently has a stealth-suit function built into his costume.\n• Odd as it may sound, this trope applies to Pinkie Pie from My Little Pony: Friendship Is Magic. Normally she's pretty overt, especially given her bouncing stride, but has been known to be incredibly stealthy when the mood takes her. Also, she can apparently move through mirrors.\n• Despite her technicolor tail not being covered up by her Spy Catsuit, Rainbow Dash neatly managed to sneak her way into the hospital so she could finish reading a Daring Do book. Reading under the bed and suddenly rising, which disturbed the patient, took her out of technicolor territory and firmly into highly visible territory.\n• Fluttershy, when sneaking out of the Trixie-controlled Ponyville in Magic Duel. Ponyville is surrounded by a force field that lets Trixie know when anyone tries to get through, and her stealth suit includes bright blue bunny ears. She gets out by hiding in a log and letting her beaver friends carry it out of town, counting on Trixie to consider them unimportant and let them through the force field.\n• If this trope applies in the comic book franchise, any animated version of Spider-Man will feature it, too. Not that he doesn't get quickly noticed, lampshaded, and subsequently attacked sometimes.\n• Mixels has the Nindjas, the superhero team of Mixopolis who act as standard Ninjas. Despite their stealth, they're colored in bright black and orange for their tribe coloration.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/TechnicolorNinjas?from=Main.TechnicolorNinja", "media_links": ["/pmwiki/pmwiki.php/VideoGame/Deadpool", "/pmwiki/pmwiki.php/Anime/ScienceNinjaTeamGatchaman", "/pmwiki/pmwiki.php/Anime/BattleOfThePlanets", "/pmwiki/pmwiki.php/Anime/MazingerZ", "/pmwiki/pmwiki.php/Manga/OnePiece", "/pmwiki/pmwiki.php/Anime/MobileFighterGGundam", "/pmwiki/pmwiki.php/Manga/Naruto", "/pmwiki/pmwiki.php/Manga/RanmaOneHalf", "/pmwiki/pmwiki.php/Franchise/MarvelUniverse", "/pmwiki/pmwiki.php/ComicBook/XMen", "/pmwiki/pmwiki.php/Franchise/Wolverine", "/pmwiki/pmwiki.php/ComicBook/Gambit", "/pmwiki/pmwiki.php/ComicBook/KittyPryde", "/pmwiki/pmwiki.php/ComicBook/Nightcrawler", "/pmwiki/pmwiki.php/Franchise/SpiderMan", "/pmwiki/pmwiki.php/Franchise/MarvelUniverse", "/pmwiki/pmwiki.php/ComicBook/Elektra", "/pmwiki/pmwiki.php/Franchise/TheDCU", "/pmwiki/pmwiki.php/ComicBook/Robin", "/pmwiki/pmwiki.php/Franchise/Batman", "/pmwiki/pmwiki.php/ComicBook/RobinSeries", "/pmwiki/pmwiki.php/ComicBook/Azrael", "/pmwiki/pmwiki.php/ComicBook/Kabuki", "/pmwiki/pmwiki.php/Franchise/TeenageMutantNinjaTurtles", "/pmwiki/pmwiki.php/Film/GodfreyHoNinjaMovies", "/pmwiki/pmwiki.php/Franchise/SuperSentai", "/pmwiki/pmwiki.php/Franchise/PowerRangers", "/pmwiki/pmwiki.php/Series/NinjaSentaiKakuranger", "/pmwiki/pmwiki.php/Series/MightyMorphinPowerRangers", "/pmwiki/pmwiki.php/Series/NinpuuSentaiHurricaneger", "/pmwiki/pmwiki.php/Series/PowerRangersNinjaStorm", "/pmwiki/pmwiki.php/Series/ShurikenSentaiNinninger", "/pmwiki/pmwiki.php/TabletopGame/HeroSystem", "/pmwiki/pmwiki.php/TabletopGame/Warhammer40K", "/pmwiki/pmwiki.php/Franchise/AssassinsCreed", "/pmwiki/pmwiki.php/Franchise/MortalKombat", "/pmwiki/pmwiki.php/VideoGame/CityOfHeroes", "/pmwiki/pmwiki.php/VideoGame/WorldOfWarcraft", "/pmwiki/pmwiki.php/VideoGame/SplinterCell", "/pmwiki/pmwiki.php/Webcomic/PennyArcade", "/pmwiki/pmwiki.php/VideoGame/ShadowTheHedgehog", "/pmwiki/pmwiki.php/VideoGame/VirtuaCop", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsIVOblivion", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsVSkyrim", "/pmwiki/pmwiki.php/VideoGame/FalloutNewVegas", "/pmwiki/pmwiki.php/VideoGame/Fallout3", "/pmwiki/pmwiki.php/VideoGame/Strider", "/pmwiki/pmwiki.php/VideoGame/Persona5", "/pmwiki/pmwiki.php/VideoGame/XCOM2", "/pmwiki/pmwiki.php/VideoGame/XCOMLongWar", "/pmwiki/pmwiki.php/Franchise/TheLegendOfZelda", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaOcarinaOfTime", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaBreathOfTheWild", "/pmwiki/pmwiki.php/Franchise/ResidentEvil", "/pmwiki/pmwiki.php/Webcomic/DanAndMabsFurryAdventures", "/pmwiki/pmwiki.php/Webcomic/BobAndGeorge", "/pmwiki/pmwiki.php/Creator/DarkMazeStudios", "/pmwiki/pmwiki.php/Film/GodfreyHoNinjaMovies", "/pmwiki/pmwiki.php/WesternAnimation/TheBotsMaster", "/pmwiki/pmwiki.php/WesternAnimation/KimPossible", "/pmwiki/pmwiki.php/Franchise/GIJoe", "/pmwiki/pmwiki.php/WesternAnimation/Ninjago", "/pmwiki/pmwiki.php/WesternAnimation/YoungJustice", "/pmwiki/pmwiki.php/WesternAnimation/MyLittlePonyFriendshipIsMagic", "/pmwiki/pmwiki.php/Franchise/SpiderMan", "/pmwiki/pmwiki.php/WesternAnimation/Mixels"], "non_media_links": ["/pmwiki/pmwiki.php/Main/AppliedPhlebotinum", "/pmwiki/pmwiki.php/Main/HighlyVisibleNinja", "/pmwiki/pmwiki.php/Main/ComicBooks", "/pmwiki/pmwiki.php/Main/Anime", "/pmwiki/pmwiki.php/Main/AnimatedShows", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/ComicBooks", "/pmwiki/pmwiki.php/Main/AnimationAgeGhetto", "/pmwiki/pmwiki.php/Main/HighlyVisibleNinja", "/pmwiki/pmwiki.php/Main/FunnyBruceLeeNoises", "/pmwiki/pmwiki.php/Main/RuleOfCool", "/pmwiki/pmwiki.php/Main/ConservationOfNinjutsu", "/pmwiki/pmwiki.php/Main/StealthExpert", "/pmwiki/pmwiki.php/Main/TruthInTelevision", "/pmwiki/pmwiki.php/Main/Shapeshifting", "/pmwiki/pmwiki.php/Main/SuperSpeed", "/pmwiki/pmwiki.php/Main/RuleOfPerception", "/pmwiki/pmwiki.php/Main/RuleOfCool", "/pmwiki/pmwiki.php/Main/HighlyVisibleNinja", "/pmwiki/pmwiki.php/Main/Anime", "/pmwiki/pmwiki.php/Main/MickeyMousing", "/pmwiki/pmwiki.php/Main/TransformationTrinket", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/HumongousMecha", "/pmwiki/pmwiki.php/Main/Mooks", "http://garada.net/mediashare/o5-6e3kjgy0boqeow3l7uukwa5i2kl1s0-pre.jpg", "/pmwiki/pmwiki.php/Main/MechaMooks", "/pmwiki/pmwiki.php/Main/HomeBase", "/pmwiki/pmwiki.php/Main/WearingAFlagOnYourHead", "/pmwiki/pmwiki.php/Main/McNinja", "/pmwiki/pmwiki.php/Main/HighlyVisibleNinja", "/pmwiki/pmwiki.php/Main/AlternativeCharacterInterpretation", "/pmwiki/pmwiki.php/Main/TimeSkip", "/pmwiki/pmwiki.php/Main/DistractedByTheSexy", "/pmwiki/pmwiki.php/Main/FridgeBrilliance", "/pmwiki/pmwiki.php/Main/FridgeBrilliance", "/pmwiki/pmwiki.php/Main/DudeLooksLikeALady", "/pmwiki/pmwiki.php/Main/WholesomeCrossdresser", "/pmwiki/pmwiki.php/Main/RealMenWearPink", "/pmwiki/pmwiki.php/Main/WallCrawl", "/pmwiki/pmwiki.php/SelfDemonstrating/Deadpool", "/pmwiki/pmwiki.php/Main/CloudcuckooLander", "/pmwiki/pmwiki.php/Main/CrouchingMoronHiddenBadass", "/pmwiki/pmwiki.php/Main/CrazyAwesome", "/pmwiki/pmwiki.php/Main/NoPeripheralVision", "/pmwiki/pmwiki.php/Main/SuperReflexes", "/pmwiki/pmwiki.php/Comicbook/Invincible", "/pmwiki/pmwiki.php/Comicbook/Daredevil", "/pmwiki/pmwiki.php/Comicbook/Nightwing", "/pmwiki/pmwiki.php/Characters/BatmanAndBatFamily", "/pmwiki/pmwiki.php/Main/SuckSessor", "/pmwiki/pmwiki.php/Main/ScaryImpracticalArmor", "/pmwiki/pmwiki.php/Main/Ninja", "/pmwiki/pmwiki.php/Main/RealMenWearPink", "/pmwiki/pmwiki.php/Main/LiveActionTV", "https://www.rovang.org/wiki/ninja-rangers.jpg", "/pmwiki/pmwiki.php/Main/TabletopGames", "/pmwiki/pmwiki.php/Main/RedOnesGoFaster", "/pmwiki/pmwiki.php/Main/InsaneTrollLogic", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/PaletteSwap", "/pmwiki/pmwiki.php/Main/SpikesOfVillainy", "/pmwiki/pmwiki.php/Main/ShouldersOfDoom", "/pmwiki/pmwiki.php/Main/WordOfGod", "/pmwiki/pmwiki.php/Main/RuleOfPerception", "http://www.penny-arcade.com/comic/2013/08/16", "/pmwiki/pmwiki.php/Main/InvisibilityCloak", "/pmwiki/pmwiki.php/Main/PrivateMilitaryContractors", "/pmwiki/pmwiki.php/Main/PhantomThief", "/pmwiki/pmwiki.php/Main/StealthExpert", "/pmwiki/pmwiki.php/Main/EvilCounterpart", "/pmwiki/pmwiki.php/Main/RedAndBlackAndEvilAllOver", "/pmwiki/pmwiki.php/Main/FemmeFataleSpy", "/pmwiki/pmwiki.php/Main/CombatStilettos", "/pmwiki/pmwiki.php/Main/Webcomic", "http://missmab.com/Comics/Vol_1258.php", "http://missmab.com/Comics/Vol_1259.php", "http://missmab.com/Comics/Vol_1355.php", "/pmwiki/pmwiki.php/Main/WebOriginal", "/pmwiki/pmwiki.php/WebVideo/NinjaTheMissionForce", "/pmwiki/pmwiki.php/Main/AffectionateParody", "http://themasterplan09.deviantart.com/art/The-Ultimate-Ninja-Showdown-43071783", "/pmwiki/pmwiki.php/Roleplay/WeAreAllPokemonTrainers", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/NinjaPirateZombieRobot", "/pmwiki/pmwiki.php/Main/SideKick", "/pmwiki/pmwiki.php/Main/ZigZaggingTrope", "/pmwiki/pmwiki.php/Main/StealthHiBye", "/pmwiki/pmwiki.php/Main/SpyCatsuit", "/pmwiki/pmwiki.php/Main/HighlyVisibleninja", "/pmwiki/pmwiki.php/Main/FriendToAllLivingThings", "/pmwiki/pmwiki.php/Main/HighlyVisibleNinja"]}