{"title": "Level-Map Display", "content": "An in-game display of a miniature version of the entire level. The game has to be one where your normal field of view is limited to the area around a player character. Therefore, Real-Time Strategy games and such doesn't count.\n\nExamples generally fit into one of two types:\n• The map is always available (at least in certain levels), either on the main screen or through a menu system or such. A Fog of War-like effect may limit the map view only to already explored areas.\n• The map must be obtained, as a special power (which might even cost something to use) and/or collectible item (these are often not tracked for 100% Completion because only the map for the area the player is currently in can be brought up).\n\nSystems that display a map of where the player has already traveled are often said to be utilizing \"automap\". The term descending from early role-playing games where the player was often expected to create their own map, typically on graph paper.\n\nThe map display would also rotate to indicate the direction the player is facing, either by rotating the 'you are here' cursor arrow, or by rotating the entire map so that up is the direction they are going. Generally the former method is more commonly used in older games as it was much easier with limited processing power to rotate an arrow than it is to rotate the entire map.\n\nMay also be a Enemy-Detecting Radar, if it shows enemies.\n• Both Drakengard games displayed a map of the level when pausing the game; the second also allowed you to switch between your Enemy-Detecting Radar and level-map overlay at any time (once you collected the area's actual map).\n• Dark Cloud allowed you to toggle between a small and large map overlay while crawling through its Randomly Generated Levels.\n• Ratchet & Clank games have a map that you can pause the game and look at. Each game also has a Mapper gadget you can find, which makes said map also show secret areas.\n• Final Fantasy:\n• In Final Fantasy I and Final Fantasy II, pressing a combination of buttons on the Overworld Not to Scale would display its zoomed-out version.\n• Final Fantasy III and Final Fantasy IV had a Sight spell to display a map instead. The latter games replaced the both methods with a map that is always available instead.\n• In Final Fantasy V the map is a special item you need to find on the Ship Graveyard. However, once obtained it can be accessed anywhere on the world map, and even on the other world, the fusionaded world, and even underground on the center of the earth .\n• Cave Story has a map item that can be acquired early. It's very handy as it shows all hidden passages.\n• In Mega Man X3, the head upgrade gives X access to a (very rudimentary) map of the level, dividing it into small sectors and showcasing the special items of the level.\n• Pressing the Select button in Mega Man Legends will show you a map of Kattelox Island, and your current position. Pressing Select while in ruins shows you the squares you've explored in the current ruin. In Legends 2, aside from the automap, there is a Map menu which shows the whole area you're currently in. While in ruins, you can even switch between floors.\n• Diablo games. Especially useful given that the maps are randomized. You need that map.\n• In Peasant's Quest, you fill in semi-crude drawings for each location visited.\n• Minecraft has a Map item which you can craft to keep track of the world you explore. Interestingly, it's the \"automap\" type but it will only cover the quadrant around the area it was crafted in. If you go past the border, you'll need to craft another. For this reason, it's more useful in mapping the points of interest surrounding your house than as a tool for long distance trips. There is also a craftable compass that points to the world's default spawn point.\n• In the Metroid Prime Trilogy, there are rooms where Samus can download the map of the place she's currently exploring, or navigate everywhere to get the whole map layout.\n• Recettear: An Item Shop's Tale's dungeons have a minimap that completes itself as you go through each randomly generated level. Two of the random effects that can happen on each level play with this; one reveals the entire map from the start, the other disables it.\n• The Legend of Zelda:\n• In several games of the series, the world map can be viewed at any time via the menu screen. From Ocarina of Time onwards, a mini map display—complete with arrows marking your point of entry (represented in blue) and your current heading (the yellow one)—usually occupies the lower left corner of the screen for faster, easier navigation. There are two games in which, even after reaching a new place, its map has to be obtained from a character: Tingle in Majora's Mask and the Fishman in The Wind Waker.\n• In most Zelda games, the player can acquire a Map item inside each dungeon which reveals the layout of the entire dungeon. The dungeon maps are acquired from chests, except in one of the Twilight Princess dungeons (where Link gets it from a resident character). In the first game, the map shown on the subscreen fills itself in as you explore the dungeon, while the map item shows you the general shape of the dungeon as an overlay on the main game screen, including a flashing room to mark your present location. This holds true for the other games except for the latter aspect, because the full dungeon layouts are only displayed via a particular Map Subscreen. In most games, the compass must also be found, which helps you keep your bearings and reveals the location of all unopened chests on the map, as well as the boss's whereabouts.\n• The Legend of Zelda: Breath of the Wild:\n• At the start of the game, the world map on Sheikah slate is blank. Each region on the map contains a Sheikah tower where Link can gain the regional map by climbing to the top and activating the terminal there.\n• The Divine Beast maps gained from their map terminals not only reveal the entire layouts of those dungeons, they also let you physically manipulate certain mechanical sections of the Divine Beasts to solve puzzles.\n• This applies to at least half of all Racing Games. Every (non-sidescrolling) racer has a heads-up display that at least displays the positions of the other racers compared to the player(s), and nearly all have maps of every course somewhere in the games, if not as an onscreen overlay during the actual races. In the case of Mario Kart 64, there's a unique case with one of the courses, whose labyrinthic layout disables the game's capacity to identify where each character is placed until the player has completed the race.\n• In Doom, you can always look at a map of what you have explored so far. If you find a computer map you can see the entire level. Heretic and Hexen, which use the same engine, also have automapping, complete with a tan-and-sepia color scheme to fit with the high fantasy setting. Heretic also has map scrolls that reveal the entire map.\n• In Guild Wars, there are actually three map displays; a radar-like map of your immediate area which shows the location of friends, neutrals and enemies; a \"mini-map\" which shows the larger mission or explorable area with objectives and paths; and a map of the entire continent which is obscured at the beginning by \"fog of war\" and which becomes more detailed and reveals various places as you explore more of the map.\n• Iji has a map for completed levels, as well as a specific computer terminal in level 6 that reveals the map before you complete it.\n• Dragon Slayer has the MAP spell to display a zoomed-out view of the level. Being a spell, it's not available from the start of the game. It also consumes magic power, like most other spells.\n• La-Mulana has a Map item to be found in each area of the dungeon (there is no overworld map). Viewing a map requires equipping either or both of the Ruins RAM cartridges.\n• Project IGI justified it as a satellite view from above, which marked locations of enemies. However, it won't show anything under a roof.\n• Nitemare 3D had a map in the HUD that could be toggled on and off and drained a particular meter while it was on, and another meter (faster) when you chose to also see nearby enemies.\n• The Etrian Odyssey series utilizes the map as a dominant aspect of gameplay. Unlike most modern games the player's progress is not automatically mapped, instead a full complement of mapping tools are provided for the player to make their own maps in the style of older role-playing games.\n• The arcade version of Tutankham displayed a miniature view of the entire level at the top of the screen. It wasn't really useful for navigation or finding items, so most ports simply omitted it.\n• The Ace Combat series typically has a map in the pause menu with mission-critical targets and allies marked on it.\n• In the Naval Ops series, the player has a minimap that doubles as Enemy-Detecting Radar.\n• World of Tanks has a minimap where enemies are marked once an ally has spotted them. Particularly clueless players are often accused of not paying attention to it.\n• The Descent series, owing to its zero-gravity nature, shows its map screen in full (wireframe) 3D - the player can freely scroll and rotate the map in any direction, just the same as they can spin and move their ship in any direction within the level.\n• Spider-Man 2 has a zoomable, interactive map of New York. It displays information on challenges, help tokens (also whether or not you've completed them — useful, that), citizens in distress, Spidey Stores, crimes in progress, objective points, and key locations such as the Daily Bugle and Mary Jane's apartment. There was also a GPS-like minimap.\n• The Metal Gear series has a level map, which comes in handy for the End's boss fight in 3 since it shows you where he's sniping from. In 4 it also shows paths blocked by convenient rubble.\n• Level maps in the Dragon Age games have to be uncovered manually by visiting every spot on them, and the current small portion of them is usually shown on the Enemy-Detecting Radar. The fact that the Player Character has access to what essentially amounts to Photographic Memory, ideal spatial awareness, and a perfect sense of direction is lampshaded hilariously in the Mark of the Assassin DLC for Dragon Age II, where two party members get separated from Hawke and get hopelessly lost within a rather confined dungeon because they are so used to Hawke always leading the way.\n• Roundabout displays a road-map style map of the entire area on the pause screen. It only covers the region of the map you're currently in (Suburbs, Roundabout City, or the Mountain), however.\n• Mass Effect lets you see a map of your current area at any time, marked with points of interest such as plot destinations, merchants or area transitons. Maps for main areas are made of outlines filled with blue while maps for uncharted worlds are displayed as heightmaps. Mass Effect 2 limited maps to hub areas only. For missions you had to make do with an arrow on your compass pointing you to the destination instead.\n• Chantelise: Every level has one, that also shows where the enemies are.\n• Shaw's Nightmare: There are two map modes which you can use to explore areas, a wireframe mode and a 2D textured mode. You can also see where the enemies are.\n• In Warframe, you have an automap which shows outline of the terrain and points to the locations of your goals and other points of interests, such as merchants.\n• Unreal:\n• Unreal Tournament 2004 has minimaps for the Onslaught mode, where the player, every Power Core and every Power Node are displayed, with red, blue or neutral coloring in order to display which items are owned by the red or blue team. The map itself is also displayed in the in-game options menu.\n• Unreal Tournament III incorporates it for the Warfare and Vehicle Capture the Flag modes. In Warfare, like in Onslaught, it displays the Cores and Nodes, but it also displays the team's own orb, if it's in play, and the enemy team's orb, if it's near an item; while in VCTF it displays the status of the flags and where the team's own flag carrier is. The map itself is displayed in full in the in-game options menu as well.\n• Euro Truck Simulator, in addition to the standard road map that is part of the HUD, also has a diegetic world map on the GPS screen present in the trucks' more luxurious trim levels. If you feel like experiencing a little more inmersive interface, you can disable your standard HUD map and instead rely on your truck's GPS screen. If you don't feel like paying a fortune of in-game money for upgrading your truck's cabin, a DLC will also allow you to install separate GPS screens into your truck's dashboard or windshield.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/LevelMapDisplay?from=Main.MapScreen", "media_links": ["/pmwiki/pmwiki.php/VideoGame/MegaManLegends", "/pmwiki/pmwiki.php/VideoGame/Drakengard", "/pmwiki/pmwiki.php/VideoGame/DarkCloud", "/pmwiki/pmwiki.php/VideoGame/RatchetAndClank", "/pmwiki/pmwiki.php/Franchise/FinalFantasy", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyI", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyII", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyIII", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyIV", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyV", "/pmwiki/pmwiki.php/VideoGame/CaveStory", "/pmwiki/pmwiki.php/VideoGame/MegaManX3", "/pmwiki/pmwiki.php/VideoGame/MegaManLegends", "/pmwiki/pmwiki.php/VideoGame/Diablo", "/pmwiki/pmwiki.php/VideoGame/PeasantsQuest", "/pmwiki/pmwiki.php/VideoGame/Minecraft", "/pmwiki/pmwiki.php/VideoGame/MetroidPrimeTrilogy", "/pmwiki/pmwiki.php/VideoGame/RecettearAnItemShopsTale", "/pmwiki/pmwiki.php/Franchise/TheLegendOfZelda", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaOcarinaOfTime", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaMajorasMask", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaTheWindWaker", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaTwilightPrincess", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaBreathOfTheWild", "/pmwiki/pmwiki.php/VideoGame/MarioKart64", "/pmwiki/pmwiki.php/VideoGame/Doom", "/pmwiki/pmwiki.php/VideoGame/Heretic", "/pmwiki/pmwiki.php/VideoGame/Hexen", "/pmwiki/pmwiki.php/VideoGame/GuildWars", "/pmwiki/pmwiki.php/VideoGame/Iji", "/pmwiki/pmwiki.php/VideoGame/DragonSlayer", "/pmwiki/pmwiki.php/VideoGame/LaMulana", "/pmwiki/pmwiki.php/VideoGame/ProjectIGI", "/pmwiki/pmwiki.php/VideoGame/Nitemare3D", "/pmwiki/pmwiki.php/VideoGame/EtrianOdyssey", "/pmwiki/pmwiki.php/VideoGame/Tutankham", "/pmwiki/pmwiki.php/VideoGame/AceCombat", "/pmwiki/pmwiki.php/VideoGame/NavalOps", "/pmwiki/pmwiki.php/VideoGame/WorldOfTanks", "/pmwiki/pmwiki.php/VideoGame/Descent", "/pmwiki/pmwiki.php/VideoGame/SpiderMan2", "/pmwiki/pmwiki.php/VideoGame/MetalGear", "/pmwiki/pmwiki.php/Franchise/DragonAge", "/pmwiki/pmwiki.php/VideoGame/DragonAgeII", "/pmwiki/pmwiki.php/VideoGame/Roundabout", "/pmwiki/pmwiki.php/VideoGame/MassEffect1", "/pmwiki/pmwiki.php/VideoGame/MassEffect2", "/pmwiki/pmwiki.php/VideoGame/Chantelise", "/pmwiki/pmwiki.php/VideoGame/ShawsNightmare", "/pmwiki/pmwiki.php/VideoGame/Warframe", "/pmwiki/pmwiki.php/VideoGame/Unreal", "/pmwiki/pmwiki.php/VideoGame/UnrealTournament2004", "/pmwiki/pmwiki.php/VideoGame/UnrealTournamentIII", "/pmwiki/pmwiki.php/VideoGame/EuroTruckSimulator"], "non_media_links": ["/pmwiki/pmwiki.php/Main/RealTimeStrategy", "/pmwiki/pmwiki.php/Main/FogOfWar", "/pmwiki/pmwiki.php/Main/OneHundredPercentCompletion", "/pmwiki/pmwiki.php/Main/EnemyDetectingRadar", "/pmwiki/pmwiki.php/Main/EnemyDetectingRadar", "/pmwiki/pmwiki.php/Main/RandomlyGeneratedLevels", "/pmwiki/pmwiki.php/Main/EasterEgg", "/pmwiki/pmwiki.php/Main/OverworldNotToScale", "/pmwiki/pmwiki.php/Main/RacingGame", "/pmwiki/pmwiki.php/Main/EnemyDetectingRadar", "/pmwiki/pmwiki.php/Main/EnemyDetectingRadar", "/pmwiki/pmwiki.php/Main/InsurmountableWaistHighFence", "/pmwiki/pmwiki.php/Main/EnemyDetectingRadar", "/pmwiki/pmwiki.php/Main/PlayerCharacter", "/pmwiki/pmwiki.php/Main/PhotographicMemory", "/pmwiki/pmwiki.php/Main/ColorCodedForYourConvenience", "/pmwiki/pmwiki.php/Main/CaptureTheFlag"]}