{"title": "Media Scrum", "content": "From Rugby, a knot of reporters and camera men gathered around someone, usually a politician, each trying to shove forward to ask their questions and catch the answers to the others' questions. Also known as a \"gangbang\".\n\nOften the questions are things that the interviewee has not or does not want to address in a press release or conference. The reporters can and will chase the politician to their car or office, only being diverted by the appearance of someone even more newsworthy.\n\nNote, the scrum is the activity described, not the group of reporters themselves.\n\nMore common in the Commonwealth than elsewhere but ubiquitous in Canadian politics, where the scrum is considered one of the central facets of parliamentary democracy and a cornerstone of freedom of the press. Although certain individuals might choose not to participate (and might be judged accordingly), any government (federal or provincial) that tried to dispose of the scrum in toto might find itself out of a job. Scrums are taken that seriously, by everyone.\n\nOn the other hand, the scrum is almost unknown at the highest levels of American politics. The President especially would never be mobbed like this; that's what press conferences note and the Secret Service are for (in 2012, a reporter for an online publication attempted to scrum President Obama during an answer and found himself out of the White House Press Corps). The difference is likely to be related to the fact that the US President is both the head of state and the head of government, whereas the Prime Minister of Canada is merely the head of government, and heads of state are always considered of higher rank than heads of government. Protocol-wise the Prime Minister doesn't even come second in line after the actual Head of State, the Queen - he's fourth!\n\nLesser politicians and non-politicians can expect them in the US, often from \"less legitimate\" news agencies. Anyone running for office—including the presidency—can expect to get scrummed (unless, of course, they're already President). Lower offices with smaller constituencies are more likely to have this happen; presidential candidates are more likely to get scrummed during the early primaries (where \"retail politics\" predominate). Whether this implies a greater respect for the subject's privacy or a lack of journalistic independence is a matter of some debate.\n\nBecause of the scrum's central role in Canadian politics, you'll see these featured in all kinds of shows. Comedians have even participated in scrums; Mary Walsh of This Hour Has 22 Minutes once showed up to a scrum on Parliament Hill dressed as Xena and calling herself \"Marg, Princess Warrior\" - to the apparent amazement and delight of then-Prime Minister Paul Martin.\n\nMedia scrums are often fictionalized in Korean Series, often to the point of knocking down the person they want to interview.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/MediaScrum", "media_links": ["/pmwiki/pmwiki.php/Film/ThankYouForSmoking", "/pmwiki/pmwiki.php/Series/ThisHourHas22Minutes", "/pmwiki/pmwiki.php/ComicBook/Watchmen", "/pmwiki/pmwiki.php/ComicBook/WonderWoman1987", "/pmwiki/pmwiki.php/Franchise/Superman", "/pmwiki/pmwiki.php/ComicBook/WhoTookTheSuperOutOfSuperman", "/pmwiki/pmwiki.php/Film/ThankYouForSmoking", "/pmwiki/pmwiki.php/Film/Birdman", "/pmwiki/pmwiki.php/Literature/TheColorOfDistance", "/pmwiki/pmwiki.php/Literature/WetDesertTrackingDownATerroristOnTheColoradoRiver", "/pmwiki/pmwiki.php/Series/BestLove", "/pmwiki/pmwiki.php/Literature/Cinderella", "/pmwiki/pmwiki.php/Series/BostonLegal", "/pmwiki/pmwiki.php/Series/TheCityHall", "/pmwiki/pmwiki.php/Franchise/LawAndOrder", "/pmwiki/pmwiki.php/Series/NCIS", "/pmwiki/pmwiki.php/VisualNovel/OurTwoBedroomStory", "/pmwiki/pmwiki.php/Webcomic/FunnyFarm", "/pmwiki/pmwiki.php/Webcomic/StandStillStaySilent"], "non_media_links": ["http://en.wikipedia.org/wiki/Canadian_order_of_precedence", "/pmwiki/pmwiki.php/Main/KoreanSeries", "/pmwiki/pmwiki.php/Main/Paparazzi", "/pmwiki/pmwiki.php/Main/VictimOfTheWeek", "/pmwiki/pmwiki.php/Main/RealityShow", "http://www.funnyfarmcomics.com/index.php?date=2009-04-10"]}