{"title": "Holler Button", "content": "Video games with a holler button allow the Player Character to call out to NPCs. This may be for a variety of reasons: telling them to follow you (or stay put for a while) during an Escort Mission, or to call for assistance if the NPC is capable of helping you out. Frequently used to call for the player's mount, allowing them to ride.\n\nA Holler Button must have an effect in terms of game mechanics. If it's purely atmospheric, then it's a Taunt Button instead. Related to Summon Magic, but distinct in that the effect isn't actually magical (even though the called NPC may inexplicably appear from nowhere).\n• In A Boy and His Blob, the boy will call out for his blob, and the blob will do everything physically possible to make its way back to the boy. If you press the call button three times in a row, the boy will then whistle, causing the blob to automatically use the balloon ability, ignoring terrain and obstacles, to navigate directly to your location.\n• Equipping the megaphone tool in Animal Crossing: New Leaf lets you press A and yell a character's name to find out where they are (assuming they're not in a building or on Main Street). It's really helpful if you need to find a specific villager for an errand. Using the megaphone is also the easiest way to wake up Gulliver; usually you have to talk to him several times, but the megaphone will wake him right up.\n• Assassin's Creed II introduced basic stop/follow/act commands for commanding the courtesans, mercenaries or thieves when using the context-sensitive Head button, but Brotherhood replaced the former \"context-sensitive camera\" button with the Call Assassins (tap)/Arrow Storm (hold) button, the animation for which is Ezio raising his fist and whistling.\n• Brotherhood also features a button to call your horse. Luckily, all horses in the game know the art of Offscreen Teleportation and will gladly appear even on the top of the Coliseum's ruins for you - not that you can do much with them there.\n• The Bard's Tale lets you use the directional pad to give your allies four different hollers.\n• BattleBlock Theater has one (though it's not so much a Holler button as it is a cry like a little baby button). It usually has no real use, but it CAN call friendly animals to you.\n• Battlefield games have a commo rose with a context sensitive \"Spotted\" command that will reveal whatever you're looking at that belongs to the enemy on the radar. However, it also has other commands, such as \"Negative,\" \"Sorry,\" and the ever-popular \"Enemy boat spotted!\"\n• Can be done in the Dead Rising games to herd survivors. You generally had to be constantly tapping the button or the survivor would decide that smacking zombies with a handbag was more important than getting to the safehouse. Oddly, it also works in Infinity Mode, where it is completely useless (all the survivors are trying to kill you.)\n• Disaster Report has this, as part of the point of the game is to look for other survivors in the huge (not-so-)natural disaster going on at the time.\n• In Drakengard 2, there's a button that calls your dragon down. What makes it fall under the trope is that Nowe shouts out \"Legna!\" when you hit it. (Caim would likely have done the same with Angelus if he had vocal cords.)\n• Both The Fairly OddParents: Breakin' Da Rules and its Spiritual Successor, Shadow Showdown present a variant: pressing a certain button will call Cosmo and Wanda, who will comment on things in the level, what's going on in the story, or give you hints as to how to get through a particular section.\n• The latter game plays this straight with two wishes:\n• The first is in the \"Fairly Disastrous\" level, and sees Timmy in a cow suit so he can lure the wayward Dairy Fairy cows back to their respective barns. Pressing the action button will make him to moo, which will causes the cow to follow him back to its barn.\n• The second is in the \"Get a Clue!\" level, in which Timmy wishes to become a ghost to frighten the Animated Armor that attacks you petrified so he can safely pass through (again, It Makes Sense in Context). In this case, the action button has him make typical \"ghost\" noises.\n• In Final Fantasy XII, there is a minigame of sorts where you must spread the word throughout the town of Bhujerba that your comrade Basch, contrary to popular belief, is still alive. By pressing a button, you could call attention to this by yelling out such things as \"I'm Basch fon Ronsenberg of Dalmasca!\" Your effectiveness in spreading this message would rise or fall upon your proximity to sympathetic or unsympathetic ears. Don't do this next to guards; the local guides, however, are particularly effective ( ).\n• The beckon emote in Final Fantasy XIV is used in several side quests that are an Escort Mission. You use the command to get your NPC to follow you to the spot you called them from.\n• In Frogger 2: Swampy's Revenge, the character you play as can croak by pressing a specific button. Its primary function is to locate nearby baby frogs, of which you need to collect all five to complete the level.\n• In most of the Harvest Moon games, there are buttons to whistle for your dog or horse. In some games this also catches the attention of nearby NPCs.\n• In Grand Theft Auto: San Andreas, Carl \"CJ\" Johnson, the player character is tutored by his older brother Sweet on how to recruit fellow Grove Street foot soldiers for additional firepower to back CJ up when swarmed with enemy gang members. This forms a Chekhov's Skill, as it is introduced fairly early during the first Los Santos phase, but then not utilized in story missions until late in the game, when endgame events take CJ back to Los Santos after having completed the San Fiero and Las Venturas story arcs. Completing story missions earns CJ \"respect\" which can be used to recruit up to seven additional Grove Street members, which comes in useful when trying to contest gang territory with the rival Ballas gang. Targeting a fellow Grove Street member and recruiting them allows you to issue standard \"wait/catch up/disband\" commands.\n• A few chapters of Half-Life 2 provided you with human resistance members that were very enthusiastic to follow commands that you would issue them.\n• Earlier, you gain a similar ability to command antlions with a \"Holler Bag\" (a pheromone gland yoinked from one of their queens).\n• In Haunting Ground you can use the right analog stick to give commands to your canine companion, Hewie. Pushing it down calls him, leading to different hollers in different situations, starting with a gentle \"Hewie!\" in normal circumstances, becoming a harsher \"HEWIE!\" when a stalker is around, and turning straight into \"HELP!\" when she is in Panic Mode.\n• The former Trope Namer was Heavy Rain's \"Press X to Jason,\" which has you pressing \"X\" to call for your missing son. It was renamed because Pressing X to Jason (or Ethan) doesn't do anything mechanically.\n• ICO lets the PC call out for Yorda, a girl he escorts around. Doing so prompts her to come to you. Before you find her or if she's far out of range, he'll just make an odd yell.\n• Kingdom Hearts I used the Triangle button to call over your friends to you (or, if you where in the air when pressing Triangle, make them jump). The second game has Triangle as the Action Commands button instead, where it functions as this when escorting Minnie to the throne of Disney Castle.\n• In Kingdom Hearts 3D: Dream Drop Distance, holding L and R for a moment will make your allies teleport over to you in the blink of an eye (Assuming they're not getting beaten on by an enemy at the moment or immobilized by a Standard Status Effect).\n• The boy in The Last Guardian can shout out to the creature that's been tailing him, Trico, which you'll need to do to move him into position to progress through the game.\n• In Left 4 Dead: There's a generic \"look\" command that is context-sensitive and will alert other teammates to whatever weapons, health, enemies or allies that you happen to be looking at. There are also a bunch of meaningless-but-amusing Taunt Button-style commands.\n• The The Legend of Zelda series has Epona's Song in The Legend of Zelda: Ocarina of Time and The Legend of Zelda: Majora's Mask, the Command Melody in Wind Waker as mentioned above, the Horse Grass and Horse Call in The Legend of Zelda: Twilight Princess, and whistling in The Legend of Zelda: Breath of the Wild.\n• In Wind Waker, you can press R to call NPCs to your side or to activate statues in one dungeon.\n• In Luigi's Mansion, you can press the A button to make Luigi shout \"Mario!!\" in various inflections. There's little point to it, though it does serve as an auditory check of Luigi's health.\n• Most Mario Party games let you do this to taunt and/or annoy your opponents.\n• In Majin and the Forsaken Kingdom, you can tell the Majin to \"Stay\" or \"Follow.\" If you tell him to Follow when too far away, though, he can occasionally get stuck.\n• The Maw has a button so the main character can yell \"Maw!\", usually to call him to you.\n• Hunting for Ames in Metal Gear Solid 2: Sons of Liberty is done by pushing Triangle with the Directional Microphone equipped, causing Raiden to ask \"You must be Ames\". There's just the one inflection, but if you spam it repeatedly Raiden's questions will get increasingly bored (\"You're Ames, aren't you?\" \"I bet you're not Ames either.\" \"It'd be a huge help if you happened to be Ames.\"). Perhaps Lampshaded by the fact that there's a parrot who can learn to say the phrase if you spam it at it enough times.\n• Nethack has the magic whistle item, which summons your pet to you.\n• While playing as Y.V. in Nuclear Throne, pressing the B key causes the screen to slightly shake while an air horn sound plays.\n• Practically the entire point of the Oddworld games with Abe in them (especially the first two) is to use voice commands to lead your fellow Mudokons (and, in Munch's Oddysee, Fuzzles) to sweet freedom.\n• In Pikmin, one of Olimar's most important moves is using the whistle to call Pikmin to order.\n• If a Shadow Pokemon goes into Hyper Mode during battles in Pokémon Colosseum, there is an option to use up a turn calling out to the Pokemon, which snaps it back to normal. It also wakes them from sleep and, in the second game, boosts their accuracy.\n• Atlas and P-Body of Portal 2 can't really talk, but they can create visual cues like beacons or timers to communicate with each other.\n• In Postal 2, the Postal Dude can yell at bystanders to get down if they don't want to die. In the original release it had no functionality, but when integrated with the Steam Workshop, yelling it will cause bystanders to either not react, panic, or open fire on the player depending on what the Dude is wielding.\n• Press X To Jason is a game based on the titular meme, and the former trope namer. However, no matter how much you much you press X, Jason can't be saved.\n• The up button in Red Dead Redemption calls your horse. As an Acceptable Break from Reality, you will always call a horse even if the one you legally own has died. This can be abused for a source of income.\n• Resident Evil 4 has a button for controlling Ashley, which alternates between \"Follow\" and \"Wait,\" along with \"Hide\" if you're near a dumpster.\n• Resident Evil 5 uses a button to change how your A.I. partner reacts; \"Attack\" makes your partner fight more aggressively (generally results in your partner using his or her best weapon and all of its ammo on the weakest enemies), while \"Cover\" makes your partner fight more defensively and stay closer to you. You also have a button to shout encouragement during the boss fight with Jill . Doing so will sometimes make the boss hesitate and open for an attack.\n• In Samurai Warriors 2, Keiji can call for his horse, and so can any player character as long as they have a horse equipped in Dynasty Warriors 5. Warriors Orochi expanded it so anybody could call a horse (with the default being the worst horse in the game).\n• In Shadow of the Colossus, the holler button has two functions. In most Colossus battles, Wander will whistle loudly to provoke the Colossus. On the overworld and in a few battles, Wander will call for his horse, Agro.\n• Silent Hill: Shattered Memories briefly allows Harry to call out for his daughter Cheryl in the first several minutes of the game. He even has two variations — yelling when outdoors, and saying her name in an anxious whisper while indoors, and each of those have further variations.\n• Siren: Several Escort Missions involve you scouting ahead for your escorted and then letting them know when it's safe to pass. (Use sparingly: yelling also attracts the attention of the enemies.)\n• Shortly after you find Prince Tricky in Star Fox Adventures, he runs off; after you deal with all the Sharpclaw in the area, he'll teach you the Heel command, which calls him to you if he's capable of getting there. This is primarily useful if you told him to Stay on the wrong spot, or if he's busying himself growling at enemies when you want him to execute a Sidekick Skill.\n• In Swat4, pressing the use button with no context makes you yell at a suspect to drop the weapon and get down. You must do this for every suspect you see or lose points for unauthorized use of deadly force should they resist.\n• In Team Fortress 2 The \"Medic!\" call will let anyone nearby that you want to be healed — notable because it actually adds an icon to any nearby allied medics showing the location of the caller and how much health they have. There are also pre-recorded voice clips to convey pretty much any non-game-mode specific information imaginable, plus stuff that has no real use except entertainment value, such as unleashing a battle cry, insulting the enemy team, or insulting your team.\n• The Tribes series had dozens of voice commands you can use in a well-designed system to communicate without a microphone. V-F-D stands for \"defend the flag!\" (V = voice, F = flag-related commands, D = defend.) At the end of a round, you'll hear a lot of V-G-C-G \"good game!\" (V = voice, G = global, goes to both teams, C = compliments, G = good game.) The most famous of these is V-G-S, \"shazbot!\" In Tribes 2, bots would react to whatever the player said using voice commands if they were looking at the bot, so telling a bot to V-D-F (Defend the flag!) would cause them switch to defense, or flat out tell you \"no\".\n• The \"Honk!\" button in Untitled Goose Game, used to distract and/or startle villagers. Especially nice when you can make them drop what they're holding so you can run off with it.\n• The X-Men Legends and Marvel Ultimate Alliance games have a button for summoning your allies when the party gets separated. In combat, it commands the AI to use characters' special powers.\n• Yo! Noid 2: Enter the Void:\n• The humanoid Noids have a dab button, and they emit small noises whenever they dab.\n• Played straighter with Cappy; since he has no arms to dab with, he just says \"Noid\".", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/HollerButton", "media_links": ["/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaTheWindWaker", "/pmwiki/pmwiki.php/VideoGame/ABoyAndHisBlob", "/pmwiki/pmwiki.php/VideoGame/AnimalCrossing", "/pmwiki/pmwiki.php/VideoGame/AssassinsCreedII", "/pmwiki/pmwiki.php/VideoGame/AssassinsCreedBrotherhood", "/pmwiki/pmwiki.php/VideoGame/TheBardsTale", "/pmwiki/pmwiki.php/VideoGame/BattleBlockTheater", "/pmwiki/pmwiki.php/VideoGame/Battlefield", "/pmwiki/pmwiki.php/VideoGame/DeadRising", "/pmwiki/pmwiki.php/VideoGame/DisasterReport", "/pmwiki/pmwiki.php/VideoGame/Drakengard2", "/pmwiki/pmwiki.php/VideoGame/TheFairlyOddparentsBreakinDaRules", "/pmwiki/pmwiki.php/VideoGame/TheFairlyOddparentsShadowShowdown", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyXII", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyXIV", "/pmwiki/pmwiki.php/VideoGame/Frogger", "/pmwiki/pmwiki.php/VideoGame/HarvestMoon", "/pmwiki/pmwiki.php/VideoGame/GrandTheftAutoSanAndreas", "/pmwiki/pmwiki.php/VideoGame/HalfLife2", "/pmwiki/pmwiki.php/VideoGame/HauntingGround", "/pmwiki/pmwiki.php/VideoGame/HeavyRain", "/pmwiki/pmwiki.php/VideoGame/Ico", "/pmwiki/pmwiki.php/VideoGame/KingdomHeartsI", "/pmwiki/pmwiki.php/VideoGame/KingdomHeartsII", "/pmwiki/pmwiki.php/VideoGame/KingdomHearts3DDreamDropDistance", "/pmwiki/pmwiki.php/VideoGame/TheLastGuardian", "/pmwiki/pmwiki.php/VideoGame/Left4Dead", "/pmwiki/pmwiki.php/Franchise/TheLegendOfZelda", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaOcarinaOfTime", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaMajorasMask", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaTwilightPrincess", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaBreathOfTheWild", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaTheWindWaker", "/pmwiki/pmwiki.php/VideoGame/LuigisMansion", "/pmwiki/pmwiki.php/VideoGame/MarioParty", "/pmwiki/pmwiki.php/VideoGame/MajinAndTheForsakenKingdom", "/pmwiki/pmwiki.php/VideoGame/TheMaw", "/pmwiki/pmwiki.php/VideoGame/MetalGearSolid2SonsOfLiberty", "/pmwiki/pmwiki.php/VideoGame/Nethack", "/pmwiki/pmwiki.php/VideoGame/NuclearThrone", "/pmwiki/pmwiki.php/VideoGame/Oddworld", "/pmwiki/pmwiki.php/VideoGame/Pikmin", "/pmwiki/pmwiki.php/VideoGame/PokemonColosseum", "/pmwiki/pmwiki.php/VideoGame/Portal2", "/pmwiki/pmwiki.php/VideoGame/PressXToJason", "/pmwiki/pmwiki.php/VideoGame/RedDeadRedemption", "/pmwiki/pmwiki.php/VideoGame/ResidentEvil4", "/pmwiki/pmwiki.php/VideoGame/ResidentEvil5", "/pmwiki/pmwiki.php/VideoGame/SamuraiWarriors", "/pmwiki/pmwiki.php/VideoGame/DynastyWarriors", "/pmwiki/pmwiki.php/VideoGame/WarriorsOrochi", "/pmwiki/pmwiki.php/VideoGame/ShadowOfTheColossus", "/pmwiki/pmwiki.php/VideoGame/SilentHillShatteredMemories", "/pmwiki/pmwiki.php/VideoGame/Siren", "/pmwiki/pmwiki.php/VideoGame/StarFoxAdventures", "/pmwiki/pmwiki.php/VideoGame/Swat4", "/pmwiki/pmwiki.php/VideoGame/TeamFortress2", "/pmwiki/pmwiki.php/VideoGame/Tribes", "/pmwiki/pmwiki.php/Series/MorkAndMindy", "/pmwiki/pmwiki.php/VideoGame/UntitledGooseGame", "/pmwiki/pmwiki.php/VideoGame/XMenLegends", "/pmwiki/pmwiki.php/VideoGame/MarvelUltimateAlliance", "/pmwiki/pmwiki.php/VideoGame/YoNoid2EnterTheVoid"], "non_media_links": ["/pmwiki/pmwiki.php/Main/HeroicMime", "/pmwiki/pmwiki.php/Main/PlayerCharacter", "/pmwiki/pmwiki.php/Main/NPC", "/pmwiki/pmwiki.php/Main/EscortMission", "/pmwiki/pmwiki.php/Main/JustWhistle", "/pmwiki/pmwiki.php/Main/CoolHorse", "/pmwiki/pmwiki.php/Main/TauntButton", "/pmwiki/pmwiki.php/Main/SummonMagic", "/pmwiki/pmwiki.php/Main/AcceptableBreaksFromReality", "/pmwiki/pmwiki.php/Main/AntiFrustrationFeature", "/pmwiki/pmwiki.php/Main/OffscreenTeleportation", "/pmwiki/pmwiki.php/Main/ContextSensitiveButton", "/pmwiki/pmwiki.php/Main/MemeticMutation", "/pmwiki/pmwiki.php/Main/EverythingTryingToKillYou", "/pmwiki/pmwiki.php/Main/TheVoiceless", "/pmwiki/pmwiki.php/Main/SpiritualSuccessor", "/pmwiki/pmwiki.php/Main/ItMakesSenseInContext", "/pmwiki/pmwiki.php/Main/AnimatedArmor", "/pmwiki/pmwiki.php/Main/ItMakesSenseInContext", "/pmwiki/pmwiki.php/Main/LaResistance", "/pmwiki/pmwiki.php/Main/EscortMission", "/pmwiki/pmwiki.php/Main/NPC", "/pmwiki/pmwiki.php/Main/BigBrotherMentor", "/pmwiki/pmwiki.php/Main/GangBangers", "/pmwiki/pmwiki.php/Main/ColorCodedForYourConvenience", "/pmwiki/pmwiki.php/Main/ChekhovsSkill", "/pmwiki/pmwiki.php/Main/AllianceMeter", "/pmwiki/pmwiki.php/Main/ContextSensitiveButton", "/pmwiki/pmwiki.php/Main/UndyingLoyalty", "/pmwiki/pmwiki.php/Main/HeroicMime", "/pmwiki/pmwiki.php/Main/AntlionMonster", "/pmwiki/pmwiki.php/Main/TropeNamer", "/pmwiki/pmwiki.php/Main/MemeticMutation", "https://www.youtube.com/watch?v=0t0uCWjQ6Og&feature=player_embedded", "/pmwiki/pmwiki.php/Main/EscortMission", "/pmwiki/pmwiki.php/Main/ActionCommands", "/pmwiki/pmwiki.php/Main/StandardStatusEffect", "/pmwiki/pmwiki.php/Main/ContextSensitiveButton", "/pmwiki/pmwiki.php/Main/TauntButton", "/pmwiki/pmwiki.php/Main/Lampshaded", "/pmwiki/pmwiki.php/Main/KillerRabbit", "/pmwiki/pmwiki.php/Videogame/Postal", "/pmwiki/pmwiki.php/Main/TauntButton", "/pmwiki/pmwiki.php/Main/AcceptableBreakFromReality", "/pmwiki/pmwiki.php/Main/GameBreaker", "/pmwiki/pmwiki.php/Main/EscortMission", "/pmwiki/pmwiki.php/Main/TauntButton"]}