{"title": "Sorry I'm Late", "content": "You're The Hero in a videogame. For some reason you got separated from the rest of your party. Cue (usually) a few not-so-random encounters where they join up with you one or two at a time in the middle of the fight.\n\nDoesn't actually have to be in a battle, though it usually is. It still qualifies as this trope if you just find the rest of your party walking around.\n\nSometimes overlaps with Big Damn Heroes, but in this case, it's the supporting heroes who come to back up the protagonist when he's having a rough fight alone.\n• EVE Online has this with either event-driven NPCs or that lone wolf in your fleet.\n• Final Fantasy IX had this a few times in one sequence near the end of the game.\n• Final Fantasy X had this in that desert where Home was and in Yuna's section of Via Purifico.\n• In Final Fantasy IV, Rydia returns as your party is busy dying very quickly.\n• In Final Fantasy VI, Terra returns after her Trance form.. Humbaba Snorts away two party members. And she's stuck in\n• Much earlier in Final Fantasy VI, Sabin arrives mid-battle to help with a boss. Unlike most examples, this is the first time Sabin appears in the game outside of a flashback.\n• And Gau has an entire gameplay mechanic where he'll do this on the Veldt a few battles after he Leaps away.\n• In Edge's chapter in Final Fantasy IV: The After Years, any of Edge's ninjas (that weren't Killed Off for Real, which is possible) will rejoin Edge mid-battle when Edge attempts to storm the Tower of Babil.\n• Final Fantasy XIII has a boss fight starting with Hope as your only playable character. Considering that Hope isn't exactly the most durable character on the team, he ends up having quite a hard time just surviving on his own until Lightning and Fang arrive to back him up. Note that since he is also The Medic, it is possible (with enough grinding) to keep him going indefinitely, in which case Light and Fang rush in after a certain time anyway, even if Hope isn't nearing death.\n• In Golden Sun The Lost Age, one of the fights against Karst and Agatio works like this- much to their chagrin since their original plan was to fight the group two at a time. You don't have to win the fight either. When it ends, the Enigmatic Minion intervenes before anyone can get killed, then announces that the Party from the last game are on their way up, forcing the pair to flee with the plot trinket.\n• During the final battle of Super Paper Mario, after fighting for a bit Mario is joined by all his allies, thought to be dead .\n• Also in Paper Mario: The Thousand-Year Door, when Mario is separated from his friends and thrown into a one-sided boss fight against Doopliss, a shapeshifting ghost who has stolen both Mario's identity AND his friends, Mario is rescued after a few rounds by\n• Wild ARMs 4 has a series of battles in which the four protagonists are supposed to fight alone. However, Yulie ends up against impossible odds since it was a ploy to split them up and capture her. About two rounds into the fight, assuming you survive that long, the rest of the party will show up to rescue her.\n• Returning from the Verseworld for the first time in Grandia III, Yuki and Alfina meet up with Miranda and Alonso, surrounded by Goddamned Bats.\n• Early in Tales of Symphonia, Lloyd is captured while he and Genis are looking for Colette and the others. After a short dungeon on his own, Lloyd runs into the base's leader. Before they come to blows, the rest of the party shows up.\n• This also happens later in the game, going through the base of the world tree, the other party members stay behind one after the other to allow the others to continue. Just as Lloyd gets to the end, they all show up again to help.\n• Kratos actually says \"Sorry I'm late\" when he turns up to fight off the \"Desians\" attacking Colette in the OVA.\n• In Tales of Vesperia, when you fight Gusios for the first time, Yuri will start off alone due to a cave-in Gusios caused, separating him from the rest of the party. As the battle progresses, Repede, Estelle, and Rita will join in. Rita even says \"Sorry I'm late.\"\n• This happens in the final battle of Tales of Xillia. Made awesome by the fact that each member unleashes their Mystic Arte as they arrive.\n• In an inversion, Valkyria Chronicles has you separated from your squad in one chapter. Instead of being rescued by your allies, you find and rescue them from an overwhelming assault.\n• In EarthBound, Poo leaves your party to go training after you leave the pyramid in Scaraba. He returns during the boss fight with Master Barf in Deep Darkness.\n• A possible NPC example from Dragon Age II: in the Act II endgame, Isabella will betray you and run off with the loot. However, if you have a strong (Friend, Rival, or Romance) relationship with her, she will find herself unable to leave your side and join you in the middle of the battle against the act boss.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/SorryImLate", "media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/EVEOnline", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/FinalFantasyIX", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/FinalFantasyX", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/FinalFantasyIV", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/FinalFantasyVI", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/FinalFantasyVI", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/FinalFantasyIVTheAfterYears", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/FinalFantasyXIII", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/GoldenSun", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/SuperPaperMario", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/PaperMarioTheThousandYearDoor", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/WildARMs4", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/GrandiaIII", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/TalesOfSymphonia", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/TalesOfVesperia", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/TalesOfXillia", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/ValkyriaChronicles", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/DragonAgeII"], "non_media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/Main/TheHero", "https://tvtropes.org/pmwiki/pmwiki.php/Main/BigDamnHeroes", "https://tvtropes.org/pmwiki/pmwiki.php/Main/RolePlayingGame", "https://tvtropes.org/pmwiki/pmwiki.php/Main/SuperMode", "https://tvtropes.org/pmwiki/pmwiki.php/Main/ModeLock", "https://tvtropes.org/pmwiki/pmwiki.php/Main/KilledOffForReal", "https://tvtropes.org/pmwiki/pmwiki.php/Main/SquishyWizard", "https://tvtropes.org/pmwiki/pmwiki.php/Main/HopelessBossFight", "https://tvtropes.org/pmwiki/pmwiki.php/Main/TheMedic", "https://tvtropes.org/pmwiki/pmwiki.php/Main/EnigmaticMinion", "https://tvtropes.org/pmwiki/pmwiki.php/Main/GoddamnedBats", "https://tvtropes.org/pmwiki/pmwiki.php/Main/LimitBreak", "https://tvtropes.org/pmwiki/pmwiki.php/Videogame/EarthBound"]}