{"title": "Big Store", "content": "A bunch of empty offices made up to look like a real life setting, say a bookmaker's or production office. Commonly used by a Con Man.\n\nExpect the place to be completely abandoned by the time the authorities show up in force. Which will likely prompt a It Was Here, I Swear! by the conned character.\n• Harry Dickson: Dickson stays at a country hotel for the night with a friend (an expert called in to deal with a supposedly haunted painting), but the friend disappears during the night (his corpse is later found being picked over by crabs), as does the staff. While looking around, he notices that every room except his own, the dining room and the reception haven't been used in years, and he later finds out the hotel closed a decade ago (all a trap by the criminals to prevent the discovery that the painting is a fake).\n• The Sting uses this exact term to describe what they need to rent, and later pay for: an empty basement office/store in order to convert it into a betting parlor.\n• The protagonists of Accepted use this technique to create a stand-in fictional college to fool their parents. However, before long Hilarity Ensues.\n• Subverted in The Game starring Michael Douglas. Our hero does convince the cops to come back to the Big Bad's main HQ but it is empty. Turns out the company owns the entire building so it was no trouble faking a few empty floors .\n• In Sneakers, the Big Bad picked an office building that was abandoned because it was due for demolition in a few days. By the time our heroes returned, all the evidence was rubble. Crease: Oh, Marty, you didn't fall for that one, did you?\n• In The Grifters, a con-woman tells of a big con which involved convincing the mark that banks of huge computers were in the next (empty) rooms. Despite the risk her confederate kept asking the mark to go see them, while the woman laughed and said he didn't have to go.\n• The Spanish Prisoner: At the midpoint of the film, the protagonist goes around to a number of establishments he met with a man and discovers that they are all either empty buildings or different kinds of establishments from what he was led to believe.\n• Subverted in Larceny Inc. A gangster buys a luggage store next to a bank, planning to tunnel into the vault. The store becomes more profitable than the robbery ever would.\n• The Aaron Eckhart thriller Erased has Ben Logan working for a division of the Helgate Group as a security expert, giving them aid on some devices. After picking up his daughter from the airport, Logan drops by the office only to find it completely cleaned out. He goes to the main headquarters of Helgate who inform him they have never run a division from that building, have no record of the man Logan claims was his boss and they're not the ones paying Logan. It turns out the Group was a front for the CIA to use people's talents to pull off secret coups.\n• Such offices are used several times for various purposes in the Burke series by Andrew Vachss.\n• In The Little Golden Calf,\n• Ostap opens one of those, as a firm that supposedly buys horns and hooves to make combs. (It is in fact a front for his investigations into the the illegal fortune of the Secretly Wealthy antagonist.) Since then, \"Horns and Hooves\" became a Russian idiom for any suspicious office that's likely to vanish when things will go sour.\n• Subverted: when Ostap's scheme fails and the firm is busted, the Soviet government nationalizes it and builds a real office that really trades in horns and hooves.\n• The third Heist Society novel has one; it is even specifically called this trope.\n• The thriller The Day Before Midnight has the wife of a former defense contractor revealing she gave information on an American base but did it for the Israelis, their allies. She talks about going to the Israeli embassy, packed with workers, flags, portraits of famous Israeli politicans and more. When she mentions the address, an FBI agent asks to repeat it and whens he does, he reveals that he used to work by the Israeli embassy and it's on the other side of New York. He openly states all someone had to do was \"rent out an empty brownstone, hang some flags and photos, get people to walk around and look busy. An hour after you've left, the whole place is cleaned out.\" The woman realizes she gave the information on a missile base to a band of terrorists leading to a My God, What Have I Done? reaction.\n• Used in several Sherlock Holmes stories, although their purpose isn't to scam the mark: it's to keep him occupied there while the real crime takes place elsewhere (digging a tunnel under the mark's shop to a bank vault in The Red-Headed League, breaking into a bank vault while posing as the mark in The Stockbroker's Clerk).\n• Everybody Loves Raymond: Robert was fooled with this con.\n• Hustle used this in almost every episode.\n• A fun bit has the team pulling a con on another scam artist. They're all celebrating inside their usual bar. Outside, the con artist comes to it only to find the outside taped off and a police officer (a friend of the gang's), telling him it's off limits due to it being condemned. The man thus walks off, thinking the place was used to fool him and unaware it's totally operational.\n• Mission: Impossible put this one to work a lot. To pick but one example, \"The Execution\" has an unused warehouse turned into a death row prison block and gas chamber.\n• Alias Smith and Jones did a Big Store con in detail (to a mark who richly deserved it) in the episode \"The Great Shell Game\".\n• On The Blacklist, Raymond Reddington wakes up in a Paris hospital and is told he's been paralyzed after an attack by Katerina. A French Inspector says that if he wants to be extradiated to the U.S., Red better give up what he knows on her. Red gets the guy to call his \"lawyer\" who's really Ressler who meets an attache outside the French embassy to share details on this. In reality, Red isn't paralyzed and is in a mock-up building in Maryland as the \"inspector\" is actually \"The Illusionist,\" a criminal who pulls these scams to trick folks into giving up information.\n• The team are able to figure things out Ressler goes to the French embassy to push about releasing Reddington to them only to find the attache is a completely different man who has no idea what he's talking about. Meanwhile, when he pickpockets an orderly's phone, Red is struck by how the man's screen image has him at a Washington Nationals baseball game. Looking at the buildings outside his window, Red (who's been to Paris numerous times) sees the skyline is completely wrong for where the hospital should be and figures out what's happened.\n• Burn Notice subverted this: after convincing the mark that a closed up church-room was being used by a group of assassins out for the mark's blood, they then had a problem when the mark took his brother back there. So they turned it into a church and put on a show to convince the brother that the mark was crazy.\n• Played straight when Michael realized the office manager he had spoken with earlier was Carla, the handler he'd been trying to locate. On returning to the office he finds it empty except for a small gift and bundle of balloons, congratulating him on figuring it out.\n• On CSI: Miami, a corpse goes missing and Natalie checks out a Biotech company that was cited as taking the body. A woman comes out in a hat, claiming the offices are mostly empty as everyone is in the back celebrating a coworker's birthday. Later, Natalie returns with Horatio to discover an empty building with just the woman's party hat in the trash. This soon leads to the discovery that the \"murder\" was part of a complicated live action roleplaying game that's gotten out of hand.\n• A variation on Elementary as a doctor who was a high-class survivalist is murdered. Holmes and Watson find he was investing thousands in an upscale \"Doomsday Bunker\" for the rich. They check it out, finding a rather lavish area with nice apartments and a game room. It takes Holmes two minutes to figure out it's a sham: The walls behind the paneling are cracked and moldy, the \"high-end ventilation\" system is covered with dust, the boxes of supplies and food are all empty, and the door to the \"generator room\" opens to a brick wall. Holmes notes the guy spent a lot on making it look good, but the place couldn't stand up to a strong storm (let alone the apocalypse), and he's been scamming rich survivalists for millions.\n• In one episode of It's Always Sunny in Philadelphia Charlie is convinced the company he and Mac get jobs at is one of these. Turns out, no, it's a legitimate company, Charlie's just gone insane from stress.\n• On Psych, Shawn is happy when he's chosen to be part of a \"think tank\" set up by a millionaire to find ways to kill him for security reasons. Shawn brags about it to Lassiter, who's at first upset he wasn't picked but then confused as he's never heard of the guy Shawn says is in charge of the millionaire's security. Shawn then sees footage of the millionaire on TV but with longer hair then the \"live video\" he was addressing the think tank on. Shawn leads the cops to the meeting room, Lassiter grousing when he sees the electronic keypad and fingerprint scanner on the door. Shawn, realizing what's happening, yanks the \"lock\" off, revealing it's just a box with lights. He easily opens the door to show the \"command center\" has been totally cleaned out and too late figures out the \"security chief\" is the killer and Shawn has just given him the perfect plan.\n• Leverage has used this a few times, but not as often as you'd expect for a show about con artists. The showrunner says in the DVD commentary that this trope's become so ubiquitous in con-artist stories that he avoided it as much as possible.\n• The pilot, for instance, is actually a subversion: the mark realizes he's being had and calls the cops on the fake business, but it turns out that they're genuine and also that the team has got them thinking that he's pulling something on them: all part of the plan.\n• In \"The Boiler Room Job,\" the mark is an experienced con artist himself and laughs at the team's attempt to make him think he's in a busy stock office (\"my grandfather invented that con!\") As it turns out, the team knew he would see through it and used it as a distraction while they stole his money out from under him. Also, all the \"workers\" just happen to be the man's past victims who he honestly didn't recognize.\n• Inverted in one episode where the team makes a legit business look fake as bait for a mark looking for a way to launder money. They get a small gym cleared out during peak hours (except for one intense woman who keeps up with Parker on the exercise bike) so it looks like an operation set up to cover \"fake\" membership dues as a laundering set-up with no real costumers (for an added twist, the list of fake members is just the names of all the people the mark had stolen money from, he doesn't even recognize their names).\n• Played mostly straight in \"The Boost Job.\" The team sets up a fake business in a real car dealership by sending the actual owners on a ten-day trip to Hawaii; the episode glosses over what will become of the car sales they make at drastically reduced prices to real customers in the process of faking out their mark. (Since the mark was driving the other dealership out of business with his crooked sales practices, they presumably end up better off in the long run regardless.)\n• A Monster of the Week in Criminal Minds who was killing people based on their fear operated his practice out of an abandoned office building his wife's family owned. To make it look more real, he put other fake businesses on the entry hall board.\n• Sneaky Pete: In Marius's backstory, he rented a place and used it to set up a fake casino for a gambling con to trick Vince. It didn't work, Vince wanted his money back, and thus we have the series.\n• On an episode of Deception (2018), Cameron is kidnapped by the Mystery Woman, waking up in what looks to be a hotel suite in Italy. He manages to get out of the room and into the hallway, knocking out a guard and racing to the elevator...and it opens to show he was in a set inside a warehouse in New Jersey and this was all a test.\n• On ER, Carter treats a doctor who talks of how he's been running an inner-city clinic for twenty years. Carter visits it a few weeks later to check on the man, observing a run-down but helpful clinic for the locals. He gives the man a huge donation to use to upgrade the clinic. Shortly after, Carter drops by the clinic only to find it deserted. The police reveal that instead of being around for twenty years, the clinic only just opened...right after Carter met the doctor. Carter realizes the guy set this whole thing up just to con Carter out of a few hundred thousand dollars, then packed up the clinic and left town. He also sardonically notes he never saw the guy treat anyone so can't even be sure he was really a doctor.\n• On The Resident, Julian is a saleswoman for Quo Vadis, a company that boasts that all their medical devices are created in Atlanta and is proud of their work. A surgical death gets her interest and she goes to check out the factory where the devices are built. She finds a mostly empty warehouse where workers are taking out materials from China and then putting them in Quo Vadis boxes. Julian is with her boss as he shows investors a fully-staffed and lavish lab where they do all their research and design work. Later that day, she goes back to find the \"lab\" is now completely cleared out of the rented equipment with only a trio of people (clearly not doctors) just sitting around. Julian thus realize the entire company is a massive fraud that can risk people's lives before it crumbles.\n• In Liberal Crime Squad, you can purchase a Business Front upgrade for the abandoned warehouses and the crack house you can seize as safehouses. Their purpose is to hide the heat your Liberals have acquired, therefore making it harder for the law enforcement to track them.\n• A shady organization on Batman Beyond had a building made up to look like a school for gifted children, as a cover for abductions: on closer inspection, rows of computer terminals were empty monitor casings, most floors had never even been used, etc.\n• One episode of All Grown Up! had Suzie go to a building where an apparent talent agent had told her to be after giving her 1,000 dollars. Turns out the woman's a con artist that swindled her, and the building hasn't been used in years. Suzie is understandably upset about this.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/BigStore", "media_links": ["/pmwiki/pmwiki.php/ComicBook/HarryDickson", "/pmwiki/pmwiki.php/Film/TheSting", "/pmwiki/pmwiki.php/Film/Accepted", "/pmwiki/pmwiki.php/Film/TheGame", "/pmwiki/pmwiki.php/Film/Sneakers", "/pmwiki/pmwiki.php/Film/TheGrifters", "/pmwiki/pmwiki.php/Film/TheSpanishPrisoner", "/pmwiki/pmwiki.php/Film/LarcenyInc", "/pmwiki/pmwiki.php/Creator/AaronEckhart", "/pmwiki/pmwiki.php/Creator/AndrewVachss", "/pmwiki/pmwiki.php/Literature/TheLittleGoldenCalf", "/pmwiki/pmwiki.php/Literature/HeistSociety", "/pmwiki/pmwiki.php/Literature/SherlockHolmes", "/pmwiki/pmwiki.php/Series/EverybodyLovesRaymond", "/pmwiki/pmwiki.php/Series/Hustle", "/pmwiki/pmwiki.php/Series/MissionImpossible", "/pmwiki/pmwiki.php/Series/AliasSmithAndJones", "/pmwiki/pmwiki.php/Series/TheBlacklist", "/pmwiki/pmwiki.php/Series/BurnNotice", "/pmwiki/pmwiki.php/Series/CSIMiami", "/pmwiki/pmwiki.php/Series/Elementary", "/pmwiki/pmwiki.php/Series/MacGyver", "/pmwiki/pmwiki.php/Series/ItsAlwaysSunnyInPhiladelphia", "/pmwiki/pmwiki.php/Series/Psych", "/pmwiki/pmwiki.php/Series/Leverage", "/pmwiki/pmwiki.php/Series/CriminalMinds", "/pmwiki/pmwiki.php/Series/SneakyPete", "/pmwiki/pmwiki.php/Series/Deception2018", "/pmwiki/pmwiki.php/Series/ER", "/pmwiki/pmwiki.php/Series/TheResident", "/pmwiki/pmwiki.php/VideoGame/LiberalCrimeSquad", "/pmwiki/pmwiki.php/WesternAnimation/BatmanBeyond", "/pmwiki/pmwiki.php/WesternAnimation/AllGrownUp"], "non_media_links": ["/pmwiki/pmwiki.php/Main/ConMan", "/pmwiki/pmwiki.php/Main/ItWasHereISwear", "/pmwiki/pmwiki.php/Main/ItWasHereISwear", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/HilarityEnsues", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/SecretlyWealthy", "/pmwiki/pmwiki.php/Main/MyGodWhatHaveIDone", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/MonsterOfTheWeek", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/WesternAnimation"]}