{"title": "Pop Quiz", "content": "Kaaaa-wiiiizzz! The answer is Goombaria. If you got it right, have a Star Piece!\n\nThe tendency of some video games to suddenly spring a general knowledge quiz on you regarding relatively obscure facts about the events, characters and monsters in the game universe. They are always multiple choice and usually timed. Sometimes these questions are simply impossible to answer because the game has never given you the relevant information, forcing you to take a wild guess. The most insidious versions of these quizzes randomize the questions so you can't just reach the end through trial-and-error. Unfortunately, these quizzes are usually essential to get a 100% Completion. Can take the form of a Game Show or Fairy Battle, and also be a Deadly Game. Pop quizzes can also be a form of anti-piracy, usually with the answer in the manual or included in Feelies\n• There are three of these in Custom Robo Arena, and some of the questions are about in-universe history that the game did NOT tell you before that point... unless you knew where to look (the computers in the Midheart lobby). The rest of the questions were about the robo parts, though.\n• Mega Man:\n• Mega Man Legends 2 plays this straight for the Z Sabre. Strange in that most of the questions revolve around real world knowledge (only four or five out of a database of around 200 are related to the in-game world), and notorious for a couple of questions being bereft of a proper answer through quirks of translation. Better have The Other Wiki open when you go to tackle it.\n• Both the Mega Man Battle Network and Mega Man Star Force series usually have several of these in each game with considerably greater focus on in-game knowledge, most often as optional sidequests for an item reward. No set of questions is randomized, and each question has 3 choices which appear in the same order every time, no time limit, and you're told immediately when you enter a wrong answer, which merely forces you to restart from the first question. Thus, the quizzes can be completed through Trial-and-Error Gameplay if you don't know the answers.\n• The one major exception in the Battle Network series was in the Japan-only Rockman.EXE 4.5: Real Operation, which has a required quiz that costs 100 Zenny to retry if you fail, but it's also probably the easiest quiz in the series if you've been paying any attention at all (and can read Japanese, or at least katakana). For example, one question is \"What is it called when you defeat two enemies simultaneously? Double Date, Douple Delete, or Double Delete?\"\n• The first Star Force also had required timed multiple-choice questions in Libra Balance's stage, but a wrong answer merely cost you a few HP, and would not deplete your HP below 1.\n• Mega Man Zero and Mega Man ZX usually have one or two per game (also on in-game knowledge) that are as hard to find as the answers to the questions.\n• The third installment of the Zero series even has one where the answer to the quiz hidden in an easily overlooked optional dialogue with a character in the second game.\n• Spider-Man: Web of Shadows features a segment where Wolverine quizzes Spidey on comic book trivia to make sure he's the real deal. \"Whose killer did we track in Berlin?\" \"What are you parents' names?\" Some mistakes even have in-universe justifications - it's possible to select \"Ben and May\", only for Spidey to realize he should have said \"Richard and Mary\".\n• Dynasty Warriors: Gundam Reborn has a series of stages where Queen Diana asks Gundam Trivia quesions and the player must give the answer by attacking the correct character.\n• At least one of the CSI computer games used this after the conclusion of each case. How well you answered affected your performance evaluation.\n• The Legend of Zelda:\n• The Legend of Zelda: Majora's Mask has Keaton, who gives you a Piece of Heart if you answer his quizzes about the game's world correctly.\n• The Legend of Zelda: Phantom Hourglass has one too, requiring you to take note of minor details about Goron Island.\n• Leisure Suit Larry 1: In the Land of the Lounge Lizards used this as a measure to prevent children from playing the game by asking a General-Knowledge at the time question, such has \"Mohammed Ali is a\" and then 4 answers with the correct one being \"A boxer\". Once answered, the game would consider that an adult was playing. The right key combination (Alt-X in the AGI version) instantly skipped the quiz, though. Al Lowe, the creator of the game, posted the answers to the quiz questions on his website, saying \"The problem with these questions now is: they're only good at identifying someone over age 41 now!! And yes, the O. J. Simpson question below was in the original game back in 1987, long before O. J. ever was indicted!\"\n• The adventure hybrid video game of Magic: The Gathering has such quizzes in several locations, which will ask about the various kinds of cards that appear in the game. One is a random encounter on the overland map, where answering correctly will net you a bunch of good cards for your deck. Another place where this happens is in dungeons - if you answer incorrectly, a monster will be spawned in your path and you have to defeat it if you want to move through that corridor. If answer correctly, the monster does not appear. This is very important because, unlike the overland map, in dungeons you win nothing from fights and your life meter does not regenerate after them, so you want to minimize the number of fights.\n• Both PokéPark Wii and its sequel have this as one of the ways to befriend Pokémon. Questions range from the fairly simple (\"What shape is Pikachu's tail?\" when Pikachu's tail is in the shot) to decently complex (Solosis in particular has a few lengthy word problems in Wonders Beyond).\n• The Quest for Glory games did this occasionally as in-game puzzles. In the first and fifth game you had to answer three questions to get in to see the wizard Erasmus, which were different each time, some of them being trivia about the game world. In the first game the dev team has a little fun with this: if you answer correctly what the password to get into the Thieves' Guild is, you're turned away as \"the wizard does not deal with thieves\". In the fourth game, one of the creatures in the forest who will aid you is a strange fairy-like being called a Leshy, who will ask you a series of questions about people and places, prompting you to go exploring and find the answers.\n• In the Christian-themed Zelda clone Spiritual Warfare, touching the randomly spawning angel who wafts about allows to partake in a Bible trivia game to win some swag.\n• This is the schtick of Another Code. Pretty much every chapter in the game ends with a multiple choice test of the events in that chapter. Spiritual Successor Hotel Dusk: Room 215 did the same thing.\n• Captain Novolin uses short quizzes to break up its levels, asking the player questions about diabetes and how to manage it. However, all the answers are told at the start of the level, so the quizzes usually just depend on the player remembering the answer they read three minutes ago, and some questions are only tangentially related to diabetes at best (\"Check you feet [sic] for sores!\") or just plain inane (\"Why is it good to eat at even times through the day?\").\n• Jump Ultimate Stars has a pop quiz minigame, though you only have to play it once, and the only penalty for failure is not getting bonus points to use for unlocks.\n• Super Smash Bros. Ultimate gives us the Mysterious Dimension, in which the player must answer trivia questions like \"Which spirit is part of Bowser\u0092s army?\" or \"Which group hails from Inkopolis?\" in order to progress. Rather than simply answering correctly, you must fight and defeat the correct spirit in order to proceed.\n• In one of Taneo's stages in Incredible Crisis, he awakens from taking a blow to the head to find himself in an ambulance, where two paramedics pester him with math, logic, and trivia questions. If he gets too many wrong, they'll assume he's delirious and electrocute him with a defibrillator to \"snap him out of it\".\n• Mario Party 3 has the minigame \"M.P.I.Q.\", in which players must answer Mario Party trivia questions. The first player to get three points wins.\n• One of the Mini Events in Sonic Shuffle quizzes you on things ranging from questions you really should be able to answer (\"How many Preciousstones do you have?\") to ridiculous things like how many times you've landed on a certain type of space.\n• Geekwad Series:\n• Wacky Funsters: A Geekwad's Guide To Gaming features pop quizzes in which you have to answer questions that kings ask you. Every king has different questions.\n• The Geekwad: Games Of The Galaxy also has pop quizzes asked by other crew members. The reward for answering them is the order of the things you have to click on in order to defuse the bomb. Unlike Wacky Funsters, it's optional if you know the order beforehand.\n• One of the minigames in The Three Stooges is a pop quiz. While there are some questions relating to the shorts, a lot of questions are biographical in nature and can easily stump first-time players who are only casual fans of the Stooges.\n• In Adventures In The Magic Kingdom, you had to acquire six keys to the gates of the Magic Kingdom theme park. Getting one of these keys required you to run around the park answering surprisingly obscure Disney trivia questions, like \"Which state was Davy Crockett born in?\".\n• Banjo-Kazooie has Grunty's Furnace Fun, a board game and Gruntilda's last ditch attempt to stop Banjo and Kazooie from rearching the top of her lair. The answers to personal questions about Gruntilda are randomized each game. Banjo-Tooie has the Tower of Tragedy Quiz where the loser gets a 16 ton safe dropped on him. By this time, it's evident that Grunty's love of random quizzes knows no bounds, so she continues with the questions during the Final-Exam Boss battle where she promises to \"go easier on you\" if you answer them correctly. Bit of a lie, as there isn't a huge difference between her faster and slower magic blasts. It returns in \"Nuts and Bolts\", where getting L.O.G's questions right would add extra time to the mission that he assigned you.\n• Swanky's Bonus Bonanzas in Donkey Kong Country 2: Diddy's Kong Quest were exactly this, but thankfully they were optional bonus rounds that offered One Ups. Ironically, your number of extra lives don't get saved, but the fact that you completed a Swanky Quiz does, so they're strictly a one-off bonus that stays locked on loading a \"Quiz Completed\" save.\n• Earthworm Jim 2 features one near the end of the \"Villi People\" stage, with ridiculous questions (\"How does Jim spell his name?\" The choices: JMI, MIJ or IJM).\n• The Super Mario Bros. fan game has one or two amusingly ridiculous examples of this, in that the pop quiz questions have absolutely nothing to do with the game. As in, it asks stuff like what baseball team won what season, questions about maths and stuff related to history.\n• Sonic Unleashed for the PS3/360 has 2: A wondering woman who asks you about the current hub, and a female reporter who has question about the storyline, and miscellany. While they get no in-game rewards, they are required to get Trophies (PS3)/Achievements (360).\n• Dates all the way back to Wonder Boy in Monster Land - the round 6 boss (Sphinx) asks you one of these. Some hilariously bad translation can result in you needing to answer with the right component of the sentence \"I don't like pizza.\"...\n• Wonder Boy in Monster World has the Sphinx perform the same function at the top of the pyramid in the desert. Passing the quiz opens another section of the pyramid which has a teleporter to the next land in the game sequence.\n• Yooka-Laylee: As you're exploring Hivory Towers, you might get challenged to \"Dr. Quack's Quackfire Quiz\", where Dr. Quack will challenge you to answer questions about the game. You get a point for each correct answer, or two points if you answer quickly enough, and you have to score ten points in order to move on.\n• In some levels of Super Mario Odyssey, Mario has to meet the Sphynx, who asks questions relevant to the level they're on. Answering one reveals a Power Moon (and typically a small cache of coins), answering all of them nets another Power Moon. Completing all the quizzes, and finding the Sphynx's airships in a few other worlds, unlocks the final quiz on the Darker Side, which gets Mario a small fortune in coins.\n• Flash game The Impossible Quiz features a hellish version of this, featuring questions like \"How many holes in a Rolo?\" and \"What was the answer to the last question?\"\n• Wonderland Adventures surprises you towards the end with a quiz on things the player wouldn't think was important.\n• The Tower and the Emperor in Typing of the Dead. The former has serious questions which must be answered correctly to damage it, while the latter has silly questions with seemingly no correct answer, though answering with any answer will damage him. However, these questions do have \"correct\" answers that affect what ending you get. These don't come back in Typing of the Dead Overkill, but the final boss has another gimmick in which you are challenged to type words that are related to a topic which changes every so often. You also do damage by typing randomly, which is usually the more effective option.\n• The Paper Mario series has this as a Running Gag.\n• Paper Mario 64:\n• Chuck Quizmo shows up randomly and gives the player a Star Piece if they answer a question correctly.\n• Peach was pulled into a survey by Bowser and Kammy Koopa after Mario silences Tubba Blubba and ask her what things Mario hates and fears. The player could then have Peach rig the answers to give Mario items or play honest to summon enemies he can fight for extra Star Points.\n• Peach gets roped into a Koopa game show in one of her segments, with questions that point at Mario's next goal.\n• Paper Mario: The Thousand-Year Door:\n• There was a Thwomp that popped up near the beginning, asking you a bunch of easy questions to let you through - and then, near the end, he pops up again - in a cybernetic version - for another round!\n• TEC uses a quiz to impart some exposition to Peach.\n• Super Paper Mario:\n• Merlee ( ) asks what Mario hates; these things are through the door ahead, and while unpleasant (if your answers are honest; if not, she'll leave items like in the above example), they're hardly unbeatable. She then yells at you for lying.\n• In an earlier level, sentient doors give you pop quizzes as a security clearance measure. One of them pulls out all the stops and gives what amounts to an IQ exam involving memory and problem solving. It's actually fairly similar to the Six Doors challenge mentioned below.\n• There is also an inverted pop quiz which has Mario asking the questions.\n• Paper Mario: Sticker Star has Snifit or Whiffit (Hit it or Snifit in the PAL version), in which Mario has to answer quiz questions and whack \"unpaid Snifit interns\" while in a room filled with Deadly Gas.\n• Paper Mario: Color Splash also has \"Sniffit or Whiffit\" except this time Mario drowns in the sea if he is wrong.\n• Super Mario RPG had the Six Doors Challenge, in which you must successfully complete the challenges behind four of the six doors (of your choice, thankfully). Two doors lead to a green Hammer Brother named \"Doctor Topper\" who makes you solve puzzles, one of which is a trivia quiz on the game world.\n• The \"Flab Zone\" level of Bowser's Inside Story actually has three Pop Quizzes of increasing difficulty. Through a creature called Nutsoglobin, you ask Bowser questions about various things (at 5 coins a pop!). When you feel you've asked enough, Nutsoglobin treats you to the \"Big Bad Bowser Brain Train\", where he asks you random questions about Bowser's responses. Get them all right, and he tells you which way to go through the maze, along with a coin bonus. Get any wrong, and you get a Random Encounter. Mercifully, these Brain Trains are completely optional, and you can get through the Flab Zone just by exploring it for yourself.\n• Once an Episode in the Pokémon games.\n• Happens in the Cinnabar gym of Pokémon Red/Blue/Yellow: the player can get to Blaine by either answering questions or fighting trainers. Most choose to fight the trainers for the XP.\n• Pokémon Gold and Silver had a brief quiz to get the FM radio add-on for your Pokégear.\n• Also occurs in Ruby/Sapphire/Emerald, where one of the Trick Master's trick rooms (the 5th iteration, which is unlocked by the Feather Badge) is full of robot duplicates of himself that quiz you on such topics as \"how much does a Super Potion and a Great Ball cost\" and \"which of these Pokemon cannot be caught on Route 104.\"\n• Done again in the first two fourth generation games, except the opponents think you purposefully are fighting them for XP (the questions are basic math, and you have an in-game calculator).\n• In Pokémon X and Y, the Lumiose City Gym also has you answer trivia questions before you can battle Clemont. You still have to battle trainers along the way even if you pick the right answers, but you'll face more (up to twelve in all) if you pick the wrong answers first.\n• Two of the island trials in Pokémon Sun and Moon are quizzes. Sophocles's is an audio quiz, and Kiawe's has you compare two dances. Kiawe's, however, is an enormous joke; instead of getting progressively harder, it starts easy and gets even easier in ways that are nothing short of absurd.\n• Miitopia has the Quizmaster's General Knowledge quiz. Some questions are related to in-game stuff, others are the occasional \"oddities\" like asking what the current question's number is or how many tentacles does a real-life squid have.\n• Final Fantasy IX had the Ragtime Mouse, who'd pop up in random battles and ask you True or False questions. The reward for answering each question started with money, which increased in value with every new question answered. Then you would get a Protect Ring if you had answered all of them correctly.\n• Final Fantasy VIII had the terrible quizzes to increase your SeeD rank. Answering a series of 10 questions would increase your rank by 1, which increased the amount of Gil you earned. Your rank also increased for every 100 \"SeeD Experience Points\" gained (usually gained by defeating enemies), though you lost 10 of these SeeD Points every time you were paid, which could sometimes make you lose a level if those 10 points put you under the experience needed for that level.\n• In Final Fantasy VII Crisis Core, you must answer a series of questions about Sephiroth in order to join his fan club. Of course, one wonders how a fan club member could know about his ultimate attack that he doesn't even use for the first time until years later...\n• Final Fantasy XIII-2 has one, and the questions range from insanely simple (asking about which side of her head Serah wears her ponytail on when she's the main character and obviously on-screen at the time) to pretty mundane to somewhat coded (for instance, asking about the tagline to a TV show that is never mentioned anywhere else, but happens to mention Cactuars in the title, and the correct answer is the one that applies to Cactuars) to obscure background information to questions about other Final Fantasy games entirely to even questions asking absurd things like \"Left or right?\" or \"Red or black?\" without context. The questions are randomized and the potential list of questions is huge.\n• Shadow Hearts - Both Shadow Hearts: Covenant and From The New World feature this trope repeatedly, with the most infamous example being in the former where you are quizzed on the lifestyles of naked male supermodels.\n• In Digital Devil Saga II, encountering Jack Frost in a random battle will prompt him to give you a general knowledge quiz on the Digital Devil Saga universe. These questions range from hard (\"Hee purchases 3 Rations, while Ho buys 2 Dis-Poisons and a Revival Bead. How much did they spend?\") to impossible unless you bought the companion book (\"What was Harley's Atma called?\"). Answering all 100 questions correctly opens up a Bonus Boss and a Bragging Rights Reward.\n• Kingdom Hearts: 358/2 Days: Roxas has a mission in Twilight Town where he has to answer questions about structures in the town from Pence.\n• Legend of Legaia features this trope occasionally: the first such quiz is in regards to the significance of the Genesis Tree and it's location, and the second involves a female member of the party quizzing you as a game; if you get all her questions right, she gives you ten Healing Shrooms. Later on, you meet the wife of a scientist who's a quiz junkie, and who insists on asking you a 'who you are, where you're going and what you're doing' set of questions in order to confirm your identity.\n• In Earthbound/Mother 2, knocking on a certain door in Onett prompts this response; \"OK, pop quiz! 'A Beatles song, XXXterday. Can you fill in the blanks?\" It is, of course, a Yes or No question. You don't get anything for answering correctly, though.\n• There's a quest in World of Warcraft that does this, though the answers can indeed be found in-game—in the book you're bringing to the quest guy, in fact. The introduction of the Timeless Isle gave players another quiz master who dispenses timeless coins to players who can answer questions about the game's lore, although many are very obscure. There is no penalty for incorrect answers however so random guessing will result in success fairly quickly.\n• There is apparently this one Reaper in The World Ends with You who likes walling off an arbitrary pathway once per chapter unless you can complete his \"Shinigami Quiz\"/\"Reaper Review\". It's usually about places and sights around Shibuya, but he occasionally tosses in random cultural trivia.\n• \"Like a bolt from the blue, here comes the Reaper Review!\"\n• Joshua springs this on you at one point: after Neku shows less interest in one of his random tangents, he springs a quiz about the information he'd dumped on you two speech bubbles before (who was the district Dogenzaka named after — and being as Shibuya is a real place, this is a true answer). No penalty for answering wrong, though, except Joshua mocks Neku for not listening. On the other hand, Joshua is shamelessly condescending towards Neku if you do answer correctly; he's just that sort of guy.\n• Shin Megami Tensei: Persona:\n• At one point in Persona 3, Yukari does some investigating at school, and asks Junpei and The Hero to do the same. At the end of that week, she asks what you learned... and treats it like a pop quiz rather than sharing and comparing information. Comes off as a bit arrogant, since she seems to assume that you'll naturally reach the exact same conclusions she has, despite all the rumors surrounding the incident.\n• In 3, 4, and 5, on certain days the teacher will ask you a question about real world trivia (history, sciences, mathematics, literature...), and answering correctly would give you a slight attribute bonus (Charm in 3, because your classmates admire your smarts, and Knowledge in 4 because, well, it makes sense). If you answered wrong the teacher would give you the right answer, which is good, because there are a few important tests per game and the questions are all ones that you have already been asked. Getting a high score on your test will get you some sweet prizes.\n• In zOMG!, many of the early NPC characters each had a conversation topic about a particular game mechanic, which was followed by a pop quiz on the topic for a small reward. Considering the number of players that ask about these basic mechanics on the forums now, these have likely been removed.\n• Tales of Legendia had the Quiz Shacks during the Character Quests, in which you could earn some decent equipment (though nothing powerful with the exception of the 405K Hammer for Will). The questions they asked you ranged from general knowledge about the Legacy to questions relating to exact details (such as \"On which knee did Cashel have a spiked knee-pad on?\").\n• Fallout 2 has a rare random encounter which asks you a question from a pool of random meta gaming questions like \"What's the maximum carrying capacity of a character with 8 strength and the pack rat perk?\". Answer wrong and you die. The first two questions are very simple. The third one however is quite difficult if you're not a munchkin - carrying capacity for a char with specified strength. But if you answer with a question (\"With or without the pack rat perk?\"), the asker gets melted and you get his robe.\n• Fallout: New Vegas: Progression in one side quest depends upon correctly answering an NPC's questions about the history of the New California Republic.\n• Arcanum: Of Steamworks & Magick Obscura features an occasional pop-quiz NPC who usually hangs around in some town bars and asks a single question regarding the game's universe. Answer correctly and gain 500 coin; answer incorrectly and lose 500 coin. Each quiz offered is even immune to save-scumming, as that NPC will only ever ask you once (it can revert your losing, but not help you win).\n• Both Parasite Eve games pull this in their latter thirds: the former is general knowledge-based and requires that you'd paid attention to the various science-laden Infodumps throughout the game, the latter is a minor Continuity Nod that mixes bits of the former with questions about the previous game's events.\n• One of the missions in Guild Wars: Nightfall requires you to answer a series of questions about the game's lore. A fairly benign example for three reasons: first, the whole mission is optional and doesn't have to be done to continue the storyline; second, the questions are about fairly well-known lore concerning the game world's gods, which even players uninterested in the lore will probably have picked up by osmosis by then anyway; and third, the only consequence of giving wrong answers is that a few more enemies spawn, making the rest of the mission a little harder but not impossible.\n• Marvel Ultimate Alliance has both a Marvel Universe trivia quiz for experience, and a boss who zaps you with electricity when you get his questions wrong. 'What is the half-life of strontium-90?'\n• In Terranigma, the Developer's Room in the Japanese version includes a quiz asking the player about the Quintet staff and their previous games. The prize for winning is a piece of Magirock, of course.\n• In Holy Umbrella, a Mad Scientist puts you through a quiz towards the end of the game. You have to answer all the questions correctly, but there are only three of them.\n• In Dragon Age: Inquisition, you can find an NPC named Lord Trifles Minutiae around Skyhold. If you can answer three of his questions, he'll give you a unique weapon: the Boon of the Spoon.\n• In X-Men Legends, there's an X-Men trivia quiz at the X-Mansion between missions that gives out experience points for correct answers. The sequel also has quizzes at the various bases.\n• BoxxyQuest: The Gathering Storm has one in its second dungeon, asking you to remember specific things about the dungeon\u0092s earlier puzzles. There\u0092s also a much harder quiz later, en route to the secret PC Ending.\n• In Animal Crossing: New Leaf, helping out seagull sailor Gulliver involves helping him remember his original destination before he got washed onto the shores of your town. You have to guess it from a list of four countries based on three factoids Gulliver gives you. Get it right, and he'll send you a souvenir in the mail the next day.\n• An unusual sports game example, NCAA Football 09 by EA Sports has a Quiz the Quarterback feature that asks the player what play the defense just ran, should you throw an interception. An incorrect answer negatively affects your QBs performance for the game.\n• Civilization uses several pop quizzes that act as an anti-piracy measure (the answers are All There in the Manual, and the developers assume that a pirated copy of the game doesn't come with a manual.) The game justifies the pop quiz by calling it a challenge of the legitimacy of the player's rule by a potential usurper. The quiz questions themselves are about the game's Tech Tree - one must choose the correct combination of technologies needed to produce the technology pictured in the question. If the question is answered incorrectly, all units outside of cities are lost.\n• Ogre Battle 64 performs the pop quiz when you encounter the Vampire Count character. The answers are not as important as the combination of answers you give in regards to the time of the day (For example, you have to answer ADCDBA between 21:00 and 24:00). Answers were mostly non-sensical and a potential Guide Dang It! moment. Succeeding in this rewarded you with an item (Blood Kiss) which transforms one of your characters into a Vampire.\n• Killer7:\n• The third chapter has you answering questions on a series of posters that you just passed by featuring your target for that chapter, Andrei Ulmeyda. Just to see if you're paying attention, one of the questions is \"This is question number...?\" At the end of the quiz, it's revealed this is done to ensure that Ulmeyda's followers/cultists are brainwashed enough to learn the truth about his cult, which is behind the door the quiz unlocks.\n• In the sixth chapter, Garcian must answer a series of questions asked inside a computer to log in as so he can open the gym to meet the Minister of Education.\n• In Silent Hill 2 there is a quiz which is totally winnable, if one read all the documents throughout the game and played Silent Hill in the same way.\n• Kagetsu Tohya springs one of these on you if you enter a certain room at a certain time. Given the extreme non-linearity of the game, it's highly unlikely that you will have found the answers to all of the questions the first time you find it. Worse, there are actually 3 different sets of questions, which are chosen at random each time you visit. If you win, you get an important item. If you lose, it's Needle Time.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/PopQuiz", "media_links": ["/pmwiki/pmwiki.php/VideoGame/PaperMario64", "/pmwiki/pmwiki.php/VideoGame/CustomRobo", "/pmwiki/pmwiki.php/Franchise/MegaMan", "/pmwiki/pmwiki.php/VideoGame/MegaManLegends", "/pmwiki/pmwiki.php/VideoGame/MegaManBattleNetwork", "/pmwiki/pmwiki.php/VideoGame/MegaManStarForce", "/pmwiki/pmwiki.php/VideoGame/MegaManZero", "/pmwiki/pmwiki.php/VideoGame/MegaManZX", "/pmwiki/pmwiki.php/VideoGame/SpiderManWebOfShadows", "/pmwiki/pmwiki.php/ComicBook/Wolverine", "/pmwiki/pmwiki.php/VideoGame/DynastyWarriorsGundam", "/pmwiki/pmwiki.php/Anime/TurnAGundam", "/pmwiki/pmwiki.php/VideoGame/CSI", "/pmwiki/pmwiki.php/Franchise/TheLegendOfZelda", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaMajorasMask", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaPhantomHourglass", "/pmwiki/pmwiki.php/VideoGame/LeisureSuitLarry1InTheLandOfTheLoungeLizards", "/pmwiki/pmwiki.php/VideoGame/MagicTheGathering", "/pmwiki/pmwiki.php/VideoGame/PokeParkWii", "/pmwiki/pmwiki.php/VideoGame/QuestForGlory", "/pmwiki/pmwiki.php/VideoGame/SpiritualWarfare", "/pmwiki/pmwiki.php/VideoGame/AnotherCode", "/pmwiki/pmwiki.php/VisualNovel/HotelDuskRoom215", "/pmwiki/pmwiki.php/VideoGame/CaptainNovolin", "/pmwiki/pmwiki.php/VideoGame/JumpSuperStars", "/pmwiki/pmwiki.php/VideoGame/SuperSmashBrosUltimate", "/pmwiki/pmwiki.php/VideoGame/SuperMarioBros", "/pmwiki/pmwiki.php/VideoGame/Splatoon", "/pmwiki/pmwiki.php/VideoGame/IncredibleCrisis", "/pmwiki/pmwiki.php/VideoGame/MarioParty", "/pmwiki/pmwiki.php/VideoGame/SonicShuffle", "/pmwiki/pmwiki.php/VideoGame/GeekwadSeries", "/pmwiki/pmwiki.php/VideoGame/TheThreeStooges", "/pmwiki/pmwiki.php/VideoGame/AdventuresInTheMagicKingdom", "/pmwiki/pmwiki.php/VideoGame/BanjoKazooie", "/pmwiki/pmwiki.php/VideoGame/BanjoTooie", "/pmwiki/pmwiki.php/VideoGame/DonkeyKongCountry2DiddysKongQuest", "/pmwiki/pmwiki.php/VideoGame/EarthwormJim", "/pmwiki/pmwiki.php/Franchise/SuperMarioBros", "/pmwiki/pmwiki.php/VideoGame/SonicUnleashed", "/pmwiki/pmwiki.php/VideoGame/WonderBoyInMonsterLand", "/pmwiki/pmwiki.php/VideoGame/WonderBoyInMonsterWorld", "/pmwiki/pmwiki.php/VideoGame/YookaLaylee", "/pmwiki/pmwiki.php/VideoGame/SuperMarioOdyssey", "/pmwiki/pmwiki.php/VideoGame/TheImpossibleQuiz", "/pmwiki/pmwiki.php/VideoGame/WonderlandAdventures", "/pmwiki/pmwiki.php/VideoGame/HouseOfTheDead", "/pmwiki/pmwiki.php/VideoGame/PaperMario", "/pmwiki/pmwiki.php/VideoGame/PaperMario64", "/pmwiki/pmwiki.php/VideoGame/PaperMarioTheThousandYearDoor", "/pmwiki/pmwiki.php/VideoGame/SuperPaperMario", "/pmwiki/pmwiki.php/VideoGame/PaperMarioStickerStar", "/pmwiki/pmwiki.php/VideoGame/PaperMarioColorSplash", "/pmwiki/pmwiki.php/VideoGame/SuperMarioRPG", "/pmwiki/pmwiki.php/VideoGame/MarioAndLuigiBowsersInsideStory", "/pmwiki/pmwiki.php/Franchise/Pokemon", "/pmwiki/pmwiki.php/VideoGame/PokemonRedAndBlue", "/pmwiki/pmwiki.php/VideoGame/PokemonGoldAndSilver", "/pmwiki/pmwiki.php/VideoGame/PokemonRubyAndSapphire", "/pmwiki/pmwiki.php/VideoGame/PokemonDiamondAndPearl", "/pmwiki/pmwiki.php/VideoGame/PokemonXAndY", "/pmwiki/pmwiki.php/VideoGame/PokemonSunAndMoon", "/pmwiki/pmwiki.php/VideoGame/Miitopia", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyIX", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyVIII", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyVIICrisisCore", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyXIII2", "/pmwiki/pmwiki.php/VideoGame/ShadowHearts", "/pmwiki/pmwiki.php/VideoGame/DigitalDevilSaga", "/pmwiki/pmwiki.php/VideoGame/KingdomHearts358DaysOver2", "/pmwiki/pmwiki.php/VideoGame/LegendOfLegaia", "/pmwiki/pmwiki.php/VideoGame/TheWorldEndsWithYou", "/pmwiki/pmwiki.php/Franchise/ShinMegamiTenseiPersona", "/pmwiki/pmwiki.php/VideoGame/Persona3", "/pmwiki/pmwiki.php/VideoGame/Persona4", "/pmwiki/pmwiki.php/VideoGame/Persona5", "/pmwiki/pmwiki.php/Website/GaiaOnline", "/pmwiki/pmwiki.php/VideoGame/TalesOfLegendia", "/pmwiki/pmwiki.php/VideoGame/Fallout2", "/pmwiki/pmwiki.php/VideoGame/FalloutNewVegas", "/pmwiki/pmwiki.php/VideoGame/ArcanumOfSteamworksAndMagickObscura", "/pmwiki/pmwiki.php/VideoGame/ParasiteEve", "/pmwiki/pmwiki.php/VideoGame/GuildWars", "/pmwiki/pmwiki.php/VideoGame/MarvelUltimateAlliance", "/pmwiki/pmwiki.php/VideoGame/Terranigma", "/pmwiki/pmwiki.php/VideoGame/HolyUmbrella", "/pmwiki/pmwiki.php/VideoGame/DragonAgeInquisition", "/pmwiki/pmwiki.php/VideoGame/XMenLegends", "/pmwiki/pmwiki.php/VideoGame/BoxxyQuestTheGatheringStorm", "/pmwiki/pmwiki.php/VideoGame/AnimalCrossing", "/pmwiki/pmwiki.php/VideoGame/Civilization", "/pmwiki/pmwiki.php/VideoGame/OgreBattle64", "/pmwiki/pmwiki.php/VideoGame/Killer7", "/pmwiki/pmwiki.php/VideoGame/SilentHill2", "/pmwiki/pmwiki.php/VideoGame/SilentHill1", "/pmwiki/pmwiki.php/VisualNovel/Tsukihime"], "non_media_links": ["/pmwiki/pmwiki.php/FanFic/PaperMarioX", "/pmwiki/pmwiki.php/Main/HundredPercentCompletion", "/pmwiki/pmwiki.php/Main/GameShow", "/pmwiki/pmwiki.php/Main/FairyBattle", "/pmwiki/pmwiki.php/Main/DeadlyGame", "/pmwiki/pmwiki.php/Main/CopyProtection", "/pmwiki/pmwiki.php/Main/AllThereInTheManual", "/pmwiki/pmwiki.php/Main/Feelies", "/pmwiki/pmwiki.php/Main/ActionGame", "/pmwiki/pmwiki.php/Main/GuideDangIt", "/pmwiki/pmwiki.php/Wiki/TheOtherWiki", "/pmwiki/pmwiki.php/Main/TrialAndErrorGameplay", "/pmwiki/pmwiki.php/Main/NoExportForYou", "/pmwiki/pmwiki.php/Main/Nephewism", "/pmwiki/pmwiki.php/Main/DeceasedParentsAreTheBest", "/pmwiki/pmwiki.php/Main/AdventureGame", "http://www.allowe.com/Larry/1questions.htm", "/pmwiki/pmwiki.php/Main/ThievesGuild", "/pmwiki/pmwiki.php/Main/SpiritualSuccessor", "/pmwiki/pmwiki.php/Main/EdutainmentGame", "/pmwiki/pmwiki.php/Main/FightingGame", "/pmwiki/pmwiki.php/Main/MinigameGame", "/pmwiki/pmwiki.php/Main/MineralMacGuffin", "/pmwiki/pmwiki.php/Main/PlatformGame", "/pmwiki/pmwiki.php/Main/SurpriseDifficulty", "/pmwiki/pmwiki.php/Main/FinalExamBoss", "/pmwiki/pmwiki.php/Main/OneUp", "http://www.mfgg.net/index.php?act=resdb%C2%B6m=02&c=2&id=26076", "/pmwiki/pmwiki.php/Main/RiddlingSphinx", "/pmwiki/pmwiki.php/Main/TheDragon", "/pmwiki/pmwiki.php/Main/PuzzleGame", "/pmwiki/pmwiki.php/Main/RailShooter", "/pmwiki/pmwiki.php/Main/MultipleEndings", "/pmwiki/pmwiki.php/Main/RolePlayingGame", "/pmwiki/pmwiki.php/Main/RunningGag", "/pmwiki/pmwiki.php/Main/DeadlyGas", "/pmwiki/pmwiki.php/Main/RandomEncounter", "/pmwiki/pmwiki.php/Main/OnceAnEpisode", "/pmwiki/pmwiki.php/Main/ShockAndAwe", "/pmwiki/pmwiki.php/Main/TeenGenius", "/pmwiki/pmwiki.php/Main/BonusBoss", "/pmwiki/pmwiki.php/Main/BraggingRightsReward", "/pmwiki/pmwiki.php/Videogame/Earthbound", "/pmwiki/pmwiki.php/Main/StealthPun", "/pmwiki/pmwiki.php/Videogame/WorldOfWarcraft", "/pmwiki/pmwiki.php/Main/TheHero", "/pmwiki/pmwiki.php/Main/HereComesTheScience", "/pmwiki/pmwiki.php/Main/Infodump", "/pmwiki/pmwiki.php/Main/ContinuityNod", "/pmwiki/pmwiki.php/Main/MarvelUniverse", "/pmwiki/pmwiki.php/Main/DevelopersRoom", "/pmwiki/pmwiki.php/Main/MadScientist", "/pmwiki/pmwiki.php/Main/LethalJokeItem", "/pmwiki/pmwiki.php/Main/SimulationGame", "/pmwiki/pmwiki.php/Main/SportsGame", "/pmwiki/pmwiki.php/Main/StrategyGame", "/pmwiki/pmwiki.php/Main/AllThereInTheManual", "/pmwiki/pmwiki.php/Main/TechTree", "/pmwiki/pmwiki.php/Main/GuideDangIt", "/pmwiki/pmwiki.php/Main/SurvivalHorror", "/pmwiki/pmwiki.php/Main/VisualNovel"]}