{"title": "Stalking Mission", "content": "A gameplay segment in which the player is tasked with following an NPC to a designated area, either on foot or in a vehicle. However, there's a special provision: for one reason or another, your target can not be alerted to your presence, as this will cause them to panic and flee, resulting in mission failure. Some games provide a \"suspicion meter\" that reveals how close the target is from getting spooked, and which can be reduced if the player further distances themself.\n\nYou must avoid following them too closely as doing so will typically end the mission instantly. Sometimes, this makes no sense as your target would logically have no idea what the Player Character or their vehicle would look like and they are never the slightest bit suspicious of the NPC traffic all around them. But rest assured if you get close they will instantly know you're following them. On the other hand, feel free to be as obvious as you need to in your efforts to stay a safe distance away: stopping your car in the middle of the street while the target is waiting at a red light is apparently not suspicious at all as long as you're not too close.\n\nIn any case, you are required to follow them from a considerable distance, which may prove to be problematic in crowded areas or in intricate environments, especially if your target is unmarked and difficult to identify. On the other hand, no matter how easy it would be to find the target again, losing sight of them (or rather, getting too far from them) even for a short while will typically cause the mission to be declared a failure instantly. This also means that even if you already know the target's ultimate destination, you can't simply go there directly and wait for them. You must follow the target all the way.\n\nAlmost invariably a forced-stealth Unexpected Gameplay Change, the Stalking Mission is often viewed in a negative light for a variety of reasons. They may be lengthy and contain no Check Points, and if the target takes a difficult-to-follow route to their destination, it may be necessary to resort to trial-and-error. Finally, the target may walk painfully slow, jarring to players who are used to constantly running. This is even worse in driving variations, as the NPC will typically drive at a normal speed and obey traffic laws, something the player has hitherto been unbound by. Said traffic will sometimes flatten the target, resulting in mission failure.\n\nSee also Escort Mission, which may also involve tailing an NPC but for different reasons, Stealth Escort Mission when the target must remain unaware that he's in danger in the first place, and Assassination Sidequest if you need to follow your mark until they reached a designated location so you can kill them there. A subtrope of Stealth-Based Mission; the difference is which person, or rather how many people, whose detection you need to avoid.\n• This is one of the stalwart mission types of the Grand Theft Auto games, as nearly every game features at least one, usually complete with a \"Spook-O-Meter.\" It gets ridiculous in later games how close you must be in order to pursue the target. In several missions it's possible to lose even though the enemy vehicle is still in clear view, leading to situations where you'll fail a mission because the vehicle \"escaped\" despite the fact you can either still see it, or it's on a one way street or a bridge and therefore nearly impossible to lose track of.\n• Grand Theft Auto IV requires the player to stay 2 car lengths away at all times (including stop lights), which is rather strange when the target doesn't seem to care about any other of the motorists encroaching on the supposed spook-radius. One mission subverts this however, as a phone call from Niko's cousin Roman (to go bowling, no less) alerts the target early, after which the mission devolves into a simple footchase followed by a shoot-out.\n• Grand Theft Auto III did have a humorous way to subvert one case. The victim (stalkee?) is meant to be picked up by a taxi. You can easily grab a taxi yourself, and the victim will end up in your taxi. Then it's just a pleasant drive to the destination, followed by running him over once you get him there. It also has another one where you don't actually need to stalk the guy, just be close to the destination when he arrives, so you can take a shortcut and beat him there.\n• L.A. Noire features a couple of stalking missions, some by foot and some by car.\n• The Neo-Tokyo level in Time Splitters 2. To elaborate, Neo-Tokyo is one of those knife-edge ones where it's game over the moment you get spotted. Combine this with the fact you have to stay close enough to slip through a laser security gate before it closes — but not so soon that you're spotted — and you have one of the toughest missions in the series. Once you're past that point, however, it's a normal mission.\n• Metal Gear Solid 4: Guns of the Patriots also had a variation where you had to track someone by their footprints. The second stalking mission was actually pretty good, because it gave a good reason for the target to be spooked, as well as a justification for being able to single him out easily. Also, it had several check points and you could go where you wanted instead of babysitting him all the time. Getting spotted by him is also not an instant game over or mission ender. If he does spot you, he may draw a pistol and attack you or otherwise run away, but neither of these is a big deal because for the former, his pistol is very weak and he isn't all that accurate, and for both cases, you can get out of his sight pretty easily, and once he loses track of you for a few minutes, he'll return to his normal route, allowing you to stalk him again. You also have to protect him from getting spotted by the PMC guards around the city, however he's pretty good about avoiding most of them on his own, meaning there's only a few guards you actually have to tranquilize or kill, and there's usually a good spot on the map for you to take them out from without being spotted by the guards or the mark. And, lastly, you don't even really need to keep the guy alive - if he dies for whatever reason (most likely by your hand, just to troll Otacon), all you have to do is take out the scanner again and find another guy to tail. All-in-all, it is a fairly well-done example.\n• There's also a possible bug in the game that makes the section even easier. If you equip any FaceCamo other than the default or any of the Snakes, you can go through the entire level without having to worry about detection, as both the resistance member you have to follow as well as the PMC guards in the city will not pay much attention to you (even though they logically should) as long as you don't do anything suspicious to draw their attention, like equipping a weapon while in their field of vision. If you do alert them while wearing a FaceCamo, you'll no longer be able to use that camo to sneak past them, but you can always equip another one to do so, as long as you don't do it in front of them. Alternatively, when the resistance member is disguising himself as a PMC guard, you can follow him normally, and any other PMC guards you come across, including a pair that patrol with him and vehicle patrols, ignore you entirely.\n• And as a final alternative, if you know where you need to go, you can just go there and wait for a resistance member to catch up with you.\n• Splinter Cell has done this at least once, though on one occasion in Pandora Tomorrow your objective isn't so much avoiding being noticed by the person you're following as it is making sure nobody else she comes across notices you while she leads you to a specific point. And then once you're where you need to be, your CO radios you and orders you to kill her. It also had a subverted example where you're supposed to follow someone while staying out of sight of everyone she comes across, but shortly before any sort of stalking happens, one of the guards radios in that she's The Mole , and it instead turns into a defensive shootout as multiple armed guards come after her.\n• Syphon Filter also does this often. One of the most irritating was That One Level late on in the first game, where the objective was to follow a scientist through a series of catacombs to reach the cell containing your partner. The obvious route was to follow him all the way, picking off the guards as he passed them, and then getting to the door, where he would happily stand around and not bother to open it. This was because of an oversight that made the game sometimes get into a situation where the scientist had noticed you but didn't fail the mission; the usual solution was to take an alternative route around, letting him out of your sight unpenalized and meeting up with him later on on his route.\n• Smuggler's Run 2 did this a few times.\n• Some side missions in In FAMOUS make you follow a Reaper courier around without being spotted, to see what he's up to. All he does is go somewhere to hide some blast shards.\n• Given that Sasha drugs the Reapers up to the eyeballs in that funky goo, it is of no surprise that some Reapers will want to protect shiny things.\n• The Legend of Zelda:\n• Twice in The Legend of Zelda: Oracle of Seasons. The latter is especially frustrating since you have to avoid being spotted by TWO characters.\n• And one, optionally, in The Wind Waker (gets you an empty bottle).\n• You also get to hear Link meow like a kitty if you're not completely hidden when the target checks to see if she's being tailed, which is a reward in itself.\n• During \"The Stolen Heirloom\" quest from Breath of the Wild, Link must quietly follow several NPCs who are suspected of stealing the eponymous heirloom.\n• In one of the missions in Sly Cooper: Thieves in Time, the player has to follow undetected in The Grizz's footsteps and listen to the phonecalls he makes to his boss to gain vital information.\n• Assassin's Creed I has pickpocketing and interrogation missions, which require going unnoticed beforehand.\n• The sequel has missions which require you to tail somebody to a certain location (usually a meeting of your targets) without being detected. Expect the game to throw countless minstrels and men carrying crates in your way.\n• Same goes for the bonus assassinations in the 1st one, which apparently happen at the same time as every drunk and looney in town decide to hang out in the streets.\n• In Thief: The Dark Project, the targets can take more than one possible route. In Thief II: The Metal Age, it's very easy to fail as a result of forgetting just what your target is.\n• The Final Fantasy XI quest \"All By Myself\" is a maddening example, as you have to keep your target from dying without him noticing you do it while he fights every damn monster he so much has seen an inch of, aggressive to him or not, while capped at level 10. The usual approach is to cheat — have someone not on the quest, and thus not on his radar and not capped, run ahead of him and kill things.\n• The Driver series has a number of these. \"Squeeze up! Hang back! You lost your target!\"\n• Driver: San Francisco features these. First being when they identify ex-mercenary Leila Sharon who shot the police convoy with the RPG in the intro and the mission ends when an early game Broken Bridge perceptible only to Tanner prevents him from continuing. A second time when they arrest Krug after the ammonia tanker hi-jacking but let him off on \"tainted evidence\" and bug his car with a microphone, knowing he would call back Jericho after getting out of prison. Jericho isn't having any of it and someone else calls up on a debt Krug owes, which leads you defending Krug from the mafia's gang before he calls Jericho again (thankfully this temporarily gets rid of the suspicion, as Krug's too busy worrying about his own life). This leads to Jericho blowing up Krug and his car both out of You Have Failed Me and since they would release Krug to bug his car. The latter mission is interesting in that the dialogue between Krug and Jericho gets cut-off if you stray out of range. Falling out of range gives you ten seconds to catch up to your target like any other pursuit scenario in the game.\n• Pursuit Force\n• One particularly egregious example requires the player to follow the bad guy's car. Not too bad, right? Well, for one thing, he's almost as fast as you, and invincible, and the worst driver ever, smashing into all sorts of obstacles without so much as a slight decrease in speed, whereas you have to avoid his path of destruction because your car is not invincible, and can explode before you reach your destination. And then, once you reach your destination, you have exactly four seconds before he kills his target and you fail your mission, and what you have to do to prevent that is ambiguous at best.\n• A recurring event in Freshly-Picked Tingle's Rosy Rupeeland has you following a boy through one of the areas.\n• The second half of Fallen Angel mission in Call of Duty: Black Ops II. This is justified, since you are supposed to record the conversations rather than just following the target. It comes just after a more traditional Stealth-Based Mission, as well, where you have to avoid an automated drone patrolling the streets that will instantly tear you and your squadmate to shreds if it spots you.\n• The otherwise excellent Anachronox has a very annoying one.\n• Ecco the Dolphin: Defender of the Future. Tides of Time had a deadly version after the final boss battle, where you had to let the Vortex Queen remove a few doors for you, and then squeeze ahead for the last stretch and get to the time portal before she did.\n• The Elder Scrolls\n• In Morrowind's Bloodmoon expansion, one of the East Empire Company quests at Raven Rock has you follow a suspected Ebony thief into the mine. Once deep enough into the mine, you can confront him and he will confess.\n• Oblivion:\n• Subverted during one quest in which you must follow a specific NPC to a meeting and then listen in on said meeting. The AI is a little on the forgiving side in regards to the whole \"don't let them know you're following them\" thing. In fact, the fact that the mission briefing says not to make your presence known is really the only attention the game pays to the idea at all. In execution, you're completely free to wear your heaviest armor and illumination rings that glow bright enough to make you walking daylight incarnate, run in laps and circles around the target as he's walking toward his meeting, talk to him on the way (several times,) stand between him and the person he's talking to when the meeting starts, and more, all without penalty.\n• In the \"Paranoia\" miscellaneous quest, Glarthir, a paranoid Bosmer (Wood Elf), wants you to follow several NPCs around to see if they're doing anything, which one would assume they are. But they aren't. They barely know the guy, and if you do follow them around, you find them eating, sleeping, going to church, going to the bar — basically, the same thing you'd find if you followed any other NPC. And since they're not actually doing anything, they don't much mind being followed around. Of course, since Glarthir is a fairly obvious nutjob, the game also gives you the option to straight-up lie to him about having stalked anyone at all rather than waste your time following normal (unscripted) NPCs around.\n• An unmarked sidequest in Skyrim has you tracking Morthal's self-appointed wizard protector into the swamp in the middle of the night. The way it works out is similar to the Oblivion cases. You might even end up saving him from the swamp's native creatures and he won't comment on your presence until the quest-appropriate time.\n• In Wing Commander IV, in one of the early missions, you are supposed to follow a pirate fighter back to its base, while staying far enough away to not be noticed. There is static in the commanding officer's transmission at the exact point that he gives the distance measurement unit.\n• The Indiana Jones and the Fate of Atlantis Adventure Game had a number of these, but probably the funniest is in Egypt. You must follow a man through a crowded bazaar, zoomed out so far that everyone is represented by a single pixel. While it is technically possible to follow him by eye, the intended way to follow him is to get a fez and trick him into wearing it, which causes him to appear in the zoomed out shots as a bright red pixel.\n• In Summoner, Flece must reach Lord Yago without being seen by the palace guards. In the sequel, Sangaril must escape detection by the Daldyran guards, although she is allowed to kill them as long as she does it by slitting their throats from behind. In both cases, faliure results in returning to the start of the level rather than a non-standard game over.\n• One Mystery in Magician's Quest: Mysterious Times tasks you with playing a game with an ogre. You must hunt the ogre down, but cannot be seen in the process. He moves after you find him, meaning you have to be on your toes just to find him.\n• In Mabinogi, G13 has you tail Claudius all around the stage. Problem? You character is 'sneaking' and walks way slower then Claudius himself.\n• An optional Black & White mission requires you (as a God) to sneakily follow someone down a mountain. The man repeatedly looks in awkward angles and losing him for a single second makes him disappear (despite the fact he's walking down a small mountain path with nowhere else to go).\n• Black & White 2 has a similar quest wherein a guy accuses you of impregnating his daughter. (Your evil conscience's reaction is hilarious.) You can either pay him off with wood, or track her to her actual lover's house. Thankfully it's much easier than in the previous game, to the point where you can keep one eye on the girl and do your job with the other eye.\n• [PROTOTYPE] inverts this. In one mission, you have to get a Leader Hunter to stalk you. Too far and it will lose interest, too close and it will beat you to death. You also have to attack it occasionally to keep its attention. Several missions do play it somewhat straight, though. An earlier mission has you chase a Leader Hunter who just kidnapped your sister. It's a stalking mission because you have to keep up, but it doesn't actually matter if it can see you. You're better off if it doesn't, though, because it's invincible and will kill you for getting too close. The second to last mission has you stalk Col. Taggart's thermobaric tank. Again, him spotting you is bad not because you fail the mission, but because he's riding a thermobaric tank.\n• Not so much 'stalk' as 'chase'. Taggart is panicking, and trying to break out of the city quarantine to save his own hide. If he escapes, it can only end badly for everybody in the city.\n• In Mass Effect 2, Thane's loyalty mission has you stalking his 's target as he walks through the Citadel markets. Helpfully, you're on a catwalk above him rather than on the ground.\n• No matter how obvious you try to be (surely they could have at least gotten you to put on maintenance worker disguises) however, you cannot spook the target, and nobody on the market floor will actively notice you... even if you're running around in evil-looking armour that is illegal in Citadel space.\n• A maintenance worker disguise wouldn't help much since the Citadel is maintained by the Keepers, which aren't at all humanoid.\n• True Crime: Streets of L.A. and True Crime: New York City have stalking missions with its suspicion meter which triggers if you tail too close to their car.\n• Mission 16 in Tenchu Z, \"Pursuit Of Echigoya\" is one of these. On the good side, it's the only one in the game (there's 50 missions). On the bad side, it's by far the hardest to get a Ninja 5 ranking on, as you have to stealth kill every guard in the level, all the while keeping close to Echigoya, which sucks because it's the only level in the game with strict Ninja 5 conditions (in any other level you really have to try to get anything lower). And dear god does he take his time.\n• Soul Reaver contains another example of the \"you are the stalkee\" inversion. In order to defeat Dumah, Raziel must lure him all the way from his lair to a room containing a mechanism that can be used to set him on fire. Get too big of a lead, and Dumah will lose interest and head back to his lair; allow him to get too close, and he'll smack the crap out of you. Also, Dumah is about five times Raziel's size.\n• The Saboteur has one of these.\n• X3: Terran Conflict has particularly annoying examples of these. You are told to follow a randomly spawned NPC ship and find out its destination. This destination is prominently displayed in the ship's info window, but of course you can't just report that to your employers and call it a day. You also can't just jump there with your jumpdrive and wait for it, you have to follow the ship. You can't set one of your other ships to follow it for you or keep track of it on your network of spy satellites, you must do it personally. And of course the ships tend to be painfully slow. At least the game has a hotkey to match speeds with a target...\n• Mafia II has a couple, of course. The driving ones are fairly forgiving, especially thanks to the speed limiter toggle.\n• The Biko H-Game was made of these missions, stalking young women through the streets of Japan. Because it's possible to take the stalking to it's creepiest possible conclusion, people tend to overlook that you have the option to simply confess your love instead.\n• Dragon Quest VI has a short one of these in Pescani/Pescado.\n• Test Drive Unlimited 2 has some missions where you are supposed to tail certain cars without being too far or too close.\n• In Kingdom Hearts: 358/2 Days, Roxas and Axel have to stalk Pete during one of their visits to Agrabah. Obnoxiously, not only do you have to stay out of Pete's sight (easy enough), but you also have to keep Pete in Roxas's sight — Roxas's, not yours. If your player model is positioned wrong, you can \"lose sight of him\" despite him being plainly on screen.\n• Openly mocked in Retro City Rampage where the player has to regularly drink coffee in order to stay awake.\n• Happens in Far Cry 3. In the main story mission \"Bad Side of Town\", after being prompted in a hallucination, Jason must follow the stranger through the streets of Bad Town. He will stop periodically and glance behind him. If you lose sight of him (even if he hasn't moved!) for more than a few seconds, a twenty-second timer counts down to mission failure. Of course, he's a CIA agent who already knew you were tailing him from the start.\n• Marble Hornets Entry 66 plays out exactly like one of these, with Jay and Tim following through the Abandoned Hospital.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/StalkingMission", "media_links": ["/pmwiki/pmwiki.php/VideoGame/GrandTheftAuto", "/pmwiki/pmwiki.php/VideoGame/GrandTheftAutoIV", "/pmwiki/pmwiki.php/VideoGame/GrandTheftAutoIII", "/pmwiki/pmwiki.php/VideoGame/LANoire", "/pmwiki/pmwiki.php/VideoGame/TimeSplitters2", "/pmwiki/pmwiki.php/VideoGame/MetalGearSolid4GunsOfThePatriots", "/pmwiki/pmwiki.php/VideoGame/SplinterCell", "/pmwiki/pmwiki.php/VideoGame/SyphonFilter", "/pmwiki/pmwiki.php/VideoGame/InFAMOUS", "/pmwiki/pmwiki.php/Franchise/TheLegendOfZelda", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaOracleGames", "/pmwiki/pmwiki.php/VideoGame/SlyCooperThievesInTime", "/pmwiki/pmwiki.php/VideoGame/AssassinsCreedI", "/pmwiki/pmwiki.php/VideoGame/AssassinsCreedII", "/pmwiki/pmwiki.php/VideoGame/ThiefTheDarkProject", "/pmwiki/pmwiki.php/VideoGame/ThiefIITheMetalAge", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyXI", "/pmwiki/pmwiki.php/VideoGame/Driver", "/pmwiki/pmwiki.php/VideoGame/DriverSanFrancisco", "/pmwiki/pmwiki.php/VideoGame/PursuitForce", "/pmwiki/pmwiki.php/VideoGame/FreshlyPickedTinglesRosyRupeeland", "/pmwiki/pmwiki.php/VideoGame/CallOfDutyBlackOpsII", "/pmwiki/pmwiki.php/VideoGame/Anachronox", "/pmwiki/pmwiki.php/VideoGame/EccoTheDolphin", "/pmwiki/pmwiki.php/VideoGame/Spyro2RiptosRage", "/pmwiki/pmwiki.php/Franchise/TheElderScrolls", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsIIIMorrowind", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsIVOblivion", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsVSkyrim", "/pmwiki/pmwiki.php/VideoGame/WingCommander", "/pmwiki/pmwiki.php/VideoGame/IndianaJonesAndTheFateOfAtlantis", "/pmwiki/pmwiki.php/VideoGame/Summoner", "/pmwiki/pmwiki.php/VideoGame/MagiciansQuestMysteriousTimes", "/pmwiki/pmwiki.php/VideoGame/Mabinogi", "/pmwiki/pmwiki.php/VideoGame/BlackAndWhite", "/pmwiki/pmwiki.php/VideoGame/Prototype", "/pmwiki/pmwiki.php/VideoGame/MassEffect2", "/pmwiki/pmwiki.php/VideoGame/TrueCrimeStreetsOfLA", "/pmwiki/pmwiki.php/VideoGame/TrueCrimeNewYorkCity", "/pmwiki/pmwiki.php/VideoGame/Tenchu", "/pmwiki/pmwiki.php/VideoGame/LegacyOfKain", "/pmwiki/pmwiki.php/VideoGame/TheSaboteur", "/pmwiki/pmwiki.php/VideoGame/X", "/pmwiki/pmwiki.php/VideoGame/MafiaII", "/pmwiki/pmwiki.php/VideoGame/DragonQuestVI", "/pmwiki/pmwiki.php/VideoGame/TestDrive", "/pmwiki/pmwiki.php/VideoGame/KingdomHearts358DaysOver2", "/pmwiki/pmwiki.php/VideoGame/RetroCityRampage", "/pmwiki/pmwiki.php/VideoGame/FarCry3"], "non_media_links": ["/pmwiki/pmwiki.php/Main/NPC", "/pmwiki/pmwiki.php/Main/GameOver", "/pmwiki/pmwiki.php/Main/PlayerCharacter", "/pmwiki/pmwiki.php/Main/ConspicuouslySelectivePerception", "/pmwiki/pmwiki.php/Main/YouShouldntKnowThisAlready", "/pmwiki/pmwiki.php/Main/UnexpectedGameplayChange", "/pmwiki/pmwiki.php/Main/ScrappyLevel", "/pmwiki/pmwiki.php/Main/CheckPoint", "/pmwiki/pmwiki.php/Main/TrialAndErrorGameplay", "/pmwiki/pmwiki.php/Main/RunDontWalk", "/pmwiki/pmwiki.php/Main/NPC", "/pmwiki/pmwiki.php/Main/OptionalTrafficLaws", "/pmwiki/pmwiki.php/Main/EscortMission", "/pmwiki/pmwiki.php/Main/StealthEscortMission", "/pmwiki/pmwiki.php/Main/AssassinationSidequest", "/pmwiki/pmwiki.php/Main/StealthBasedMission", "/pmwiki/pmwiki.php/Main/HardLight", "/pmwiki/pmwiki.php/Main/ThatOneLevel", "/pmwiki/pmwiki.php/Main/GoodBadBugs", "/pmwiki/pmwiki.php/Main/TheMole", "/pmwiki/pmwiki.php/Main/ThatOneLevel", "/pmwiki/pmwiki.php/Videogame/TheLegendOfZeldaTheWindWaker", "/pmwiki/pmwiki.php/Main/CatScare", "/pmwiki/pmwiki.php/Main/NobodyHereButUsBirds", "/pmwiki/pmwiki.php/Videogame/TheLegendOfZeldaBreathOfTheWild", "/pmwiki/pmwiki.php/Main/GoddamnBats", "/pmwiki/pmwiki.php/Main/DefiedTrope", "/pmwiki/pmwiki.php/Main/BrokenBridge", "/pmwiki/pmwiki.php/Main/YouHaveFailedMe", "/pmwiki/pmwiki.php/Main/StealthBasedMission", "/pmwiki/pmwiki.php/Main/FantasyMetals", "/pmwiki/pmwiki.php/Main/TheGuardsMustBeCrazy", "/pmwiki/pmwiki.php/Main/SubvertedTrope", "/pmwiki/pmwiki.php/Main/AdventureGame", "/pmwiki/pmwiki.php/Main/SideQuest", "/pmwiki/pmwiki.php/Main/BossInMookClothing", "/pmwiki/pmwiki.php/Main/BFG", "/pmwiki/pmwiki.php/Main/HGame", "/pmwiki/pmwiki.php/Main/IHaveYouNowMyPretty", "/pmwiki/pmwiki.php/Main/StalkerWithACrush", "/pmwiki/pmwiki.php/WebVideo/MarbleHornets", "/pmwiki/pmwiki.php/Main/AbandonedHospital"]}