{"title": "Drunken Montage", "content": "Montage showing character out on a bender. Character often stumbles through a backdrop of flashing neon signs, swirling lights, floating alcoholic beverages, and so on. Expect to hear Blues music on the soundtrack.\n\nA Discredited Trope - a more popular variation nowadays is the Binge Montage. See also Drowning My Sorrows. Compare and contrast Disney Acid Sequence and Mushroom Samba.\n• Tenma has one of these early on in Monster. He appears to have slept it off in a trash heap after unsuccessfully trying to stumble his way home.\n• In one episode of Sgt. Frog, Keroro gets drunk on humidity due to his Bizarre Alien Biology, and he is shown wobbling in front of a shot of neon lights and signs (and holding a take-out box, a uniquely Japanese symbol of a drunken Salaryman stumbling home).\n• Tylor from Irresponsible Captain Tylor has a few of these.\n• In the Fatal Fury tie-in OVA, Fatal Fury 2: The New Battle, Terry Bogard finds himself drinking heavily, after suffering a humiliating defeat at the hands of Wolfgang Krauser. His fall into drunken depression comes complete with him staggering through the streets, with images of neon bar signs passing over his head.\n• One of the most famous early examples of this trope (and the stylistic basis for many a parody) is the film The Lost Weekend.\n• Even earlier was Greogory's montage in Metropolis.\n• Mel Brooks's Silent Movie does feature a montage of Mel Funn stumbling through town on a bender. Oddly enough, it doesn't feature the floating neon signs. Those are reserved for the later scene where Mel's friends look in every bar in town to find him.\n• Classic example in Fear and Loathing in Las Vegas as they cruise down the strip drunk, high, and totally blasted on acid and mescaline.\n• The 1942 black-and-white film Moontide featured an amazingly surreal montage. What's amazing is that this is the Lighter and Softer version of the montage. Salvador Dali had been brought in to create images for the bender, and his Booze Clock was the only bit to make the final cut—everything else was deemed too disturbing.\n• This trope appears to have been fully developed by the time it appeared in (1946).\n• This appears in Wristcutters: A Love Story in which the main character proceed to get drunk at bars in Purgatory.\n• The 2000 film 28 Days starring Sandra Bullock has one of these shortly before her character is forced into rehab.\n• This happens a few times in The Twilight Zone; the first time is purely this trope, the others? Well they're more a case of reusing sets.\n• Several of the films by James Franco and Seth Rogen, including The Interview and This Is the End, include sequences like this. The trope is often somewhat deconstructed by showing comical glimpses of realism, such as one of the characters vomiting after drinking too much, sparingly in the montages.\n• In Corner of a Round Planet this is achieved over the course of several chapters to illustrate just how big a mess the main character has gotten himself into.\n• Played surprisingly straight on Frasier, when he was racked with guilt. For a change.\n• Played straight in the series finale of Battlestar Galactica, in a flashback sequence set on pre-war Caprica where then-Captain Adama, Colonel Tigh, and Mrs. Tigh have a wild night out in a strip club to celebrate Adama's upcoming \"retirement\" from the military to take a civilian job. Adama has one too many, ends up puking in a back alley, then gazing up at the stars. (Obviously, Adama changes his mind.)\n• Played for laughs in Community episode Communication Studies when Abed gets Jeff prepared to leave a drunk message.\n• The third season opener of Jeeves and Wooster, features one played for laughs involving a character Wooster is supposed to be keeping out of trouble. For bonus points, it's set in Prohibition-era New York.\n• In the Sam & Max: Freelance Police episode They Stole Max's Brain! this is parodied as Sam drives past a variety of neon signs at nighttime. The final sign just says \"Neon Sign\"\n• Homestar Runner: The Strong Bad Email \"rock opera\" features one scene of Strong Bad strolling along a black background while neon signs float by.\n• Inverted on Futurama; in the episode \"I, Roommate\", Bender spends the night out not drinking (as robots need alcohol to function) and is assaulted on all sides by increasingly tame and mundane neon images of stuff like \"Boring Geology Lecture\" and \"Bible Study 2 Nite.\"\n• The Simpsons loves this trope.\n• In \"El Viaje Misterioso de Nuestro Jomer\", Homer passes by several mundane signs while searching for his soulmate.\n• In \"The Last Temptation of Krust\" Krusty goes on \"the bender to end all benders\" after his stand-up act bombs.\n• In \"HOMR\", Homer becomes a social outcast when he becomes intelligent and sees neon signs for \"Dum-Dum Club\", \"Lunkheadz\" and \"Disney Store\".\n• In \"She of Little Faith\", Lisa renounces her Christianity and walks past signs advertising alternate faiths, including a blinking neon sign labeled \"Amish.\"\n• In \"The Regina Monologues\", Bart and Lisa get addicted to British candy and have a binging montage à la Trainspotting.\n• In \"I Won't Be Home for Christmas\", Marge and the kids walk past various signs while out looking for Homer. It turns they're in a Neon Sign Store\n• Formed the basis of a musical number in the animated feature Gay Purr-ee.\n• The song \"It's Tough to Be a God\" in The Road to El Dorado turns into this.\n• A G-rated variation occurs late in Hanna-Barbera's animated adaptation of Charlotte's Web. The obnoxious rat Templeton is thrilled to hear that Farmer Zuckerman and all his animals are going to the county fair, because a fair is \"a rat's paradise.\" After the midway shuts down one night, the sleazy rodent scampers from one concession stand to another, gleefully singing \"A Veritable Smorgasbord\" and gorging himself on all the carnival food. The sequence takes on a surreal quality as all the colored lights disorient Templeton and phantasmic images of his favorite foods float on the air before him - and by the end of the night, Templeton is so fat that he can barely walk, staggering around while hiccoughing and still caterwauling stupidly.\n• Subverted on God, the Devil and Bob: The Devil tells Bob he's going to show him a world full of things he never imagined. Next we see Bob walking wide-eyed through the standard sequence of neon signs for bars, strip clubs and other places of ill repute, but then we see him and the Devil exiting a building marked \"Museum of Neon,\" with Bob saying, \"Wow, I never knew neon signs were so interesting.\"", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/DrunkenMontage", "media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/Anime/Monster", "https://tvtropes.org/pmwiki/pmwiki.php/Manga/SgtFrog", "https://tvtropes.org/pmwiki/pmwiki.php/Anime/IrresponsibleCaptainTylor", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/FatalFury", "https://tvtropes.org/pmwiki/pmwiki.php/Film/TheLostWeekend", "https://tvtropes.org/pmwiki/pmwiki.php/Film/Metropolis", "https://tvtropes.org/pmwiki/pmwiki.php/Creator/MelBrooks", "https://tvtropes.org/pmwiki/pmwiki.php/Film/SilentMovie", "https://tvtropes.org/pmwiki/pmwiki.php/Literature/FearAndLoathingInLasVegas", "https://tvtropes.org/pmwiki/pmwiki.php/Film/WristcuttersALoveStory", "https://tvtropes.org/pmwiki/pmwiki.php/Film/TwentyEightDays", "https://tvtropes.org/pmwiki/pmwiki.php/Series/TheTwilightZone1959", "https://tvtropes.org/pmwiki/pmwiki.php/Creator/JamesFranco", "https://tvtropes.org/pmwiki/pmwiki.php/Creator/SethRogen", "https://tvtropes.org/pmwiki/pmwiki.php/Film/TheInterview", "https://tvtropes.org/pmwiki/pmwiki.php/Film/ThisIsTheEnd", "https://tvtropes.org/pmwiki/pmwiki.php/Series/Frasier", "https://tvtropes.org/pmwiki/pmwiki.php/Series/BattlestarGalactica2003", "https://tvtropes.org/pmwiki/pmwiki.php/Series/Community", "https://tvtropes.org/pmwiki/pmwiki.php/Series/JeevesAndWooster", "https://tvtropes.org/pmwiki/pmwiki.php/VideoGame/SamAndMaxFreelancePolice", "https://tvtropes.org/pmwiki/pmwiki.php/WesternAnimation/Futurama", "https://tvtropes.org/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "https://tvtropes.org/pmwiki/pmwiki.php/Film/Trainspotting", "https://tvtropes.org/pmwiki/pmwiki.php/WesternAnimation/GayPurree", "https://tvtropes.org/pmwiki/pmwiki.php/WesternAnimation/TheRoadToElDorado", "https://tvtropes.org/pmwiki/pmwiki.php/Creator/HannaBarbera", "https://tvtropes.org/pmwiki/pmwiki.php/Literature/CharlottesWeb", "https://tvtropes.org/pmwiki/pmwiki.php/WesternAnimation/GodTheDevilAndBob"], "non_media_links": ["https://tvtropes.org/pmwiki/pmwiki.php/Main/Blues", "https://tvtropes.org/pmwiki/pmwiki.php/Main/DiscreditedTrope", "https://tvtropes.org/pmwiki/pmwiki.php/Main/BingeMontage", "https://tvtropes.org/pmwiki/pmwiki.php/Main/DrowningMySorrows", "https://tvtropes.org/pmwiki/pmwiki.php/Main/DisneyAcidSequence", "https://tvtropes.org/pmwiki/pmwiki.php/Main/MushroomSamba", "https://tvtropes.org/pmwiki/pmwiki.php/Main/Anime", "https://tvtropes.org/pmwiki/pmwiki.php/Main/Manga", "https://tvtropes.org/pmwiki/pmwiki.php/Main/BizarreAlienBiology", "https://tvtropes.org/pmwiki/pmwiki.php/Main/Salaryman", "https://tvtropes.org/pmwiki/pmwiki.php/Main/Film", "https://tvtropes.org/pmwiki/pmwiki.php/Main/LighterAndSofter", "http://www.lileks.com/bw/noir/blackangel/index.html", "https://tvtropes.org/pmwiki/pmwiki.php/Main/RecycledSet", "https://tvtropes.org/pmwiki/pmwiki.php/Main/LiveActionTV", "https://tvtropes.org/pmwiki/pmwiki.php/Recap/CommunityS1E16CommunicationStudies", "https://tvtropes.org/pmwiki/pmwiki.php/Main/Music", "https://tvtropes.org/pmwiki/pmwiki.php/Main/TropeName", "https://tvtropes.org/pmwiki/pmwiki.php/Main/WebAnimation", "https://tvtropes.org/pmwiki/pmwiki.php/WebAnimation/HomestarRunner", "https://tvtropes.org/pmwiki/pmwiki.php/WebAnimation/StrongBadEmail", "https://tvtropes.org/pmwiki/pmwiki.php/Recap/StrongBadEmailE125RockOpera", "https://tvtropes.org/pmwiki/pmwiki.php/Main/WesternAnimation", "https://static.tvtropes.org/pmwiki/pub/images/Cap000.jpg", "https://tvtropes.org/pmwiki/pmwiki.php/Main/TakeThat", "https://tvtropes.org/pmwiki/pmwiki.php/Main/Jerkass"]}