{"title": "Dead End Job", "content": "In most ongoing series, there are several job positions that need to be filled. Often, these roles will be filled by the characters of a Five-Man Band. But in some series, there is one specific job that tends to have a high turn-over rate. This allows the author to keep bringing in new characters who have skills useful to that particular story or who can betray the operation from the inside.\n\nWhen played straight, these positions become an obvious Chekhov's Gun; whoever the \"new guy\" is, everyone knows that they will become significant later on. However, this character can still turn out to be no more or less relevant than anyone else.\n\nThe nature of this job lets the writers kill this character off, if they want to, usually in some emotionally significant way. Retirony may come into play. Characters in Dead End Jobs do tend to hang around long enough for viewers to get attached, Chekhov's Gunman or not.\n\nWhen done poorly, the audience may start wondering why the HR department doesn't get rid of the job altogether and delegate that work to established and trustworthy characters.\n\nPlease note that this trope does not apply to Red Shirt characters of the type you tend to find on Star Trek. Characters who hold jobs of this type tend to last for a full plot arc, be significant to that plot arc, and then get conveniently shuffled off-screen at the end to make room for the next plot-significant character.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/DeadEndJob", "media_links": ["/pmwiki/pmwiki.php/Franchise/StarTrek", "/pmwiki/pmwiki.php/Film/ThisIsSpinalTap", "/pmwiki/pmwiki.php/Literature/HarryPotter", "/pmwiki/pmwiki.php/Literature/BastardOperatorFromHell", "/pmwiki/pmwiki.php/Creator/IsaacAsimov", "/pmwiki/pmwiki.php/Series/NightCourt", "/pmwiki/pmwiki.php/Series/TwentyFour", "/pmwiki/pmwiki.php/Webcomic/SchlockMercenary", "/pmwiki/pmwiki.php/WesternAnimation/SouthPark"], "non_media_links": ["/pmwiki/pmwiki.php/Main/FiveManBand", "/pmwiki/pmwiki.php/Main/TheMole", "/pmwiki/pmwiki.php/Main/ChekhovsGun", "/pmwiki/pmwiki.php/Main/RedHerring", "/pmwiki/pmwiki.php/Main/KilledOffForReal", "/pmwiki/pmwiki.php/Main/RuleOfEmpathy", "/pmwiki/pmwiki.php/Main/Retirony", "/pmwiki/pmwiki.php/Main/ChekhovsGunman", "/pmwiki/pmwiki.php/Main/RedShirt", "/pmwiki/pmwiki.php/Main/HighTurnoverRate", "/pmwiki/pmwiki.php/Main/Lampshading", "/pmwiki/pmwiki.php/Discworld/GoingPostal", "/pmwiki/pmwiki.php/Main/TheCharacterDiedWithHim", "/pmwiki/pmwiki.php/Main/MauveShirt", "/pmwiki/pmwiki.php/Main/DeathIsCheap", "/pmwiki/pmwiki.php/Main/MadBomber"]}