{"title": "Weak Boss Strong Underlings", "content": "The exact opposite of Authority Equals Asskicking; this is when somebody who isn't physically intimidating, or who's even outright weak, has at their disposal plenty of people who are. Call them what you will: goons, thugs, hired muscle, bodyguards, the long and short of this is they're suddenly a lot more intimidating because even if they can't hurt you themselves, they can give somebody much stronger the order to do so.\n\nSupertrope to Mister Big; can overlap with Evil Cripple and/or Dark Lord on Life Support, but the boss doesn't have to be disabled or even all that weak, just physically less intimidating than who they have at their command. Contrast Bodyguarding a Badass. Not to be confused with Hard Levels, Easy Bosses, though the two can occasionally overlap.\n• Area88 has Giuseppe Farina, an extremely elderly, wheelchair-bound, blind or nearly blind mafia don who nonetheless has an enormous amount of influence and connections.\n• One Piece has Spandam, leader of the secret government agency Cipher Pol 9. While his subordinates are all trained assassins and spies with superpowers, he himself is weaker than even a common low-rank Marine troop; he does have the \"elephant sword\" Funkfreed, but what should be a potentially powerful weapon is little more than trash in his hands, which Franky demonstrates.\n• While the Batman and more frequently Robin Series villain the General did eventually bulk up he started out as an eleven year old bossing around gangsters and other criminals, and for a short time the army of a small foreign country, who were willing to listen to him because his brutal plans and strategies tended to work.\n• In Zootopia, Dawn Belwether is a tiny, non-threatening sheep who happens to be Big Bad of the story and establishes an anti-predator conspiracy - she also employs a number of large rams as her goons.\n• There's also Mr. Big, a tiny Arctic shrew who happens to be a mob boss who employs a gang of polar bears.\n• Guy Ritchie was particularly fond of this trope:\n• In Lock, Stock & Two Smoking Barrels, Harry has Big Chris and Barry the Baptist at his disposal (but Harry's not above getting physical himself, even if the only weapon available is a 15-inch black rubber sex toy)\n• Snatch. features this quite a lot; Bricktop has his thugs (most prominently John and Errol), Turkish and Tommy used Gorgeous George for that purpose, Doug The Head hires Bullet-Tooth Tony both for this and for his abilities to find someone, and Avi has Rosebud.\n• The Emperor in Return of the Jedi is this, his ability to shoot lightning from his fingertips notwithstanding.\n• The Netflix exclusive Bright has Poison, an Evil Cripple bound to a wheelchair but surrounded by a couple of trigger-happy cholos.\n• Lex Luthor in Batman v Superman: Dawn of Justice is a young, skinny Evil Genius who uses Anatoli Knyazev and his mercenary team as muscle.\n• In the Discworld novel Guards! Guards!, Sam Vimes is first seen as a hopeless alcoholic shunted sideways into commanding the Night Watch, a laughable Ragtag Bunch of Misfits in the City Guard. Vimes ends up taking several levels in badass, but not before he recruits the terrifying troll Detritus and the very keen Constable Carrot, a man who can knock out a troll in a fist fight. When Vimes is menaced by two of the much more reputable Palace Guards, he considers and says \"You're right. This is not a scary uniform.\" [Constable Carrot steps forward] \n\nVimes: This, on the other hand, is a scary uniform.\n• Red Dragon Inn has Torglesnarf Duncleton (First of His Name), the self-proclaimed goblin king of small stature surrounded by minions who definitely aren't tiny.\n• Borderlands 2's \"Tiny Tina's Assault on Dragon Keep\" DLC features a sidequest that is acknowledged in universe as a shout out to the Borderlands equivalent of Game of Thrones, featuring an expy in the form of \"Prince Jeffery.\" Jeffery taunts you from his iron throne made of guns while his two bodyguards fight you. After you finish them off, Tina (the DM) admits that she can't allow you to kill a minor, but your character can go up and smack Jeffery around and reduce him to a quivering mess with a melee hit. You can do it as many times as you desire, but Tina eventually states that she can't think of any more dialogue for the character to say.\n• The Necromancer in West of Loathing. For a large portion of the game, you hear about him and see his handiwork in the many skeletons you fight. After finding a bunch of clues, you locate the tower. You fight your way to the top of the tower through hordes of skeletons. Then, you finally reach the Necromancer. It turns out that all that dark magic did a number on him, and the Necromancer turned to dust if you just breathed on him hard enough.\n• Trope image provider Mr. Burns in The Simpsons may struggle to crush a paper cup, but is still widely feared because he has a private army of security guards, hired goons, and lawyers in his personal retinue.\n• Miraculous Ladybug: Though Hawkmoth does have the baseline powers of a Miraculous Bearer (super-strength, boosted reflexes, and a magic Sword Cane and indestructible suit), just about any one of his akumatized minions would be more than a match for him in a fight. The one time he actually gets into a fight, he is exhausted after just a few minutes.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/WeakBossStrongUnderlings", "media_links": ["/pmwiki/pmwiki.php/Manga/Area88", "/pmwiki/pmwiki.php/Anime/OnePiece", "/pmwiki/pmwiki.php/ComicBook/Batman", "/pmwiki/pmwiki.php/ComicBook/RobinSeries", "/pmwiki/pmwiki.php/Disney/Zootopia", "/pmwiki/pmwiki.php/Film/LockStockAndTwoSmokingBarrels", "/pmwiki/pmwiki.php/Film/Snatch", "/pmwiki/pmwiki.php/Film/ReturnOfTheJedi", "/pmwiki/pmwiki.php/Film/Bright", "/pmwiki/pmwiki.php/Film/BatmanVSupermanDawnOfJustice", "/pmwiki/pmwiki.php/Literature/Discworld", "/pmwiki/pmwiki.php/TabletopGame/RedDragonInn", "/pmwiki/pmwiki.php/VideoGame/Borderlands2", "/pmwiki/pmwiki.php/Series/GameOfThrones", "/pmwiki/pmwiki.php/VideoGame/WestOfLoathing", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/WesternAnimation/MiraculousLadybug"], "non_media_links": ["/pmwiki/pmwiki.php/Main/AuthorityEqualsAsskicking", "/pmwiki/pmwiki.php/Main/MisterBig", "/pmwiki/pmwiki.php/Main/EvilCripple", "/pmwiki/pmwiki.php/Main/DarkLordOnLifeSupport", "/pmwiki/pmwiki.php/Main/BodyguardingABadass", "/pmwiki/pmwiki.php/JustForFun/IThoughtItMeant", "/pmwiki/pmwiki.php/Main/HardLevelsEasyBosses", "/pmwiki/pmwiki.php/Main/ComicBooks", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/IronicName", "/pmwiki/pmwiki.php/Main/EvilCripple", "/pmwiki/pmwiki.php/Main/EthnicScrappy", "/pmwiki/pmwiki.php/Comicbook/LexLuthor", "/pmwiki/pmwiki.php/Main/GeekPhysiques", "/pmwiki/pmwiki.php/Main/EvilGenius", "/pmwiki/pmwiki.php/Main/HuskyRusskie", "/pmwiki/pmwiki.php/Discworld/GuardsGuards", "/pmwiki/pmwiki.php/Main/RagtagBunchOfMisfits", "/pmwiki/pmwiki.php/Main/TookALevelInBadass", "/pmwiki/pmwiki.php/Main/Expy", "/pmwiki/pmwiki.php/Main/DualBoss", "/pmwiki/pmwiki.php/Main/ImprobableInfantSurvival", "/pmwiki/pmwiki.php/Main/ArmyofLawyers", "/pmwiki/pmwiki.php/Main/SwordCane"]}