{"title": "Signpost Tutorial", "content": "Where a video game offers in-game instructions on how to play through some feature of the game world. The instructions may be advertised on some part of the background, or the player can stop to read them in a manner similar to Story Breadcrumbs.\n\nThis serves to make tutorial levels self-guided and less obtrusive than having NPCs interrupt the gameplay and try to explain the controls while maintaining character.\n• The Legend of Zelda:\n• The Legend of Zelda: Ocarina of Time contains a number of literal signposts in a maze near the cave that leads to the Kokiri Sword. These cover basic jumping and attack maneuvers. You can ignore them if you want to (and most people do, as unlike some tutorials the game doesn't pull the \"you are not allowed to do any maneuver that you didn't learn in-game\" trick) and still be able to do everything.\n• The Legend of Zelda: Majora's Mask teaches you how to control your Goron and Zora transformations using text on the gravestones of the characters whose visages you are copying.\n• Ittle Dew has the Tutorial Cave, full of signs that explain basic mechanics.\n• Eternal Darkness has recurring paintings, frescoes, and other artworks in nearly every chapter which depict the four Ancients' runes in a circular pattern, clueing you in on how the Elemental Rock\u0096Paper\u0096Scissors works.\n• The Glider PRO \"Demo House\" does this with instructions printed over the background graphic.\n• Braid uses free-standing signs that depict a button and the action that your character will perform.\n• Crash Bandicoot 2: N-Tranced: In the first \"tutorial\" stage, you'll find \"hint squares\" that will teach you how you do things.\n• In Horatio The Third Senior Manjensen With Knuckles, the first level features signposts that tell you how to play.\n• Iji: The tutorial is given by reading floating logbooks.\n• The Jumper games give instructions to the player in form of unobstructing text. Jumper Two, however, puts them away in blocks that Ogmo has to bump from below to read.\n• Kirby:\n• Kirby's Epic Yarn has the tutorial level laden with signposts that demonstrate what certain buttons do in specific scenarios like when he transforms into a tank or a saucer.\n• Kirby's Return to Dream Land has large signposts in the background of the first few levels that demonstrate controls and actions with pictures. If the player follows directions, the sign shows a checkmark and the game plays a chime. They were also featured in Triple Deluxe and Planet Robobot.\n• Level Up: The tutorial is given through touching speech bubbles with question marks inside them, that lay on the ground.\n• The Lost Vikings uses squares with question marks that show an instructional text box when pressed. The very first such block activates automatically to explain how to read the other blocks.\n• In Marvin's Marvellous Adventure for the Amiga, the ground is strewn with Speech Bubbles saying \"HELP.\" Hints from the Professor pop up when you walk over these.\n• Purple's stage 1-1 features billboards that visually show how to move around.\n• Putty has the Gym, a simple beginning level with signs showing where the Stretch, Bounce, Jab, Absorb and Inflate moves can best be used.\n• Super Mario 64 contains a number of signposts scattered throughout the Castle, and a few more in the levels themselves. They cover all of the basic moves and gameplay elements, but you can skip them if you want.\n• The signposts return in Super Mario Galaxy under the name of Bill Board, and they also cover the basics of gameplay.\n• The fangame Super Mario 63 conveys the majority of controls and hints to you from signs in the tutorial levels.\n• Super Mario World occasionally has message blocks that Mario can bump into that give playing hints, captioned \"-Point of Advice-\" (or \"Tourist Tips\" in the Advance remake).\n• Tiny Toon Adventures Buster Busts Loose has wall signs in the first level pointing out where to \"DASH!!\" and \"JUMP!!\"\n• Toe Jam And Earl: Panic on Funkotron, for playing tips, recommends examining the funky fountains along your path.\n• Wario Land: Shake It! uses signs in the background of the tutorial level to show the controls.\n• Wario Land 4 has the Hall of Hieroglyphs, which teaches players in much the same way, only through the eponymous hieroglyphs.\n• In Super Mario World 2: Yoshi's Island, message blocks similar to Super Mario World appear whenever a new gameplay mechanic is introduced that you can read for hints on what to do and how to do it. Some even have illustrations.\n• You Have to Burn the Rope has the game's only instructions written on the wall in the background.\n• In World of Goo, the signposts scattered around the stages will tell you how the new type of goo works if you encounter one, as well as give hints on how to clear the stage. It's also where most of the story is contained.\n• Need for Speed: Underground 2 has a series of info coronas laid around the Airport and City Center (the only two sections of town accessible at the start of the game). Driving through these gives you some information on the game and a small amount of cash.\n• The tutorial in Dark Souls is given through messages on the ground. They outwardly look the same as the player-written messages, but once you read them they can be distinguished by unique art, inability to be rated, and not conforming the usual templates.\n• In Holy Umbrella, signposts in the Side View levels say which way the player should go, which techniques to use here or how the player needs to use them.\n• Present in any Pokémon main series game: Signposts may contain in-universe information (location names, etc.), or they may contain \"Trainer Tips!\" which provide tutorial-like information to the player.\n• Undertale mostly prefers He Knows About Timed Hits to this trope, but a few examples do occur:\n• Parodied with the first freestanding signpost in the game reads: \"Press [Z] to read signs!\"\n• A straight example is the piano puzzle in Waterfall, where the buttons to press are crudely drawn on the wall above.\n• Black & White has literal signposts littered throughout the lands and clustered around your temple that remind you of how to do basic deeds, though there are actual advisors who explain the principles as well.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/SignpostTutorial", "media_links": ["/pmwiki/pmwiki.php/Franchise/TheLegendOfZelda", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaOcarinaOfTime", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaMajorasMask", "/pmwiki/pmwiki.php/VideoGame/IttleDew", "/pmwiki/pmwiki.php/VideoGame/EternalDarkness", "/pmwiki/pmwiki.php/VideoGame/Glider", "/pmwiki/pmwiki.php/VideoGame/Braid", "/pmwiki/pmwiki.php/VideoGame/CrashBandicoot2NTranced", "/pmwiki/pmwiki.php/VideoGame/HoratioTheThirdSeniorManjensenWithKnuckles", "/pmwiki/pmwiki.php/VideoGame/Iji", "/pmwiki/pmwiki.php/VideoGame/Jumper", "/pmwiki/pmwiki.php/Franchise/Kirby", "/pmwiki/pmwiki.php/VideoGame/KirbysEpicYarn", "/pmwiki/pmwiki.php/VideoGame/KirbysReturnToDreamLand", "/pmwiki/pmwiki.php/VideoGame/KirbyTripleDeluxe", "/pmwiki/pmwiki.php/VideoGame/KirbyPlanetRobobot", "/pmwiki/pmwiki.php/VideoGame/LevelUp", "/pmwiki/pmwiki.php/VideoGame/TheLostVikings", "/pmwiki/pmwiki.php/VideoGame/Purple", "/pmwiki/pmwiki.php/VideoGame/Putty", "/pmwiki/pmwiki.php/VideoGame/SuperMario64", "/pmwiki/pmwiki.php/VideoGame/SuperMarioGalaxy", "/pmwiki/pmwiki.php/VideoGame/SuperMario63", "/pmwiki/pmwiki.php/VideoGame/SuperMarioWorld", "/pmwiki/pmwiki.php/VideoGame/TinyToonAdventuresBusterBustsLoose", "/pmwiki/pmwiki.php/VideoGame/ToeJamAndEarl", "/pmwiki/pmwiki.php/VideoGame/WarioLandShakeIt", "/pmwiki/pmwiki.php/VideoGame/WarioLand4", "/pmwiki/pmwiki.php/VideoGame/SuperMarioWorld2YoshisIsland", "/pmwiki/pmwiki.php/VideoGame/YouHaveToBurnTheRope", "/pmwiki/pmwiki.php/VideoGame/WorldOfGoo", "/pmwiki/pmwiki.php/VideoGame/NeedForSpeedUnderground", "/pmwiki/pmwiki.php/VideoGame/DarkSouls", "/pmwiki/pmwiki.php/VideoGame/HolyUmbrella", "/pmwiki/pmwiki.php/Franchise/Pokemon", "/pmwiki/pmwiki.php/VideoGame/Undertale", "/pmwiki/pmwiki.php/VideoGame/BlackAndWhite"], "non_media_links": ["/pmwiki/pmwiki.php/Main/StoryBreadcrumbs", "/pmwiki/pmwiki.php/Main/NPC", "/pmwiki/pmwiki.php/Main/HeKnowsAboutTimedHits", "/pmwiki/pmwiki.php/Main/InstructiveLevelDesign", "/pmwiki/pmwiki.php/Main/ActionAdventure", "/pmwiki/pmwiki.php/Main/SiliconBasedLife", "/pmwiki/pmwiki.php/Main/FishPeople", "/pmwiki/pmwiki.php/Main/VoluntaryTransformation", "/pmwiki/pmwiki.php/Main/FaceStealer", "/pmwiki/pmwiki.php/Main/ElementalRockPaperScissors", "/pmwiki/pmwiki.php/UsefulNotes/Amiga", "/pmwiki/pmwiki.php/Main/SpeechBubble", "/pmwiki/pmwiki.php/Main/PunnyName", "/pmwiki/pmwiki.php/Main/StoryBreadcrumbs", "/pmwiki/pmwiki.php/Main/MadLibsDialogue", "/pmwiki/pmwiki.php/Main/SideView", "/pmwiki/pmwiki.php/Main/HeKnowsAboutTimedHits"]}