{"title": "Player Data Sharing", "content": "User Manual, The Legend of Zelda: A Link Between Worlds \"Shadow Link data will be exchanged if you encounter other players who also have StreetPass activated for this software on their systems. Other players' data will appear as Shadow Link characters somewhere in your game. Talk to a Shadow Link character and you'll be able to challenge him to a battle!\"\n\nThis trope lies in between a single player and multiplayer game. Rather than allowing players to compete or cooperate directly, the game uses a system where another player's game data is used to influence the game. This can range from trading items and equipment between players (or characters; this is a mainstay of mons series) to outright having a customisable Player Character cameoing as an NPC.\n\nWhile this was possible on older games (the ability to share saves on a PC game has always been a given), online games (and improvements in technology which allow for easier localised data sharing) have made this much more popular. It's especially attractive to a developer who wants to add online features without ending up with a Misbegotten Multiplayer Mode or needs a means of linking One Game for the Price of Two.\n\nGames in the Roguelike genre often have a feature called \"bones\" files, which store the saves of dead characters so their grave (and/or angry ghost) can make an appearance. Another variation is an odd sort of Drop-In-Drop-Out Multiplayer where only the host plays normally, and everyone else simply helps or hinders them indirectly (e.g. by being able to attack them or fight with them with the limitations of an NPC, or simply observing) while keeping their single player campaigns separate.\n\nCompare Previous Player-Character Cameo, Meta Multiplayer (where players are still able to compete in a single player game) and Old Save Bonus (when a player can import data from one game to another). Can be a Socialization Bonus.\n• The Nintendo 3DS has a feature known as StreetPass, which lets you exchange player data when your 3DS's wireless features are switched on and comes within range of another StreetPass-enabled 3DS. (The 3DS doesn't have to be fully on—StreetPass will continue to run in Sleep Mode.) All 3DSes come with software known as StreetPass Mii Plaza, which lets you exchange player avatars known as Miis with other users and have received Miis partake in a number of games. 3DS games (though not all of them) can also exchange StreetPass data of their own. Doing so requires having some space on the exchanging users' SD cards for additional save data — this is what allows players to receive StreetPass data for their games regardless of whether those games are currently running or even in the player's 3DS to begin with — and only up to 12 games may be enabled for StreetPass at any one time.\n• Bloodstained: Ritual of the Night included this feature as one of its kickstarter stretch goals, described as \"asynchronous multiplayer\", with the specific details of how players will be able to interact yet to be announced.\n• Dynasty Warriors 8: Empires has the option to allow \"Guest Officers\" to show up in their current Empires Mode playthrough, which ultimately amounts to the game downloading created characters at random and throwing them into China someplace as free officers or groups of vagabonds.\n• God Eater Burst features \"Avatar Cards\" which you can exchange with other players, allowing them to use your Player Character as a NPC teammate and vice versa. The character's equipment is dependent on what the character had on his/her person when the card was given. The sequel improves on this by letting you edit the cards' equipment before giving them away.\n• Subverted in Journey: The glowing symbols that can be seen floating above the environments look like previous players' souls/symbols returning to the beginning from the top of the mountain, as happens to your own at the end of the game , especially since other players can actually accompany you if you play online, but careful observation reveals that those symbols are always the same and are essentially static features of the respective levels.\n• The Legend of Zelda: A Link Between Worlds has a feature where the StreetPass loads other players' profiles. These players can be fought as Shadow Links for an amount of money based on their difficulty (players can customise their Link's equipment and make battles with their shadow as easy or hard as they like).\n• The Tales of the World: Radiant Mythology trilogy had other players' uploaded characters as randomly-appearing mercenaries at the local tavern. However, the English version of the first game axed this feature completely and instead featured preset custom characters with generic names.\n• Tell Tale Games does this where, at the end of an episode, you can see your choices recapped and see how many other players made the same choice(s) you did.\n• Dreamfall Chapters also does this, though you can also view the balance symbol in-game when a choice comes out to see what percent of the playerbase chose what.\n• Some versions of The Oregon Trail (for example, the Windows 95 version) allow you to encounter the tombstones of player characters that didn't make it to Oregon. The cause of the \"Here lies andy, peperony and chease\" Memetic Mutation is that one of the most-pirated copies of the game had this line saved into it by the original uploader. Cue the swear words.\n• Dragon Ball Z: Battle of Z applies this concept to the classic Spirit Bomb. Sometimes after clearing a mission, the player will be prompted by Goku to share their energy; they then have one minute to tap a button and donate Ki. When the player uses the Spirit Bomb themselves, they receive some of the Ki donated by players from around the world. One can even pick a message of encouragement to send along with the Ki, such as \"You can do it!\" or \"Here's my energy, just don't waste it!\"\n• The Mario Kart games have allowed players to share Ghost data for Time Trials since Super Circuit, although it wasn't until Wii that players could do so over the internet rather than in person.\n• Hatsune Miku Project Mirai DX lets you use StreetPass to exchange Player Cards with others. A Player Card include the player's handle, a short tagline, a two-segment special title, the last Vocaloid they had selected and a player-chosen backdrop. Player Cards additionally can come with one custom dance, one player-composed song, and one random BGA comment. Having fellow Project Mirai DX players on your 3DS friends list will allow you to exchange Player Cards via Nintendo's SpotPass service with them without having to come within physical proximity of them. Regardless of how you obtained a particular Player Card, it will automatically be updated to the most current version whenever its corresponding player StreetPasses you, or occasionally via SpotPass.\n• NetHack's bones files allow you to loot the dead character in question's corpse. Just remember that the cause of their death still tends to be around.\n• One Way Heroics, its remake Plus, and its Spiritual Successor Mystery Chronicle: One Way Heroics all use Twitter as a means to convey messages left behind by other players in-game, Dark Souls-style. If the message is tied to an event where the player died, their ghost appears close to the distance listed in the message, and speaking to said ghost drops one item from that player's inventory at the time of their death, selected at random.\n• The roguelike Omega allowed high-scoring player characters to achieve certain positions, such as becoming head of the various guilds, or Duke of Rampart. The relevant nonplayer characters would then be renamed after the ranking players in successive games. On a single-player system this became somewhat confusing, since all the NPCs would end up with your own name.\n• The Pokémon series was built on the idea of players being able to trade their mons between each other. Each iteration of the game even comes in multiple versions, with exclusive Pokemon, to encourage trading. Various games in the series also encourage you to share other kinds of data through various means. These range from in-consequential things such as news reports on how many ledges a trainer jumped over to opening up new areas such as the Eon Ticket (an item that's distributed by the Streetpass feature in Omega Ruby and Alpha Sapphire) that lets you access the Southern Island to catch Latios or Latias, or fighting the team the player had on them at the moment of data exchange.\n• The online component of Dark Souls (and to a lesser degree, its predecessor Demon's Souls) allows players to leave each other notes and also leaves blood stains to show where other players have died. There is also a more direct co-op element, which allows players to join one another's games during boss fights or \"invade\" their game and kill them.\n• Persona 4: Golden added a feature (to take advantage of the PS Vita's wifi/3G capabilities) where the player could call for help while in dungeons and gets healed based on the number of players who respond. The game also lets players write a short message (from a few specific phrases, presumably so they could be easily translated and avoid griefing), which is stored in anyone they aid's log.\n• In Dragon's Dogma, your pawn (a fully customizable follower of your character) can be used by anyone in the pawn community. While with another player, your pawn will gain gifts from the other player, rift crystals, and quest experience from the quests they went on while away. You can also hire other's pawns and have them travel with you on your quests.\n• Monster Hunter 4 Ultimate lets you use StreetPass, local wireless rooms, and online rooms to exchange not only Guild Cards (which is also possible in 3 Ultimate), but also Guild Quests and Palicoes, saving the trouble of having to farm for the latter two. The catch is that any Guild Quests and Palicoes sent to other players will reset to the levels they were when they were earned or scouted by the original player, so you can't just easily grab Level 140 Guild Quests and Level 30 Palicoes in this manner.\n• The conclusion of Bravely Default has various alternate worlds help defeat the Final Boss - these worlds are actually those of your friends who also own the game.\n• In NieR: Automata, if your character dies you can attach a message to the corpse for other players to come across. In Ending E, you are helped out by other players for the final Bullet Hell segment and in the end you're given the option of offering to help other players by sacrificing your entire save data .\n• The Etrian Odyssey series has Guild Cards. A Guild Card summarizes the player's guild's information, including the current party, a short message to other players, how many enemies they've fought, which emblems they've earned, etc. As for how it works from game to game:\n• The DS games allow exchanging cards through a special sleep mode.\n• The 3DS games allow exchanging cards via StreetPass, eliminating the need to go into a specific in-game mode to swap cards. Additionally, the player can choose one member of their guild to be shown on their card, showing off their stats, equipment, and skill build, and other players can recruit a copy of that character provided their guilds each have at least one guild member who has reached the featured character's level, though the registered character cannot level up or change equipment. If StreetPassing cards is not feasible, the player can convert their Guild Card into a QR code and scan other players' QR codes to get their Guild Cards.\n• Etrian Odyssey V: Beyond the Myth takes cards a step further by having cards' featured characters appear in certain field events, immersing the player in the idea that their guild isn't the only one exploring the labyrinth.\n• Watch_Dogs allows players to \"hack\" into other players' single-player campaigns to gain additional resources. In-game, the player being hacked experiences it as Pearce being tracked by hostile rival \"fixers\". The intruding player is given a random NPC model in the host's game, but can be unmasked if they're scanned.\n• Way of the Samurai, particularly the third and fourth installments, featured the option to allow other players' characters to show up in one's own game as wandering NPCs.\n• Every game in the Creatures series has allowed players to save and share Norns with one another.\n• In Spore, all of the creatures, spaceships and other content a given player generates can be uploaded to \"Sporepedia\" and downloaded into another player's game. The result being that Sporepedia has well over 100,000 times the amount of content the game had when it shipped. The creators of the game referred to it as a \"massively single-player\" game for this reason.\n• Animal Crossing: New Leaf has this in two flavors. First, using the 3DS' StreetPass system to find other New Leaf players allows you to access a model of their home in the Happy Home Academy Showcase, which you can go to and buy furniture you like (albeit at a steep markup). Second, the Dream Suite allows you to access dream versions of other players' towns over the Internet. Since it's All Just a Dream, you can't take any items with you, but you can get new patterns by talking to Wendell in the dream.\n• Tomodachi Life:\n• Upon unlocking the Import Shop, you'll be allowed to obtain one Import item that can be sent to other players in StreetPass. This is the only way to obtain Import items other than your own, other than special SpotPass-exclusive items.\n• Once you get a couple married and to have a child, you can either keep the child on the island, making them a new Islander, or turn them into a Traveler who travels from player file to player file via StreetPass. Receiving Travelers lets you interact with them in ways similar to interacting with Islanders, such as feeding them, giving them baths, changing their hair color, and the like. Travelers on your Island only stay the day you receive them from your Port (which actually happens only when you check the Port, not immediately when you pick them up in StreetPass); the day after, they'll hang around the Port until they depart for another player's 3DS.\n• Players have been able to upload their Sims and buildings to a central online hub in every iteration of The Sims, known as the Exchange in The Sims 1, The Sims 2 and The Sims 3 and the Gallery in The Sims 4. The sites for 1 and 2 have since been shut down, but players can still export their game files and upload them elsewhere.\n• Some of the Disgaea games have online features where another player's units can show up in their game, AI-controlled.\n• In Disgaea 4: A Promise Unforgotten, players can form their own group of Item World pirates, complete with their own custom ship, and upload them online to either take on other pirates directly or invade other players' Item World sessions. The invader can also choose whether their pirates are hostile or neutral to the other players they encounter. Also, some of the Dark Assembly positions are used exclusively online, and characters in said positions who get bribed by other players actually take home said bribes to their respective players.\n• Disgaea 5: Alliance of Vengeance takes this a step further by involving whole Netherworlds invading Item World sessions, while giving the victim the option to call their Netherworld in as backup.\n• Supa Robo Gakuen introduces this mechanic into the Super Robot Wars series, working pretty similar to the Pokémon example above, though its usefulness is limited, as there is no One Game for the Price of Two in play.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/PlayerDataSharing", "media_links": ["/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaALinkBetweenWorlds", "/pmwiki/pmwiki.php/VideoGame/StreetPassMiiPlaza", "/pmwiki/pmwiki.php/VideoGame/BloodstainedRitualOfTheNight", "/pmwiki/pmwiki.php/VideoGame/DynastyWarriors", "/pmwiki/pmwiki.php/VideoGame/Journey", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaALinkBetweenWorlds", "/pmwiki/pmwiki.php/VideoGame/TalesOfTheWorld", "/pmwiki/pmwiki.php/Creator/TellTaleGames", "/pmwiki/pmwiki.php/VideoGame/DreamfallChapters", "/pmwiki/pmwiki.php/VideoGame/TheOregonTrail", "/pmwiki/pmwiki.php/VideoGame/MarioKart", "/pmwiki/pmwiki.php/VideoGame/NetHack", "/pmwiki/pmwiki.php/VideoGame/OneWayHeroics", "/pmwiki/pmwiki.php/Website/Twitter", "/pmwiki/pmwiki.php/VideoGame/Omega", "/pmwiki/pmwiki.php/Franchise/Pokemon", "/pmwiki/pmwiki.php/VideoGame/DarkSouls", "/pmwiki/pmwiki.php/VideoGame/DemonsSouls", "/pmwiki/pmwiki.php/VideoGame/Persona4", "/pmwiki/pmwiki.php/VideoGame/DragonsDogma", "/pmwiki/pmwiki.php/VideoGame/MonsterHunter", "/pmwiki/pmwiki.php/VideoGame/BravelyDefault", "/pmwiki/pmwiki.php/VideoGame/EtrianOdyssey", "/pmwiki/pmwiki.php/VideoGame/WatchDogs", "/pmwiki/pmwiki.php/VideoGame/WayOfTheSamurai", "/pmwiki/pmwiki.php/VideoGame/Creatures", "/pmwiki/pmwiki.php/VideoGame/Spore", "/pmwiki/pmwiki.php/VideoGame/AnimalCrossing", "/pmwiki/pmwiki.php/VideoGame/TomodachiLife", "/pmwiki/pmwiki.php/VideoGame/TheSims", "/pmwiki/pmwiki.php/VideoGame/TheSims1", "/pmwiki/pmwiki.php/VideoGame/TheSims2", "/pmwiki/pmwiki.php/VideoGame/TheSims3", "/pmwiki/pmwiki.php/VideoGame/TheSims4", "/pmwiki/pmwiki.php/Franchise/Disgaea", "/pmwiki/pmwiki.php/VideoGame/Disgaea4APromiseUnforgotten", "/pmwiki/pmwiki.php/VideoGame/Disgaea5AllianceOfVengeance", "/pmwiki/pmwiki.php/VideoGame/SupaRoboGakuen", "/pmwiki/pmwiki.php/VideoGame/SuperRobotWars", "/pmwiki/pmwiki.php/Franchise/Pokemon"], "non_media_links": ["/pmwiki/pmwiki.php/UsefulNotes/Nintendo3DS", "/pmwiki/pmwiki.php/Main/CompetitiveMultiplayer", "/pmwiki/pmwiki.php/Main/CoOpMultiplayer", "/pmwiki/pmwiki.php/Main/PlayerGeneratedEconomy", "/pmwiki/pmwiki.php/Main/Mons", "/pmwiki/pmwiki.php/Main/PlayerCharacter", "/pmwiki/pmwiki.php/Main/NPC", "/pmwiki/pmwiki.php/Main/MisbegottenMultiplayerMode", "/pmwiki/pmwiki.php/Main/OneGameForThePriceOfTwo", "/pmwiki/pmwiki.php/Main/Roguelike", "/pmwiki/pmwiki.php/Main/EverythingTryingToKillYou", "/pmwiki/pmwiki.php/Main/DropInDropOutMultiplayer", "/pmwiki/pmwiki.php/Main/NPC", "/pmwiki/pmwiki.php/Main/PreviousPlayerCharacterCameo", "/pmwiki/pmwiki.php/Main/MetaMultiplayer", "/pmwiki/pmwiki.php/Main/OldSaveBonus", "/pmwiki/pmwiki.php/Main/SocializationBonus", "/pmwiki/pmwiki.php/UsefulNotes/Nintendo3DS", "/pmwiki/pmwiki.php/Videogame/GodEaterBurst", "/pmwiki/pmwiki.php/Main/PlayerCharacter", "/pmwiki/pmwiki.php/Main/NPC", "/pmwiki/pmwiki.php/Main/EquipmentBasedProgression", "/pmwiki/pmwiki.php/Main/VideoGameCrueltyPotential", "/pmwiki/pmwiki.php/Main/MemeticMutation", "/pmwiki/pmwiki.php/Main/CombinedEnergyAttack", "/pmwiki/pmwiki.php/Main/KiManipulation", "/pmwiki/pmwiki.php/Videogame/HatsuneMikuProjectDIVA", "/pmwiki/pmwiki.php/Main/SpiritualSuccessor", "/pmwiki/pmwiki.php/Main/Mons", "/pmwiki/pmwiki.php/Main/OneGameForThePriceOfTwo", "/pmwiki/pmwiki.php/Main/KentBrockmanNews", "/pmwiki/pmwiki.php/Main/SpiritualSuccessor", "/pmwiki/pmwiki.php/Main/UpdatedRerelease", "/pmwiki/pmwiki.php/Main/Griefing", "/pmwiki/pmwiki.php/Main/FinalBoss", "/pmwiki/pmwiki.php/Videogame/NierAutomata", "/pmwiki/pmwiki.php/Main/BulletHell", "/pmwiki/pmwiki.php/Main/CosmeticAward", "/pmwiki/pmwiki.php/Main/HeroOfAnotherStory", "/pmwiki/pmwiki.php/Main/PlayerCharacter", "/pmwiki/pmwiki.php/Main/AllJustADream", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Main/OneGameForThePriceOfTwo"]}