{"title": "The Good Old British Comp", "content": "Lots of girls and lots of boys\n\nLots of smells and lots of noise\n\nTeacher comes to break it up\n\nComprehensive schools, now generally just called \"Secondary Schools\", were set up in the 1960s by the Harold Wilson government, replacing the old system of Grammars and Secondary Moderns (where you went and a lot of your future depended on the dreaded 11 plus exams — this system still prevails in Northern Ireland and small parts of England, and a variation on it can be seen in the Harry Potter books and movies).\n\nSchool buildings in the UK widely vary in age, from Victorian era to brand new. On TV, many are Victorian. Fortunately, the days of the outside toilets and outside swimming pools are gone. Actually, the \"outside\" has gone too, having been sold off to property developers.\n\nBritish school pupils in almost all cases are required to wear school uniforms, and you can spot a troublemaker from a mile off by the fact that he or she isn't wearing it properly (skirt too short, tie askew, shirt not tucked in, top button undone). It is of note that in some schools, not wearing one's uniform correctly has encroached en masse, to the extent that very few pupils wear the entire uniform correctly. They generally include a white shirt, tie, dark bottoms (trousers or skirts), smart dark shoes and, quite often, a blazer.\n\nThese troublemakers also like to smoke behind the bike sheds, where romance also takes place. (Presumably, the smoke obscures the romance.) These days smoking in the Staff Room is illegal, so pupils and teachers both disappear behind the bike sheds where they carefully ignore each other.\n\nKids in glasses are generally portrayed as \"swots\", as are \"prim and proper young ladies\" (e.g., Hermione Granger from Harry Potter). The former get bullied, the latter may turn out to be Beautiful All Along.\n\nGangs are common, both of the good (\"let's have a jape\") and bad (\"let's nick the smart kid's dinner money\") variety, although most schools now have electronic payment for school dinners, so it's more \"steal their dinner card/finger print\". Kids in TV schools display a far greater degree of coordination on their own than one ever saw in real life. The teachers have to be called \"Miss\" or \"Sir\" (a policy that only actually happens in some schools) and are generally highly strict. Whatever you do, don't annoy the Head Teacher.\n\nThey used to be able to administer a caning, but this was stopped in the 1980s; many a media commentator has called for its return. Highly popular for the expected hijinks the students (and also often teachers) will get up to, because really, they shouldn't get up to them. Such shows are naturally prone to Dawson Casting.\n\nThere are a wide range of differences between English and Scottish schools, but none of them are relevant to the trope, except that uniforms seem to be more optional.\n\nSee also British Education System. Compare and contrast with Boarding School, the other British education trope.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/TheGoodOldBritishComp", "media_links": ["/pmwiki/pmwiki.php/Music/Madness", "/pmwiki/pmwiki.php/Franchise/HarryPotter", "/pmwiki/pmwiki.php/Literature/HarryPotter", "/pmwiki/pmwiki.php/Literature/Discworld", "/pmwiki/pmwiki.php/Creator/AAPessimal", "/pmwiki/pmwiki.php/Film/CarryOnTeacher", "/pmwiki/pmwiki.php/Theatre/TheHistoryBoys", "/pmwiki/pmwiki.php/Literature/AdrianMole", "/pmwiki/pmwiki.php/Literature/TheDemonHeadmaster", "/pmwiki/pmwiki.php/Literature/Discworld", "/pmwiki/pmwiki.php/Creator/TerryPratchett", "/pmwiki/pmwiki.php/Series/TheBeiderbeckeAffair", "/pmwiki/pmwiki.php/Series/TheBootStreetBand", "/pmwiki/pmwiki.php/Series/DoctorWho", "/pmwiki/pmwiki.php/Series/GrangeHill", "/pmwiki/pmwiki.php/Series/Hollyoaks", "/pmwiki/pmwiki.php/Series/TheInbetweeners", "/pmwiki/pmwiki.php/Series/TheSarahJaneAdventures", "/pmwiki/pmwiki.php/Series/Teachers", "/pmwiki/pmwiki.php/Series/WaterlooRoad", "/pmwiki/pmwiki.php/Music/Madness", "/pmwiki/pmwiki.php/Music/Absolutely", "/pmwiki/pmwiki.php/VideoGame/SkoolDaze", "/pmwiki/pmwiki.php/VideoGame/WastedYouth", "/pmwiki/pmwiki.php/Webcomic/Annyseed"], "non_media_links": ["/pmwiki/pmwiki.php/UsefulNotes/HaroldWilson", "/pmwiki/pmwiki.php/Main/CustomUniform", "/pmwiki/pmwiki.php/Main/BeautifulAllAlong", "/pmwiki/pmwiki.php/Main/DawsonCasting", "/pmwiki/pmwiki.php/UsefulNotes/BritishEducationSystem", "/pmwiki/pmwiki.php/Main/BoardingSchool", "/pmwiki/pmwiki.php/Main/BritishComics", "/pmwiki/pmwiki.php/Main/FantasyCounterpartCulture", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Main/LesYay", "/pmwiki/pmwiki.php/Main/CatholicSchoolGirlsRule", "/pmwiki/pmwiki.php/Main/TheBully", "/pmwiki/pmwiki.php/Main/Eagleland", "/pmwiki/pmwiki.php/Main/NewTransferStudent", "/pmwiki/pmwiki.php/Main/FantasyCounterpartCulture", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Recap/DoctorWhoS28E3SchoolReunion", "/pmwiki/pmwiki.php/Main/SoapOpera", "https://www.youtube.com/watch?v=BE7gAEsI0XY", "https://www.youtube.com/watch?v=0E8AZ8bsdOY", "/pmwiki/pmwiki.php/Main/HighSchool", "/pmwiki/pmwiki.php/Main/BoardingSchoolOfHorrors", "/pmwiki/pmwiki.php/UsefulNotes/ZXSpectrum"]}