{"title": "You Break It, You Profit", "content": "A subtrope of Rewarding Vandalism, where when you break something in a Video Game you receive a sum of money equal to the total cost of the damage you've caused. May take the form of a \"mayhem mission\" for games with a Sociopathic Hero or Villain Protagonist.\n• Trope Codifier is the Grand Theft Auto series of games: you get money when you run over pedestrians, for example. The more you get in a row, the more cash you get for the next in a chain.\n• Sleeping Dogs: Running over parking meters gets you money (presumably the value that was in them).\n• The Burnout series has this in most of the games with its \"Crash\" events (like Burnout Paradise's \"Showtime\").\n• Zombie Driver has this. For some reason, the game states that The Mayor is paying you for killing zombies who are ruining his city. It doesn't explain why you also receive money for ruining the city yourself.\n• In Mercenaries, the A.N. will pay you a bounty for destroying North Korean vehicles.\n• Most Armored Core games have at least one mission to rampage throughout the city and be compensated for the amount of damage you do.\n• In Skate 2, if you get a certain number of damage points to your body when you bail and break a record, the Hall of Meat will pay you cash.\n• Star Fox 64: No actual money changes hands, but at the end of the game, Team Star Fox sends out a bill related to how many points they scored throughout the game. The amount on the bill is equal to 64 currency units for each enemy you shot down.\n• Every game in the Saints Row series has this as a minigame, with the justification that you're breaking things to either devalue property or get media attention. The Third adds a version of the minigame where you're breaking things with a tank. In addition, certain actions in the game (such as blowing up vehicles of a certain type) have challenges connected to them - once you complete that challenge, you start gaining money each time you do the action rather than respect.\n• Blurst's Minotaur China Shop game: You're supposed to be delivering items to customers, and if you try to do that, breaking items costs you money. But you can also break stuff on purpose \u0097 once the minotaur is overtaken by his ancestral \"minotaur rage\", his shop's rage insurance kicks in and you start earning money for breaking things.\n• City of Villains has Mayhem Missions, which were so much fun that the developers eventually had to add a similar mission type for heroes. (The heroes' \"Safeguard Missions\" are generally agreed to be less fun since you are expected to prevent vandalism instead of causing it.)\n• We Love Katamari has one level where your score is calculated by the monetary value of the items rolled up, rather than the katamari's overall size.\n• Blast Corps has one bonus level, Salvage Wharf, that challenges you to cause a certain number of dollars' worth of damage as quickly as possible.\n• Overlaps with Attack Its Weak Point in Monster Hunter. More often than not, the way to obtain a monster's horns or fangs is to smash them, in which case they have a high chance of turning up as an extra quest reward after the beast is dead. This could qualify as Fridge Logic (for obvious reasons), but in another way it's Fridge Brilliance - the Guild probably takes the first cut of the monster's remains after you kill it, so the only way to get your grubby mitts on (what remains of) the valuable bits is to make sure the Guild doesn't want them.\n• The Japanese arcade game Chō Chabudai Gaeshi (a.k.a. \"Table Flip\") is mostly scored based on the amount of damage you do, though other achievements (such as causing someone to fall out of the office onto a garbage truck) also add to your score.\n• Justified in The Bard's Tale, which features a corrupt barrel-maker who will pay you for each barrel you break because it means more business for him.\n• In many simulation/tycoon games, The Sims being only one of tons of examples, bulldozing/demolishing something apparently counts as (basically) the same as selling it. It makes logic sense that you can sell a chair and get the purchase price money back again, but it is not so realistic that when you demolish a house or a fence, you don't have to pay for the demolition work - instead you are paid the exact same amount of money as you spent when you constructed the house/fence.\n• The RollerCoaster Tycoon games, at least, deal with this by making some items not give you back money when you remove them, like fences and trash cans, and forces you to pay money to remove trees and bushes, which would likely have to be cut down with no gain. For some reason, though, footpaths can still be resold — even tarmac and dirt.\n• Parking Meters, like in Sleeping Dogs, give money when broken in Final Fight Streetwise. It takes 3 hits to make one spill the cash, you know, in case you're that desperate for $5.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/YouBreakItYouProfit", "media_links": ["/pmwiki/pmwiki.php/VideoGame/GrandTheftAuto", "/pmwiki/pmwiki.php/VideoGame/SleepingDogs", "/pmwiki/pmwiki.php/VideoGame/Burnout", "/pmwiki/pmwiki.php/VideoGame/BurnoutParadise", "/pmwiki/pmwiki.php/VideoGame/ZombieDriver", "/pmwiki/pmwiki.php/VideoGame/Mercenaries", "/pmwiki/pmwiki.php/VideoGame/ArmoredCore", "/pmwiki/pmwiki.php/VideoGame/Skate", "/pmwiki/pmwiki.php/VideoGame/StarFox64", "/pmwiki/pmwiki.php/VideoGame/SaintsRow", "/pmwiki/pmwiki.php/VideoGame/CityOfVillains", "/pmwiki/pmwiki.php/VideoGame/KatamariDamacy", "/pmwiki/pmwiki.php/VideoGame/BlastCorps", "/pmwiki/pmwiki.php/VideoGame/MonsterHunter", "/pmwiki/pmwiki.php/VideoGame/TheBardsTale", "/pmwiki/pmwiki.php/VideoGame/TheSims", "/pmwiki/pmwiki.php/VideoGame/RollerCoasterTycoon", "/pmwiki/pmwiki.php/VideoGame/FinalFightStreetwise"], "non_media_links": ["/pmwiki/pmwiki.php/Main/JustifiedTrope", "/pmwiki/pmwiki.php/Main/RewardingVandalism", "/pmwiki/pmwiki.php/Main/VideoGame", "/pmwiki/pmwiki.php/Main/SociopathicHero", "/pmwiki/pmwiki.php/Main/VillainProtagonist", "/pmwiki/pmwiki.php/Main/TropeCodifier", "/pmwiki/pmwiki.php/Main/VoodooShark", "/pmwiki/pmwiki.php/Main/TankGoodness", "/pmwiki/pmwiki.php/Main/AttackItsWeakPoint", "/pmwiki/pmwiki.php/Main/FridgeLogic", "/pmwiki/pmwiki.php/Main/FridgeBrilliance", "/pmwiki/pmwiki.php/Main/IncrediblyLamePun", "/pmwiki/pmwiki.php/Main/JustifiedTrope"]}