{"title": "Trippy Finale Syndrome", "content": "\n• Perhaps the archetypal example, as shown above: the end of 2001: A Space Odyssey, as astronaut David Bowman goes to \"Jupiter and Beyond the Infinite\". Do not pretend to understand it.\n• Although Arthur C. Clarke's companion novel offers an explanation, if you really must have one.\n• Interstellar is already the modern equivalent of 2001, so it wouldn't be complete without the trip inside a black hole where aliens have set up infinite rooms showing Cooper's daughter's room throughout multiple time periods, and then the trip backwards and forwards through time and space as Cooper goes home.\n• In Brazil, the climax of the film is a sort of fever dream. It's ultimately revealed that the hero has actually gone insane under torture and is hallucinating it all.\n• The 1979 Disney science fiction film The Black Hole ends with the main characters passing through a black hole; the villain appears to merge with a robot who then becomes Lord of Hell, whilst the heroes either ascend to heaven or simply pass through a white hole into another part of the universe. And then the film ends.\n• The novelization suggests that the heroes Ascend to a Higher Plane of Existence after passing through the black hole, V.I.N.C.E.N.T. included.\n• The 1974 ant thriller Phase IV ends with the surviving human characters - a man and a woman - apparently being captured by ants and forced to become the next stage of human evolution, or something along those lines.\n• John Boorman's deranged post-apocalyptic sci-fi film Zardoz ends with the main character and his wife growing old in timelapse, as their child grows up to adulthood, to no discernible cinematic purpose.\n• The Quiet Earth (1985), a rare post-70s example, ends with the main character seemingly transported to the moon of a distant ringed planet, or possibly the afterlife, or perhaps he remains where he is and the universe changes around him. It makes no sense. It wasn't meant to.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/TrippyFinaleSyndrome", "media_links": ["/pmwiki/pmwiki.php/Film/TwoThousandOneASpaceOdyssey", "/pmwiki/pmwiki.php/Creator/ArthurCClarke", "/pmwiki/pmwiki.php/Film/Interstellar", "/pmwiki/pmwiki.php/Film/Blueberry", "/pmwiki/pmwiki.php/Creator/BusbyBerkeley", "/pmwiki/pmwiki.php/Film/TheGangsAllHere", "/pmwiki/pmwiki.php/Film/Brazil", "/pmwiki/pmwiki.php/Film/TheBlackHole", "/pmwiki/pmwiki.php/Film/PhaseIV", "/pmwiki/pmwiki.php/Film/Zardoz", "/pmwiki/pmwiki.php/Film/TheQuietEarth", "/pmwiki/pmwiki.php/Literature/AtPlayInTheFieldsOfTheLord"], "non_media_links": ["/pmwiki/pmwiki.php/Main/AllThereInTheManual", "/pmwiki/pmwiki.php/Main/MindScrewdriver", "/pmwiki/pmwiki.php/Main/BusbyBerkeleyNumber", "/pmwiki/pmwiki.php/Main/AscendToAHigherPlaneOfExistence", "/pmwiki/pmwiki.php/Main/GainaxEnding"]}