{"title": "Dogfaces", "content": "Dogfaces, or dognoses, are nearly human dogs that populate the Disney Ducks Comic Universe, Mickey Mouse Comic Universe, DuckTales (1987) (and 2017), Goof Troop, A Goofy Movie, An Extremely Goofy Movie and some of the Classic Disney Shorts. One even shows up in the Quack Pack episode \"All Hands on Duck\". Goofy is considered to be a dogface as well. Similar character designs have been used by other cartoon studios as well, though Disney is largely the Trope Codifier.\n• They often have fur in human skintones or no fur at all.\n• Goofy and Max have black fur all over their bodies. Goofy has a flesh-colored muzzle and Max has a flesh-colored face.\n• In Mickey, Donald, Goofy: The Three Musketeers, the Beagle Boys have grey fur all over.\n• They usually have muzzles like dogs.\n• They almost always have feet shaped at least somewhat like human feet.\n• They do not have tails.\n• They often have human-like head hair, and sometimes have human-like facial hair and body hair.\n• Unlike characters like Donald, Mickey or even Goofy, their species is almost never mentioned and they are only referred by generic terms like person.\n• They usually have black or brown (typically button) noses.\n• They usually have ears that flop (\"rose ears\" like those of a greyhound or bulldog) or those that droop (\"pendant ears\" like those of a bloodhound). Occasionally they will be drawn mistakenly with human ears.\n• But Pistol has erect ears like a Chihuahua, Roxanne has ears that look like human ears, and Goofy Jr. and Peg are drawn without any pinnae (ear flaps) whatsoever.\n• Sometimes they will have completely humanlike ears.\n• They usually range in portrayal from Funny Animal to Little Bit Beastly.\n\nRelated, but slightly less common are similar human designs with minimal animal features added. The second most common tends to be people with pig-noses/ears, but others may show up such as bird people with \"feather feet complete with toes\" or cat eared people.\n\nEven though they are most prominent in the Disney universe, dogfaces/dognoses are not exclusive to Disney. In fact they are ostensibly Older Than Dirt since the concept of cynocephali has been documented in many ancient civilisations from ancient greeks to Inuit; turns out depicting other people as dogfaced is an old pastime of racists.\n• Bigfoot, Sasquatch and Yeti: There is a dogface version of Bigfoot in A Goofy Movie. A dogface version of the Yeti appears in the video game adaptation of DuckTales (1987).\n• Carl Barks: Wanted to draw humans for the Donald Duck comics but Disney insisted on keeping humans out. Barks compromised by adding pig or dog noses to the human designs he drew, though occasionally he did manage to sneak in actual humans.\n• Depending on the Artist: Sometimes, dognoses are drawn with human-like ears.\n• Don Rosa, though he would sometimes drop the \"dog snout/ears\" element, making them basically humans with black noses.\n• Executive Meddling: Carl Barks loved drawing humans, and wanted to include them in his Donald Duck stories, but the higher ups demanded Dogfaces to be used all the time. He sneaked some humans here and there, before completely sending his bosses' wishes to screw themselves with his classic story Dangerous Disguise, in which Donald and his nephews are the sole ducks in a world otherwise exclusively populated by humans. Barks got the warning of his life for that one, and was forbidden from using humans ever again. His chief editor declared that it simply looked bad, and that it \"took the ducks out of their own world\".\n• Subverted in the Donald Duck cartoons. If you pay attention, dogfaces populate Donald's world only in the earliest shorts; unlike many of the Mickey Mouse toons before, Don's universe was much more likely to shelter actual humans; in fact, Quack Pack settled on using them instead of dogfaces because there was already a rich history of duck-human interactions on these Classic Disney Shorts.\n• Fantastic Racism: A mild example. The two richest residents of Duckburg are duck people, while most of the middle and lower classes and seemingly the entire criminal element (the Beagle Boys) are made up entirely of Dogfaces. Think about it.\n• Fur Is Skin: Many of them have this, it is just common for them to just not have fur at all.\n• Furry Baldness: Some older male Dogfaces have this.\n• Furry Denial: They act completely human, they are almost never acknowledged to be dogs, and they refer to themselves as \"people\", \"person\", \"man\", \"men\", and any other human-related term. They don't refer to themselves by any dog-related term at all. They don't even act anything like dogs. Mickey, Minnie, and Mortimer are still referred to as mice, and Donald, Daisy, the Nephews, Scrooge, Von Drake, and the rest of the Duck family are still referred to as ducks, however.\n• In the worlds of Mickey Mouse, Donald Duck, Goofy, and other Classic Disney Shorts, \"dogs\", save for Penelope Poodle from Minnie's Bow-Toons, are ''always'' non-anthropomorphized, which in turn, actually include Pluto, and as a result, many people are still determining what animal Goofy actually is.\n• On Goof Troop, Pete (who is, of course, a cat, although in Goof Troop this was made ambiguous) had a pet dog called Chainsaw, who acted like a real dog. There was even an episode where Max, frustrated by Chainsaw's misbehavior, muttered, \"I hate dogs\" (!).\n• Furry Female Mane: Most of the female dogfaces have these, though a lot of male dogfaces have human-like head hair too.\n• Furry Lens: Of all the classic Disney cartoon and comics animals, dogfaces are the most contextually human ones (more so than the mice and ducks), rarely slipping a Furry Reminder if any.\n• Furry Reminder: One dogface in An Extremely Goofy Movie catches a Frisbee in his mouth as a normal dog would.\n• Humanlike Foot Anatomy: They have feet like those of humans.\n• Humanoid Female Animal: The female Dogfaces in Disney Ducks Comic Universe, Goof Troop, A Goofy Movie, and An Extremely Goofy Movie are a little more likely to be humanlike, to the point where their noses, muzzles, and ears can often be their only non-human feature. Though male dogfaces aren't immune, particularly when they are caricatures of celebrities or historical figures.\n• Older than You Think\n• Species Surname: Completely averted, but for some reason played straight with the Beagle Boys and Penny Pooch from Minnie 'N Me line of merchandise.\n• Theodore Roosevelt: Don Rosa apologized for depicting him as a dognose for the sake of consistency in the biography of Scrooge McDuck.\n• Treasure Planet: The character, Dr. Doppler is actually one of these, though he atypically evidences some canine behavior traits.\n• Classic Disney Shorts: The shorts depicting Goofy as \"George Geef\" depict him with a furless body outside of his head. In a few shorts, George Geef even had ears. Pete and his (unnamed) son in their Cameo in \"Father's Week End\" appear similar.\n• Goof Troop. Goofy, Max, Pete, and P.J. have dogface (or catface for the latter two) furless bodies like in the George Geef shorts. Most other characters are full on flat out dogfaces with occasional people with cat or pig features such as the customers in Goofing up the Social Ladder.\n• A Goofy Movie and An Extremely Goofy Movie, Goofy and Pete reverted back to having furred bodies like in the classic shorts.\n• Most secondary, tertiary and background characters in the Mickey Mouse Comic Universe.\n• Surprisingly averted with Penelope Poodle from Minnie's Bow-Toons; she is an anthropomorphic poodle instead of a dogface.\n• American Dragon: Jake Long: Oddly, Jake sports a dog-like nose in his dragon form, as do some of the other Western dragons seen in the show.\n• Treasure Planet: Battle at Procyon: The Canid species, which includes the aforementioned Dr. Doppler, is an example of this.\n• Captain Ersatz: The bank robbers in this John Stanley \"Woody Woodpecker\" strip look awfully like the Beagle Boys.\n• Fur Is Skin: Like the Disney ones, most of them have this.\n• Older than You Think\n• Species Surname: Mostly averted as with the Disney examples, but somehow played straight with the titular character of the MGM Oneshot Cartoon \"Officer Pooch.\"\n• J. P. Cubish from one Daffy Duck cartoon and Daffy Duck's Quackbusters\n• The earliest shorts with Daffy and Porky Pig have dognoses as supporting characters and extras, but these would largely be replaced with humans in the shorts made after the early 1940's.\n• Betty Boop started out as one of these before her dog nose was removed and her floppy ears replaced with hoop earrings.\n• The very first episode of the Fleischer Popeye cartoon featured dogfaces as background characters, though this is an example of Early Installment Weirdness; most other Popeye shorts feature strictly humans.\n• 'Mazing Man: Maze's best friend/Heterosexual Life-Partner, Denton Fixx, is fully human, but has a dog face (though it makes him look like a dogface). (The Floating Head in the upper left here.)\n• There are a few Tex Avery MGM Cartoons, especially in the 1950s, that feature dogfaces.\n• They showed up a lot in Warner Bros. oneshots from the 1930s as well, many of which, such as \"Thugs With Dirty Mugs\", were directed by Tex Avery.\n• Dogfaces even show up in Walter Lantz's New Funnies comics that also feature Woody Woodpecker.\n• The original Underdog (a.k.a. Shoeshine) and Sweet Polly Purebred look like dognoses, unlike the Disney version of both characters, who are a beagle and a cocker spaniel respectively.\n• The characters in the movie Rock & Rule are all hyper evolved rats, cats and dogs which created their own civilization after humanity nuked themselves. Outside of having animal muzzles and ears, the majority of them look totally humans.\n• Adventures of Sonic the Hedgehog in sharp contrast to the other anthropomorphic animals, the character, Wes Weasley looked exactly like a human complete with a furless humanoid body and humanlike ears. The only Weasel trait of Wes was his muzzle, essentially a \"Weasel Face.\"\n• A literary example would be the Fetchers from Mister Monday.\n• The title character in Officer Pooch, an MGM Oneshot Cartoon that Bill Hanna and Joseph Barbara directed.\n• The Whos from various Dr. Seuss works (like in Horton Hears a Who!) are similar to Disney's dogfaces. They are a type of Demihuman in the animated and live-action versions of How the Grinch Stole Christmas!, though.\n• Several characters from Arthur, such as Binky Barnes.\n• Bosko the Talk-Ink Kid was eventually redesigned into one of these to mask that he was originally a racist, politically incorrect caricature of a black person.\n• Of the various Funny Animal people in Sphinx And The Cursed Mummy, the most common are dog-like people. They bear a strong resemblance to the Disney dogfaces, especially in their \"snouts.\" Given their Egyptian origins, they're probably jackal-people.\n• Both Snuffy and Old Oscar from Jay Jay the Jet Plane have a face that looks like that of a dogface due to the cover of the their propellers.\n• A majority of the characters of Sherlock Hound have this trait.\n• Leo Ortolani's peculiar style makes all of his human characters look like not dogs, but monkeys. Ths is especially evident for the protagonist of Rat-Man, who without his Rat-costume seems perpetually naked and in fact looks like a monkey rather than a human.\n• Timburr and its evolutionary family from Pokémon resemble overly muscular dog-faces.\n• Pounder (AKA Pound Hound) has a face of a Bulldog from Matchbox Hero City\n• Most of Gondoland's population in Muzzy in Gondoland with the exception of the green goblinoid Corvax and possibly the King (who looks like anthropomorphic lion, but can be considered a Dogface with mane-like hair).\n• Some Blackface style caracitured black African people in early 20th-century comics look rather like short-muzzled, black-furred dogfaces with peach or light skintone muzzles.\n• Unfortunately that may be where this trope has its roots.\n• The female-gendered tow truck in the Bonkers episode, \"Calling All Cars,\" has a face that looks like that of a dogface.\n• An alternate nickname for GIs in World War II.\n• Many of the incidental characters in Victor & Hugo. Lampshaded once when Victor made Ponsward the butler fetch a stick and Lord Hobbes-Sutclyffe responds 'Oh for Heaven's sake! Ponsward's not a dog!'\n• The titular character of Parappa The Rapper looks like a dogface with floppy ears.\n• In the Fairly OddParents episode \"Teacher's Pet,\" Crocker turned his mom into something resembling a dogface after hooking her to his Mother machine. Crocker: I hooked Mother up to Mother, but she got a little too much bloodhound.\n• Unlike most of the examples, she acts like a dog and even runs on all fours.\n• Some of the generic civvies in Sonic Underground.\n• The Clash's album Sandinista!! has liner notes formatted like a fictitious newspaper, \"The Armegideon Times\". All the illustrations in this newspaper feature cartoon dogfaces rather than humans.\n• The musicians and people on the album cover of Frank Zappa's Cruising with Ruben & the Jets all have dog noses and ears. Album cover designer Cal Schenkel did this as an Homage to Carl Barks. On the album cover of The Perfect Stranger' and Francesco Zappa another dogfaced creature is shown, wearing sunglasses.\n• The salesman in Jungle Jitters, one of the infamous Censored Eleven.\n• In a more grisly example, Osamu Tezuka's manga Ode to Kirihito features Monmow Disease, which causes the victim's head and facial features to mutate into a more canine form.\n• Star Wars: Clone Wars introduces the Nelvaanians, who are blue-grey furred dogface aliens with black manes. The males are shown to have somewhat more wolf-like faces.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/Dogfaces", "media_links": ["/pmwiki/pmwiki.php/ComicBook/DisneyDucksComicUniverse", "/pmwiki/pmwiki.php/ComicBook/DisneyDucksComicUniverse", "/pmwiki/pmwiki.php/ComicBook/MickeyMouseComicUniverse", "/pmwiki/pmwiki.php/WesternAnimation/DuckTales1987", "/pmwiki/pmwiki.php/WesternAnimation/DuckTales2017", "/pmwiki/pmwiki.php/WesternAnimation/GoofTroop", "/pmwiki/pmwiki.php/WesternAnimation/AGoofyMovie", "/pmwiki/pmwiki.php/WesternAnimation/ClassicDisneyShorts", "/pmwiki/pmwiki.php/WesternAnimation/QuackPack", "/pmwiki/pmwiki.php/WesternAnimation/Goofy", "/pmwiki/pmwiki.php/WesternAnimation/Goofy", "/pmwiki/pmwiki.php/WesternAnimation/MickeyDonaldGoofyTheThreeMusketeers", "/pmwiki/pmwiki.php/WesternAnimation/GoofTroop", "/pmwiki/pmwiki.php/WesternAnimation/AGoofyMovie", "/pmwiki/pmwiki.php/WesternAnimation/GoofTroop", "/pmwiki/pmwiki.php/Creator/Disney", "/pmwiki/pmwiki.php/Creator/Disney", "/pmwiki/pmwiki.php/WesternAnimation/AGoofyMovie", "/pmwiki/pmwiki.php/VideoGame/DuckTales", "/pmwiki/pmwiki.php/WesternAnimation/DuckTales1987", "/pmwiki/pmwiki.php/Creator/CarlBarks", "/pmwiki/pmwiki.php/Creator/DonRosa", "/pmwiki/pmwiki.php/WesternAnimation/DonaldDuck", "/pmwiki/pmwiki.php/WesternAnimation/DonaldDuck", "/pmwiki/pmwiki.php/WesternAnimation/MickeyMouse", "/pmwiki/pmwiki.php/WesternAnimation/QuackPack", "/pmwiki/pmwiki.php/WesternAnimation/ClassicDisneyShorts", "/pmwiki/pmwiki.php/WesternAnimation/MickeyMouse", "/pmwiki/pmwiki.php/WesternAnimation/DonaldDuck", "/pmwiki/pmwiki.php/WesternAnimation/MickeyMouse", "/pmwiki/pmwiki.php/WesternAnimation/ClassicDisneyShorts", "/pmwiki/pmwiki.php/WesternAnimation/MinniesBowToons", "/pmwiki/pmwiki.php/WesternAnimation/GoofTroop", "/pmwiki/pmwiki.php/WesternAnimation/AnExtremelyGoofyMovie", "/pmwiki/pmwiki.php/ComicBook/DisneyDucksComicUniverse", "/pmwiki/pmwiki.php/WesternAnimation/GoofTroop", "/pmwiki/pmwiki.php/WesternAnimation/AGoofyMovie", "/pmwiki/pmwiki.php/Creator/DonRosa", "/pmwiki/pmwiki.php/Disney/TreasurePlanet", "/pmwiki/pmwiki.php/WesternAnimation/ClassicDisneyShorts", "/pmwiki/pmwiki.php/WesternAnimation/GoofTroop", "/pmwiki/pmwiki.php/WesternAnimation/Pete", "/pmwiki/pmwiki.php/WesternAnimation/AGoofyMovie", "/pmwiki/pmwiki.php/ComicBook/MickeyMouseComicUniverse", "/pmwiki/pmwiki.php/WesternAnimation/MinniesBowToons", "/pmwiki/pmwiki.php/WesternAnimation/AmericanDragonJakeLong", "/pmwiki/pmwiki.php/VideoGame/TreasurePlanetBattleAtProcyon", "/pmwiki/pmwiki.php/ComicBook/DisneyDucksComicUniverse", "/pmwiki/pmwiki.php/WesternAnimation/MGMOneshotCartoons", "/pmwiki/pmwiki.php/WesternAnimation/DaffyDuck", "/pmwiki/pmwiki.php/WesternAnimation/PorkyPig", "/pmwiki/pmwiki.php/WesternAnimation/BettyBoop", "/pmwiki/pmwiki.php/WesternAnimation/TexAveryMGMCartoons", "/pmwiki/pmwiki.php/WesternAnimation/ThugsWithDirtyMugs", "/pmwiki/pmwiki.php/Creator/TexAvery", "/pmwiki/pmwiki.php/Creator/WalterLantz", "/pmwiki/pmwiki.php/WesternAnimation/WoodyWoodpecker", "/pmwiki/pmwiki.php/WesternAnimation/Underdog", "/pmwiki/pmwiki.php/Film/Underdog", "/pmwiki/pmwiki.php/WesternAnimation/RockAndRule", "/pmwiki/pmwiki.php/WesternAnimation/AdventuresOfSonicTheHedgehog", "/pmwiki/pmwiki.php/WesternAnimation/KeysToTheKingdom", "/pmwiki/pmwiki.php/Creator/DrSeuss", "/pmwiki/pmwiki.php/Literature/HortonHearsAWho", "/pmwiki/pmwiki.php/WesternAnimation/HowTheGrinchStoleChristmas", "/pmwiki/pmwiki.php/WesternAnimation/Arthur", "/pmwiki/pmwiki.php/WesternAnimation/SphinxAndTheCursedMummy", "/pmwiki/pmwiki.php/WesternAnimation/JayJayTheJetPlane", "/pmwiki/pmwiki.php/Anime/SherlockHound", "/pmwiki/pmwiki.php/ComicBook/Rat-Man", "/pmwiki/pmwiki.php/Franchise/Pokemon", "/pmwiki/pmwiki.php/WesternAnimation/MatchboxHeroCity", "/pmwiki/pmwiki.php/WesternAnimation/MuzzyInGondoland", "/pmwiki/pmwiki.php/WesternAnimation/Bonkers", "/pmwiki/pmwiki.php/WesternAnimation/VictorAndHugo", "/pmwiki/pmwiki.php/VideoGame/ParappaTheRapper", "/pmwiki/pmwiki.php/WesternAnimation/FairlyOddParents", "/pmwiki/pmwiki.php/WesternAnimation/SonicUnderground", "/pmwiki/pmwiki.php/Music/TheClash", "/pmwiki/pmwiki.php/Music/Sandinista", "/pmwiki/pmwiki.php/Music/FrankZappa", "/pmwiki/pmwiki.php/Music/CruisingWithRubenAndTheJets", "/pmwiki/pmwiki.php/Creator/CarlBarks", "/pmwiki/pmwiki.php/Music/ThePerfectStranger", "/pmwiki/pmwiki.php/WesternAnimation/JungleJitters", "/pmwiki/pmwiki.php/WesternAnimation/CensoredEleven", "/pmwiki/pmwiki.php/Creator/OsamuTezuka", "/pmwiki/pmwiki.php/Manga/OdeToKirihito", "/pmwiki/pmwiki.php/WesternAnimation/StarWarsCloneWars"], "non_media_links": ["/pmwiki/pmwiki.php/Main/LittleBitBeastly", "/pmwiki/pmwiki.php/Main/TropeCodifier", "/pmwiki/pmwiki.php/Main/FurIsSkin", "/pmwiki/pmwiki.php/Main/HumanlikeFootAnatomy", "/pmwiki/pmwiki.php/Main/InexplicablyTailless", "/pmwiki/pmwiki.php/Main/FurryFemaleMane", "/pmwiki/pmwiki.php/Main/FurryEarDissonance", "/pmwiki/pmwiki.php/Main/ArtMajorBiology", "/pmwiki/pmwiki.php/Main/FunnyAnimal", "/pmwiki/pmwiki.php/Main/LittleBitBeastly", "/pmwiki/pmwiki.php/Main/HumanlikeFootAnatomy", "/pmwiki/pmwiki.php/Main/OlderThanDirt", "https://en.wikipedia.org/wiki/Cynocephaly", "/pmwiki/pmwiki.php/Main/BigfootSasquatchAndYeti", "/pmwiki/pmwiki.php/Main/CartoonCreature", "/pmwiki/pmwiki.php/Main/DependingOnTheArtist", "/pmwiki/pmwiki.php/Main/ExecutiveMeddling", "/pmwiki/pmwiki.php/Main/FantasticRacism", "/pmwiki/pmwiki.php/Main/FullyDressedCartoonAnimal", "/pmwiki/pmwiki.php/Main/FunnyAnimal", "/pmwiki/pmwiki.php/Main/FurIsSkin", "/pmwiki/pmwiki.php/Main/FurryBaldness", "/pmwiki/pmwiki.php/Main/FurryDenial", "/pmwiki/pmwiki.php/Main/FurryConfusion", "/pmwiki/pmwiki.php/Main/FurryFemaleMane", "/pmwiki/pmwiki.php/Main/FurryLens", "/pmwiki/pmwiki.php/Main/FurryReminder", "/pmwiki/pmwiki.php/Main/FurryReminder", "/pmwiki/pmwiki.php/Main/HumanlikeFootAnatomy", "/pmwiki/pmwiki.php/Main/HumanoidFemaleAnimal", "/pmwiki/pmwiki.php/Main/OlderThanYouThink", "/pmwiki/pmwiki.php/Main/SpeciesSurname", "/pmwiki/pmwiki.php/Main/QuirkyMinibossSquad", "/pmwiki/pmwiki.php/UsefulNotes/TheodoreRoosevelt", "/pmwiki/pmwiki.php/Main/TheCameo", "/pmwiki/pmwiki.php/Main/CaptainErsatz", "http://disneyweirdness.blogspot.com/2010/10/excellent-idea.html", "/pmwiki/pmwiki.php/Main/FullyDressedCartoonAnimal", "/pmwiki/pmwiki.php/Main/FurIsSkin", "/pmwiki/pmwiki.php/Main/OlderThanYouThink", "/pmwiki/pmwiki.php/Main/SpeciesSurname", "/pmwiki/pmwiki.php/Main/ArtEvolution", "/pmwiki/pmwiki.php/ComicStrip/Popeye", "/pmwiki/pmwiki.php/Main/EarlyInstallmentWeirdness", "/pmwiki/pmwiki.php/Main/HeterosexualLifePartner", "/pmwiki/pmwiki.php/Main/FloatingHeadSyndrome", "http://d1466nnw0ex81e.cloudfront.net/iss/600w/482/104821/645444.jpg", "http://stanleystories.blogspot.com/2010/02/killer-not-filler-john-stanleys-woody.html", "/pmwiki/pmwiki.php/Main/AftertheEnd", "/pmwiki/pmwiki.php/Main/DemiHuman", "/pmwiki/pmwiki.php/Main/FunnyAnimal", "/pmwiki/pmwiki.php/Main/Blackface", "/pmwiki/pmwiki.php/UsefulNotes/WorldWarII", "/pmwiki/pmwiki.php/Main/Lampshaded", "/pmwiki/pmwiki.php/Main/RunningOnAllFours", "/pmwiki/pmwiki.php/Main/Homage"]}