{"title": "Irrelevant Act Opener", "content": "You're attending a musical, and you've just gotten back from Intermission. You're ready for the tension built up in the first act to be released. The orchestra starts up again, and the curtain opens...\n\nGenerally, the song is about love, food, drinking... you know, happy stuff, although there are exceptions. This type of song is very common in musicals, although it's starting to become a bit of a Discredited Trope. Typically, its purpose is to give the audience a chance to re-adjust their reality filters back into \"it is totally normal for everyone to be singing\" mode by presenting a scene where it actually would be normal for the cast to be singing; the fact that the lyrics are irrelevant to the plot also gives the people late back from the bathrooms and refreshment stands a few extra minutes to get to their seats without missing anything important. It also gives the main cast a few more minutes to prepare while the chorus entertains the audience.\n• The Music Man: The act II opener \"It's You\" isn't particularly relevant, and neither is the following song, \"Shipoopi.\" The dance to \"Shipoopi,\" where Harold shows Marian how to dance the latest one-step, is quite significant. Both numbers were moved to later scenes in the 1962 movie version.\n• The Tales of Hoffmann: Justified, the opera starts with an hymn to beer and wine... However, it's just the Muse, trying to convince Hoffmann to forsake love, and embrace drinks.\n• \"Oom Pah Pah\" from Oliver! is a drinking song. Looks like it's named after everyone's favorite thing, too. The movie version makes it less irrelevant: Nancy leads the crowd in song in order to distract Bill Sikes so she can take Oliver to London Bridge.\n• Annie opens Act Two with the orphans singing \"You're Never Fully Dressed Without a Smile\", a song they just heard on the radio. It's adorable, but it advances the plot in no way. However, the orphans do find out that Warbucks is helping Annie find her parents during the same radio broadcast.\n• The original production and 1982 film had this number make more sense, as the scene took place in the radio station where the \"Hour of Smiles\" is being broadcast, and explained exactly how Warbucks is planning to track down Annie's parents (offering a $50,000 check to whoever can prove they're the real deal). At the end, Warbucks is tricked into plugging the toothpaste that sponsors the show, and launches into a tirade; Bert Healy, the quick-thinking host, then ends the program with \"You're Never Fully Dressed.\" Halfway through the song, the scene cuts to the orphanage, and the girls sing their own version of the song. Some versions cut the radio scene entirely, and just have the orphans perform the number; while it saves time, it does make the song a lot more out of place.\n• In some versions of Meet Me in St. Louis, the housekeeper sings \"A Touch of the Irish\", a song about women-men relationships and how Irish women handle them.\n• \"One By One,\" in the Broadway version of The Lion King. Specifically noted by Word of God to allow time for a major set change.\n• \"The Farmer and the Cowman\" from Oklahoma! is really a subversion of this trope. The song is interrupted by a heated argument, then restarts and leads to An Aesop.\n• \"Masquerade\" from The Phantom of the Opera is important thematically, but doesn't really advance the plot. All the plot points are delivered in stylistic breaks from the song.\n• \"Moments of Happiness\" from CATS. It's very hard to pin down if it even has a meaning, it's surprisingly somber, and 90% of the fandom tends to ignore it.\n• Notably, it's one of three songs not based on Old Possum's Book of Practical Cats but on one of T. S. Eliot's True Art Is Incomprehensible poems, \"The Dry Salvages\" from Four Quartets. (The others are \"Memory\" and \"Grizabella the Glamour Cat\"; the first is taken from \"Preludes\" and \"Rhapsody on a Windy Night\", the latter from \"Rhapsody\" and a poem Eliot decided against including in Practical Cats.)\n• \"There Once Was a Pirate\" from Spring Awakening was originally supposed to be the first song of Act Two, but was then cut from the productions in favor of the more plot-relevant \"The Guilty Ones\".\n• Paint Your Wagon begins the second act with the irrelevant and irreverent \"Hand Me Down That Can of Beans.\" The song is followed by not one but two ballets.\n• \"A Real Nice Clambake\" from Carousel.\n• One production gave its irrelevance some dramatic weight by superimposing the following scene, in which Jigger seduces Carrie, over it in a sort of theatrical split-screen.\n• \"Too Darn Hot\" from Kiss Me Kate, where the minor characters sing about how uncomfortable the weather is... really. Averted with the film version, in that Cole Porter is a character, so he can play whatever the hell he wants.\n• The two Night Waltzes from A Little Night Music are important in setting the tone of the second act, but are sung by the Greek Chorus and don't advance the plot.\n• \"Steam Heat\" from The Pajama Game. As a castmember said: \"We show up once and do this random song. It has nothing to do with the plot and is never spoken of again.\"\n• And is arguably the single most memorable song from the whole show. One gets the feeling the writers shoved it in because it was too catchy to leave out and they wanted at least one song the audience could hum as they left the theatre.\n• \"Hernando's Hideaway\" is at least as memorable, and is actually plot-relevant, so \"Steam Heat\" must have been a \"we wrote it and it's too good not to use SOMEHOW\" number.\n• \"Everything Beautiful Happens at Night\" from 110 in the Shade. Also \"Evenin' Star\" added in the revival.\n• \"Life Is Like a Train\" from On the Twentieth Century.\n• The first song in act one of Guys and Dolls is \"Fugue for Tinhorns,\" a song about horse races. Yes, the show is about gamblers, but that's the wrong kind—the rest of the show is about craps.\n• A more traditional one happens at the start of act two, with \"Take Back Your Mink\"—one of the Hot Box numbers. (This replaced a reprise of \"A Bushel and a Peck\" during the original production's pre-Broadway run.)\n• Lampshaded in The Drowsy Chaperone. \"Message from a Nightingale\" is revealed to not be related to the titular Show Within a Show at all; it's the act two opener of another show completely. The actual act opener averts this trope, however.\n• The Broadway version of Chess opens with a children's choir singing a Hungarian folk song, which just serves as a three-minute long announcement of the setting change.\n• Some versions open the first act with \"Merano\", which similarly serves to identify the setting and nothing else relevant.\n• The London production started with \"The Story of Chess\" It hasn't been done in a professional production since, probably for monetary reasons.\n• They did it in the recently recorded In Concert album.\n• The London production also starts the second act with \"One Night in Bangkok,\" which merely serves to describe the location where the second act takes place.\n• \"I Feel Like I'm Not Out of Bed Yet\" at the beginning of On the Town. The second act starts with an irrelevant burlesque chorus of \"So Long, Baby,\" though the also irrelevant Cut Song \"The Intermission's Great\" originally preceded this. (The next number is, of all things, \"Happy Birthday to You!.\")\n• Spamalot starts with the narrator talking about England, then the curtain comes up to \"Finland!\" (\"I said England!\")\n• Porgy and Bess has two large song-and-dance numbers that function as Irrelevant Scene Openers: \"I Ain't Got No Shame\" and \"Good Mornin', Sistuh.\" This is not to mention the lengthy piano blues which opens the first act and is usually abridged so the show can proceed directly to \"Summertime.\"\n• Godspell's second act opens with a reprise of \"Learn Your Lessons Well\" before launching into Act 2 proper with \"Turn Back O Man.\" (Unless that production is smart enough to skip it.)\n• Of Thee I Sing has the scene-setting chorus \"Hello, Good Morning\" for its second act opening. Of all the show's musical numbers, this one bears the least relation to the plot.\n• The second act of RENT opens with \"Seasons of Love\", possibly the best-known song from the show, but the one with the least relevance to its plot. (Though, that said, there's a Dark Reprise of \"Seasons\" later on with the line \"how do you measure a year in the life?\" replaced with \"how do you figure a last year on earth?\", which is very relevant indeed.)\n• \"Seasons of Love\" is used in the opening to the movie as well, and that becomes somewhat relevant, since it acts as a prologue and lends some intro to the characters.\n• It also happens in opera: in the three-act version of The Flying Dutchman, the second and third acts begin with, respectively, Senta's friends singing a song about a spinning wheel, and the sailors singing a drinking song.\n• Fairly common in Opera— Gilbert and Sullivan's Utopia, Limited opens the second act with a song parodying tenors; L'elisir d'amore uses a drinking song, and so on.\n• We Will Rock You was already pretty ropily strung together, but the second act opens with \"One Vision\", possibly just to get the fried chicken line in somewhere. Given the lyrics, it may have been satirical to highlight that Killer Queen's control over the Gaga kids was slipping.\n• \"Come Follow the Band\" in Barnum, performed by a marching band as Barnum and Jenny Lind arrive in Washington, D.C. (several months after the end of Act One had them set out on a tour), has no bearing on the plot.\n• \"Ladies of the Evening\" from The Boys From Syracuse.\n• \"The Real American Folk Song\" from Crazy For You serves no purpose. Then again, most of the music in that show is purposeless.\n• Girl Crazy, the show which Crazy For You is extremely loosely based on, had a second act opening number called \"Land of the Gay Caballero,\" whose primary function was giving a Spanish dance team something to do.\n• \"Catch Me If You Can\" from Street Scene is an irrelevant comic relief number featuring a bunch of kids. The second act only gets more tragic from there.\n• City of Angels opens its second act with Jimmy Powers in a recording studio singing \"Stay With Me.\"\n• \"Never, Never be an Artist\" from Can-Can.\n• The second act of Engelbert Humperdinck's opera Hänsel und Gretel opens with Gretel's folksy song \"Ein Männlein steht im Walde,\" which bears no relation to the action.\n• \"The Overlords\" which opens act 2 of Kristina.\n• \"Who's Got the Pain?\" in Damn Yankees\n• \"The Sun Has Got His Hat On\" in the 1980s revised version of Me and My Girl.\n• \"Big Dollhouse\" from the original Broadway production of Hairspray.\n• Urinetown parodies this, of course. The verses of \"What is Urinetown?\" are pertinent to the characters, and spoken parts deliver exposition in the show's signature style. But each time a chorus comes up, the characters make more and more strangled metaphors to justify yelling \"Dance! Dance!\"\n• West Side Story's first act culminates in a violent gang fight. Act two opens with \"I Feel Pretty\". Arguably justified, as it shows how quickly Maria's happiness comes crashing down around her. Averted in the film, where the song is moved to an earlier point.\n• The film moved a few songs (and scenes) around to give a single rising line of tension throughout the movie as a whole, in contrast to the two (one for each act) in the stage play.\n• \"Cabin Fever\" in Muppet Treasure Island. A lavish show-stopping number that has no impact on the plot whatsoever, and also happens to be an Affectionate Parody of this sort of number. Even one of the characters state, \"Like to get my hands on, whoever wrote the script.\"\n• The Protomen has an Irrelevant Act Closer, in the form of Due Vendetta at the end of Act I. It's just a list of a bunch of Mega Man characters.\n• Show Boat opens its second act with \"At the Fair,\" an extended but irrelevant ensemble about the attractions of the 1893 World's Fair at Chicago.\n• The first lyric Oscar Hammerstein II wrote ever for a Broadway show (though without credit), \"Make Yourselves At Home\" from a forgotten 1917 musical called Furs And Frills, was one of these. This is more of a trivia note than an example, particularly since the song is lost.\n• \"Let's Make Believe We're In Love\" from Footloose, which takes place at a chintzy dance hall.\n• \"Opening Sequence\" (it was never given a proper name) from Top Hat\n• Amaluna, one of Cirque du Soleil's few shows to have a distinct plot to follow, has two irrelevant scenes at the beginning before the storm that jumpstarts the story: the Japanese unicycle twins, and the Icarian Games/Meteor acrobats. Ditto the teeterboard number at the beginning of Act 2, whose sole purpose is to give the shipmates more stage time.\n• The Most Happy Fella subverts it in Act II with \"Fresno Beauties,\" which is interrupted for a relevant recitative for Rosabella and Joe, and plays it straight in Act III, with a reprise of \"Abbondanza\" for the purpose of literally ushering the audience back into their seats.\n• Averted in Wicked, where 'Thank Goodness' is filled with both character development for Glinda and Fiyero and plot relevant propaganda against the Wicked Witch and even a Checkov's Gun or two.\n• In Shrek: The Musical, \"Morning Person\" recreates a funny bit from the movie, and lets Fiona tap-dance with the Pied Piper and the rats, but is otherwise irrelevant.\n• The Bridges of Madison County opens Act 2 with \"State Road 21\", a toe-tapping country fair number... that has no plot development or character insights whatsoever.\n• Three Smart Girls opens with a scene in which Penny, the youngest of the three sisters, sings a song while the three daughters are sailing on a lake. This has absolutely no relevance to the plot of the film, but it does allow Deanna Durbin to show off her soprano.\n• \"Shiny\" from Moana would count as it serves no purpose other than for Tamatoa to boast about himself. In song form! The only plot-significant moment is in the bridge between the second and third chorus, which contains the first mention of Maui's Parental Abandonment.\n• \"Poor Pirates\" from The Spongebob Musical is a protest song from Patchy the Pirate, who had been kicked out of the theater before the show started due to trying to film the show on his phone. After the song, security once again kicks him out, and the show returns to Spongebob's story.\n• The Broadway Retool of Charlie and the Chocolate Factory does this once in each act.\n• \"The Candy Man\", an import from the famous 1971 film adaptation of the source novel, opens Act One; it's sung by Willy Wonka himself as a second-person \"I Am Great!\" Song. It's Pandering to the Base of people who can't imagine a Charlie and the Chocolate Factory adaptation without Willy Wonka songs. As with \"Masquerade\" in Phantom of the Opera, anything plot-relevant is brought up in dialogue between verses. To make matters worse the very next song (\"Willy Wonka! Willy Wonka!\") is also about how amazing Willy Wonka and his candies are but also delivers Backstory, and the Act One closer \"It Must Be Believed to Be Seen\" is another \"I Am Great!\" Song for Wonka.\n• \"Strike That, Reverse It\". In the original West End version of the show, it was important in that it was Willy Wonka's second song and scene (he didn't appear onstage until the end of Act One) and the first in which he truly interacted with the other characters and revealed how quirky he was, to their befuddlement. In the retool, of course, Mr. Wonka is the very first character the audience sees and he goes on to maintain a King Incognito masquerade for most of Act One as a candy shop owner whom Charlie gets to know, so his personality is well-established by the time everybody gets to his factory. In addition, \"Strike That, Reverse It\"'s Foreshadowing of the climax (via his and Charlie's brief conversation) was eliminated with the retooling of the song, so nothing that happens in it tells the audience anything they don't already know or need to know for later.\n• Frozen (2018): \"Hygge\" is how the musical adapts Anna's visit to Oaken from the movie. Here, it starts off as Oaken peddling his wares to the audience, with the song not becoming plot relevant until Anna and Kristoff come in to get supplies about two minutes through the song, then spend the rest of the number trying to get Oaken to understand the seriousness of the situation.\n• \"Guy Love\" from the Scrubs musical episode has nothing to do with the plot, but just makes fun of Turk and J.D.'s Ho Yay.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/IrrelevantActOpener", "media_links": ["/pmwiki/pmwiki.php/Theatre/TheMusicMan", "/pmwiki/pmwiki.php/Theatre/TheTalesOfHoffmann", "/pmwiki/pmwiki.php/Theatre/Oliver", "/pmwiki/pmwiki.php/Theatre/Annie", "/pmwiki/pmwiki.php/Film/Annie1982", "/pmwiki/pmwiki.php/Theatre/TheLionKing", "/pmwiki/pmwiki.php/Theatre/Oklahoma", "/pmwiki/pmwiki.php/Theatre/ThePhantomOfTheOpera", "/pmwiki/pmwiki.php/Theatre/CATS", "/pmwiki/pmwiki.php/Literature/OldPossumsBookOfPracticalCats", "/pmwiki/pmwiki.php/Creator/TSEliot", "/pmwiki/pmwiki.php/Theatre/SpringAwakening", "/pmwiki/pmwiki.php/Theatre/PaintYourWagon", "/pmwiki/pmwiki.php/Theatre/Carousel", "/pmwiki/pmwiki.php/Theatre/KissMeKate", "/pmwiki/pmwiki.php/Theatre/ALittleNightMusic", "/pmwiki/pmwiki.php/Theatre/ThePajamaGame", "/pmwiki/pmwiki.php/Theatre/GuysAndDolls", "/pmwiki/pmwiki.php/Theatre/TheDrowsyChaperone", "/pmwiki/pmwiki.php/Theatre/Chess", "/pmwiki/pmwiki.php/Theatre/OnTheTown", "/pmwiki/pmwiki.php/Theatre/Spamalot", "/pmwiki/pmwiki.php/Theatre/PorgyAndBess", "/pmwiki/pmwiki.php/Theatre/Godspell", "/pmwiki/pmwiki.php/Theatre/OfTheeISing", "/pmwiki/pmwiki.php/Theatre/RENT", "/pmwiki/pmwiki.php/Creator/GilbertAndSullivan", "/pmwiki/pmwiki.php/Theatre/UtopiaLimited", "/pmwiki/pmwiki.php/Theatre/WeWillRockYou", "/pmwiki/pmwiki.php/Theatre/StreetScene", "/pmwiki/pmwiki.php/Theatre/CityOfAngels", "/pmwiki/pmwiki.php/Theatre/CanCan", "/pmwiki/pmwiki.php/Theatre/Hairspray", "/pmwiki/pmwiki.php/Theatre/Urinetown", "/pmwiki/pmwiki.php/Theatre/WestSideStory", "/pmwiki/pmwiki.php/Film/MuppetTreasureIsland", "/pmwiki/pmwiki.php/Music/TheProtomen", "/pmwiki/pmwiki.php/VideoGame/MegaManClassic", "/pmwiki/pmwiki.php/Theatre/ShowBoat", "/pmwiki/pmwiki.php/Film/Footloose", "/pmwiki/pmwiki.php/Film/TopHat", "/pmwiki/pmwiki.php/Creator/CirqueDuSoleil", "/pmwiki/pmwiki.php/Theatre/TheMostHappyFella", "/pmwiki/pmwiki.php/Theatre/Wicked", "/pmwiki/pmwiki.php/Theatre/ShrekTheMusical", "/pmwiki/pmwiki.php/Theatre/TheBridgesOfMadisonCounty", "/pmwiki/pmwiki.php/Film/ThreeSmartGirls", "/pmwiki/pmwiki.php/Disney/Moana", "/pmwiki/pmwiki.php/Theatre/TheSpongebobMusical", "/pmwiki/pmwiki.php/Theatre/CharlieAndTheChocolateFactory", "/pmwiki/pmwiki.php/Film/WillyWonkaAndTheChocolateFactory", "/pmwiki/pmwiki.php/Theatre/Frozen2018", "/pmwiki/pmwiki.php/Disney/Frozen", "/pmwiki/pmwiki.php/Series/Scrubs"], "non_media_links": ["/pmwiki/pmwiki.php/Main/Intermission", "/pmwiki/pmwiki.php/Main/DiscreditedTrope", "/pmwiki/pmwiki.php/Main/WordOfGod", "/pmwiki/pmwiki.php/Main/SetSwitchSong", "/pmwiki/pmwiki.php/Main/AnAesop", "/pmwiki/pmwiki.php/Main/TrueArtIsIncomprehensible", "/pmwiki/pmwiki.php/Main/AuthorAvatar", "/pmwiki/pmwiki.php/Main/GreekChorus", "/pmwiki/pmwiki.php/Main/PrettyInMink", "/pmwiki/pmwiki.php/Main/ShowWithinAShow", "/pmwiki/pmwiki.php/Main/CutSong", "/pmwiki/pmwiki.php/Main/HappyBirthdayToYou", "/pmwiki/pmwiki.php/Main/DarkReprise", "/pmwiki/pmwiki.php/Main/Opera", "/pmwiki/pmwiki.php/Main/Opera", "/pmwiki/pmwiki.php/Main/HaveAGayOldTime", "/pmwiki/pmwiki.php/Main/EngelbertHumperdinck", "/pmwiki/pmwiki.php/Main/NoFourthWall", "/pmwiki/pmwiki.php/Main/BigLippedAlligatorMoment", "/pmwiki/pmwiki.php/Main/AffectionateParody", "/pmwiki/pmwiki.php/Main/ListSong", "/pmwiki/pmwiki.php/Main/LampshadeHanging", "/pmwiki/pmwiki.php/Main/ParentalAbandonment", "/pmwiki/pmwiki.php/Main/Retool", "/pmwiki/pmwiki.php/Main/IAmGreatSong", "/pmwiki/pmwiki.php/Main/PanderingToTheBase", "/pmwiki/pmwiki.php/Main/Backstory", "/pmwiki/pmwiki.php/Main/IAmGreatSong", "/pmwiki/pmwiki.php/Main/KingIncognito", "/pmwiki/pmwiki.php/Main/Foreshadowing", "/pmwiki/pmwiki.php/Main/HoYay"]}