{"title": "The Rant", "content": "The Rant, a.k.a. News Post, is a section of text below a webcomic strip that acts as a blog for the authors — sometimes, using actual blog software. They comment on their lives, beg for forgiveness for plot holes and irregular updates, and generally fill in the blanks.\n\nThis section is called \"the rant\" because it can be (and has been) used as a soap box to orate from. It's usually used more constructively than that. The rant helps improve the cross-media feel of webcomics, often acting as an easy-to-access Universe Compendium, built up slowly beneath each strip. It also allows the comic's creators to present themselves personally to the readers and shill The Merch.\n\nAlmost all webcomickers have a rant of some kind, whether it's called a newspost, blog, or something else. If more than one person works on the comic, such as a writer and an artist, they will each have their own rant section. Occasionally, other people, such as the person who hosts the website, the person who runs the forum, or random friends of the creators will chime in as well.\n\nIn some comics, it's taken as given that you'll read the rant, with the strip itself being an utterly incomprehensible non sequitur otherwise. Almost all strips of such a comic will have some explanation or extra detail in the rant, making it important as a frame for the strip. Others rarely update their rant, and only post philosophical musings and important announcements at irregular intervals.\n\nNot to be confused with the similar but usually more overt Author Tract, nor \"The Reason You Suck\" Speech.\n• Randall Millholland of Something*Positive regularly leaves a sentence or two tag line at the bottom of his comics - sometimes they'll relate to the joke at hand, sometimes they have absolutely nothing to do with S*P and are just Randy's random thoughts. If he ever has a rant to dish out about something, or something he wants to inform his readers about, he'll usually post it just beneath the comic, if not make it a part of the comic itself.\n• Com'c has a commentary under each str'p (that can sometimes get pretty long), plus unscheduled newsposts that are occasionally posted between regular updates.\n• Integral in Saturday Morning Breakfast Cereal because it gives the author some space to explain the inevitable Schedule Slip.\n• Tycho's newsposts are such an integral part of Penny Arcade that they're on the main page instead of the comic. He has pointed out that he only started writing the posts when the page they built originally had a lot of blank space. To hear him tell it, he would have been happy with a picture of a lobster instead.\n• The Trenches, a collaboration between Penny Arcade and PvP's creators that features a group of game testers, instead features real-life stories submitted by testers and other people in the game industry in its Rant space.\n• David Morgan-Mar usually uses the Rant to either explain things in the comic that not everybody would get (often by linking to TV Tropes), make additional jokes or go into detail on the making of the comic.\n• On a related site, the comic Comments on a Postcard consists solely of broken images and fictional news posts (or, depending on which About story you read, the associated annotations of a comic whose image files have been lost for one reason or another).\n• An extreme case spends 7 pages on introductory transfinite math and then gives the Star Wars references that explains the pun.\n• This one is even longer. For an entirely black strip, no less.\n• This one features a truly epic rant... about how much Monopoly sucks.\n• Since then, the comic has ended, which put even more focus on the rant, because now we get reruns of previous comics, where the only difference is that DMM added another bit to the rant, often explaining concepts not originally explained, or talking about the process of creating the comic. Except on Sundays, where we get a new \"comic\" that's just a single picture, where the main feature is a long rant about a specific topic (often science-related).\n• Terror Island used these for various purposes ranging from the Word of God to random links the writers want to show you.\n• The rants at Sinfest (\"Notes from The Resistance\") are a series of totally inane, random musings that make no sense both in and out of the comic, which makes them great. Although originally a new one appeared rather often, it may now take many months for a new one to appear.\n• The rant of Mr Square never changes and always states: \"Disclaimer: The following was not proof read, and may have been created outside of sobriety. The artist has little recollection of what this is about.\"\n• The rant at Shortpacked! normally provides a separation of fandoms - comments on the comic go to the forums, comments on the comics theme (toy collecting) invariable end up in the LiveJournal blog. However, a lot of people will also comment on the comic itself in the blog.\n• Half the fun of is in the details that the rant highlights.\n• The rants in The B-Movie Comic are an invaluable source of information about the B-movie trope of the day, and its history.\n• Dominic Deegan used its mostly to warn about upcoming days off for cons and such, as well as adding relevant links for reminders about plot points and such.\n• Cat Nine has rants from stuff going on about the artist's life, news relating to the comic(as well as reasons why the comic is delayed). Links to the comic's vote pic/comic are also shown there.\n• Questionable Content's rants vary from music reviews to (more often than not of late) the words \"comic comic comic.\" Or, increasingly, \"Comic will be up after [insert ungodly hour] A.M. because [insert excuse here].\" As Jeph Jacques turns increasingly to Twitter and Tumblr to interact with fans, the rant is often left blank.\n• El Goonish Shive uses rants to elaborate on the current comic, including \"behind the scenes\" info and hints at future storylines. There are also frequently links to any relevant past comics, whether it's to show that a particular plot point was foreshadowed, remind the audience of a character who hasn't been seen in a while, or remind the audience the context of what's happening in the comic.\n• Misfile has commentary from the artist and his wife (who also handles the business side of the comic.\n• Sins contains lampshading of the comic's plot points and a review of whatever game, tv show, movie or whatever Pip is playing or watching at the time along with whatever sins it commits.\n• Exterminatus Now has commentary from whichever of the four authors feels like putting up comments. Unfortunately, for a comic which so laugh-out-loud ninety percent of the time, Lothar's rants formerly tended to wind up as being snipes at whatever annoyed him this post, although that hasn't been the case for years.\n• Gunnerkrigg Court's rant occasionally drops in some very handy plot background, but is mostly brief comments to the characters, as well as amusing but gentle swipes at Fan Dumb. (\"This page is a flashback. It is showing an event in the past.\") During one particularly weird and twisty-turny plotline, the \"tommentary\" simply read \"buzzz\", adding more z's with consecutive strips. When the insanity of the plotline climaxed, the post read \"bu-\". If the rant is absent, it's usually because something utterly heartbreaking is happening. (The first time this happened, it caused enough comment that he wrote \"The comments will return when the comic stops being about dead people.\")\n• For City Face the comments are over the top directors comments from \"filming\".\n• The rant is one of the main reasons to read Polk Out. It's also frequently used to figure out what's going on.\n• 's artist frequently writes a very substantial rant on his own comics, some reaching 1000 or more words. That said, he is also apparently quite happy to leave it at only 4 or 5 words\n• For Schlock Mercenary this comes in two flavors. In addition to the regularly updated fairly standard creator's blog, some comic strips have additional comments just below the comic. These are often simply humorous side notes to the ongoing story, but sometimes provides some context and/or explanation of what's going on (occasionally sidetracking into humorous side note territory), or explanations of the science behind things that appear in the comic.\n• A Miracle of Science often uses these to explain the underlying science of a strip (for example orbital mechanics and computer security ). Every strip has two pieces of commentary, one from Jon (the author) and one from Mark (the artist). Interestingly, Jon writes his commentary after seeing the finished art but before Mark writes his commentary, so Mark's commentary frequently references, or directly answers, Jon's.\n• Faulty Logic uses its rant-box as a forum for its two Author Avatars to bounce off of each other, which often provides some of the strip's funniest content. Over the course of the strip's history, Jalyss has used it to rant about half a dozen times.\n• Yahtzee's Zero Punctuation has been accompanied by a weekly column, Extra Punctuation, where Yahtzee takes a minute to flesh out points from the previous week's review Extra Punctuation is posted on Tuesday, the reviews on Wednesday \"in a format that doesn't require constant nob jokes\", as well as responding to viewer mail more punctually.\n• The news posts for Concerned, in addition to news and rants, gave insights into how the Machinima comic was made.\n• Gibson Twist's commentaries from Pictures Of You proves to sometimes be equally as entertaining as the comic itself.\n• Jesus and Mo is usually rant-free, but now and again has a link to a relevant news story. Occasionally this is phrased as a tongue-in-cheek \"thanks\" to a \"guest scriptwriter\", such as Tariq Ramadan or Karen Armstrong .\n• Brian Carroll of Instant Classic is a filmmaker and thus the majority of his rants end up being miniature articles on film and movies.\n• The news section is occasionally used to tell extra anecdotal stories on The Life of Nob T. Mouse.\n• Jukashi, author of Keychain of Creation, posts a commentary about his webcomic with each update, frequently used to explain Exalted rules that readers who don't also play the tabletop RPG might not understand. He's also very active on the comic's official forums.\n• Happle Tea strips are always accompanied by commentary from the author, which provide extra jokes and give the readers some insight on mythology.\n• Tim Krieder's The Pain -- When Will It End? does this regularly, in the form of an \"Artist's Statement\". One particularly memorable example was the cartoon he drew about Ronald Reagan's death .\n• RyanMC of Two Evil Scientists fame does this with nearly every comic, usually to explain something that might be unclear, or add in some sort of humorous remark regarding the strip's contents.\n• Captain Osaka's descriptions beneath every comic of DOUBLE K manage to be just as awesomely hammy as the comic itself, if not more.\n• The Daily Derp typically features one-liner comments from Derpy or, rarely, other characters or the author. Early on, these were always marked as \"Derpy Tips\", even if they weren't always actual advice.\n• Knights of Buena Vista includes one with each strip, usually just to give additional info, or state what the author was thinking at certain points.\n• Cucumber Quest usually has sarcastic little comments and/or author commentary below each page. When they're not there, you know that things are serious.\n• Star Power has one for both creators. Mookie tends to have a new one near once a week, usually about what's going on his life. Garth saves his for big announcements.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/TheRant?from=Main.NewsPost", "media_links": ["/pmwiki/pmwiki.php/Webcomic/PennyArcade", "/pmwiki/pmwiki.php/Webcomic/Megatokyo", "/pmwiki/pmwiki.php/Webcomic/SomethingPositive", "/pmwiki/pmwiki.php/Webcomic/Comc", "/pmwiki/pmwiki.php/Webcomic/SaturdayMorningBreakfastCereal", "/pmwiki/pmwiki.php/Webcomic/PennyArcade", "/pmwiki/pmwiki.php/Webcomic/TheTrenches", "/pmwiki/pmwiki.php/Webcomic/PvP", "/pmwiki/pmwiki.php/Webcomic/IrregularWebcomic", "/pmwiki/pmwiki.php/Webcomic/Mezzacotta", "/pmwiki/pmwiki.php/Webcomic/TerrorIsland", "/pmwiki/pmwiki.php/Webcomic/Sinfest", "/pmwiki/pmwiki.php/Webcomic/MrSquare", "/pmwiki/pmwiki.php/Webcomic/Shortpacked", "/pmwiki/pmwiki.php/Website/LiveJournal", "/pmwiki/pmwiki.php/Webcomic/TheBMovieComic", "/pmwiki/pmwiki.php/Webcomic/DominicDeegan", "/pmwiki/pmwiki.php/Webcomic/CatNine", "/pmwiki/pmwiki.php/Webcomic/QuestionableContent", "/pmwiki/pmwiki.php/Website/Twitter", "/pmwiki/pmwiki.php/Website/Tumblr", "/pmwiki/pmwiki.php/Webcomic/ElGoonishShive", "/pmwiki/pmwiki.php/Webcomic/Misfile", "/pmwiki/pmwiki.php/Webcomic/Sins", "/pmwiki/pmwiki.php/Webcomic/ExterminatusNow", "/pmwiki/pmwiki.php/Webcomic/GunnerkriggCourt", "/pmwiki/pmwiki.php/Webcomic/CityFace", "/pmwiki/pmwiki.php/Webcomic/PolkOut", "/pmwiki/pmwiki.php/Webcomic/SchlockMercenary", "/pmwiki/pmwiki.php/Webcomic/AMiracleOfScience", "/pmwiki/pmwiki.php/Webcomic/FaultyLogic", "/pmwiki/pmwiki.php/Webcomic/Concerned", "/pmwiki/pmwiki.php/Webcomic/PicturesOfYou", "/pmwiki/pmwiki.php/Webcomic/JesusAndMo", "/pmwiki/pmwiki.php/Webcomic/InstantClassic", "/pmwiki/pmwiki.php/Webcomic/TheLifeOfNobTMouse", "/pmwiki/pmwiki.php/Webcomic/KeychainOfCreation", "/pmwiki/pmwiki.php/Webcomic/Exalted", "/pmwiki/pmwiki.php/Webcomic/HappleTea", "/pmwiki/pmwiki.php/Webcomic/TwoEvilScientists", "/pmwiki/pmwiki.php/Webcomic/DoubleK", "/pmwiki/pmwiki.php/Webcomic/TheDailyDerp", "/pmwiki/pmwiki.php/Webcomic/KnightsOfBuenaVista", "/pmwiki/pmwiki.php/Webcomic/CucumberQuest", "/pmwiki/pmwiki.php/Webcomic/StarPower"], "non_media_links": ["/pmwiki/pmwiki.php/Main/ScheduleSlip", "/pmwiki/pmwiki.php/Main/FillerStrips", "/pmwiki/pmwiki.php/Main/UniverseCompendium", "/pmwiki/pmwiki.php/Main/TheMerch", "http://www.penny-arcade.com/comic/2004/04/07", "/pmwiki/pmwiki.php/Main/AuthorTract", "/pmwiki/pmwiki.php/Main/TheReasonYouSuckSpeech", "/pmwiki/pmwiki.php/Main/ScheduleSlip", "http://www.penny-arcade.com/", "/pmwiki/pmwiki.php/Wiki/TVTropes", "http://www.irregularwebcomic.net/2292.html", "http://www.irregularwebcomic.net/2175.html", "http://www.irregularwebcomic.net/2623.html", "/pmwiki/pmwiki.php/Main/WordOfGod", "http://pixelatomy.com/isotown/", "/pmwiki/pmwiki.php/Main/TheMerch", "/pmwiki/pmwiki.php/Main/DeadpanSnarker", "/pmwiki/pmwiki.php/Main/FanDumb", "/pmwiki/pmwiki.php/Main/FanNickname", "/pmwiki/pmwiki.php/Main/AnimatedActors", "http://www.jaydenandcrusader.com", "http://project-apollo.net/mos/mos094.html", "/pmwiki/pmwiki.php/Main/AuthorAvatar", "/pmwiki/pmwiki.php/WebAnimation/ZeroPunctuation", "http://www.jesusandmo.net/2009/09/24/texts/", "http://www.jesusandmo.net/2009/10/23/homo/", "http://www.thepaincomics.com/", "/pmwiki/pmwiki.php/UsefulNotes/RonaldReagan", "http://www.thepaincomics.com/weekly040609a.htm", "/pmwiki/pmwiki.php/Main/UpToEleven"]}