{"title": "Lazy Mexican", "content": "There is a stereotype of Mexicans as being lazy and taking siestas all the time. The classic image would be a Mexican character sleeping under his sombrero. More modern variations of this stereotype might involve Mexican and Chicano characters who don't care that they're on welfare. The two main reasons for this trope are a relaxed sense of time that Mexico is reputed for and the siestas.\n\nIn cartoons, the Mexican will typically (and illogically) be sleeping against a saguaro cactus, which are only found in the Sonora desert of southern Arizona in the southwestern USA and Sonora in north-west Mexico.\n\nAlthough Mexicans are the people most commonly perceived as \"lazy\" in popular culture, indeed mostly because of the siesta behavior that originated in Spain, this stereotype may apply to other Latin American countries as well as Spain, Portugal, and the USA territory of Puerto Rico. This can sometimes apply to countries on the Mediterranean and Southern Europe, not just the two on the Iberian Peninsula.\n\nEven Southerners get the lazy portrayal sometimes, because of the American South's reputation for a more relaxed sense of time than the faster sense of time that the Northeast is reputed to have. It is also usually people from the North(east) who call people from the South lazy. Also, the lazy stereotype is also common to the USA as a whole. The warmer climates in all of these areas made ceasing activities during hot afternoons necessary, at least before air conditioning became widespread.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/LazyMexican", "media_links": ["/pmwiki/pmwiki.php/ComicBook/LuckyLuke", "/pmwiki/pmwiki.php/ComicBook/LuckyLuke", "/pmwiki/pmwiki.php/Film/TheThreeStooges", "/pmwiki/pmwiki.php/Series/Seinfeld", "/pmwiki/pmwiki.php/Series/TopGear", "/pmwiki/pmwiki.php/Series/TheGeorgeLopezShow", "/pmwiki/pmwiki.php/Series/GetSmart", "/pmwiki/pmwiki.php/VideoGame/Desperados", "/pmwiki/pmwiki.php/VideoGame/SouthParkTheFracturedButWhole", "/pmwiki/pmwiki.php/WesternAnimation/FamilyGuy", "/pmwiki/pmwiki.php/WesternAnimation/TheSimpsons", "/pmwiki/pmwiki.php/Series/ElChapulinColorado", "/pmwiki/pmwiki.php/WesternAnimation/LooneyTunes", "/pmwiki/pmwiki.php/WesternAnimation/RockyAndBullwinkle", "/pmwiki/pmwiki.php/Film/TheThreeStooges", "/pmwiki/pmwiki.php/WesternAnimation/SouthPark", "/pmwiki/pmwiki.php/WesternAnimation/TUGS", "/pmwiki/pmwiki.php/WesternAnimation/ScoobyDooAndTheMonsterOfMexico", "/pmwiki/pmwiki.php/Film/ElMariachi", "/pmwiki/pmwiki.php/Series/ChappellesShow", "/pmwiki/pmwiki.php/Series/KnightRider"], "non_media_links": ["/pmwiki/pmwiki.php/Main/PoliticalCorrectnessGoneMad", "/pmwiki/pmwiki.php/Main/WordOfGod", "/pmwiki/pmwiki.php/Main/CaptainErsatz", "/pmwiki/pmwiki.php/Main/StereotypeFlip", "/pmwiki/pmwiki.php/Main/MeaningfulName", "/pmwiki/pmwiki.php/Main/Lampshaded", "/pmwiki/pmwiki.php/Main/IncrediblyLamePun", "/pmwiki/pmwiki.php/Recap/AsterixInSpain"]}