{"title": "Replacement Mooks", "content": "Goldar: Might I suggest we send down a group of Putties to attack the Rangers? They're in the open and will be easy prey. \n\nLord Zedd: (laughs evilly) Your Putties are as useless to me as you are. I have my own army of Putties, the likes of which you have never seen! Might I suggest we send down a group of Putties to attack the Rangers? They're in the open and will be easy prey.(laughs evilly) Your Putties are as useless to me as you are. I have my own army of Putties, the likes of which you have never seen!\n\nIn this trope, a villain replaces older or more familiar Mooks with new ones, usually because the older ones failed or are no longer useful.\n\nOur Big Bad may have been defeated last time, but they ain't stupid. It seems that all of the weak, pathetic mooks the hero(es) barged right through last time have been replaced. Possibly, by something much worse.\n\nThis typically happens in series which retain a recurring villain who, after failing in their plans the last time, has seen fit to replace their forces with newer enemies for the hero, whether in part or in whole. A variation is that a new Big Bad comes with their own, more powerful forces. Another variation is for the Elite Mooks or Giant Mooks from the previous iteration to now to be the standard Mooks. This is usually because the villain is attempting to learn from his or her mistakes during the previous altercation—after all, if something doesn't work once, why try it again? New enemies could catch the heroes off-guard, or make it much more difficult to adjust. Or, the villain might just want to send a message about what happens when his minions aren't up to task.\n\nThe inversion to this is Mook Carryover, whereas a new Big Bad uses the same Mooks or Elite Mooks as the previous one.\n• Done as one of Robotnik's schemes in Sonic the Comic, where he basically exploits Sonic taking the games' difficulty curve for granted by transposing some of his more advanced badniks from a Sonic CD level into the Green Hill Zone.\n• The Matrix Reloaded. After the failure of the Smith-model Agents in The Matrix, the Machines come out with improved Agents (which Neo calls \"upgrades\" when he first meets them), though Neo still knocks them out in short order.\n• The Incredibles centers around this trope, as the villain tests his robots against superheroes in order to improve them.\n• Terminator: Every Terminator starts as this. The first one introduced, the T-800, was a replacement for the T-600. In the next film, the T-1000 replaced the T-800. Then, the T-X replaced the T-1000. Justified, because they're machines and SkyNet is just upgrading.\n• In the Star Wars prequels, the Trade Federation replaces its rather laughable battle droids from the first film with more advanced Super Battle Droids with a more menacing, dehumanised silhouette. One of them can be seen knocking the earlier models aside to get at the Jedi enemy in Attack of the Clones.\n• A realistic version of this shows up in A Song of Ice and Fire. When civil war wracks the Kingdom of Westeros during a Succession Crisis, the Kingsguard (bodyguards for the royal family) suffer several losses. When Jaime Lannister finally makes it back to the capital to take command, he's horrified and infuriated to find that he has two dependable knights left in the Kingsguard, while most of the other new members are political appointments, second raters, or amoral mercenaries.\n• Kamen Rider: When Rider 1 returns with an upgrade in episode 53 the entire series does as well. The Shocker grunts remove the useless rankings (the red grunts had a higher rank than the black ones, they were beat up all the same) and replaces them with it's most remembered outfit, which is black with a skull pattern. It doesn't do much difference. Later, in the series, Gel-Shocker appears with much more flamboyant mooks, in ther first episode they actually catch the heroes by surprise and give them a lot of trouble. By the next episode, though, they are back to being easily defeated.\n• Power Rangers: MMPR season two saw Rita's Putty Patrollers replaced by Lord Zedd's Z-Putties, who were in turn replaced with Rito's Tengas in season three. Then the Machine Empire marched into their territory with the Cogs. This doesn't apply as much post \"Space\", as each year is now an entirely different story set in the same world, but some villains will introduce elite versions of their own grunts, eg Kelzacks becoming Kelzack Furies.\n• In Justified, Boyd ends up pulling this trick against some his former Neo Nazi friends. When they think Boyd is hopelessly outnumbered, he introduces his own new crew...\n• In Breaking Bad, Gus kills Victor because Victor was spotted at the scene of Gale's murder by witnesses. Victor is replaced by another henchman, Tyrus Kitt.\n• In the Mass Effect series, the villainous use the robotic geth as their primary mooks in the first game. While they're still active in the sequel, their role as the primary mooks are taken up by the insectoid Collectors, who are abandoned to die at the end of THAT game .\n• In the third game, the new primary mooks are Husks, reanimated corpses of various species jammed full of cybernetics. They were around in the previous games as simple cannon fodder, but they now come in a variety of forms with various abilities. For example, Marauders (turian husks) can use guns and infantry tactics, Banshees (asari husks) can fly, throw out biotic attacks, and put barriers around allies, and Ravagers (rachni husks) have cannons built into their backs. However, the have also managed to strengthen their geth forces by taking control of the anti-Reaper geth majority , and have successfully indoctrinated even as it tries to do the same to them.\n• In Halo, the High Prophets of the Covenant replace the Elites with the Brutes in the second half of Halo 2, which continues into Halo 3. The Hierarchs claim it's because the Elites had failed to stop the Master Chief, but it's revealed that the Prophets were actually just concerned about the Elites' loyalty, and were looking for any excuse to get rid of them. The resulting civil war cripples the Covenent at a critical point.\n• When you beat Super Mario Bros. once and start a new game immediately afterward, all Goombas are replaced by Buzzy Beetles.\n• It happens frequently on Metroidvania style games, most likely after defeating an important boss, unlocking a new zone or obtaining a power-up.\n• In Paper Mario: The Thousand-Year Door, eventually the goombas and other basic enemies in the Rogueport Sewers are replaced by more threatening Koopatrols, Hammer Bros., and Magikoopas.\n• In Red Faction, you fight the Ultor Corporation's security guards for most of the game. After you kill Capek, Ultor sends in mercenaries, who replace the security guards as your main enemy for the rest of the game.\n• In Area 51 (FPS), you start off fighting hordes of mutants. Then, after you gain your mutant powers, you start fighting the Illuminati Dark Ops, as well and more advanced mutants.\n• In Half-Life 2, you start off fighting Civil Protection, the Combine's police force. Later, you fight Overwatch, the Combine's military force.\n• Grunts are eventually replaced by 1337 agents as the basic Mooks of the A.A.H.W. in Madness Combat.\n• In The Order of the Stick, Big Bad Xykon gets his goblin forces routed by the heroes during the first arc. Soon after, he finds an army of hobgoblins which numbers in the tens of thousands.\n• In Teen Titans season 3, Brother Blood's human mooks prove ineffective against the heroes, so he replaces them for the season finale with mecha mooks adapted from Cyborg's technology- which prove to be some of the toughest mooks in the whole show.\n• It seems like every season of the '80s-'90s Teenage Mutant Ninja Turtles cartoon has an episode like this, with Shredder and Krang replacing Bebop and Rocksteady, only for the replacements to be de-mutated, destroyed, or do a Heel\u0096Face Turn, forcing the baddies to re-employ Bebop and Rocksteady.\n• Eventually Shredder and Krang themselves were replaced by Dregg. For his first season on the show, he used Insect like creatures called the Techno Gang. Next season he used a race of batlike creatures as his mooks.\n• In the later episodes of ThunderCats (1985), Mumm-Ra eventually phased out the Mutants in favor of the more powerful (and more treacherous) Lunataks. This didn't really make things more difficult for the Thundercats in the long run, since the Lunataks were prone to in-fighting and following their own personal agendas.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/ReplacementMooks", "media_links": ["/pmwiki/pmwiki.php/Series/MightyMorphinPowerRangers", "/pmwiki/pmwiki.php/ComicBook/SonicTheComic", "/pmwiki/pmwiki.php/VideoGame/SonicCD", "/pmwiki/pmwiki.php/Film/TheMatrixReloaded", "/pmwiki/pmwiki.php/Film/TheMatrix", "/pmwiki/pmwiki.php/WesternAnimation/TheIncredibles", "/pmwiki/pmwiki.php/Franchise/Terminator", "/pmwiki/pmwiki.php/Film/TheTerminator", "/pmwiki/pmwiki.php/Film/Terminator2JudgmentDay", "/pmwiki/pmwiki.php/Film/Terminator3RiseOfTheMachines", "/pmwiki/pmwiki.php/Franchise/StarWars", "/pmwiki/pmwiki.php/Film/AttackOfTheClones", "/pmwiki/pmwiki.php/Literature/ASongOfIceAndFire", "/pmwiki/pmwiki.php/Series/KamenRider", "/pmwiki/pmwiki.php/Franchise/PowerRangers", "/pmwiki/pmwiki.php/Series/PowerRangersNinjaStorm", "/pmwiki/pmwiki.php/Series/Justified", "/pmwiki/pmwiki.php/Series/BreakingBad", "/pmwiki/pmwiki.php/Franchise/MassEffect", "/pmwiki/pmwiki.php/Franchise/Halo", "/pmwiki/pmwiki.php/VideoGame/Halo2", "/pmwiki/pmwiki.php/VideoGame/Halo3", "/pmwiki/pmwiki.php/VideoGame/PaperMarioTheThousandYearDoor", "/pmwiki/pmwiki.php/VideoGame/RedFaction", "/pmwiki/pmwiki.php/VideoGame/Area51FPS", "/pmwiki/pmwiki.php/VideoGame/HalfLife2", "/pmwiki/pmwiki.php/Webcomic/TheOrderOfTheStick", "/pmwiki/pmwiki.php/WesternAnimation/TeenTitans", "/pmwiki/pmwiki.php/WesternAnimation/TeenageMutantNinjaTurtles1987", "/pmwiki/pmwiki.php/WesternAnimation/Thundercats"], "non_media_links": ["/pmwiki/pmwiki.php/Main/Mook", "/pmwiki/pmwiki.php/Main/YouHaveFailedMe", "/pmwiki/pmwiki.php/Main/YouHaveOutlivedYourUsefulness", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/MagnificentBastard", "/pmwiki/pmwiki.php/Main/SortingAlgorithmOfEvil", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/EliteMooks", "/pmwiki/pmwiki.php/Main/GiantMook", "/pmwiki/pmwiki.php/Main/YouHaveFailedMe", "/pmwiki/pmwiki.php/Main/MookCarryover", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/Mooks", "/pmwiki/pmwiki.php/Main/EliteMooks", "/pmwiki/pmwiki.php/Main/ComicBook", "/pmwiki/pmwiki.php/Main/GreenHillZone", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/JustifiedTrope", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/SuccessionCrisis", "/pmwiki/pmwiki.php/Main/LiveActionTV", "/pmwiki/pmwiki.php/Main/EliteMooks", "/pmwiki/pmwiki.php/Main/Videogames", "/pmwiki/pmwiki.php/Main/BrainwashedAndCrazy", "/pmwiki/pmwiki.php/Main/NGOSuperpower", "/pmwiki/pmwiki.php/Main/SuperMarioBros", "/pmwiki/pmwiki.php/Main/Metroidvania", "/pmwiki/pmwiki.php/Main/TheGoomba", "/pmwiki/pmwiki.php/Main/HeavilyArmoredMook", "/pmwiki/pmwiki.php/Main/DiscOneFinalBoss", "/pmwiki/pmwiki.php/Main/PrivateMilitaryCompany", "/pmwiki/pmwiki.php/Main/DarkOps", "/pmwiki/pmwiki.php/Main/WebAnimation", "/pmwiki/pmwiki.php/Main/TheMenInBlack", "/pmwiki/pmwiki.php/Main/Mooks", "/pmwiki/pmwiki.php/WebAnimation/MadnessCombat", "/pmwiki/pmwiki.php/Main/WebComics", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/HeelFaceTurn", "/pmwiki/pmwiki.php/Main/StatusQuoIsGod"]}