{"title": "Neurosis Commercialis", "content": "They mean well, poor souls, and they dress neatly and keep a cheery smile, but they must have been shortchanged in the smarts department because all they care about in this life is how white their whites get. At night they have surrealistic dreams in which their towels come out whiter and whiter and whiter until the whole laundry room is filled with dazzling metaphysical sunlight, and (at last!) their towels are clean and their sins forgiven.\n\nCharacters in commercials are obsessed about the product, and think about nothing else but the product. Their work and family are nothing but mere window dressing for their obsession with Product X. An entire series of a certain company's commercials never show these people doing anything normal. In office situations, you begin to wonder what sort of work gets done in these offices, and how they can have the time when they're talking about bowel irregularity and male enhancement all day. Teenagers take their girlfriends on a date to a fast-food place like McDonalds and none of them ever complain. Epic family quarrels arise from discarding unused cell phone minutes.\n\nCompare with The Power of Cheese.\n• Those commercials where the kids wreck the car into the garage and the dad is more upset about the cell phone bill.\n• A woman is so obsessed about making people think she didn't get Glade candles that she takes the labels off and lies to her friends about them.\n• A certain contraceptive commercial involves a group of women that get together to talk about said product and how it \"makes your skin look better,\" and normal communication is thrown in at the end as an afterthought. \"Are we ever going to eat!\"\n• Those people on the Cialis commercials that sit in two separate bath tubs. Forever.\n• Lampshaded by a later Cialis ad campaign, which asks \"When will we get out of those bathtubs?\" Cue variations on \"when the time is right.\"\n• \"Ah, but why leave when I'm just starting to enjoy it?\"\n• <Insert-City-Here>helpwanted.com's There's a whole group of these sites owned by the same company; Kansas City Help Wanted Bakersfield Help Wanted , etc. radio commercials feature a \"boss\" who tells his secretary, \"Mrs. Norbit\", to get new employees for the company. While he apparently eats (he puts four donut balls in his mouth), the only thing he discusses with Mrs. Norbit is hiring new employees. Considering how long the commercials have run, his company should be so full of employees that they need to start firing them to compensate for the tremendous amount of dead weight on the budget. You never get to find out what they actually do there.\n• SafeAuto's mascot speculates that all the people in a coffee shop are simultaneously using their computers to switch insurance providers online.\n• The kids who are so obsessed with trash bags they start their own home television network, \"Glad TV.\"\n• The families who love Chips Ahoy so much they have football games and water fights to determine who gets them.\n• A radio ad for the site doublemyspeed.com has everyone who's used the site being able to say nothing other than the site's name at double speed, and the boy in one of these families apparently goes around the neighborhood all day proselytizing about it. This is for a site that's supposed to do nothing more than remove malware/viruses from your computer.\n• In The Jack Benny Program on radio, Mr Wilson was completely enamored of Jello. And later, the Sportsman Quartet would sing rhapsodies to Lucky Strikes.\n• On Fibber McGee and Molly, Mr. Wilcox did nothing but extol the virtues of Johnson's Glo Coat floor wax.\n• Parodied and played for laughs by an advertisement for Trident Layers gum, in which a slightly-eerie Stepford Smiler family is thrilled that their patriarch is now getting paid in gum. A chimney sweep even pops out of the fireplace to share their joy, and the camera pans to show a disappointed-looking electrician complaining that he never gets paid in gum.\n• The commercial hook itself is parodied in a later ad which depicts a man as being ecstatic that his new job pays him in Trident Layers, but his family doesn't share his deranged psychosis and is worried about how they're going to pay the bills.\n• Decades ago, Swedish coffee brand Gevalia used to have commercials with the Gevalia family. They talked about nothing but coffee, and seemed to like it that way. The plot of the commercials would be like this one: Before the father leaves for work, he is told not to forget to buy coffee. The mom thinks that she'd better buy some while she's out, since the father probably will forget. Everybody else in the family thinks so as well, and once they get home they realize that not only did everybody buy coffee just to be sure — the dad actually remembered to buy coffee! What a laugh!\n• And now Gevalia has a new mascot: a handsome man who apparently comes out of nowhere to replace worn-out ladies' \"cup of Joe\" with \"a cup of Johan,\" and give them a moment to enjoy the luxury of the coffee.\n• Wendy's has a red-headed lady into their advertisements who seems to think about nothing but the fast-food restaurant (and yet somehow maintains a trim figure). It's gotten so bad she can't get through deciding which movie to watch with her friends without deciding to go to Wendy's instead.\n• Turned Up to Eleven and Played for Laughs on Ned & Stacey: Wife: I tried a different brand tonight. Hope you don't mind. Ned Dorsey: Mind?! Of course I mind, damnit! I want Family Goodness Biscuits! Get out of here, you wrong biscuit buying slut!\n• Activia commercials where women apparently have get-togethers for the sole purpose of talking about yogurt (and their bowel movements).\n• An Applejacks commercial has a bunch of kids take a photo of themselves when they're eating breakfast. On the bottom of the picture, they write \"Applejacks '94.\" Apparently, these kids are defined by their breakfast cereal.\n• A series of ads by Progressive auto insurance put their spokeswoman, Flo, in everyday situations with her family (all played by the same actress). Flo is apparently so obsessed with her work, she plugs it into every mundane conversation.\n• A series of SpongeBob SquarePants commercials were made for the show's tenth anniversary that talked about how SpongeBob improved people's lives. In one, a family staying at a hotel comes in with SpongeBob-themed luggage. It turns out that the bellhops also watch the show, and they fight over who is going to get to bring the family's luggage to the room.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/NeurosisCommercialis", "media_links": ["/pmwiki/pmwiki.php/Creator/RogerEbert", "/pmwiki/pmwiki.php/Franchise/TheHitchhikersGuideToTheGalaxy", "/pmwiki/pmwiki.php/Radio/TheJackBennyProgram", "/pmwiki/pmwiki.php/Radio/FibberMcGeeAndMolly", "/pmwiki/pmwiki.php/Series/NedAndStacey", "/pmwiki/pmwiki.php/WesternAnimation/SpongeBobSquarePants"], "non_media_links": ["/pmwiki/pmwiki.php/Main/ThePowerOfCheese", "/pmwiki/pmwiki.php/Main/OffscreenInertia", "/pmwiki/pmwiki.php/Main/LampshadeHanging", "/pmwiki/pmwiki.php/Main/KansasCityHelpWanted", "/pmwiki/pmwiki.php/Main/BakersfieldHelpWanted", "/pmwiki/pmwiki.php/Main/StepfordSmiler", "https://www.youtube.com/watch?v=W6VyCFNBBVc", "/pmwiki/pmwiki.php/Main/FridgeLogic", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Main/PlayedForLaughs", "/pmwiki/pmwiki.php/Advertising/Progressive"]}