{"title": "I Never", "content": "\"I Never...\" or \"Never Have I Ever...\" is a Drinking Game played frequently by college students.\n\nThe premise is simple: Everyone has a drink. Going around in a circle, players begin, \"I never...\" and finish the statement with an action or behavior. Everyone who has done so must drink.\n\nIn Real Life, this is a way for friends to get to know each other better, although it has a tendency to turn nasty, becoming spiteful and a way to embarrass \"friends.\" It is also probable that someone will be playing only to learn new gossip about the other players. They will probably react badly if called on this.\n\nIt is also sometimes known as \"ten fingers,\" because it can be played by putting down a finger instead of taking a drink, if you're in a setting where alcohol is unavailable. It gets raunchy.\n\nIn fiction, it's just mild teasing, and it's great for character exposition.\n• This Knights of the Old Republic fanfic.\n• This Lucky Star fanfic, using candy instead of alcohol.\n• Hetalia fanfic It's a Small World After All's sequel, It's Raining Women, has one here.\n• Shows up frequently in the MLP:FiM loops, mostly to allude to or reference NoodleIncidents involving loops we don't see. One memorable occasion involves Discord getting out of a turn by using a paradox: Discord: Never have I ever caused someone to drink in 'Never Have I Ever'. *Everyone reaches for their drinks before working it out.* Applejack: So, if'n we drink...That mean he's lyin', an' we don't drink? Twilight: New rule: paradoxical statements are not valid turns.\n• Played in the Miraculous Ladybug fic Porte-Boner during the party at Adrien's house, spanning multiple chapters. Probably the funniest part of the game is when Marinette unexpectedly gets the entire room to admit to having had at least one sexual fantasy involving an Akuma, much to her shock.\n• Taken to hilarious extremes in where, no matter what activity is named, at least one person has performed it.\n• In a group of Gryffindors and Slytherins plays it.\n• In Us Against the World most of the Gryffindor eighth-years play it.\n• Service With A Smile: In chapter 24, after the twins and Neo take Jaune and Pyrrha to the club's private room, they engage in a few rounds of this. We learn in short order that Jaune's been caught masturbating (he has seven sisters, he has no privacy), Miltia has publicly exposed herself (she got woken up for an emergency and stumbled out without putting her clothes on properly), Jaune has never made out with a girl (Miltia happily corrects that one), and Pyrrha has never made out with a boy (Pyrrha happily corrects that one using Jaune).\n• In Tim nearly passes out while playing it on his bachelor night because being bisexual means there isn't much that he hasn't done.\n• Appears (unsurprisingly) in Beerfest, where we find out that tough-guy Landfill made out with a (presumably male) coach at the local high school .\n• Appears in American Reunion, where Oz's girlfriend Mia admits to having had an orgy and sex in public, much to the dismay of Oz's ex Heather, who is also playing.\n• In The Boat That Rocked, the lesbian cook of the ship (the only woman on board) says, \"I've never had sex with a man.\" One crew member sheepishly swigs.\n• Features in Loving Annabelle. Annabelle uses it to come out.\n• At one point in Unfriended, the protagonists play this, but as Laura points out, \"the loser doesn't drink, the loser dies\".\n• Sawyer and Kate play \"I Never...\" on Lost. The scene establishes that each has killed a man and that Kate has been married.\n• On Brooklyn Nine-Nine, the girls try to play it at Amy's bachelorette party, but Amy ends up not drinking throughout the entire game.\n• \"I Never...\" was played on an episode of Medium where it became a clue that a man was possessed by his murderer ancestor. He was playing with his girlfriend and she asked whether he had dreamt of menstrual blood running down a virgin's leg and then slitting her throat. He had to take a drink.\n• There was one episode of Frasier wherein the characters played a version called \"I'm the Dullest Person\" during a blackout, using pennies. Roz: Well at least pick a game someone else has has a chance of winning.\n• We then find out that Roz has had sex in a phone booth, in an elevator, on a plane, and on a merry go round. Roz: I was in College, I was trying to find myself. \n\nNiles: Well maybe you should have checked underneat the nearest man.\n• An episode in the first season of Veronica Mars had flashbacks featuring the main character and her former friends ditching going to homecoming and drinking champagne in a limo while playing \"I Never.\"\n• Mentioned on an episode of How I Met Your Mother. Lily thinks the worst thing about having only had one sexual partner is not being able to play this game (not that she's inexperienced, she just doesn't want people to know all the weird stuff she lets Marshall do to her).\n• Played in a bar on Fastlane between Van Ray, Deaqon Hayes and Simone.\n• Used in The L Word episode \"Lifecycle.\" The question of whether anyone playing has ever cheated on anyone ends up causing a serious mess.\n• In the series finale of ER a girl shows up in an alcohol-induced coma after \"winning\" a game that was actually supervised by another girl's parents.\n• Done by the Greek ZBZ's (without drinking), and ends up with a fight between Casey and Frannie.\n• Discussed on Top Gear during a news segment, in which Clarkson notes that an easy turn for a guy is to say \"I've never used a tampon\". Hammond notes this for future reference, but May says he has used one (for \"you know, spillage\") then goes on with an innuendo-laden discussion of two legitimate uses a man might find for a tampon. Given that all three hosts did use tampons in the Bolivia special (to help seal their cars for a river crossing), this becomes Hilarious in Hindsight.\n• In Game of Thrones, Tyrion, Bronn, and Shae play a similar game where they ask each other questions about their pasts. Despite his confidence that he will win, Tyrion ends up revealing more than his companions.\n• The staff of Cloud Nine in Superstore play this game with each other after they get Locked in a Room.\n• On The Big Bang Theory episode \"The Big Bear Percipitaiton\", Leonard, Sheldon, Amy and Penny play \"Never have I ever...\" to pass the time at a cabin while it's raining outside. It leads to a spat between Leonard and Penny when it's revealed that Leonard keeps a secret money account. We also learned that Sheldon was arrested for jaywalking (or rather, for harassing an officer for not arresting him for jaywalking) and that Amy once pushed all the buttons on an elevator. (\"Everyone has a past.\")\n• In the 7 Yüz episode \"Büyük Günahlar\", a game of \"never have I ever\" at a New Year's Eve party provides the frame through which Mete relates his story.\n• Happy Days: Fonzie is invited to a socialite's dinner party but only for the purpose of making fun of him. When Fonzie catches on, he leaves but not before he dresses down his hostess. She huffs \"Well, I never!\" To which the Fonz replies, \"Yeah, maybe that's your problem!\"\n• In The Witcher 3: Wild Hunt, Geralt, Eskel, and Lambert can engage in a round of \"I Never\" during their drunken night in. The \"I Never\"s are predictably saucy, including sleeping with a succubus and taking fisstech as one of Geralt's possible choices, to both of which Eskel drinks, prompting Lambert to quip that still waters run deep. If Geralt chooses the other possible dialogue option in the game, Lambert reveals himself as having slept with his best friend's wife.\n• The webcomic Bohemials (the sequel to Albion Fuzz) featured dialogue clearly from a game of I Never in the background of an early strip .\n• The Alt Text from this xkcd comic.\n• In an El Goonish Shive storyline in which Ellen and Nanase are among the few guests at a college party not drinking, there's a montage of scenes that drive them upstairs to play video games. One of them is some of the college kids playing I Never and lamenting that not enough of them have actually done things.\n• Another non-alcoholic version of \"I Never...\" occurs in the lonelygirl15 episode \"Backyard Bikini Patrol\". The point was obviously not to get drunk (they were playing with M&M's), but to learn \"something juicy\" about the participants. Served as a means of delivering exposition because we found out how different the lives of trait positives were from those of normal girls.\n• On Family Guy, the guys play this on a boating trip. Quagmire ends up taking a drink for everything the other characters think of, and eventually they're actively trying to come up with something he hasn't done, getting progressively more ridiculous (for some reason, it never occurs to them to say something non-sexual, nor is it ever shown to be Quagmire's turn to say \"I never\"). It doesn't work, and he ends up passing out. Peter: God, let's see, what else is there, um... I never gave a reach-around to a spider monkey while reciting the Pledge of Allegiance. \n\nQuagmire: Oh, God. \n\n(Quagmire takes a drink.)", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/INever", "media_links": ["/pmwiki/pmwiki.php/VideoGame/KnightsOfTheOldRepublic", "/pmwiki/pmwiki.php/Manga/LuckyStar", "/pmwiki/pmwiki.php/Manga/AxisPowersHetalia", "/pmwiki/pmwiki.php/Series/Highlander", "/pmwiki/pmwiki.php/WesternAnimation/MyLittlePonyFriendshipIsMagic", "/pmwiki/pmwiki.php/WesternAnimation/MiraculousLadybug", "/pmwiki/pmwiki.php/Film/Beerfest", "/pmwiki/pmwiki.php/Film/AmericanPie", "/pmwiki/pmwiki.php/Film/TheBoatThatRocked", "/pmwiki/pmwiki.php/Film/LovingAnnabelle", "/pmwiki/pmwiki.php/Film/Unfriended", "/pmwiki/pmwiki.php/Series/Lost", "/pmwiki/pmwiki.php/Series/BrooklynNineNine", "/pmwiki/pmwiki.php/Series/Medium", "/pmwiki/pmwiki.php/Series/Frasier", "/pmwiki/pmwiki.php/Series/VeronicaMars", "/pmwiki/pmwiki.php/Series/HowIMetYourMother", "/pmwiki/pmwiki.php/Series/Fastlane", "/pmwiki/pmwiki.php/Series/TheLWord", "/pmwiki/pmwiki.php/Series/ER", "/pmwiki/pmwiki.php/Series/Greek", "/pmwiki/pmwiki.php/Series/TopGear", "/pmwiki/pmwiki.php/Series/GameOfThrones", "/pmwiki/pmwiki.php/Series/Superstore", "/pmwiki/pmwiki.php/Series/TheBigBangTheory", "/pmwiki/pmwiki.php/Series/YediYuz", "/pmwiki/pmwiki.php/Series/HappyDays", "/pmwiki/pmwiki.php/VideoGame/TheWitcher3WildHunt", "/pmwiki/pmwiki.php/Webcomic/Xkcd", "/pmwiki/pmwiki.php/Webcomic/ElGoonishShive", "/pmwiki/pmwiki.php/WesternAnimation/FamilyGuy"], "non_media_links": ["/pmwiki/pmwiki.php/Main/DrinkingGame", "/pmwiki/pmwiki.php/Main/RealLife", "http://kotorfanmedia.net/node/3158", "http://www.fanfiction.net/s/5029771/15/A_Cluster_of_Stars", "/pmwiki/pmwiki.php/Fanfic/ItsASmallWorldAfterAll", "http://www.fanfiction.net/s/6955412/9/Its_Raining_Women", "http://www.fanfiction.net/s/5432365/1/Never-Ever", "/pmwiki/pmwiki.php/Fanfic/TheInfiniteLoops", "/pmwiki/pmwiki.php/Main/NoodleIncident", "https://www.fanfiction.net/s/2615234/1/I-Never", "http://archiveofourown.org/works/9501449/chapters/21582914", "https://www.fanfiction.net/s/10509651/1/Us-Against-The-World", "/pmwiki/pmwiki.php/FanFic/ServiceWithASmile", "https://www.fanfiction.net/s/12089693/32/The-Last-Straw", "/pmwiki/pmwiki.php/Main/PlayedForDrama", "/pmwiki/pmwiki.php/Main/DeadlyGame", "/pmwiki/pmwiki.php/Main/ReallyGetsAround", "/pmwiki/pmwiki.php/Main/Flashback", "/pmwiki/pmwiki.php/Main/NeatFreak", "/pmwiki/pmwiki.php/Main/HilariousInHindsight", "/pmwiki/pmwiki.php/Main/LockedInARoom", "/pmwiki/pmwiki.php/Main/PokeThePoodle", "/pmwiki/pmwiki.php/Main/NiceGuy", "/pmwiki/pmwiki.php/Main/JerkWithAHeartOfGold", "/pmwiki/pmwiki.php/Main/HiddenDepths", "/pmwiki/pmwiki.php/Main/INever", "http://www.hirezfox.com/jimrob/afbh/bohemials/bh01.html", "/pmwiki/pmwiki.php/Main/AltText", "http://xkcd.com/565/", "http://www.egscomics.com/index.php?id=1637", "/pmwiki/pmwiki.php/WebVideo/Lonelygirl15", "/pmwiki/pmwiki.php/Main/RuleOfFunny", "/pmwiki/pmwiki.php/Main/ButtMonkey"]}