{"title": "The Musical Musical", "content": "An inordinate number of musicals are about professional singers and dancers, who are themselves sometimes performing in musicals. The advantages are obvious — the creators get to write what they know, the characters actually have a good reason to keep breaking into song (this doesn't mean that they don't still break into song off stage as well), and musical numbers can be thrown in without needing any kind of plot relevance.\n\nCompare with Most Writers Are Writers, Set Behind the Scenes, and Show Within a Show. See also That Reminds Me of a Song.\n• All musical biopics, of course — Walk the Line (Johnny Cash), Ray (Ray Charles), La Vie en Rose (Edith Piaf), Great Balls of Fire! (Jerry Lee Lewis), Yankee Doodle Dandy and George M (George M. Cohan), Jersey Boys (Frankie Valli and the Four Seasons) and so on, and so forth.\n• The Broadway Melody (1929) is probably the first example, or one of the first. Two sisters with a song-and-dance act come to Broadway to make it big.\n• Singin' in the Rain is about the making of a musical motion picture.\n• Many other Gene Kelly films, including For Me And My Gal and Summer Stock (both of which also starred Judy Garland). A lot of Garland's own films were like this (Easter Parade, Strike Up The Band, A Star Is Born) along with Fred Astaire.\n• Gene Kelly also made his film debut (For Me And My Gal) after being discovered performing in Pal Joey on Broadway.\n• The musical version of Hairspray is about the stars of a dance-oriented TV show.\n• Hunky Dory is a film about students performing a glam rock musical version of The Tempest.\n• Billy Elliot is about a boy who wants to be a dancer; the original was a film, but this trope applies to the musical adaptation.\n• The Band Wagon is about the staging of a musical.\n• Baz Luhrman's Moulin Rouge! is about a show being put on in the club-turned-theater.\n• The Sound of Music is about a family singing act.\n• West Point Story is about a musical show being put on at West Point.\n• In Top Hat, Fred Astaire plays a song-and-dance man. There's also Easter Parade (with Judy Garland and Ann Miller) and Blue Skies (also starring Bing Crosby). Also The Gay Divorcee, and The Barkleys of Broadway, which featured Ginger Rogers.\n• Once is about a busker.\n• The Commitments is about a working-class Irish band.\n• Every High School Musical film is about the staging of a high school musical.\n• Not the second, though it is about a talent contest that many of the cast members are planning to sing at.\n• Even better, the first two films have stage adaptations.\n• Most Busby Berkeley musicals use this trope.\n• 42nd Street is a musical about Peggy Sawyer and her having to learn all the dance steps, songs and lines in the In-Musical production The Pretty Lady in a night after accidentally breaking the leg of the intended leading woman, Dorothy Brock.\n• In Footlight Parade, James Cagney has to impress some skeptical producers by putting on three big musical numbers in one night.\n• In Dames Dick Powell's character is putting on a musical called Sweet and Hot.\n• In Gold Diggers of 1933, Dick Powell's character is putting on a musical. Again.\n• Sunny Side Up: Although Molly isn't a professional dancer and singer, she does perform for her neighbourhood on several occasions and eventually a carnival for rich people.\n• On the Town has the main character (Gene Kelly)'s love interest as an aspiring dancer, though she is currently doing Burlesque.\n• Sugar figured that Some Like It Hot was already about a couple of (male) musicians who join an all-female band to get away from the mob; why not turn it into a musical?\n• Bullets Over Broadway would obviously become this when adapted to a Broadway musical. Subverted, though, since the play being put on isn't a musical. Just a play.\n• La La Land is about an aspiring actress and a jazz pianist.\n• Ziegfeld Girl is about three women who join the Ziegfield Follies. Songs and musical numbers follow.\n• The Greatest Showman follows the story of the founding of the first circus and frames it as a precursor to later Vaudeville performances, complete with all-cast musical numbers and individual talent performances, and refers to the circus as \"the greatest show.\" Besides the obvious reference to theater, Barnum's circus did/does refer to itself as \"the greatest show on earth.\" It also heavily features opera singer Jenny Lind, and her relationship with Barnum as they tour the US.\n• Bright Lights focuses on the performers in a Broadway show called Bright Lights. The female lead is leaving show business to marry a rich guy but her male co-star and old admirer is jealous. Lots of musical numbers.\n• Just like the movie it's based on, Sister Act is about a lounge singer who goes into hiding at a convent, taking over said convent's choir.\n• The Muppets Take Manhattan is about The Muppets trying to bring their college show Manhattan Melodies to Broadway. Similarly, The Muppets and Muppets Most Wanted are about them bringing back The Muppet Show, first as a telethon, then as a live tour of Europe.\n• Smash is about the conception and production of a Broadway musical.\n• Show Boat, as the title suggests, is about performers on a show boat.\n• Cabaret, as the title suggests, is about performers in a cabaret.\n• Kiss Me Kate — often described as a musical version of The Taming of the Shrew — would be more accurately described as a musical about a musical version of The Taming of the Shrew.\n• The Music Man is a light example: Harold Hill is selling band instruments, band uniforms and the false promise of starting a band. At the very end the band does wind up performing, once, not very well. The fact that his love interest is a music teacher adds to things a bit.\n• Chicago is about a wannabe singer, with the secondary female lead a former singer (\"former\" because now she's in prison). They both get out of prison and become famous performers.\n• Bye Bye Birdie is about a 50s rock singer performing one last concert before he goes off to the army.\n• The Phantom of the Opera, strangely enough.\n• [title of show] features friends writing a musical.\n• Not only that, but the musical they are writing is [title of show]. They are writing a musical about writing a musical about writing a musical about writing a musical about...\n• Curtains is about a murder investigation on the set of an off-Broadway musical.\n• The stage adaptation of The Producers turns the story into a musical producing the fictional musical Springtime for Hitler.\n• Miss Adelaide and the Hotbox Girls in Guys and Dolls. Adelaide's numbers at the Hotbox actually do very little to propel the story; they're mostly there to provide transitions into other scenes set at the Hotbox (the other Hotbox girls are so alternatively insignificant that only one has any lines outside of those numbers).\n• The Drowsy Chaperone is a about an agoraphobic musical-lover listening to his collection of musical records. His favorite one—The Drowsy Chaperone—which he listens to with the audience, is about the wedding of two 1920s musical stars, and several other supporting characters in that show are related to the stage as well (although there's no musical in the show-within-a-show). There's also a scene from a different, also made up show called Message from a Nightengale, an obvious riff on The King and I.\n• Gypsy is about a vaudeville dancer who transitions into the Burlesque scene.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/TheMusicalMusical", "media_links": ["/pmwiki/pmwiki.php/Film/WalkTheLine", "/pmwiki/pmwiki.php/Film/GreatBallsOfFire", "/pmwiki/pmwiki.php/Film/YankeeDoodleDandy", "/pmwiki/pmwiki.php/Theatre/JerseyBoys", "/pmwiki/pmwiki.php/Film/TheBroadwayMelody", "/pmwiki/pmwiki.php/Film/SinginInTheRain", "/pmwiki/pmwiki.php/Creator/GeneKelly", "/pmwiki/pmwiki.php/Film/ForMeAndMy", "/pmwiki/pmwiki.php/Creator/JudyGarland", "/pmwiki/pmwiki.php/Creator/FredAstaire", "/pmwiki/pmwiki.php/Creator/GeneKelly", "/pmwiki/pmwiki.php/Film/Hairspray", "/pmwiki/pmwiki.php/Film/HunkyDory", "/pmwiki/pmwiki.php/Theatre/TheTempest", "/pmwiki/pmwiki.php/Film/BillyElliot", "/pmwiki/pmwiki.php/Film/PalJoey", "/pmwiki/pmwiki.php/Film/TheBandWagon", "/pmwiki/pmwiki.php/Film/MoulinRouge", "/pmwiki/pmwiki.php/Film/TheSoundOfMusic", "/pmwiki/pmwiki.php/Film/Fame", "/pmwiki/pmwiki.php/Film/TopHat", "/pmwiki/pmwiki.php/Creator/FredAstaire", "/pmwiki/pmwiki.php/Creator/JudyGarland", "/pmwiki/pmwiki.php/Music/BingCrosby", "/pmwiki/pmwiki.php/Film/TheGayDivorcee", "/pmwiki/pmwiki.php/Creator/GingerRogers", "/pmwiki/pmwiki.php/Film/Once", "/pmwiki/pmwiki.php/Film/TheCommitments", "/pmwiki/pmwiki.php/Film/HighSchoolMusical", "/pmwiki/pmwiki.php/Creator/BusbyBerkeley", "/pmwiki/pmwiki.php/Film/FortySecondStreet", "/pmwiki/pmwiki.php/Film/FootlightParade", "/pmwiki/pmwiki.php/Creator/JamesCagney", "/pmwiki/pmwiki.php/Film/Dames", "/pmwiki/pmwiki.php/Film/GoldDiggersOf1933", "/pmwiki/pmwiki.php/Film/SunnySideUp", "/pmwiki/pmwiki.php/Film/OnTheTown", "/pmwiki/pmwiki.php/Film/DarlingLili", "/pmwiki/pmwiki.php/Film/SomeLikeItHot", "/pmwiki/pmwiki.php/Film/BulletsOverBroadway", "/pmwiki/pmwiki.php/Theatre/BulletsOverBroadway", "/pmwiki/pmwiki.php/Film/LaLaLand", "/pmwiki/pmwiki.php/Film/ZiegfeldGirl", "/pmwiki/pmwiki.php/Film/TheGreatestShowman", "/pmwiki/pmwiki.php/Film/BrightLights", "/pmwiki/pmwiki.php/Film/SisterAct", "/pmwiki/pmwiki.php/Film/TheMuppetsTakeManhattan", "/pmwiki/pmwiki.php/Franchise/TheMuppets", "/pmwiki/pmwiki.php/Film/TheMuppets", "/pmwiki/pmwiki.php/Film/MuppetsMostWanted", "/pmwiki/pmwiki.php/Series/TheMuppetShow", "/pmwiki/pmwiki.php/Series/Glee", "/pmwiki/pmwiki.php/Series/Smash", "/pmwiki/pmwiki.php/Theatre/ShowBoat", "/pmwiki/pmwiki.php/Theatre/Cabaret", "/pmwiki/pmwiki.php/Theatre/KissMeKate", "/pmwiki/pmwiki.php/Theatre/TheTamingOfTheShrew", "/pmwiki/pmwiki.php/Theatre/TheTamingOfTheShrew", "/pmwiki/pmwiki.php/Theatre/TheMusicMan", "/pmwiki/pmwiki.php/Theatre/AChorusLine", "/pmwiki/pmwiki.php/Theatre/Chicago", "/pmwiki/pmwiki.php/Theatre/ByeByeBirdie", "/pmwiki/pmwiki.php/Theatre/ThePhantomOfTheOpera", "/pmwiki/pmwiki.php/Theatre/TitleOfShow", "/pmwiki/pmwiki.php/Film/TheProducers", "/pmwiki/pmwiki.php/Theatre/GuysAndDolls", "/pmwiki/pmwiki.php/Theatre/TheDrowsyChaperone", "/pmwiki/pmwiki.php/Theatre/TheKingAndI", "/pmwiki/pmwiki.php/Theatre/Gypsy"], "non_media_links": ["/pmwiki/pmwiki.php/Main/ShowWithinAShow", "/pmwiki/pmwiki.php/Main/WriteWhatYouKnow", "/pmwiki/pmwiki.php/Main/SubTrope", "/pmwiki/pmwiki.php/Main/MusicStories", "/pmwiki/pmwiki.php/Main/MostWritersAreWriters", "/pmwiki/pmwiki.php/Main/SetBehindTheScenes", "/pmwiki/pmwiki.php/Main/ShowWithinAShow", "/pmwiki/pmwiki.php/Main/ThatRemindsMeOfASong", "/pmwiki/pmwiki.php/Main/Biopic", "/pmwiki/pmwiki.php/Main/ScreenToStageAdaptation", "/pmwiki/pmwiki.php/Main/Burlesque", "/pmwiki/pmwiki.php/Main/Sugar", "/pmwiki/pmwiki.php/Main/Subverted", "/pmwiki/pmwiki.php/Main/ShowWithinAShow", "/pmwiki/pmwiki.php/Main/ShowWithinAShow", "/pmwiki/pmwiki.php/Main/Burlesque"]}