{"title": "Felony Murder", "content": "Felony murder, also known as constructive malice, is a legal rule used in the United States and some other jurisdictions stating that any death that occurs during the commission of a felony is first-degree murder.\n\nThe common scenario is that of someone suffering a fatal heart attack during the course of a bank robbery. That death, which may have been caused by the stress of the robbery or the failure to get medical treatment caused during it, would be counted as first-degree murder. Likewise, numerous criminals have found themselves charged with Felony Murder because their accomplice was shot in self-defense by the intended victim. Cue the criminal's family screaming about how it wasn't even their poor misunderstood choirboy who pulled the trigger. The reasoning behind this law is that if the criminals had not been committing a felony, then the victim would not have died, therefore the criminals are responsible for the death.\n\nFirst degree murder is a capital (death penalty) crime in many jurisdictions, but Supreme Court decisions in the U.S. have restricted this somewhat; in order to be eligible for the death penalty, a participant in a felony murder must either:\n• Intend that a killing take place, or\n\nCan serve as Justice by Other Legal Means.\n\nIn the UK, this crime has not been used since 1957. In England and Wales, it is either considered manslaughter (culpable homicide in Scotland), or, if one person commits a crime that is \"outwith the common criminal purpose\" any of his co-criminals may be acquitted of it entirely. The classic example is a man, part of a group of bankrobbers, who murders the teller because he was having an affair with his wife, without informing his confederates that he was going to do so, in a plan which otherwise did not call for the use of violence.\n\nNote that this rule is the subject of great controversy in America. Because any felony can serve as the basis for a felony-murder conviction, it can have some odd consequences. The drafters of the Model Penal Code (MPC) noted that because it is a felony in most states to sell a visibly drunk individual alcohol, if the drunk drinks himself to death or crashes his car and kills himself or other people, the liquor store shopkeeper or bartender who gave the drunk the booze might be criminally liable for murder under the traditional felony-murder rule. The two sides of the debate both make strong cases on this example:\n• The pro-felony murder contingent argues that declaring the drunk Somebody Else's Problem led directly to them becoming someone else's problem. Had the bartender obeyed the law, the victims would not be dead. They are an Accomplice by Inaction.\n• The counter-argument is that the bartender should not be held responsible for the drunk's actions. Despite the fact that the bartender's failure to act allowed the death to occur, it is ultimately the drunk's actions that led to the death(s).\n\nIt becomes even more complicated in the cases this law is primarily intended to cover, such as the classic armed-robbery scenario. In these cases, it becomes murder on the grounds of \"depraved indifference\". American courts generally accept that when you act recklessly in a manner where it is not merely possible but likely that you are going to kill someone, it's murder by the rule of \"depraved/extreme indifference to human life\", or more poetically \"depraved-heart murder\". Opponents of the rule (particularly defense attorneys) describe it as a prosecutor's easy way out, used not to get proper convictions when the facts are difficult but rather to take a shortcut when the facts are easy and a conviction is assured on other legal grounds. Due to this Flame Bait status, even legal scholars who don't advocate for its abolition are quite wary of it, and it's a favorite target of politicians looking to score points with the defense attorney crowd.\n\nThe MPC (adopted by somewhere in the ballpark of 10-20 states) includes a very narrow version of the rule that explicitly defines it as a form of depraved-heart murder. One state (New Mexico) has modified it in a manner that makes it more or less useless. Three states have abolished it entirely (Hawaii and Kentucky by legislative enactment, Michigan by judicial decision).note Michigan's felony-murder rule was judicial in origin. Michigan's common law of crimes is very well developed—decisions of the Michigan Supreme Court are often regarded as highly persuasive precedent in criminal cases in other states—and its legislature codified far less of the criminal law than is usual. To give you an idea, Jack Kevorkian, a physician infamous for his assisted suicide work in Detroit's northern suburbs, was tried on common law murder charges, a highly unusual occurrence in the United States, but perfectly normal in Michigan. Michigan's murder rule is common law (that is, judge-made), and the murder statute just sets the penalty (defining first-degree murder, which carries the possibility of life without parole—Michigan having abolished the death penalty for ordinary crimes in 1846 and for all crimes in 1964—as \"murder with such-and-such aggravating factors\" and second-degree murder as \"any other murder\"). The judges ultimately determined that felony-murder had been \"swallowed\" (i.e. made redundant by) murder by depraved indifference to human life.\n\nThis is a death trope. Here there be spoilers.\n• Used in an issue of Nightwing, complete with a woman dropping dead of a heart attack during a robbery.\n• One telling of Batman's origin has this law be the explanation for why Batman is a vigilante and not a badged police officer. One of Bruce Wayne's law professors poses a hypothetical situation where two teenagers steal a car for a joyride and end up hitting and killing a pedestrian. When Bruce states that only the driver should be held responsible for the death, the professor corrects him that both teens are responsible because they both participated in the felony which led to the death of the victim. Bruce finds this shockingly unjust, leading him to decide to work outside the law.\n• In Peter Parker, The Spectacular Spider-Man, the second Prowler found himself in a terrible situation when he tried burgling a penthouse and a guard tried tackling him while the Prowler was going over the side to escape. As it happens, the combined momentum led to the guard being accidentally thrown off and he falls to his death while the Prowler could only watch helplessly clinging to the building wall. After that, the Prowler became even more dependent on his employer, Belladonna, considering the accident would still be considered a \"murder in commission of a felony.\" The fact that the police suspect Spider-Man did it is no help considering the Prowler knows that the Super Hero will be looking for him to clear his name.\n• In Let Him Have It, mentioned below, Derek Bentley is hanged for a murder committed by an underage accomplice, who only gets ten years in prison.\n• In one episode of CSI, a man convicted in 1991 of killing a man during a burglary (put away by evidence from Catherine Willow's first solo case) appeals his conviction. It's found his girlfriend did it, but since he was present and covered it up, he is guilty of felony murder.\n• Also used in the \"Fight Night\" episode's opening sequence, where the in-ring death of a boxer is provisionally declared a murder because the fight's organizers had rigged the betting odds to ensure they'd make a fortune. Someone was indeed charged with the boxer's murder, but that's because the other fighter had loaded his gloves with mercury for a neck-snapping punch, not because of the felony murder statute.\n• In The Closer, a kid was killed because a man fired a warning shot at a couple of gang bangers who were trying to steal his car, and the bullet flew two blocks away and hit the kid. The bangers were arrested for felony murder as they instigated the crime which led to the kid's accidental death.\n• In another episode, the owner of a jewelry store has a heart attack and dies during a robbery. The robbers get charged with both robbery and felony murder.\n• Vinny on Wiseguy used criminals' fear of this law to save an innocent person without blowing his cover. A customer suffered a heart attack when Vinny (an undercover fed) was helping rob a bank, and Vinny insisted that the real crooks let him save the man, ostensibly because he didn't want to risk a felony murder charge.\n• One episode of Emergency! had two bank robbers call in the paramedics when one of their hostages had a heart attack. Probably to prevent these charges from being filed.\n• A favorite tactic of Jack McCoy in Law & Order was, if he couldn't get someone dead to rights on murder, to go after them for Felony Murder, usually with regard to how it related to suspects who acted with reckless indifference for human life.\n• In The Shield, Dirty Cop Shane is on the run with his pregnant wife, Mara, and their two year old son. A drug deal gone wrong results in Mara shooting an innocent bystander while trying to defend Shane. This results in her facing a first degree murder charge as it took place during a crime in progress.\n• The fact that the British legal system no longer recognizes this has caused the Law & Order: UK writers a few problems when they remake an original series episode.\n• On one episode of Breakout Kings, one of the fugitives was a man who had been put away for felony murder after he stole a car when he was 18 to go joyriding (his elderly victim had a heart attack when pulled out of the car). Once in prison he was sexually abused by the other inmates-he broke out mainly to get revenge on his main tormentor, who had gotten out and gotten married.\n• Chicago Justice: The defendant in \"AQD\" is charged with the murder of a man by making a woman believe her daughter had been kidnapped. It caused her to hit the victim while speeding down the street to deliver the ransom money.\n• A Real Life case in January 2012: a young woman who was home alone with her infant child shot and killed an intruder after he broke in. His accomplice, who ran away at the sound of the shots, faced Felony Murder charges. She, on the other hand, won't be facing any charges.\n• The case that led to the end of Felony Murder (or \"constructive malice\") in British law was that of Derek Bentley and Christopher Craig in 1952. Bentley, 19, was severely mentally disabled. Craig was 16. When breaking into a warehouse one night, Craig was carrying a gun. Confronted by the police, Bentley (while already under arrest) allegedly said \"Let him have it, Chris!\" Craig then shot dead a police officer. The prosecution claimed this meant to shoot him, which the defense contested of course, but it didn't matter - Bentley was part of the underlying felony, meaning legally he was guilty of the murder as well, even if he hadn't also urged Craig to do this. Craig was too young to be hanged (it was for 18-year olds and above only) and received \"detention at Her Majesty's pleasure\", paroled after 10 years. Bentley was hanged. The absurdity of the murderer being spared in place of his mentally disabled partner led to the Homicide Act 1957, abolishing constructive malice and permitting the defense of diminished responsibility (as Bentley was not allowed to utilize) - capital punishment was then mandatory for murder convictions, and this also helped in the campaign against hanging. In 1993, Bentley was retroactively pardoned, and his sentence quashed in 1998. The case was chronicled in a film named after Bentley's ambiguous words - Let Him Have It.\n• Ryan Holle is one of the most controversial uses of this rule. Ryan let some friends borrow his car when they said they were going to commit a robbery to obtain marijuana. During the robbery, the ringleader killed a little girl. No one had discussed killing anyone with Ryan, and Ryan was sleeping in his home a mile and a half away at the time the death occurred. It didn't matter, Ryan was still arrested and charged with first degree murder. Despite his claims that he was drunk, wasn't thinking clearly at the time, and thought his friends were joking, Ryan was still put on trial. Ryan was the only one involved with the crime who was offered a plea deal. Since he truly believed he was innocent, Ryan refused the deal. He was later found guilty and sentenced to life without parole. The Florida governor later commuted his sentence to twenty five years.\n• Giuseppe Zangara attempted to assassinate Franklin D. Roosevelt a few weeks before his inauguration, but actually ended up severely wounding (among others) Anton Cermak, the Mayor of Chicago who was accompanying Roosevelt on his trip to Florida. Cermak subsequently died as the result of a screw-up on the part of the doctors operating on him, but Zangara was hit with a first degree murder charge anyway, as threatening (let alone trying to assassinate) the President or President-elect is a felony in its own right, regardless of the outcome. On top of that, Florida law incorporated the rule of \"transferred intent,\" meaning that even if Zangara technically didn't mean to kill Cermak, he was treated he same as if he'd successfully killed Roosevelt. This sets aside the interesting—and probably untrue, but not entirely impossible— Conspiracy Theory that Cermak was the actual target of the attack; these theories generally rest on the (actually pretty possible) alleged ties Zangara had to The Mafia , as Cermak had run on an anti-corruption platform with a focus on cleaning up Mob influence in Chicago, and naturally the Mob did not like him. This is probably not what happened, but it makes for an interesting story nonetheless. Not that Zangara seemed to care about any of the niceties of this, as he pleaded guilty to all the charges, and was subsequently executed via the electric chair just a few weeks later.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/FelonyMurder", "media_links": ["/pmwiki/pmwiki.php/ComicBook/Nightwing", "/pmwiki/pmwiki.php/ComicBook/SpiderMan", "/pmwiki/pmwiki.php/Film/LetHimHaveIt", "/pmwiki/pmwiki.php/Series/CSI", "/pmwiki/pmwiki.php/Series/TheCloser", "/pmwiki/pmwiki.php/Series/Wiseguy", "/pmwiki/pmwiki.php/Series/Emergency", "/pmwiki/pmwiki.php/Series/LawAndOrder", "/pmwiki/pmwiki.php/Series/TheShield", "/pmwiki/pmwiki.php/Series/LawAndOrderUK", "/pmwiki/pmwiki.php/Series/BreakoutKings", "/pmwiki/pmwiki.php/Series/ChicagoJustice", "/pmwiki/pmwiki.php/Film/LetHimHaveIt"], "non_media_links": ["/pmwiki/pmwiki.php/UsefulNotes/ThreeDegreesOfMurder", "/pmwiki/pmwiki.php/Main/MamaDidntRaiseNoCriminal", "/pmwiki/pmwiki.php/Main/JusticeByOtherLegalMeans", "http://en.wikipedia.org/wiki/Model_Penal_Code", "/pmwiki/pmwiki.php/Main/SomebodyElsesProblem", "/pmwiki/pmwiki.php/Main/AccompliceByInaction", "/pmwiki/pmwiki.php/Main/JusticeByOtherLegalMeans", "/pmwiki/pmwiki.php/Main/FlameBait", "/pmwiki/pmwiki.php/Main/SuperHero", "/pmwiki/pmwiki.php/Main/FelonyMurder", "/pmwiki/pmwiki.php/Main/DirtyCop", "/pmwiki/pmwiki.php/Main/RealLife", "http://www.foxnews.com/us/2012/01/04/teen-mom-shoots-kills-intruder-with-11-dispatcher-on-phone/", "http://abcnews.go.com/GMA/video/teen-mom-sarah-mckinley-kills-intruder-phone-911-15303611", "/pmwiki/pmwiki.php/UsefulNotes/FranklinDRoosevelt", "/pmwiki/pmwiki.php/UsefulNotes/ConspiracyTheory", "/pmwiki/pmwiki.php/UsefulNotes/TheMafia"]}