{"title": "Alternate Show Interpretation", "content": "Theatrical Productions are ephemeral. Even if a production is recorded on film, the actual experience can never be exactly reproduced. This quality is arguably the quality, along with the live performance thereof, that distinguishes theatre from other forms of art. This is what enables plays to be performed dozens, hundreds, or thousands of different times.\n\nSo let's say you have a famous show that is always thought of as being performed or interpreted in a certain way. Then one day somebody decides to revive it, but with a big twist on the plot that changes the way the entire production is done. Congratulations, you've got yourself this trope, a large-scale defiance of Original Cast Precedent.\n\nThe German term is \"Regietheater\" (literally \"direction theatre\") and the trope forms an important part of German theatre culture.\n• The Turn of the Millennium revival of Stephen Sondheim's Sweeney Todd: The Demon Barber of Fleet Street (produced first in the U.K., then on Broadway) sets the whole thing in an insane asylum, drops the ensemble, and the remaining performers — the leads and supporting cast — play instruments when they aren't singing.\n• Over the years, Stephen Sondheim's Company has undergone a transformation as to the concept behind the concept musical: in the original production, there was more of a focus on the show being a series of vignettes about married life, but later productions (particularly the 2006 Broadway Revival) interpret the text as a narrative about Bobby's isolation and inability to connect with people as his friends do.\n• The Fiasco Theatre production of Stephen Sondheim's (noticing a trend?) Into the Woods, which depicts the story as told by a bunch of people using whatever they have, playing multiple roles.\n• Similarly, the 2002 film version of Chicago set all but two of the musical numbers as part of Roxie's imagination.\n• The original production of Assassins was off-Broadway at Playwright's Horizons. The Broadway production was the first time the idea of the Balladeer was implemented.\n• Many, many, many productions of any Shakespeare play—particularly Macbeth—decide to take wildly different interpretations of the text. Given how standard the practice of cutting his plays is these days, it's not surprising.\n• Instead of painting his face black to play Othello, Patrick Stewart played the titular role in a racially inverted production, opposite an otherwise all-black cast. This was by all accounts one of the more unusual productions of the play in recent memory. And it was awesome.\n• A recent BBC television adaptation of Macbeth, which also happened to include Patrick Stewart in the title role, played him as an Expy of Joseph Stalin.\n• It's not uncommon for productions of Julius Caesar to have Romans dressed as Nazis or modern politicians.\n• In the 2011 Oregon Shakespeare Festival production, the only change was making Caesar a woman.\n• There was an adaptation of Titus Andronicus that, at the end, revealed the setting to be an asylum and that all the characters were inmates.\n• The recent Broadway production of Macbeth starring Alan Cumming. Set in a psychiatric ward, Cumming plays a deeply disturbed man who impersonates almost every character in the show, occasionally leaving clues as to who the patient is, why he is recounting this story, and what has led him to become so tortured. There are only two other actors, who portray doctors commenting on his madness.\n• The 2015 performance of The Merchant of Venice, by the Royal Shakespeare Company in Straford-upon-Avon itself, interpreted the love story as a polyamorous romance between Antonio, Bassanio and Portia. None of the text was changed, but Antonio and Bassanio spent much of the play kissing and embracing, with Portia looking on happily.\n• Some productions have told the story as a tragedy, with Shylock as the protagonist.\n• The Berliner Ensemble performance of Schiller's \"Der Parasit\" (\"The Parasite\") re-enacts the whole play with actors in puppet outfits (with fake legs and fake arms, done with a sleeve connecting the wrists almost directly to the shoulder). One key character is played by a dozen different actors who pop out of boxes on the stage to chant his lines. The Queen is played by a man (Axel Werner). A comedic sound effect is played for every single action. Needless to say, the actual content of the play becomes moot.\n• Modern performances of Bertolt Brecht plays almost demand this trope, to keep the audience alienized, as Brecht wanted it. Common tactics include the use of words projected onto a screen (one of Brecht's favourite tactics), having the actors protest their stage directions, having the actors switch roles halfway through, using minimalist sets, and name-checking Brecht.\n• One memorable Berlin performance of \"St. Joan\" (in the Deutsches Theater) started out with four actors fighting over who got to play which character, all reading from cheap paperback copies of the play. Once they finally all managed to get a private part in the play, they found themselves stuck in the middle of a tragic plot, and desperately tried to stop being these characters again (with varying levels of success). Meanwhile, the actors and a miniature cardboard cityscape were filmed live and projected onto a screen, with the SFX crew clearly visible, and as the plot got more dramatic, the floor disappeared from under the actors, slowly forcing them back towards the screen. On which a counter was displayed showing how many people had died of poverty and hunger worldwide during the performance of the play alone. Oh, and? It didn't change or add a single word from Brechts original script. The whole thing was a huge Moment of Awesome.\n• A 2011 Los Angeles production of Bernard Pomerance's The Elephant Man chose to defy in-script instructions that the lead actor not use any kind of makeup/costume to suggest his deformities (he must use body language and vocal distortion instead) in favor of outfitting the performer in an elaborate prostethic suit.\n• The acclaimed 2008 U.K. revival of La Cage aux folles, which transferred to Broadway in 2010, was deliberately smaller-scale than the original Costume Porn and Scenery Porn-heavy 1983 Broadway staging that had become the precedent. This was something writers Harvey Fierstein and Jerry Herman had wanted for years; as Fierstein explains in the liner notes of the 2010 cast recording, \"I wrote about a small drag club but what we've always given the audience was a full-blown Folies Bergere....I've witnessed a lot of productions focus more on the farce and less on the heart.\"\n• The 2015 Deaf West Broadway Revival of Spring Awakening, which cast several deaf performers in the roles, making their characters deaf as a result. The deaf performers would sign while hearing actors (who also made up the band) voiced their dialogue and singing. The change really heightened the themes of miscommunication and alienation and changed some of the shows relationships. The biggest change is the show incorporating the policies for the deaf enacted in education at the time, such as forbidding sign language and forcing the students to speak. As a result, Moritz being intentionally flunked out of school is significantly harsher than the original as it seems like the teachers want to keep a deaf student out of the school and, in turn, their adoration of Melchior is because he can hear.\n• The 2019 Broadway Revival of Oklahoma!, which restaged the show in modern times with a minimalist set and band.\n• The 2014 Dallas Theater Center production of Les Misérables, which set the show in contemporary times and played the revolution similar to police riots.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/AlternateShowInterpretation", "media_links": ["/pmwiki/pmwiki.php/Music/StephenSondheim", "/pmwiki/pmwiki.php/Theatre/SweeneyToddTheDemonBarberOfFleetStreet", "/pmwiki/pmwiki.php/Music/StephenSondheim", "/pmwiki/pmwiki.php/Theatre/Company", "/pmwiki/pmwiki.php/Music/StephenSondheim", "/pmwiki/pmwiki.php/Theatre/IntoTheWoods", "/pmwiki/pmwiki.php/Film/Chicago", "/pmwiki/pmwiki.php/Theatre/Assassins", "/pmwiki/pmwiki.php/Theatre/Macbeth", "/pmwiki/pmwiki.php/Theatre/Othello", "/pmwiki/pmwiki.php/Creator/PatrickStewart", "/pmwiki/pmwiki.php/Theatre/Macbeth", "/pmwiki/pmwiki.php/Theatre/JuliusCaesar", "/pmwiki/pmwiki.php/Theatre/TheMerchantOfVenice", "/pmwiki/pmwiki.php/Creator/BertoltBrecht", "/pmwiki/pmwiki.php/Theatre/LaCageAuxFolles", "/pmwiki/pmwiki.php/Theatre/SpringAwakening", "/pmwiki/pmwiki.php/Theatre/Oklahoma", "/pmwiki/pmwiki.php/Theatre/LesMiserables"], "non_media_links": ["/pmwiki/pmwiki.php/Main/TheatricalProductions", "/pmwiki/pmwiki.php/Main/OriginalCastPrecedent", "/pmwiki/pmwiki.php/Main/TurnOfTheMillennium", "/pmwiki/pmwiki.php/Main/RuleOfThree", "/pmwiki/pmwiki.php/Main/TheNarrator", "/pmwiki/pmwiki.php/Main/Expy", "/pmwiki/pmwiki.php/UsefulNotes/JosephStalin", "/pmwiki/pmwiki.php/SugarWiki/MomentOfAwesome", "/pmwiki/pmwiki.php/Main/CostumePorn", "/pmwiki/pmwiki.php/Main/SceneryPorn"]}