{"title": "Unexpectedly Obscure Answer", "content": "Sometimes, a clue on a Game Show or other similar competition may be so arcanely obscure that the contestants and viewers are left scratching their heads long after the fact. Other times, it may be a puzzle or password that is impossible to convey no matter how much skill the contestant has. Granted, everyone has a different level of skill when it comes to game shows, but when it gets to the point that nearly everyone at home is asking \"How do they expect anyone to be able to know that?!\", you know you have an unexpectedly obscure answer. Such clues are sometimes used as a way to ramp up the difficulty, although many fans of the genre (jokingly or otherwise) refer to such clues as being a way of saving money after a particularly big win...or just to save money period if the show's particularly stingy.\n\nSometimes played with in game show parodies, where the host asks an insanely obscure question and the contestant gets it right for a big win.\n\nExamples are restricted to In-Universe, plus games where the trope is Invoked to achieve a desired effect.\n\nWhile Jeopardy! was the inspiration for this trope (see the discussion page for the most egregious examples), it's Not an Example because the writers honestly thought that someone among the contestants would get the answer right. Most examples of this sort (i.e., Nine Times Out Of Ten that it happens in Real Life) fall under Moon Logic Puzzle.\n• On The $64,000 Question, these kinds of questions were used in an attempt to force losses from contestants Charles Revson (head of show sponsor Revlon) didn't like, going so far as to swap out the questions that had been secured in a bank vault prior to the show. Dr. Joyce Brothers was one such target, but she managed to win the $64,000 legitimately by studying every book about boxing she could find.\n• After a string of correct answers, Double Dare would throw in a few questions that no child could be expected to know, such as \"What does DNA stand for?\" , to try and force a messy Physical Challenge (one of the main draws of the series) to be played. As could be expected, it didn't always work.\n• Happens frequently on QI, which has an explicit policy of asking questions that nobody's likely to know, and awarding points for how interesting a contestant's answer is, regardless of whether it's correct.\n• In a Series 3 episode, Helen Atkinson-Wood correctly answers a question \"so impossible that Stephen Fry shall award a gigantic 200 points if anyone gets the answer right.\" After she answers, the other contestants, rightly astonished, ask \"How the hell did you know that?\" For the curious, the question was \"What does this chemical equation: \"C H O + 6O —> 6CO + 6H O\", represent?\" Her answer: \"An explosion in a custard powder factory.\" The equation is for the combustion of glucose (a key element of said powder). According to those behind the show, \"an explosion in a custard factory\" is the standard Textbook Humor example used when the combustion of glucose is taught at school (it's also a common example of the effects of static electricity), hence how she knew it.\n• Played with on the Comedy Central show Vs. Winning teams would be given two choices for categories, one hilariously obscure, and one hilariously gamed to their advantage. For instance, a team of Grateful Dead fans would be given the choices of \"International Grandmasters of Chess\" or \"Jerry Garcia Songs\". Occasionally the teams would spring for the obscure category, for which they did indeed have a question prepared.\n• It also came into play in the bonus round of Clash, from 1990-91 on \"Ha! The Comedy Network\" (which merged with \"The Comedy Channel\" to form Comedy Central in 1991): a representative of the winning team spins a wheel to determine the category of a final question; get it right, and the team wins a major prize. One wedge is the \"Easy Question\" (e.g. \"Which is bigger: the Sun or your head?\"). The other five are categories like \"Incredibly Difficult Tax Code Trivia\".\n• This is the MO of the Phone-in Game Shows that went through a brief amount of popularity amongst the television money-men from 2005-10, as this clip shows — the host isn't even able to pronounce the big answer.\n• Some phone-in game shows actually got into legal issues for using this in combination with encouraging viewers to phone in multiple times (which of course keeps racking up revenue for the operator). One British show got fined for a game where \"balaclava\" (you know, those full-face masks the burglars always wear) and \"rawlplugs\" (a piece of hardware used to anchor a screw into a drywall or plaster wall) were listed as items a woman would keep in their purse. Seriously?\n• On a German call-in show, there once was a question of \"Animals Starting With 'S'\" with a really high prize. Of course the answers were obscure as usual, but one caller actually answered one correctly with \"Stirnlappenbasilisk\" (Plumed Basilisk). Which is why this animal became the mascot of critiques of this kind of show.\n• A German TV show also posed the supposedly simple question \"Add up these numbers: 1,1,2,2,3,3,4.\" However, rather than the expected answer of \"16\", the desired answer was an enormous number that appeared to be the sum of all the digits plus all the two-, three-, four-, five-, six-, and seven-digit permutations of those digits!\n• A Canadian call-in show controversially threw this one at viewers: \"4 girls are travelling on a bus. Each of them have 3 baskets, in each basket there are 4 cats. Each cat has 3 little kittens. How many legs are in the bus?\" Figured it out? Well, you're likely wrong: the desired answer was 222, which not only assumed the kittens weren't on the bus, but also counted the driver's legs and the legs of the seats as well .\n• Questions in Only Connect tend to be fairly difficult at the best of times, but some stand out as being unanswerable by anyone except a human manifestation of Google. In one such question, contestants had not only to identify the category of Chief Medical Officers of England, but also to provide the fourth in the sequence. And to get the maximum points, not only must you get it right, but you must get it in one clue! Possibly inverted by the tendency to shove in less obscurist topics which invariably loses players who wind up over-thinking.\n• In volume 3 of You Don't Know Jack (a series of PC games that play like a game show) there are \"impossible questions\", worth a ridiculous $20,000 (normal questions go from $1,000 to $3,000 in Round 1 and from $2,000-$6,000 in Round 2), like \"I'm Thinking of a number between One and Nine, what is it?\", \"Within two years, how much time was there between the invention of the can and the invention of the can opener?\", or \"If you travel at a constant speed of 10 knots, at how many bells will you have to lift anchor in order to arrive at exactly 11:00 AM and get the last delicious Fiesta Breakfast Burrito?\" What's even weirder about it is that it's either multiple choice or fill in the blank (in either case five, any number between 46 and 50 years (48 years is the actual number), and four Taco bells , respectively).\n• Subverted occasionally, as with one impossible question of the category \"It's a Dog!\": \"What has four legs, barks, and is a common household pet?\" No tricks here, the answer is \"a dog\". Another \"Impossible Question\" was the not-terribly-obscure \"What is it called when winning costs you more than losing would have?\" The correct answer is, of course, \"Pyrrhic Victory\". However, keeping with the theme, if you get it right you lose points.\n• Carried over to \"The Lost Gold\". However, each question is Pirate-themed, was worth $26,606.06 (minus the six cents), and if nobody gives the right answer, a Skull and Crossbones replaces where the correct answer would be revealed. Before each question of this type, the Set-Up music would play and the Captain would be heard crying. Schmitty becomes more and more terrified each and any time he hears it.\n• A huge number of University Challenge questions have very obscure answers, but there have been some that take the cake. One picture round required the contestants to identify nuclear power stations from photographs. What university students are spending their spare time admiring nuclear power stations!?\n• Played with on MTV's Remote Control with the \"Public Television\" channel/category, which consisted entirely of obscure scientific facts, etc. One contestant selected the channel and got the question right , however, leading to a Moment of Awesome. Ken Ober: Name the physical law which simply states that the magnitude of the electrostatic force between two point electric charges is directly proportional to the product of the magnitudes of each of the charges and inversely proportional to the square of the distance between the two charges.\n• In order to win anything at all on the British game show The Million Pound Drop, contestants must face a final All or Nothing multiple-choice question at the end of the game, picking from two choices. Picking the right answer means they get to keep their winnings, while picking the wrong one wipes out their winnings at the last second. For contestants who reach this final question, it usually ends up being an unexpectedly obscure piece of pure trivia that may as well be a coin flip. Examples:\n• For one team, the final question required them to correctly identify which happened first: the wedding of Prince Charles and Lady Diana, or that of Ozzy and Sharon Osbourne. They got it wrong, losing £525,000.\n• Another team got the question \"Which of these two U.S. TV comedies ran for more series?\" with choices Friends and Frasier.\n• The three-answer questions can fall into this, by having one answer that's fairly easy to dismiss, and two which are so close together it has to be a guess. One question asked the contestants which of three famous Peters (Peter Jones, Peter Andre, and Peter Kay) was the shortest.\n• Both Debt and Idiot Savants made use of categories based on a contestant's selected field of pop culture expertise. During each game's bonus round, questions would come from these categories, but would be extremely obscure to anyone but absolute experts. For example, one Debt question about The Flintstones asked who gave the voices for the adult Pebbles ; an Idiot Savants question about the Back to the Future series involved the exact time Marty woke up when he returned to 1985.\n• The mini-game \"M.P.I.Q.\" in Mario Party 3 will sometimes ask questions based on on-cartridge data, like what the current record time or distance on some other mini-game is or how many times a certain board has been played. Likely invoked, as the Mario Party series is a Luck-Based Mission anyway.\n• Played straight with a twist in British quiz Pointless. Given a category, the aim is to name the most obscure member. But even though giving obscure answers is the point, it's still unexpected when it happens. Also, sometimes it's the fact that a given answer is obscure that's unexpected; sometimes the 100 people surveyed will simply miss an answer that you'd expect to be obvious.\n• The final round gives you three guesses to name an answer that none of the surveyed people got, or go home with nothing. One category (\"Places in Britain which gained official city status since 1900\") had only three answers that scored zero, which even the hosts seemed to think was on the unfair side.\n• The French quiz show Burger Quizz always contained a segment where contestants had to choose between three sets of questions : two which were rather normal (for example, questions about then-current president Jacques Chirac, Star Wars, or pop rock) and a final one which was extremely difficult and based around a particularly obscure subject (examples include \"the county of Côte d'Or during the years 1870s\" or \"chemistry so complicated, that even Nobel Prize winners would have trouble answering those questions\"). Needless to say, the first two sets of questions were always picked.\n• Except this one time when third set was about some obscure and supposedly boring comic named after a theologian and a philosopher... that was picked and aced.\n• Following the 2010 Retool of the US version of Who Wants to Be a Millionaire?, a recent trend in questions seems to ask what celebrities did before they became famous (or which of four celebrities had a specific job). These are almost always the hardest in Round 1 and frequently jumped or walked away from, and none have been answered correctly.\n• The $100,000 Mystery Tune/Big Prize Tune on Name That Tune was this as well. More often than not, the song was an extremely obscure Broadway showtune, or an old Tin Pan Alley song, or even a classical piece that was designed to be the hardest song to name. Although, during the Tom Kennedy era, there were seven $100,000 winners, so some hardcore musicologists were able to name it.\n• One contestant was even able to get one past the writers. Her $100,000 Mystery Tune was \"Fugue for Tinhorns\" from the musical Guys and Dolls. The contestant gave the title \"Can Do\" (a line repeated many times in the song) and was ruled incorrect. However, the contestant did some research and found that \"Can Do\" is an alternate title of the song. The producers agreed, and brought her back onstage to award her the $100,000 prize.\n• Some questions in HQ can become this, especially when they happen in the first couple of questions. When they eliminate a large portion of the audience, Scott calls them \"Savage Questions\", complete with an associated graphic.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/UnexpectedlyObscureAnswer", "media_links": ["/pmwiki/pmwiki.php/Series/Jeopardy", "/pmwiki/pmwiki.php/Anime/Pokemon", "/pmwiki/pmwiki.php/Manga/BinboGamiGa", "/pmwiki/pmwiki.php/LightNovel/WhenSupernaturalBattlesBecameCommonplace", "/pmwiki/pmwiki.php/Manga/DrStone", "/pmwiki/pmwiki.php/ComicBook/TheJoker", "/pmwiki/pmwiki.php/ComicBook/DisneyDucksComicUniverse", "/pmwiki/pmwiki.php/WesternAnimation/DonaldDuck", "/pmwiki/pmwiki.php/Creator/CarlBarks", "/pmwiki/pmwiki.php/ComicBook/ZipiYZape", "/pmwiki/pmwiki.php/Film/MontyPythonAndTheHolyGrail", "/pmwiki/pmwiki.php/Series/MontyPythonsFlyingCircus", "/pmwiki/pmwiki.php/Creator/KarlMarx", "/pmwiki/pmwiki.php/Film/MontyPythonLiveAtTheHollywoodBowl", "/pmwiki/pmwiki.php/Music/JerryLeeLewis", "/pmwiki/pmwiki.php/Series/BoyMeetsWorld", "/pmwiki/pmwiki.php/Series/LateNight", "/pmwiki/pmwiki.php/Creator/JimmyFallon", "/pmwiki/pmwiki.php/Series/ThirtyRock", "/pmwiki/pmwiki.php/Series/HomeImprovement", "/pmwiki/pmwiki.php/Film/Coneheads", "/pmwiki/pmwiki.php/VideoGame/ProPinballTimeshock", "/pmwiki/pmwiki.php/Radio/ImSorryIHaventAClue", "/pmwiki/pmwiki.php/Radio/APrairieHomeCompanion", "/pmwiki/pmwiki.php/Series/WheelOfFortune", "/pmwiki/pmwiki.php/TabletopGame/GURPSIOU", "/pmwiki/pmwiki.php/VideoGame/Borderlands2", "/pmwiki/pmwiki.php/VideoGame/PajamaSam", "/pmwiki/pmwiki.php/VideoGame/SamAndMaxSaveTheWorld", "/pmwiki/pmwiki.php/VideoGame/SuperPaperMario", "/pmwiki/pmwiki.php/VideoGame/Undertale", "/pmwiki/pmwiki.php/WesternAnimation/LooneyTunes", "/pmwiki/pmwiki.php/WesternAnimation/TheDucksters", "/pmwiki/pmwiki.php/Series/TruthOrConsequences", "/pmwiki/pmwiki.php/Theatre/Rigoletto", "/pmwiki/pmwiki.php/WesternAnimation/GarfieldAndFriends", "/pmwiki/pmwiki.php/WesternAnimation/TinyToonAdventures", "/pmwiki/pmwiki.php/Series/The64000Question", "/pmwiki/pmwiki.php/Series/DoubleDare1986", "/pmwiki/pmwiki.php/Series/QI", "/pmwiki/pmwiki.php/Music/GratefulDead", "/pmwiki/pmwiki.php/Series/OnlyConnect", "/pmwiki/pmwiki.php/Website/Google", "/pmwiki/pmwiki.php/VideoGame/YouDontKnowJack", "/pmwiki/pmwiki.php/Series/UniversityChallenge", "/pmwiki/pmwiki.php/Creator/MTV", "/pmwiki/pmwiki.php/Series/RemoteControl", "/pmwiki/pmwiki.php/Series/TheMillionPoundDrop", "/pmwiki/pmwiki.php/Series/DragonsDen", "/pmwiki/pmwiki.php/Creator/PeterKay", "/pmwiki/pmwiki.php/Series/Debt", "/pmwiki/pmwiki.php/WesternAnimation/TheFlintstones", "/pmwiki/pmwiki.php/Series/AllInTheFamily", "/pmwiki/pmwiki.php/WesternAnimation/TaleSpin", "/pmwiki/pmwiki.php/Franchise/BackToTheFuture", "/pmwiki/pmwiki.php/VideoGame/MarioParty", "/pmwiki/pmwiki.php/Series/Pointless", "/pmwiki/pmwiki.php/Series/WhoWantsToBeAMillionaire", "/pmwiki/pmwiki.php/Series/NameThatTune", "/pmwiki/pmwiki.php/VideoGame/HQ"], "non_media_links": ["/pmwiki/pmwiki.php/Main/GameShow", "/pmwiki/pmwiki.php/Main/InUniverse", "/pmwiki/pmwiki.php/Main/InvokedTrope", "/pmwiki/pmwiki.php/Main/UnwinnableByDesign", "/pmwiki/pmwiki.php/Administrivia/NotAnExample", "/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/Main/MoonLogicPuzzle", "/pmwiki/pmwiki.php/Main/InUniverse", "/pmwiki/pmwiki.php/UsefulNotes/SchrodingersCat", "/pmwiki/pmwiki.php/Main/Chuunibyou", "/pmwiki/pmwiki.php/Main/IfItBleedsItLeads", "/pmwiki/pmwiki.php/Main/JerkAss", "/pmwiki/pmwiki.php/Main/OmnidisciplinaryScientist", "/pmwiki/pmwiki.php/Discworld/MakingMoney", "/pmwiki/pmwiki.php/UsefulNotes/VladimirLenin", "/pmwiki/pmwiki.php/UsefulNotes/CheGuevara", "/pmwiki/pmwiki.php/UsefulNotes/MaoZedong", "/pmwiki/pmwiki.php/Main/TimeMarchesOn", "/pmwiki/pmwiki.php/Main/WeAreStillRelevantDammit", "/pmwiki/pmwiki.php/Main/ChekhovsLecture", "/pmwiki/pmwiki.php/Main/AudienceGame", "/pmwiki/pmwiki.php/Main/MinigameGame", "/pmwiki/pmwiki.php/Main/DoubleEntendre", "/pmwiki/pmwiki.php/Main/CutawayGag", "/pmwiki/pmwiki.php/Main/LuckBasedMission", "/pmwiki/pmwiki.php/Main/CreditsGag", "/pmwiki/pmwiki.php/Main/PhoneInGameShows", "/pmwiki/pmwiki.php/Main/DontExplainTheJoke", "/pmwiki/pmwiki.php/ComicStrip/FoxTrot", "/pmwiki/pmwiki.php/Main/TimeTravel", "/pmwiki/pmwiki.php/Main/RunningGag", "/pmwiki/pmwiki.php/Main/NotCheatingUnlessYouGetCaught", "/pmwiki/pmwiki.php/Main/NoTrueScotsman", "/pmwiki/pmwiki.php/Main/ItMakesSenseInContext", "/pmwiki/pmwiki.php/Main/ItMakesSenseInContext", "/pmwiki/pmwiki.php/Main/MacGuffin", "http://lparchive.org/Undertale/Update%2021/11-1701.png", "/pmwiki/pmwiki.php/Main/TrainProblem", "https://en.wikipedia.org/wiki/Cavalleria_rusticana", "/pmwiki/pmwiki.php/Main/ExactWords", "/pmwiki/pmwiki.php/Main/AllJustADream", "/pmwiki/pmwiki.php/Main/TextbookHumor", "/pmwiki/pmwiki.php/Main/PhoneInGameShows", "https://youtu.be/qKFYJXRgcLs?t=6m50s", "http://mikebattista.com/2009/12/05/play-tv-canada-has-no-legs/", "/pmwiki/pmwiki.php/Main/PyrrhicVictory", "https://www.youtube.com/watch?v=OPi2GMMbzTE", "/pmwiki/pmwiki.php/SugarWiki/MomentOfAwesome", "/pmwiki/pmwiki.php/Main/AllOrNothing", "/pmwiki/pmwiki.php/Main/LuckBasedMission", "/pmwiki/pmwiki.php/Main/OverlyLongName", "/pmwiki/pmwiki.php/ComicStrip/CalvinAndHobbes", "/pmwiki/pmwiki.php/Main/ReTool", "/pmwiki/pmwiki.php/Main/Lifelines"]}