{"title": "Offscreen Start Bonus", "content": "When a player spawns into a level, many videogames expect you to go in a certain direction. In 2D games, this is generally to the right. In 3D games, this is in the direction your character starts out facing.\n\nHowever, many games that involve collectables will occasionally throw you a curve. That is, if you go in the opposite direction, instead of a wall or an unmoving screen, you'll find a hidden item.\n\nNote that this Trope only applies in situations where:\n• It is at the beginning of a \"level\". That is, you just spawned in.\n• There is a path that you are expected to take.\n• There is a path that you could take, which leads to someplace that was not immediately visible which holds a useful item.\n\nSometimes it can even make the entire level easier to finish, making for an Easy Level Trick.\n\nRelated to Behind the Black. Not really an example of Guide Dang It!; all it requires is going the other way. It can be one, however, if the game goes out of its way to convince you that going left is a bad idea yet is Unwinnable if you don't.\n• The Ur-Example: Metroid, Super Metroid, and Zero Mission all put the Morph Ball off the left side of the screen. A required item; you'll either find it immediately or you'll let your Mario instincts take over and you'll have to back-track for it two screens later. As a result, it acts as a tutorial to teach the player that they can move to the left.\n• The LEGO Star Wars games loves to stick things behind the camera when you pop into a new zone.\n• I Wanna Be the Guy does this. In addition to the obvious route down and the slightly-less-obvious route up from the first screen, there's a hidden tunnel leading to the left. This being I Wanna Be The Guy, there is no indication that it's there at all, and it's the only way to reach one of the bosses.\n• There's also a tunnel going right, but it just leads you to a later point in the upper path so it's never necessary to use it.\n• GoldenEye (1997) in the Cradle level when you fight Trevelyan. You start off facing down a long narrow walkway, but if you circle around the tower behind you, there's some very useful body armor.\n• In the first space-station level of Duke Nukem 3D, if you go backwards you teleport into your ship, where there is hidden a rocket launcher.\n• In the second level in TimeSplitters: Future Perfect you could pickup the flare gun the protagonist used in the opening cut scene if you checked the boat you came with.\n• In Bio Menace, you start the first mission after being shot down over a city filled with menacing bio-monsters... if you go left from the start, you'll find your crashed aircraft, with a bunch of grenades and extra ammo ripe for the picking.\n• Mega Man X\n• One of the clever things in Mega Man X6 was the armor part in Infinity Mijinion's level. The player simply had to go left one screen at the starting point, where most stages didn't allow movement in that direction.\n• It was done in Mega Man X2 as well, and it was particularly devious, since the life upgrade was to the left, up a wall, and hidden behind the foreground. Only skilled explorers need apply.\n• Doom:\n• Doom II: Hell on Earth, Chainsaw Good, first level. Just be sure to grab it before you move forward, or else you're out of luck.\n• It's a common convention in Doom mapping to place a decorative, unopenable white door behind the player start as a bit of flavor (supposedly, it's where you entered the level from.) One of the maps in the Game Mod Memento Mori places a secret behind this door. Not everyone liked this idea, as two users on a Doom forum noted: It's REALLY annoying, because out of the hundreds of maps where it doesn't open, these mappers decided \"Let's hide something there!\" \n\nIt doesn't even make any sense for it to be this way because it's the door you enter the map from!!\n• The Donkey Kong Country games did this a lot.\n• In Donkey Kong Country, the very first level begins with DK crashing out of the front door of his house. If you go back in, you'll find an extra life. You can also go into the cave below the house where the banana hoard should be... except since it's stolen, you get a very disappointed and sad response from the protagonists.\n• One particularly hard stage, \"Stop and Go Station\", can be skipped by going back into the cave you come out of at the beginning, which will transport you directly to the stage exit (but miss some secrets).\n• Another notable example is in the Rickety Race level in the second game. When you first land in the cart to start the race, logic tells you to go forward, lest you fall off the edge of the track. However, if you do go backwards as soon as the race starts, you eventually hit a booster that speeds you up significantly and makes the level quite a bit easier.\n• One level has an entire level section to the left of the starting point. At the end is the level's DK Coin.\n• Donkey Kong Country Returns absolutely loves this trope, with probably half of all the levels featuring a hidden alcove, usually hiding a puzzle piece or a plethora of bananas, to the left of where you begin. It also repeats the \"1-Up inside Donkey Kong's house\" from the first game.\n• Dawn of Mana had at least one stage that hid a bonus this way.\n• Kirby\n• Kirby 64 has one Crystal Shard that appears on top of one of the areas you come out through in Dedede's Castle. Many items are also hidden behind the start of the level, usually being a star or food.\n• The series is fond of this; as early as Kirby's Dream Land there was a part where you go through a door, and the only way to find that level's secret is to figure out that the door you're next to on the next screen ISN'T the one you just came through - the first was a one-way door, the other leads to the secret. D'oh!\n• This is extremely common in the first two Oddworld games, Abe's Oddysee and Abe's Exoddus. Very often there is a secret exit from the first screen of the level, which leads to hidden Mudokons.\n• Super Mario Bros.:\n• A couple levels in Super Mario 64 had 1-Up Mushrooms or other power-ups right behind the starting point.\n• Happens frequently at the beginning (or end) of levels in Super Mario Bros. 3 with hidden 1-Up blocks, although those were generally hidden above the start point.\n• Whacka is hidden far northwest of the start point of the fifth chapter in Paper Mario: The Thousand-Year Door, whereas the player is clearly expected to go a short distance east and out of the screen to continue.\n• Yoshi's Island, Sluggy the Unshaven's Fort. Heading left at the start would put you in a seemingly pointless room with a single Chain Chomp, the only one of its kind in the game; using a Pow Block to defeat it would unlock a cheat allowing you to play the Bandit battle mini games directly from the world select screen.\n• A minor one in the Honeyhive Galaxy stage in Super Mario Galaxy. Turn around and look directly behind you at the start for a bunch of star bits in the shape of an M.\n• Super Mario Galaxy 2 has one at the beginning of the final Bowser stage, having you go left, then climb a pole to find a Life Mushroom.\n• In Tomb Raider II, there's a shotgun obtainable right from the start, so long as instead of sliding down the ramp from the get-go, you move to the right to line yourself up, then jump into some vines that don't appear traversable.\n• MDK has a health pack. It's even the super-charging variety, the kind that sprouts legs and runs away screaming, and it's trapped in a corner.\n• James Pond 2: Codename Robocod. The first exit is found either four levels to the right, or two seconds' travel to the left.\n• The first level of James Pond 2 has an extra life just to the left of where you start, but the screen doesn't scroll there until you reach the edge.\n• Happens a few times in the Crash Bandicoot series, items will be placed directly behind the starting point.\n• A few levels in the first Crash Bandicoot (1996) game had either a one-up or shield mask hidden juuust behind where Crash begins the level....\n• This trope shows up straight in Crash 1 and 3, but is played differently in the second entry: there are no bonuses at the beginning of levels (which is justified in that the starting point and exit of the level are represented by caves), but there are bonuses hidden behind the start of certain sections of levels. For example, Snow Go hides the Nitro switch crate right behind where the third section starts, and Hangin' Out hides a hole leading to a secret exit this way.\n• Speaking of which, a good example in Warped is the level called \"Sphynxinator\", where not only are there four boxes behind the starting point, but there's also a fork right after it: the left presents an apparently impossible-to-jump-over gap, while the right shows a (relatively) more benign path. The level can be completely completed without even taking the left road. Why, you ask? Because the left road contains only metal crates and Nitro crates, the latter being still required despite having an appropriate trigger at the end of the level.\n• The first Trackmania game has a level that can be cleared in 3 seconds if you hit the reverse.\n• Wizards and Warriors: Fortress of Fear for the Game Boy had on on its first level.\n• Castlevania\n• It isn't intentional, but if you immediately slide left when Castlevania: Symphony of the Night starts, you can access a secret deleted area and increase your map percentage.\n• In Castlevania: Curse of Darkness, right as the game starts, if you go all the way backwards, you come across an area with a few potions and, if you have a Lament of Innocence save file on your memory card, a Moai head that restores 573 HP when used or can be sold for 5730 gold.\n• An extremely plot-important character in Astro Boy: Omega Factor is hidden to the left at the start of one area.\n• Another one is hidden several screens upwards, in an otherwise ordinary looking area. Making things even more confusing, this happens only when you visit said area a second time (the first time around, there's an invisible wall).\n• Star Wars\n• In The Force Unleashed, levels often hide hidden items behind your starship after you land.\n• If you go inside your ship in certain levels of Bounty Hunter and Shadows of the Empire, you're also able to get a few more rounds of ammo. One level of Shadows even includes a challenge point on top of your ship.\n• In the Hoth level of Jedi Knight: Jedi Academy. You're supposed to follow some light beacons only barely visible in the fog after you land, but if you go in the opposite direction, you'll find a small cave behind your Z-95 with some items. And an angry wampa.\n• In Dark Forces, the game that started it all, the first level's beginning drops you in a certain spot. As a new game, it was not clear that there was a place you came from and that the game didn't just drop you in place. When the level is complete, Kyle makes it to the roof, and his transport arrives to pick him up. If instead of just ending, he searches a little, he'll find the entrance he dropped in to start the game, including an extra life.\n• In Star Wars Starfighter, in the tutorial level, there is a hidden tunnel in the cliff face behind you that you can enter to view concept art from a game called Outlaw.\n• The first fortress level in Mega Man 4 has a hidden E-tank to the left of the starting point.\n• In one level in Serious Sam, there is an open door behind you that leads to a secret area with powerful weapons. However, the door starts closing the moment you spawn so you must run backwards immediately to get through the door. The courtyard is shown to be empty in the cutscene of the previous level, and it is unreachable in Co-op games.\n• First level of the first game, instead of going into the temple, you can backtrack in the desert for some bonuses scattered around a palm tree. There are also a few other secrets before that.\n• First level of the second game, instead of going along the valley, turning back and swimming across the lake gives you some items and a secret phone booth. Additionally going down into the lake gives you the rocket launcher.\n• This happens a lot with collectibles in the 2009 version of Bionic Commando. Helpful hint: before moving, always rotate the screen alllll the way around.\n• The Turbo Grafx flagship series Bonk liked to this on the very first level and usually at least one later level, every game.\n• Turbo Esprit on the ZX Spectrum gives you a city to drive around in, hunting down color-coded cars worth various amounts of points. You start on one of the main streets and if you go forward, nothing happens. If you put the car into reverse, one of the highest-scoring cars will spawn behind you and overtake you.\n• This is done often enough in LocoRoco and its sequel that it's usually to your benefit to backtrack a little ways from the starting point just to check.\n• Indiana Jones and the Staff of Kings has a collectible hidden this way in the very first level. Just turn around and follow the path.\n• Severance: Blade of Darkness has at least one example of this, in the Forge of Xshathra level you can get a healing potion if you go back where your character was shown to have come from in the introductory cutscene (the area turns out to be a dead end corridor with a skeleton in it).\n• The second stage of the first Viewtiful Joe game uses and subverts this; if you go left instead of right, you'll encounter a whole bunch of enemies, right at the beginning when you don't have any film canisters or hearts. But, beating them all gets you a ton of points, so it's definitely a bonus if you can live through the fight.\n• Gish has a few secrets hidden in that way. In the first level, going straightly left will reveal a hidden room with some treasure. In world 1-4, quickly going left will lead you to a warp zone which takes you to the world 4-3.\n• In the PS2/Wii/PSP version of the Iron Man video game, you can destroy stockpiles of Stark Industries crates to unlock bonus content. In one level, one of these stockpiles is hidden in an area behind where you spawn in.\n• Wolfenstein 3D, level 2. If you turn around you find a series of doors holding treasures until the last door, which holds an irate Nazi. Bizarre as you usually spawn near the elevator. Might be specific to a re-release.\n• Super Demo World: The Legend Continues, a ROM Hack of Super Mario World, has a level (Sky World 3) where the secret exit can only be reached by entering the level with a cape and flying over the gap to the left of the starting platform.\n• Super Demo World also has one level where the only way to get to the secret goal is to turn back left and go back in the pipe you just came out of. This will lead you to an area that is completely identical, except the regular goal is replaced with a secret goal and the pipe you spawn from can't be re-entered.\n• Super Monkey Ball has Beginner 2 and Advanced 6, both of which have V-shaped guardrail with a tiny ramp in the middle leading up and over the ramp, directly behind the starting point. Directly underneath the ramp is a small platform with a secret goal that gives you a big score bonus and warps you to the next bonus level (Beginner 5 or Advanced 10).\n• Sonic the Hedgehog:\n• Sonic Unleashed Wii/Playstation 2 uses this for unlockable pictures/sounds/etc. at least once.\n• In the Emerald Coast stage from Sonic Adventure, there are a few ring monitors right behind the beginning of the stage.\n• In the Game Gear version of Sonic 1, going left at Bridge Zone Act 3 will show you a 1UP. Too bad in this one they only appear once and don't re-appear when you die...\n• There's also an Invincibility monitor right behind you in Mushroom Hill Zone Act 1 of Sonic and Knuckles.\n• Also happens in Sonic Colors. One of the levels in Aquarium Park features a Red Ring that can only be reached by going the \"wrong\" direction at the start of the level.\n• In Sonic Adventure 2, in Cannon's Core, if you move up the ramp Sonic spawns on, fighting the current with homing attacks, then you will be rewarded with jumping immediately into the semi-final boss.\n• In No More Heroes, you start each level leaving this motel. The hidden path behind the motel has a bunch of Lovikov balls that can be traded for power ups.\n• One of the animal orbs in Castle Crashers can only be found after proceeding forward into a cave (seemingly starting the next level) and then walking back outside the cave to where you once were.\n• Limbo has an achievement called \"Wrong Way\" for walking offscreen to the left as soon as the game starts.\n• Aladdin (Virgin Games) for the Sega Genesis, in the desert and prison levels.\n• In computer versions, the Mickey hat Easter Egg in the desert required you to go back to the start of the level to pick up the 1-up.\n• In the Fan Remake of Streets of Rage, this trope also rears its head. On the rooftop stage where you fight the jetpack dudes, there is a 1-up to the left of the screen, just behind the lorry engine.\n• The original Streets of Rage 2 also had a 1-up if you searched the bottom-left corner of the very first screen of the game.\n• In Vay, if you go behind one of the curtains in the throne room where you start, you'll find a trio of treasure chests contains 1500 gold pieces, a Broad Sword (a powerful early starting weapon for The Hero Sandor), and a Phoenix Heart (an item that completely restores one's HP, or can be sold for a hefty sum).\n• Two worlds in Vexx — The Neverglades and the final level — get crafty with the Wraithheart hiding. Although your first instinct in both cases is to proceed forward from the start point, The Neverglades has a cave hidden behind the entry gate that holds some extra lives and a Wraithheart puzzle, while the final stage has two hidden areas directly behind it (one of which is the entry to the castle the level takes place in).\n• Final Fantasy\n• Final Fantasy XIII likes to teleport you into an area after a cutscene, with a hallway behind you that you supposedly just came through. Backtracking will often get you a treasure sphere. Lampshaded at least once when, if you backtrack, a secondary party member says \"Hey! Where are you going!?\"\n• Crisis Core has a few of these in the missions, either hiding directly behind you or in a room backwards of where you start. Players may get used to twirling the camera at the start of each mission.\n• While it doesn't have \"levels\" per se, the fixed camera in God of War likes pointing you down corridors just as much as the level designers like putting stuff underneath the camera, just out of sight until you run up to it.\n• In Dark Colony there is a mission where moving the troops through the main path ends in heavy Martian opposition, while following an inconspicuous side path lets you easily bypass most enemies.\n• The second mission in 1998's Si N (if the previous mission succeeded) starts with the player character standing in a hallway in a bank after rappelling down from the roof. Most players will look around before moving forward through the linear path up to the main offices (wherein the level becomes more open) - however, if you turn around at the beginning of the level and walk back, you can access an ATM that (once you get the code later in the level) allows you to transfer millions of dollars from Big Bad Elexis Sinclaire's bank account to Blade's in a cool Easter Egg.\n• For whatever reason, it was common in Knights of the Old Republic to have lootable crates scattered around the Ebon Hawk's various landing zones through the game. They typically didn't have anything all that valuable, but it was always worth your while to look.\n• Gears of War 3 starts in Marcus' cabin, facing the door. Turning and looking at the desk instead of the door will reveal the campaign's first collectible—the $20 Dom owes Marcus from a bet he lost before the war.\n• Rayman Origins likes to hide small groupings of Lums and hearts near the starting areas. Not only do you have to go left, you also typically need to wall jump.\n• Several levels in Trine have a small ledge just above the starting point, with an experience vial or two.\n• There's one in the second-to-last level of Kid Icarus: Uprising, and if you go for it you trigger an extra bit of dialogue in which this trope is actually discussed. It leads to one of the Zodiac Chambers, and afterwards you get an explanation of what Zodiac Chambers actually are. Which is weird, because given how late you are in the game, the average player will have already discovered several by now.\n• Another late-game Zodiac Chamber requires you to backtrack across the grind rail you used to enter the area, which would seem counter-intuitive to most players.\n• In Demon's Souls, when you enter the first Boletaria Palace level, the archstone spawns you facing toward the main level, but behind you there's some treasure.\n• In Atlantis no Nazo, to the left of the starting point in the 1st Zone is a 500-point chest.\n• At the start of the second level of Black Tiger, if Black Tiger simply turns around and destroys the wall behind him, he'll find a bonus item hidden there.\n• In the final mission of Call of Duty: Finest Hour, the one with the bridge, if you turn around and check behind the dozer tank that featured in the previous level you will find a BAR and a M1919 machine gun. Incredibly useful for the level.\n• At least one Angry Birds level has a Golden Egg behind where the sling is set up. Getting it can be annoyingly hard.\n• In Shovel Knight, if you go left from the starting area of Pridemoor Keep, you'll find a music sheet and a place to catch a golden fish for some money. This area also has an Easter Egg , where smashing the wall above the music sheet's location will reveal the Yacht Club games logo.\n• In Alpha Prime, at the start of the first level, if you turn around instead of entering the titular Alpha Prime facility, there's an obscured path that leads to an assault rifle. This is before you otherwise get your first weapon, but as the rifle itself is naturally found by the end of the level, it isn't a huge bonus.\n• Omega Quintet often puts treasure boxes behind dungeon entry points. In fact it does this so often there's a specific indicator in the few dungeons where you can't backtrack to stop you. As for why the party didn't grab them on the way there, there areas tend to be dark alleyways or similar, and Verse Maidens teachnically aren't on duty until the cameras are rolling. They had to be on time for the start of the broadcast.\n• Life Goes On has several levels where the game's cuddly Killer Rabbit mascot is hidden just off the screen from the starting location, normally with some sort of puzzle to solve to reach him. Notably the first level has you just walking left and finding him with no puzzle to solve to get eaten.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/OffscreenStartBonus", "media_links": ["/pmwiki/pmwiki.php/VideoGame/Metroid1", "/pmwiki/pmwiki.php/VideoGame/SuperMetroid", "/pmwiki/pmwiki.php/VideoGame/MetroidZeroMission", "/pmwiki/pmwiki.php/VideoGame/LegoStarWars", "/pmwiki/pmwiki.php/VideoGame/IWannaBeTheGuy", "/pmwiki/pmwiki.php/VideoGame/GoldenEye1997", "/pmwiki/pmwiki.php/VideoGame/DukeNukem3D", "/pmwiki/pmwiki.php/VideoGame/TimeSplittersFuturePerfect", "/pmwiki/pmwiki.php/VideoGame/BioMenace", "/pmwiki/pmwiki.php/VideoGame/MegaManX", "/pmwiki/pmwiki.php/VideoGame/MegaManX6", "/pmwiki/pmwiki.php/VideoGame/MegaManX2", "/pmwiki/pmwiki.php/Franchise/Doom", "/pmwiki/pmwiki.php/VideoGame/DoomIIHellOnEarth", "/pmwiki/pmwiki.php/VideoGame/DonkeyKongCountry", "/pmwiki/pmwiki.php/VideoGame/DonkeyKongCountry1", "/pmwiki/pmwiki.php/VideoGame/DonkeyKongCountry2DiddysKongQuest", "/pmwiki/pmwiki.php/VideoGame/DonkeyKongCountryReturns", "/pmwiki/pmwiki.php/VideoGame/DawnOfMana", "/pmwiki/pmwiki.php/Franchise/Kirby", "/pmwiki/pmwiki.php/VideoGame/Kirby64TheCrystalShards", "/pmwiki/pmwiki.php/VideoGame/KirbysDreamLand", "/pmwiki/pmwiki.php/VideoGame/Oddworld", "/pmwiki/pmwiki.php/Franchise/SuperMarioBros", "/pmwiki/pmwiki.php/VideoGame/SuperMario64", "/pmwiki/pmwiki.php/VideoGame/SuperMarioBros3", "/pmwiki/pmwiki.php/VideoGame/PaperMarioTheThousandYearDoor", "/pmwiki/pmwiki.php/VideoGame/YoshisIsland", "/pmwiki/pmwiki.php/VideoGame/SuperMarioGalaxy", "/pmwiki/pmwiki.php/VideoGame/SuperMarioGalaxy2", "/pmwiki/pmwiki.php/VideoGame/TombRaiderII", "/pmwiki/pmwiki.php/VideoGame/MDK", "/pmwiki/pmwiki.php/VideoGame/JamesPond", "/pmwiki/pmwiki.php/VideoGame/CrashBandicoot", "/pmwiki/pmwiki.php/VideoGame/CrashBandicoot1996", "/pmwiki/pmwiki.php/VideoGame/CrashBandicoot2CortexStrikesBack", "/pmwiki/pmwiki.php/VideoGame/CrashBandicoot3Warped", "/pmwiki/pmwiki.php/VideoGame/Trackmania", "/pmwiki/pmwiki.php/VideoGame/WizardsAndWarriors", "/pmwiki/pmwiki.php/Franchise/Castlevania", "/pmwiki/pmwiki.php/VideoGame/CastlevaniaSymphonyOfTheNight", "/pmwiki/pmwiki.php/VideoGame/CastlevaniaCurseOfDarkness", "/pmwiki/pmwiki.php/VideoGame/CastlevaniaLamentOfInnocence", "/pmwiki/pmwiki.php/VideoGame/AstroBoyOmegaFactor", "/pmwiki/pmwiki.php/Franchise/StarWarsLegends", "/pmwiki/pmwiki.php/VideoGame/TheForceUnleashed", "/pmwiki/pmwiki.php/Literature/ShadowsOfTheEmpire", "/pmwiki/pmwiki.php/VideoGame/JediKnightJediAcademy", "/pmwiki/pmwiki.php/VideoGame/DarkForces", "/pmwiki/pmwiki.php/VideoGame/StarWarsStarfighter", "/pmwiki/pmwiki.php/VideoGame/MegaMan4", "/pmwiki/pmwiki.php/VideoGame/SeriousSam", "/pmwiki/pmwiki.php/VideoGame/BionicCommando", "/pmwiki/pmwiki.php/VideoGame/Bonk", "/pmwiki/pmwiki.php/VideoGame/LocoRoco", "/pmwiki/pmwiki.php/VideoGame/IndianaJonesAndTheStaffOfKings", "/pmwiki/pmwiki.php/VideoGame/SeveranceBladeOfDarkness", "/pmwiki/pmwiki.php/VideoGame/ViewtifulJoe", "/pmwiki/pmwiki.php/VideoGame/Gish", "/pmwiki/pmwiki.php/Film/IronMan1", "/pmwiki/pmwiki.php/VideoGame/Wolfenstein3D", "/pmwiki/pmwiki.php/VideoGame/SuperMarioWorld", "/pmwiki/pmwiki.php/VideoGame/SuperMonkeyBall", "/pmwiki/pmwiki.php/VideoGame/SonicTheHedgehog", "/pmwiki/pmwiki.php/VideoGame/SonicUnleashed", "/pmwiki/pmwiki.php/VideoGame/SonicAdventure", "/pmwiki/pmwiki.php/VideoGame/SonicColors", "/pmwiki/pmwiki.php/VideoGame/SonicAdventure2", "/pmwiki/pmwiki.php/VideoGame/NoMoreHeroes", "/pmwiki/pmwiki.php/Manga/DragonBall", "/pmwiki/pmwiki.php/VideoGame/CastleCrashers", "/pmwiki/pmwiki.php/VideoGame/Limbo", "/pmwiki/pmwiki.php/VideoGame/AladdinVirginGames", "/pmwiki/pmwiki.php/VideoGame/StreetsOfRage", "/pmwiki/pmwiki.php/VideoGame/Vay", "/pmwiki/pmwiki.php/VideoGame/Vexx", "/pmwiki/pmwiki.php/Franchise/FinalFantasy", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyXIII", "/pmwiki/pmwiki.php/VideoGame/CrisisCore", "/pmwiki/pmwiki.php/VideoGame/GodOfWar", "/pmwiki/pmwiki.php/VideoGame/DarkColony", "/pmwiki/pmwiki.php/VideoGame/SiN", "/pmwiki/pmwiki.php/VideoGame/KnightsOfTheOldRepublic", "/pmwiki/pmwiki.php/VideoGame/GearsOfWar3", "/pmwiki/pmwiki.php/VideoGame/RaymanOrigins", "/pmwiki/pmwiki.php/VideoGame/Trine", "/pmwiki/pmwiki.php/VideoGame/KidIcarusUprising", "/pmwiki/pmwiki.php/VideoGame/DemonsSouls", "/pmwiki/pmwiki.php/VideoGame/AtlantisNoNazo", "/pmwiki/pmwiki.php/VideoGame/BlackTiger", "/pmwiki/pmwiki.php/VideoGame/CallOfDuty", "/pmwiki/pmwiki.php/VideoGame/AngryBirds", "/pmwiki/pmwiki.php/VideoGame/ShovelKnight", "/pmwiki/pmwiki.php/VideoGame/AlphaPrime", "/pmwiki/pmwiki.php/VideoGame/OmegaQuintet", "/pmwiki/pmwiki.php/VideoGame/LifeGoesOn"], "non_media_links": ["/pmwiki/pmwiki.php/Main/WhenAllElseFailsGoRight", "/pmwiki/pmwiki.php/Main/EasyLevelTrick", "/pmwiki/pmwiki.php/Main/BehindTheBlack", "/pmwiki/pmwiki.php/Main/GuideDangIt", "/pmwiki/pmwiki.php/Main/Unwinnable", "/pmwiki/pmwiki.php/Main/UrExample", "/pmwiki/pmwiki.php/Main/ChainsawGood", "/pmwiki/pmwiki.php/Main/InsurmountableWaistHeightFence", "/pmwiki/pmwiki.php/Main/GameMod", "/pmwiki/pmwiki.php/Main/OneUp", "/pmwiki/pmwiki.php/Main/UniqueEnemy", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/JustifiedTrope", "/pmwiki/pmwiki.php/Main/OneHundredPercentCompletion", "/pmwiki/pmwiki.php/Main/AddedAlliterativeAppeal", "/pmwiki/pmwiki.php/Main/DevelopersForesight", "/pmwiki/pmwiki.php/Main/EenieMeenieMinyMoai", "/pmwiki/pmwiki.php/Main/GoroawaseNumber", "/pmwiki/pmwiki.php/Main/TurboGrafx", "/pmwiki/pmwiki.php/UsefulNotes/ZXSpectrum", "/pmwiki/pmwiki.php/Main/FridgeLogic", "/pmwiki/pmwiki.php/Main/ROMHack", "/pmwiki/pmwiki.php/Main/ShoutOut", "/pmwiki/pmwiki.php/UsefulNotes/SegaGenesis", "/pmwiki/pmwiki.php/Main/EasterEgg", "/pmwiki/pmwiki.php/Main/FanRemake", "/pmwiki/pmwiki.php/Main/TheHero", "/pmwiki/pmwiki.php/Main/FreeRotatingCamera", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/EasterEgg", "/pmwiki/pmwiki.php/Main/ContinuityNod", "/pmwiki/pmwiki.php/Main/EasterEgg", "/pmwiki/pmwiki.php/Main/KillerRabbit"]}