{"title": "Cultural Personality Makeover", "content": "Somebody, frequently an Ordinary High-School Student, discovers something: a photo, a family record, etc., that reveals some long-lost ancestor or unknown relative belonged to some particular unusual culture. This leads the person to realize they themselves are, technically, at least, a part of that culture too.\n\nSuddenly, they become absolutely entranced by the notion of being part of this new group. The character begins researching, reading all about the culture, it's history and background, and famous people who are a part of it. They start to decorate with tribal trinkets or symbols, changes their clothing style to incorporate \"traditional\" parts of the garb, and may even begin to act in the manner that the group is supposedly supposed to act like. This will usually start to annoy their friends and possibly offend people of the particular culture who have known about it their whole lives, as the newcomer is behaving more like a stereotype than a real human being, and could end up getting them a Pretender Diss.\n\nThis trope will almost always end with a Snap Back, where the character realizes they are subsuming who they really are in favor of this, and either give up the new culture entirely, or, depending on the continuity of the series, may still keep some subtle hints to it as acknowledgment without obsession. It seems to be a method by creators to add a bit of flavor to a character or to explore the issues of cultural identity.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/CulturalPersonalityMakeover", "media_links": ["/pmwiki/pmwiki.php/Series/WillAndGrace", "/pmwiki/pmwiki.php/Series/HowIMetYourMother", "/pmwiki/pmwiki.php/Series/StarTrekTheNextGeneration", "/pmwiki/pmwiki.php/Webcomic/KevinAndKell", "/pmwiki/pmwiki.php/WesternAnimation/AllGrownUp", "/pmwiki/pmwiki.php/WesternAnimation/FamilyGuy", "/pmwiki/pmwiki.php/WesternAnimation/AsToldByGinger", "/pmwiki/pmwiki.php/WesternAnimation/SouthPark", "/pmwiki/pmwiki.php/WesternAnimation/MyLittlePonyFriendshipIsMagic", "/pmwiki/pmwiki.php/WesternAnimation/HighSchoolUSA"], "non_media_links": ["/pmwiki/pmwiki.php/Main/OrdinaryHighSchoolStudent", "/pmwiki/pmwiki.php/Main/PretenderDiss", "/pmwiki/pmwiki.php/Main/SnapBack", "/pmwiki/pmwiki.php/Main/LukeIMightBeYourFather", "/pmwiki/pmwiki.php/UsefulNotes/SATs"]}