{"title": "Rewarding Inactivity", "content": "Some games reward a character for not tackling the challenge in front of them. This could be a form of Dynamic Difficulty, where the player is given an advantage if they haven't managed to overcome an obstacle after a certain amount of time, or may be a solution to a puzzle. In some cases, especially with MMORPGs, they actually reward you for logging off entirely!\n\nOne unusual application of this idea is the Automatic Level: do nothing, and it plays itself out.\n\nRelated to Just Ignore It. Compare Sheathe Your Sword for the Puzzle Boss version of this.\n\nSee also Idle Game, a genre of games in which automatic progress without the player's input is a core mechanic.\n\nContrast Guilt-Based Gaming, in which the game tries to make you feel bad for being idle or gone for a while. Despite the title, this is not Wins by Doing Absolutely Nothing, as the latter case does not happen on purpose.\n• Some secret items in Koudelka can only be acquired with a certain number of items in your inventory, and a saved game saved at precisely a certain point of time in the game timer; the really good items require you to wait longer than it takes to beat the entire game.\n• Wario Land\n• One of the hidden paths in Wario Land 2 requires you to have Wario sleep in, by simply not pressing a button to wake him up at the start of the first level. After a few seconds (thirty seconds if this your first time playing the level), the stage ends and you get the new story.\n• One of the microgame themes in WarioWare Touched requires you to use the mic. Since nearly every game in the theme can be beaten just by blowing into the mic all the time, they'll occasionally be replaced (even if you're playing the single-game mode in the album!) with a tightrope-walking game that requires you to make no detectable noise at all.\n• WarioWare Twisted! also featured a microgame where you weren't supposed to create any input through the motion sensor. This is hard when it comes up in a normal game, but easy to do in the dedicated album mode (just set the console down for a few minutes).\n• In the WarioWare stage on Super Smash Bros. Brawl, one of the microgames that may pop up is to stand still and do nothing. However, stomping over this trope with steel-shod boots, it's sometimes better to suck down any punishment handed out for failing the Microgame... by landing some seriously heavy hits on your static opponents, since even the AI tries to follow the game's instruction to stay still. Falcon PUNCH!\n• Suikoden II, Dark Forces: Mysteries Of The Sith, The Elder Scrolls IV: Oblivion, and Xenogears all feature fights where you're supposed to do nothing but defend until your opponent gives up. Fighting back results in failure (or blocking off the best ending).\n• A common Secret Test of Character in some games involves the hero being given a morally dubious task. If he refuses to do it, he passes the test.\n• In Final Fantasy IV, Cecil's class change pits him with his Dark Knight alter ego. The idea is that Cecil must not reject or destroy his dark self violently, meaning he has to stay on guard until the shadow recedes on it own.\n• In the Game Boy Advance re-release, Cecil is given some extra Paladin tasks to do in the Bonus Dungeon. One of them is standing guard in front of a door. No matter what kind of interesting, profitable, threatening or otherwise just plain funky things happen in front of you, you fail the quest if you step away.\n• In Final Fantasy V, one of the boss battles is Gogo the mimic who performs whatever attack you do. To win, you have to do nothing. For extra pressure to attack, the battle also takes place after an underwater dungeon with a time limit which continues counting down during the boss battle...\n• In Final Fantasy XI, the quest to obtain the ranger job requires you to deal with the Old Sabertooth... by simply waiting for it to die. You can kill it, and it isn't even particularly hard, but it has to be allowed to die peacefully of old age for you to actually complete the quest.\n• There's the famous example from Earthbound where you have to stand motionless in front of a waterfall for three minutes to proceed. In this one LP of the game on Youtube, when the player got up to that part of the game, the video description said it all: \"Three minutes of nothing. Now is the time to make yourself a sandwich.\"\n• There is also the part when you first get Poo where you have to meditate on a mountain for a short period of time to proceed with the story. A number of NPCs will keep distracting you with urgent news, but you need to ignore all of them or you have to start over from the beginning.\n• At the end of Escape from Monkey Island, you face LeChuck in a battle of Monkey Kombat, but his health regenerates too quickly for you to defeat him while your own health regenerates too quickly for him to defeat you. The only way to win is to get a tie (the fight is like rock-paper-scissors) three times in a row — it's been established earlier that three ties in a row will cause your opponent to clasp his head in annoyance, and when LeChuck does the same, he crushes his partner in crime Ozzie Mandrill and the Artifact of Doom Ozzie was using to control him, triggering a huge explosion.\n• For some Pokémon, choosing not to evolve at the \"normal\" times opens up new avenues of possibility. Pokemon earlier in an evolution line learn moves earlier, or learn moves that later evolutions can't learn at all.\n• Also in Pokémon, the door to Regice's chamber in Pokémon Ruby and Sapphire and its remakes is unlocked by reading a braille message, which tells you to stand there for two minutes.\n• In Gen VI, not evolving a Pokemon that evolves via level gives it bonus exp once it has reached the normal evolving level\n• In Quest for Glory II, a Magic User player can find the Wizard's Institute of Technocery and take a test to become a full-fledged Wizard; after passing the tests you're given the option of either accepting or rejecting the head wizards' invitation. Accepting gets you a Non-Standard Game Over where your character abandons his heroic quest to study magic, leaving his friends in Shapeir to their fate; rejecting the offer gets you kicked out, but Erasmus congratulates you on the right choice (since what good is knowledge if you don't use it?) and rewards you with the Reversal spell and title of Wizard.\n• FoxTrot did a series of strips where Jason struggles to pass a seemingly invincible boss in a video game, only for Paige to get past it when he goes to the bathroom. After a week of strips where Jason pleads with her to tell him the secret, she eventually reveals that all she did was walk past it without trying to attack.\n• Landstalker has this for a crypt puzzle. A bunch of monsters drop down and the way to solve the puzzle is to just stand there. The monsters won't attack you if you don't move. It can be a very frustrating puzzle as the player is pretty much trained to attack all monsters on sight and not to let them approach you.\n• The developers of City of Heroes added \"day job rewards\" as an Anti Poop-Socking measure. When you log off in certain areas of the game, you gain a temporary power. The longer you are logged off there, the better the power.\n• City of Heroes also features several badges that are rewards for basically just being in a particular zone for a long enough time. It's possible to acquire those badges just by entering the zone, finding a safe spot, and walking away from your computer.\n• Similarly, World of Warcraft gives you a temporary experience bonus for logging off in an inn or allied city.\n• Staying in your Home or logging out while inside your Home in MapleStory 2 causes Rest Experience to accumulate, which gives you an Experience Booster effect that persists until you reach a specific EXP threshold. The threshold increases the longer you are in your Home.\n• There's a segment in Chrono Cross, while infiltrating an enemy base, where someone asks you for a password and a list of choices pops up. The correct answer is silence - leave it alone for a few seconds and they'll let you in.\n• One of the endings in Please, Don't Touch Anything requires you to defy the Schmuck Bait of the title for about a minute.\n• Similarly, in Sakura Wars you frequently have to choose from a list of three things you can make your character say, and in several cases the best choice is actually to say none of them.\n• Played with in Dragon Nest. You get a title for entering a dungeon and doing no damage at all till the end. You are more of an escort than an adventurer as you can still move around but you can't attack.\n• Chrono Trigger does this. At one point you're locked in a cell, awaiting execution. You can bait the guards into attacking you, beat them (they were stupid enough to leave you your weapon), and escape by fighting your way though the dungeon. Alternatively, you can wait in your cell quietly until the time for your scheduled execution arrives and be escorted to a guillotine. At which point one of your friends comes to bust you out, which means you have two characters to explore the dungeon with. Or if you feel that you don't need any of the items you can find there, you can just pretty much walk to the exit that's literally 2 rooms away and fight the next boss.\n• This is how you get one of the Secret Stars in Braid. You have to spend two hours waiting for a cloud to move across the level.\n• The only way to open one of the locked corridors in The Guardian Legend is to wait for a specified amount of time.\n• In the videogame version of Monty Python's The Meaning of Life, the only way to get the Plot Coupon in the Japanese rock garden is to do nothing. Twice.\n• Lost Odyssey includes a battle in which the Big Bad turns one of your own party members into a People Puppet and forces him to attack you. There's no way to break the villain's control, and killing your friend results in an immediate Game Over, so the only option is to simply not act.\n• In the breakout game Ricochet (one of the earlier versions) there was a level that played itself out perfectly if you simply released the ball without moving the ship. If you changed the position of the ship at all before releasing the ball, you had to play the whole screen yourself, and probably wouldn't get all of the blocks.\n• Uru: Path of the Shell takes this trope to an egregious level; you have to stand your character in a particular light, unmoving, for 15 minutes.\n• A Half-Life mod Half Quake Amen had a part where you have to wait in some place that's supposed to be a train station of sorts for about 20 minutes. Appropriately enough, the said part is called Patience.\n• Required in one part of Mario & Luigi: Bowser's Inside Story. You have to simply wait until Bowser's back is healed before proceeding. The game even suggests that you enjoy a cup of tea while doing so.\n• Subverted in that there's a cheat code you can input to greatly speed up the process but finding it or even knowing it exists is another matter entirely.\n• Unintentionally introduced in Team Fortress 2 with Randomly Drops. The originally had no way of telling if the player is actually, well, playing. This spawned a plethora of idling servers with small maps with AFK-monitoring disabled so the player can then minimize the game and do whatever else he wants while still enjoying the same chance to get new items as an active player. Eventually the system changed so once you get a drop, you can't get another one until you acknowledge it in your menu.\n• One quest in Oblivion requires you to prove that you're peaceful by not fighting a giant bear that appears to you. You may need to run from it for a bit, though.\n• There's this section in The Legend of Zelda: Phantom Hourglass where you have to close the DS to put the location of an important key on your map. The instructions are very unclear, however, leading many players to close the DS and give up. When they opened the DS again, the mark is now on the map!\n• In The World Ends with You, there are three types of XP used to level up pins (basically spells/attacks): Battle, Shutdown, and Mingle. The latter two can only be acquired by not playing the game, and since some pins require them to evolve, if you want 100% completion you'll have to stop playing at some point.\n• In Mario Adventure, a notable hack of Super Mario Bros. 3, a few of the levels in Desert Dares (World 7) asks you to survive for about 30 seconds in a single-screen level with a Wakitu (a Lakitu that drops bombs instead of spines). One in particular seems impossible, until...\n• The Easy-difficulty CPUs in Mario Party games will sometimes make your job very easy. A rather impressive demonstration can be seen here .\n• This is the entire premise of . Clicking or even so much as moving the mouse while the puppy is in the line of fire will instantly kill it, so the only way you can beat every level is by not doing anything.\n• In Metal Gear Solid 3 One of the bosses dies of old age (should the player wait too long before resuming the game mid-battle, or change the PlayStation 2's internal clock), Snake will feel guilty for letting him down, since The guy's dying wish was to fight him. Zero will also comment that Snake's mission is \"not a game.\"\n• In Tales of Symphonia, one of Genis' \"Dependent\" title is obtained by finishing a battle with him doing absolutely nothing.\n• The entire concept behind IdleRPG, a game on IRC servers where the number of seconds you idle translate into Experience Points and levels. You actually get punished for taking any kind of action, such as speaking in the IdleRPG channel.\n• In Dawn of War, the Bloodthirster Greater Daemon takes persistent damage whenever it isn't engaged in close combat! In the campaign mode, because of the 'Thirster's rather boneheaded AI, all you need to do to kill it is to have it chase one unit in a circle while another unit opens fire, and wait for it to crumble away. Seriously.\n• No small surprise, but , though incapable of flight, is not nearly as stupid (considering that he was a Manipulative Bastard even when he was a mere mortal ), and will lash out with various area-of-effect attacks if you try to pull that crap on him. \"PATHETIC CREATURES!!!\"\n• In Harvest Moon: Magical Melody, you acquire the Stationary Note by simply standing still for a minute.\n• One of the achievements for \"The Saboteur\" is for Sean to smoke fifty cigarettes. You can make him smoke by clicking the thumbstick, but Sean will light up if he's idle for a moment, so you can put the controller down and walk away for an hour.\n• A Sega Genesis Barney game had Barney complete the level himself if you didn't touch anything for awhile.\n• Portal 2 has an achievement for doing nothing in test chambers.\n• In Sword of the Stars, it is inadvisable to destroy Von Neumann ships, as this leads to attacks by the more powerful Berserkers.\n• In The Sims Medieval you can actually take quests from Silver to Gold or Gold to Platinum by waiting a while between quest tasks, so long as all the Sims doing the quest have high Focus. Waiting too long gives you reminders that you're behind on your quest, the last one being \"Dangerously Behind on Quest\" which actually takes focus away, but waiting almost an entire in-game day does nothing but increase the Performance Meter.\n• Touhou fangame The Genius Of Sappheiros makes it possible to recruit Byakuren at the beginning of the game by heading to the Myouren Shrine and waiting an hour.\n• Version 1.07 of The Witch's House adds one of these in the form of '___'. Simply waiting on the first screen for a full hour causes the house and the rose gate to simply disappear, letting Viola walk away without ever having to enter .\n• A perhaps unintentional example in Saints Row: The Third, it's generally much easier to complete the first half of Guardian Angel missions if you don't try to fire any rockets at the incoming cars. Said cars can barely damage your ally, while your rockets can take off a fifth of your ally's health if you happen to hit a car that's close to them (or purposely aim for them, which can be forgiven since it's usually Pierce you're protecting).\n• Far Cry 4 has a very interesting example of this. At the start of the game, when Pagan Min tells you to stay and enjoy the crab rangoon, you can choose to do just that instead of escaping. Wait in the room for about 13 minutes and you will get a secret ending where he takes you to where you were supposed to scatter your mother's ashes - your whole goal of coming back to Kyrat in the first place - and \"Could Have Avoided This!\" Plot if you had acted like a normal person rather than a video game character.\n• Far Cry 5 also has this. Waiting around 90 seconds when given the prompt to arrest Joseph at the beginning has one of your cop buddies call off the arrest, realizing how hopelessly outmatched they currently are. This is the closest thing there is to a good ending.\n• Clicker Heroes is already an Idle Game that runs itself even if you don't play it, but it takes it one step further by letting you purchase upgrades that massively boost your damage and gold output if and only if you don't click on monsters for at least a minute.\n• Anti-Idle: The Game is already a game that lets you progress even without making input, but it takes it a step further with REST bonuses: If you close the game and come back to it at least an hour later, you will gain \"Offline Progress\" in the form of EXP, Coins, and other resources, and you will also go into REST mode, in which various things are buffed for as long as the REST timer is ticking down. The longer you're away, the more REST time you'll have, up to 99:59:59. Or, you can just purchase REST time with Blue Coins or White Coins, but the cost is not trivial.\n• If you think of The Game, you lose. Thus by not playing it, you win.\n• By the way, you just lost The Game.\n• Uncharted 4: A Thief's End adds relics to an offline bank each day you don't play, to a maximum of 250. Each match you play gives you 20 relics from the bank, 10 if only 50 remain in bank, and 5 from 25 onwards.\n• There's also a trophy for recreating the controller failure during their E3 demo. When you get to the point in the game which they were demonstrating, simply put your controller down and do nothing for 30 seconds to recieve it.\n• Triangle Service's console ports of their games each award you with a \"Long Time No See\" achievement for taking a few days' break from the game.\n• In Realm Grinder, doing absolutely nothing at the start of a run for 5 minutes awards you the \"Need a Headstart?\" Trophy.\n• Being an Idle Game, progress will eventually come to letting the game play on it's own. The Undead and Drow factions both have upgrades that only work while idling/offline.\n• One of the earliest tasks in Fable is scraping together coins to buy your sister a gift, and one way to do it is by helping a farmer with watching his storehouse. A younger boy tries to tempt you into smashing the farmer's stuff, which will net you a coin, or you can simply stand on the spot and wait for the farmer to get back, which will get you the same result but with better karma. Boy: \"Are you just going to stand there all day like a lemon?\"\n• The Hitchhiker's Guide to the Galaxy has a few points where you pass out, wake up in a dark void, and need to 'wait' until your total sensory deprivation becomes less than total, then focus on whichever sense did register something after all.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/RewardingInactivity", "media_links": ["/pmwiki/pmwiki.php/Webcomic/Narbonic", "/pmwiki/pmwiki.php/VideoGame/Koudelka", "/pmwiki/pmwiki.php/VideoGame/WarioLand", "/pmwiki/pmwiki.php/VideoGame/WarioLand", "/pmwiki/pmwiki.php/VideoGame/WarioWare", "/pmwiki/pmwiki.php/VideoGame/WarioWare", "/pmwiki/pmwiki.php/VideoGame/WarioWare", "/pmwiki/pmwiki.php/VideoGame/SuperSmashBrosBrawl", "/pmwiki/pmwiki.php/VideoGame/SuikodenII", "/pmwiki/pmwiki.php/VideoGame/DarkForcesSaga", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsIVOblivion", "/pmwiki/pmwiki.php/VideoGame/Xenogears", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyIV", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyV", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyXI", "/pmwiki/pmwiki.php/VideoGame/EscapeFromMonkeyIsland", "/pmwiki/pmwiki.php/VideoGame/PokemonRubyAndSapphire", "/pmwiki/pmwiki.php/VideoGame/QuestForGloryII", "/pmwiki/pmwiki.php/VideoGame/CityOfHeroes", "/pmwiki/pmwiki.php/VideoGame/CityOfHeroes", "/pmwiki/pmwiki.php/VideoGame/WorldOfWarcraft", "/pmwiki/pmwiki.php/VideoGame/Maplestory2", "/pmwiki/pmwiki.php/VideoGame/ChronoCross", "/pmwiki/pmwiki.php/VideoGame/PleaseDontTouchAnything", "/pmwiki/pmwiki.php/VideoGame/SakuraWars", "/pmwiki/pmwiki.php/VideoGame/DragonNest", "/pmwiki/pmwiki.php/VideoGame/ChronoTrigger", "/pmwiki/pmwiki.php/VideoGame/Braid", "/pmwiki/pmwiki.php/VideoGame/TheGuardianLegend", "/pmwiki/pmwiki.php/Film/MontyPythonsTheMeaningOfLife", "/pmwiki/pmwiki.php/VideoGame/LostOdyssey", "/pmwiki/pmwiki.php/VideoGame/Uru", "/pmwiki/pmwiki.php/VideoGame/HalfLife1", "/pmwiki/pmwiki.php/VideoGame/MarioAndLuigiBowsersInsideStory", "/pmwiki/pmwiki.php/VideoGame/TeamFortress2", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsIVOblivion", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaPhantomHourglass", "/pmwiki/pmwiki.php/VideoGame/TheWorldEndsWithYou", "/pmwiki/pmwiki.php/VideoGame/SuperMarioBros3", "/pmwiki/pmwiki.php/VideoGame/MarioParty", "/pmwiki/pmwiki.php/VideoGame/MetalGearSolid3", "/pmwiki/pmwiki.php/VideoGame/TalesOfSymphonia", "/pmwiki/pmwiki.php/VideoGame/DawnOfWar", "/pmwiki/pmwiki.php/VideoGame/HarvestMoonMagicalMelody", "/pmwiki/pmwiki.php/VideoGame/TheSaboteur", "/pmwiki/pmwiki.php/Series/BarneyAndFriends", "/pmwiki/pmwiki.php/VideoGame/Portal2", "/pmwiki/pmwiki.php/VideoGame/SwordOfTheStars", "/pmwiki/pmwiki.php/VideoGame/TheSimsMedieval", "/pmwiki/pmwiki.php/VideoGame/Touhou", "/pmwiki/pmwiki.php/VideoGame/TheWitchsHouse", "/pmwiki/pmwiki.php/VideoGame/SaintsRowTheThird", "/pmwiki/pmwiki.php/VideoGame/FarCry4", "/pmwiki/pmwiki.php/VideoGame/FarCry5", "/pmwiki/pmwiki.php/VideoGame/ClickerHeroes", "/pmwiki/pmwiki.php/VideoGame/AntiIdleTheGame", "/pmwiki/pmwiki.php/VideoGame/Uncharted4AThiefsEnd", "/pmwiki/pmwiki.php/VideoGame/RealmGrinder", "/pmwiki/pmwiki.php/VideoGame/Fable", "/pmwiki/pmwiki.php/VideoGame/TheHitchhikersGuideToTheGalaxy"], "non_media_links": ["/pmwiki/pmwiki.php/Main/INeedAFreakingDrink", "/pmwiki/pmwiki.php/WebVideo/RBGProductions", "/pmwiki/pmwiki.php/Main/DynamicDifficulty", "/pmwiki/pmwiki.php/Main/WaitingPuzzle", "/pmwiki/pmwiki.php/Main/MMORPG", "/pmwiki/pmwiki.php/Main/AntiPoopSocking", "/pmwiki/pmwiki.php/Main/AutomaticLevel", "/pmwiki/pmwiki.php/Main/JustIgnoreIt", "/pmwiki/pmwiki.php/Main/SheatheYourSword", "/pmwiki/pmwiki.php/Main/PuzzleBoss", "/pmwiki/pmwiki.php/Main/IdleGame", "/pmwiki/pmwiki.php/Main/GuiltBasedGaming", "/pmwiki/pmwiki.php/JustForFun/IThoughtItMeant", "/pmwiki/pmwiki.php/Main/WinsByDoingAbsolutelyNothing", "/pmwiki/pmwiki.php/Main/GuideDangIt", "/pmwiki/pmwiki.php/Main/SecretTestOfCharacter", "/pmwiki/pmwiki.php/UsefulNotes/GameBoyAdvance", "/pmwiki/pmwiki.php/Main/BonusDungeon", "/pmwiki/pmwiki.php/Videogame/Earthbound", "/pmwiki/pmwiki.php/Main/ChekhovsGun", "/pmwiki/pmwiki.php/Main/ArtifactOfDoom", "/pmwiki/pmwiki.php/Videogame/Pokemon", "/pmwiki/pmwiki.php/Videogame/Pokemon", "/pmwiki/pmwiki.php/Main/NonStandardGameOver", "/pmwiki/pmwiki.php/ComicStrip/FoxTrot", "/pmwiki/pmwiki.php/Main/SheatheYourSword", "/pmwiki/pmwiki.php/Main/AntiPoopSocking", "/pmwiki/pmwiki.php/Main/ExperienceBooster", "/pmwiki/pmwiki.php/Main/SchmuckBait", "/pmwiki/pmwiki.php/Main/ScrappyLevel", "/pmwiki/pmwiki.php/Main/PlotCoupon", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/PeoplePuppets", "/pmwiki/pmwiki.php/Main/GameOver", "/pmwiki/pmwiki.php/JustForFun/Egregious", "/pmwiki/pmwiki.php/Main/ExactlyWhatItSaysOnTheTin", "/pmwiki/pmwiki.php/Main/RandomlyDrops", "/pmwiki/pmwiki.php/Main/GuideDangIt", "http://il.youtube.com/watch?v=m6PxRwgjzZw", "http://www.kongregate.com/games/Aragagg/dont-shoot-the-puppy", "/pmwiki/pmwiki.php/UsefulNotes/PlayStation2", "/pmwiki/pmwiki.php/Main/ExperiencePoints", "/pmwiki/pmwiki.php/Main/AxCrazy", "/pmwiki/pmwiki.php/Main/ArtificialStupidity", "/pmwiki/pmwiki.php/Main/WeWait", "/pmwiki/pmwiki.php/Main/CriticalExistenceFailure", "/pmwiki/pmwiki.php/Main/ManipulativeBastard", "/pmwiki/pmwiki.php/Main/AGodAmI", "/pmwiki/pmwiki.php/Main/LargeHam", "/pmwiki/pmwiki.php/UsefulNotes/SegaGenesis", "/pmwiki/pmwiki.php/Main/DiscOneNuke", "/pmwiki/pmwiki.php/Main/EscortMission", "/pmwiki/pmwiki.php/Main/VideoGameCrueltyPotential", "/pmwiki/pmwiki.php/Main/TheScrappy", "/pmwiki/pmwiki.php/Main/CouldHaveAvoidedThisPlot", "/pmwiki/pmwiki.php/Main/IdleGame", "/pmwiki/pmwiki.php/Main/IdleGame", "/pmwiki/pmwiki.php/Main/IdleGame", "/pmwiki/pmwiki.php/Main/RewardingVandalism", "/pmwiki/pmwiki.php/Main/SweetAndSourGrapes", "/pmwiki/pmwiki.php/Main/ControllableHelplessness"]}