{"title": "Talky Bookends", "content": "Often used in the Concept Video to help set up and conclude the \"story\", Talky Bookends are those music-free scenes you get at the beginning and end of a music video. In more experimental (or self-indulgent) videos, they can seem to go on for longer than the music.\n\nThe bookends don't really have to come in pairs — sometimes a video will just have an introduction and end in a more traditional way; other times it will play through like an ordinary video and end with a brief non-music scene. It's still a bookend, though, even if there's just one of it.\n\nNote that the bookends don't really have to feature conversation or even any dialogue at all — sometimes it's as simple as a dialogue-free sequence showing the band setting up their equipment.\n\nRepeat showings of the videos tend to quietly cut out the Talky Bookends, particularly if they go on too long.\n• Michael Jackson's Thriller, which is about fourteen minutes long, was the Trope Codifier; it's about five minutes before we get to the song. From that point onward, many of his bigger videos had these, to the point that they could run upwards of ten minutes (he preferred they be called short films). After their initial airings they were usually trimmed to just the song portion.\n• Bad: The setup establishes that Michael's character is an inner-city youth who was able to attend a private school, and when he returns to his old neighborhood, his former gangmates want him to prove he's still tough. When he cannot bring himself to rob an old man in the subway, the resultant challenge from the leader leads into the song; the full-length version ends with the leader accepting that he's still tough, but in a way that does not require violence to prove it. Keep in mind that this video is 18 minutes long and the song takes up a good five on its own.\n• \"Weird Al\" Yankovic parodies the setup in a much-condensed manner in \"Fat\", to the point that it's not trimmed for time.\n• Moonwalker's segments for \"Speed Demon\" and \"Smooth Criminal\" from Bad — Michael is pursued on a movie set in the former, and the latter sandwiches the song in an elaborate fantasy story about him, his child friends, and Joe Pesci's character Frankie Lideo, who wants to profit from selling drugs to children. Michael saves the day by turning into a sportscar, mecha and spaceship. The middle ten minutes is the music video proper; set in an old dance hall, it has nothing to do with the plot whatsoever.\n• \"Black or White\": Macaulay Culkin's playing his music too loud, and when dad George Wendt objects, he gets blasted out of the house in retaliation. The infamous closing segment is an extended, music-less dance piece for Michael that features a lot of crotch-grabbing and property-smashing.\n• \"Remember the Time\": In ancient Egypt the pharaoh's wife is bored, and he isn't happy to discover that the only performer brought to entertain her turns out to be her former lover Michael.\n• Ghosts is actually a short film at 38 minutes, with three songs — but there's lots of talking; Michael is a spirit of some sort who faces a Torches and Pitchforks mob of angry parents who disapprove of his secretly meeting with their children for ghost stories.\n• \"You Rock My World\": Circa the 1930s, Michael and his buddy Chris Tucker pursue a pretty woman into a mob-run club whose leader is played by Marlon Brando.\n• An odd Performance Video example: The sequence of the Eagles warming up before \"Hotel California\".\n• Billy Joel's \"Uptown Girl\" has an opening which was only shown when it premiered on NBC's old Friday Night Videos show: it started off with Joel watching a fragment of his \"Tell Her About It\" video on a TV in the gas station that is the set for the whole video, which then briefly cuts to the bumper for Friday Night Videos before he shuts off the TV and launches into the song.\n• \"Tell Her About It\" starts with an intro of Billy Joel and his band (\"B.J. and the Affordables\") on a \"broadcast\" of The Ed Sullivan Show. The video ends with Joel walking off stage, with Rodney Dangerfield and a dancing bear waiting in the wings. And guess who gets to follow Billy's act?\n• Somewhat subverted and twisted by Steve Perry's \"Oh Sherrie\". It starts off looking like a Concept Video set in the Middle Ages, but the music grinds to a halt and we discover we're on the set for the video. Perry is disgusted with the production difficulties, walks off the set and ends up singing the song to his girlfriend as she walks up. The video ends with everyone getting back into position to film the \"real\" video again.\n• All of Poison's early videos featured a brief introduction which not only hinted at the theme of the featured song, but also included a snippet from a previous video or song.\n• Other '80s hair metal bands had the same general idea: Cinderella, Mötley Crüe, Killer Dwarfs, etc. A standout was Twisted Sister, with videos where the introduction led into rebellious slapstick against an abusive authority figure.\n• The video for Tom Waits' song \"Downtown Train\" from Rain Dogs starts with two old people discussing how \"Everytime there's a full moon he comes out and sings. It drives me crazy!\"\n• Jon Spencer Blues Explosion's video for \"Dang\" starts with a very brief phone conversation.\n• The video for Gnarls Barkley's \"Smiley Faces\" features Dennis Hopper and Dean Stockwell as scholars debating whether the man named \"Gnarls Barkley\" ever existed.\n• And then Gnarls Barkley's latest video, \"Run (I'm A Natural Disaster)\" (the one not allowed on MTV due to failing an epilepsy test), features Justin Timberlake as the host of a '60s-style music show called City Vibin' before introducing the song and after the song.\n• \"Hello\", by Lionel Richie. Seemingly a sappy romance, unless you consider you consider that the video tells the story of a teacher stalking a blind girl from his class, calling her in the middle of the night to ask if \"it's me you're looking for\".\n• The Decemberists' \"Oh Valencia!\" does this to start and end the video's tragic plot.\n• Architecture In Helsinki's \"Heart It Races\" starts with a voiceover about a strange tribe's weird rites, which apparently involve dancing in neon costumes.\n• Alice in Chains - \"Rooster\" starts with a few clips of an interview with Jerry Cantrell's father about the Vietnam War. Fitting, as the song is about his service in the conflict.\n• A more humorous version occurs at the beginning of the Super Viral Brothers' video for \"Captain Cessna,\" with the singer's father describing his run-in with the titular Captain.\n• \"I Can't Dance\" by Genesis ends with one of these. It's an homage/parody of the segment that originally closed Michael Jackson's \"Black and White\" from Dangerous.\n• Also \"Jesus He Knows Me,\" which opens with Phil Collins as an unscrupulous televangelist asking viewers to contribute eighteen million dollars to the Lord.\n• And Phil Collins' song \"Don't Lose My Number\" has a very surreal meta video that involves him talking to directors about their ideas for the song's music video (each of which parodies another music video or movie). The video doesn't just have an opening and closing, it continually cuts away to the dialogue throughout the song. If you've ever wanted to see Phil Collins fending off the post-apocalyptic goons from Mad Max or battling a samurai warrior in ancient Japan, this is the video for you.\n• \"I Wish It Would Rain Down\" starts off at a rehearsal for a show, with a complaining director. The singer for \"Rain\" is missing, so 'Bill Collins' (who \"used to be the drummer for a really good band, and when the singer left, he took over\") gets elected to sing it. Throughout the song, he performs in the show, tours, gets a part in a movie, becomes rich and famous, wins awards... and then it turns out it was all an Imagine Spot, and the ending bookend is the director deciding to cut the number. \"This was not good.\"\n• Sting's \"Fortress Around Your Heart\" video had an opening with a midget coming up to him as he's sleeping, and saying \"Mr. Sting, Mr. Sting, wakey wakey! Mr. Sting! You have a visitor. I think he remembers you.\"\n• Bruce Springsteen as a pump jockey at a gas station asking the woman if she wants her car brought back to her house, and she says that she'll come get it later. Then the song \"I'm On Fire\" where he tells of his burning love for her (in his head) and it ends up with him driving the car to her place anyway, him seeing her husband, leaving the car keys in the mailbox, then walking away, smiling anyway.\n• The song is so short that the entire introduction is usually included when the video is shown.\n• Of course, Green Day's \"Wake Me Up When September Ends\".\n• Also an example of a non-humourous Mid-Vid Skit.\n• Brad Paisley has done this a number of times over the years. His videos for \"I'm Gonna Miss Her,\" \"Celebrity,\" \"Online,\" and \"Waitin' on a Woman\" each hold bookends, including appearances by William Shatner, Jason Alexander, and Andy Griffith.\n• Likewise the music videos for a few of Reba McEntire's songs from the early 90's and the music video for the Oak Ridge Boys' song \"Gonna Take A Lot Of River\" does this.\n• Roxette's \"Anyone\" has bookends shot in black and white showing an ambulance crew taking care of an unsuccessful suicide victim (singer Marie Fredriksson). The rest of the video is shot in colour, showing the lead-up to the suicide attempt.\n• Blind Melon's \"No Rain\" beings with a short tap routine by a girl dressed as a bee, followed by hysterical audience laughter. It sets up the story for the rest of the video.\n• \"Weird Al\" Yankovic took the (now outdated) Jeopardy! intro for \"I Lost on Jeopardy\" to help establish the location. He also does this with \"Like a Surgeon\", showing the intern walking through the corridors (and naturally using giving The Three Stooges a Shout-Out). And in a direct parody of the above mentioned \"No Rain\" (albeit silent), \"Bedrock Anthem\" starts with the tap dancing bee girl before the \"John Frusciante\" begins the Red Hot Chili Peppers parody.\n• French singer Myléne Farmer is very prone to these, some of her music videos are more than twice the length of the song.\n• Fall Out Boy's video for \"A Little Less Sixteen Candles, A Little More Touch Me\" has this and some Mid-Vid Skit-ness.\n• Their video for \"I Don't Care\" features bookends including Gilby Clarke revealed as Sarah Palin in disguise.\n• \"Thnks fr th Mmrs\" plays with this - the song starts immediately with the video, only to be cut off as the singer starts to sing. Then there's a short set-up scene, and then the song starts again.\n• Nickel Creek's video for \"Smoothie Song,\" an instrumental piece, is of the band playing the song at an instrument shop. The ending shows the band returning the instruments after finishing the song.\n• The video for Lady Gaga's \"Paparazzi\" starts with a three-minute long sequence where her boyfriend throws her off a balcony while photographers watch, and has a brief intermission where she gets back by poisoning him (and telephoning a confession to the police).\n• And the sequel, her video to \"Telephone\" is less than half singing, with enough talkiness to fill a three and a half minute song into a nine minute video.\n• \"Marry The Night\" has 8 minutes of pre music video discussion before the song starts...\n• G U Y has a major 5 minute set up and 2 minute set down.\n• This trope (along with Mid Vid Skits, fandom specific easter eggs, and the occasional credits sequence) is the reason why most 30 Seconds to Mars videos are longer than the songs themselves. The worst offender is \"Hurricane\"; the song is 6 minutes long, the full video is 13 minutes long. The video was originally intended to be 20 minutes long. And who knows how long the tie-in videos they intended to release afterwords were going to be.\n• The next best offender, \u0093From Yesterday\u0094; the song is around 4 minutes long, the version of the video aired on TV is 4 minutes and 30 seconds. The full length video (not counting the credits) is 11 minutes.\n• Subverted with \"Attack\"; both the video and the song end at 3:09. Doesn\u0092t effect the creepy factor any.\n• Night Ranger did a series of bookends for the videos from their 7 Wishes album in which they were stranded on an island, with a radio DJ commenting that the band is missing. The individual videos were implied to be all in the castaways' minds, as they relived their pasts and/or longed to get back and take up whatever romance they'd left behind.\n• Barnes & Barnes' \"Fish Heads\" video begins with a long sequence where a man buys a fish head from a fishmonger, walks down the street and unwraps it next to a hobo played by Dr. Demento.\n• \"Windowlicker\" by Aphex Twin opens with a four minute segment examining the lives of two broke wannabes. Several seconds of NSFW bickering ensures that the opening segment will never be seen on the airwaves. Of note is a unidentified but appealing song playing on a car stereo; new fans frequently ask for that song's title.\n• Said song is a remix of \"Windowlicker\" itself. As of 2011 it hasn't been released.\n• The Gregg Allman Band's \"I'm No Angel\" starts with the band pulling up to an abandoned old tavern and telling an old man sitting on the porch to fix the flat tire on their car. The song then starts when the band sets up to play inside the tavern, which comes to life with a group of immoderately attractive female outlaws. The video ends with the band leaving the building and getting back to their car. The old man shows Gregg the lawman's badge that caused the flat; Gregg makes it quite clear he wants no part of the badge, since during the song, he becomes a lawman who is hanged by those female outlaws .\n• The beginning of the video for \"Everybody's Fool\" by Evanescence is a fake commercial.\n• The video for \"I'm Not Okay (I Promise)\". \"You like D&D, Audrey Hepburn, Fangoria, Harry Houdini, and croquet. You can't swim, you can't dance, and you don't know karate. Face it, you're never gonna make it.\"\n• I don't want to make it - I just want to...\n• The video for Aerosmith's \"Love In An Elevator\" opens with scene of the band walking through a department store and running into a hot employee coming out of the elevator: \"Second floor, hardware, children's wear, lady's lingerie. Oh, good morning Mr. Tyler... going down?\" (the \"ding\" followed by announcement also preceded the song on Pump, but is usually cut in compilations and such)\n• David Bowie's Jazzin' for Blue Jean, a 20 minute short film that wraps around Blue Jean, extra points for Bowie playing two characters, one being a parody of his 'glam rock' image, the other poking fun at it.\n• Huey Lewis and the News' video for \"The Power of Love\" (featured on the Back to the Future soundtrack) begins with a 2-minute long sequence of the group getting onstage and talking about how they've \"sold out\" to the movie business, while Doc Brown arrives at the venue and tells someone to watch the Delorean. The final half-minute of the video has the Delorean (stolen by a clubgoer and his date) arrive back in the present while they comment on their experience. All in all, it takes up nearly half of the video's running time.\n• The video for \"Fight For Your Right to Party\" by the Beastie Boys starts with two rather nerdy looking teens suggesting they have a party with soda and pie. One expresses a hope that \"no one bad shows up\". Cue the Beastie Boys....\n• fun. has \"Some Nights (Intro)\" and \"Some Nights \", with 50 seconds and a minute, respectively, before the music begins (and the latter's intro has no talking, probably because the song opens with singing).\n• Weezer's video for \"Keep Fishin'\", which features them as guest stars on The Muppet Show opens with the usual backstage chaos and ends with Stalter and Waldorf.\n• Ben Folds Five's video for \"Do It Anyway\" features the Fraggles, and opens with Uncle Travelling Matt writing to Gobo that he's going to observe a Silly Creatures \"musical ritual\", followed by the sound technician asking the band if they're ready to make rock'n'roll history. It ends with the sound guy saying that was good, but could be better, and if they do it again, maybe he'll actually record it this time. (And then a quick burst of the Fraggle Rock theme.)\n• The video for the Pet Shop Boys' cover of \"Always on My Mind\" opens and closes with the boys in a car with a bizarre hitchhiker played by Joss Ackland, who puts the song on the radio. About two minutes in total. (Actually an excerpt from the lead-in to the song in their Jukebox Musical It Couldn't Happen Here.)\n• Cold's \"Stupid Girl\" is primarily a Performance Video where the band performs in front of a small audience of fans. However, in keeping with the song's lyrical theme, some of said fans were also interviewed about frustrating romantic breakups, and also asked to rip up cardboard signs with their ex's first name written on them; the interviews were used as montages at the beginning and end of the video, while the sign-ripping scenes were cut to throughout the performance footage.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/TalkyBookends", "media_links": ["/pmwiki/pmwiki.php/Music/MichaelJackson", "/pmwiki/pmwiki.php/Music/Thriller", "/pmwiki/pmwiki.php/Music/Bad", "/pmwiki/pmwiki.php/Music/WeirdAlYankovic", "/pmwiki/pmwiki.php/Film/Moonwalker", "/pmwiki/pmwiki.php/Music/Bad", "/pmwiki/pmwiki.php/Film/MichaelJacksonsGhosts", "/pmwiki/pmwiki.php/Creator/MarlonBrando", "/pmwiki/pmwiki.php/Music/Eagles", "/pmwiki/pmwiki.php/Music/BillyJoel", "/pmwiki/pmwiki.php/Music/Poison", "/pmwiki/pmwiki.php/Music/Cinderella", "/pmwiki/pmwiki.php/Music/MotleyCrue", "/pmwiki/pmwiki.php/Music/TwistedSister", "/pmwiki/pmwiki.php/Music/TomWaits", "/pmwiki/pmwiki.php/Music/RainDogs", "/pmwiki/pmwiki.php/Music/LionelRichie", "/pmwiki/pmwiki.php/Music/TheDecemberists", "/pmwiki/pmwiki.php/Music/ArchitectureInHelsinki", "/pmwiki/pmwiki.php/Music/AliceInChains", "/pmwiki/pmwiki.php/Music/Genesis", "/pmwiki/pmwiki.php/Music/Dangerous", "/pmwiki/pmwiki.php/Music/PhilCollins", "/pmwiki/pmwiki.php/Film/MadMax", "/pmwiki/pmwiki.php/Music/BruceSpringsteen", "/pmwiki/pmwiki.php/Music/GreenDay", "/pmwiki/pmwiki.php/Creator/WilliamShatner", "/pmwiki/pmwiki.php/Music/WeirdAlYankovic", "/pmwiki/pmwiki.php/Series/Jeopardy", "/pmwiki/pmwiki.php/Film/TheThreeStooges", "/pmwiki/pmwiki.php/Music/RedHotChiliPeppers", "/pmwiki/pmwiki.php/Music/FallOutBoy", "/pmwiki/pmwiki.php/Music/GunsNRoses", "/pmwiki/pmwiki.php/Music/LadyGaga", "/pmwiki/pmwiki.php/Music/ThirtySecondsToMars", "/pmwiki/pmwiki.php/Creator/DrDemento", "/pmwiki/pmwiki.php/Music/AphexTwin", "/pmwiki/pmwiki.php/Music/Evanescence", "/pmwiki/pmwiki.php/Music/MyChemicalRomance", "/pmwiki/pmwiki.php/Music/Aerosmith", "/pmwiki/pmwiki.php/Music/DavidBowie", "/pmwiki/pmwiki.php/Music/HueyLewisAndTheNews", "/pmwiki/pmwiki.php/Film/BackToTheFuture", "/pmwiki/pmwiki.php/Music/BeastieBoys", "/pmwiki/pmwiki.php/Music/Fun", "/pmwiki/pmwiki.php/Music/Weezer", "/pmwiki/pmwiki.php/Series/TheMuppetShow", "/pmwiki/pmwiki.php/Music/BenFoldsFive", "/pmwiki/pmwiki.php/Series/FraggleRock", "/pmwiki/pmwiki.php/Music/PetShopBoys"], "non_media_links": ["/pmwiki/pmwiki.php/Main/ConceptVideo", "/pmwiki/pmwiki.php/Main/TalkyBookends", "/pmwiki/pmwiki.php/Main/TropeCodifier", "/pmwiki/pmwiki.php/Main/BigLippedAlligatorMoment", "/pmwiki/pmwiki.php/Main/TorchesAndPitchforks", "/pmwiki/pmwiki.php/Main/DoesThisRemindYouOfAnything", "/pmwiki/pmwiki.php/Main/PerformanceVideo", "/pmwiki/pmwiki.php/Main/ConceptVideo", "/pmwiki/pmwiki.php/Main/ContinuityNod", "/pmwiki/pmwiki.php/Main/TheNeidermayer", "/pmwiki/pmwiki.php/Main/StalkingIsLove", "/pmwiki/pmwiki.php/Main/DrillSergeantNasty", "/pmwiki/pmwiki.php/Main/TimeCompressionMontage", "/pmwiki/pmwiki.php/Main/ImagineSpot", "/pmwiki/pmwiki.php/Main/MidVidSkit", "/pmwiki/pmwiki.php/Main/ShoutOut", "/pmwiki/pmwiki.php/Main/MidVidSkit", "/pmwiki/pmwiki.php/UsefulNotes/SarahPalin", "/pmwiki/pmwiki.php/Main/MindScrew", "/pmwiki/pmwiki.php/Main/NoSuchThingAsBadPublicity", "/pmwiki/pmwiki.php/Main/BuffySpeak", "/pmwiki/pmwiki.php/Main/MidVidSkit", "/pmwiki/pmwiki.php/Main/EasterEgg", "/pmwiki/pmwiki.php/Main/SerialEscalation", "/pmwiki/pmwiki.php/Main/ClusterFBomb", "/pmwiki/pmwiki.php/Main/ElevatorFloorAnnouncement", "/pmwiki/pmwiki.php/Main/ElevatorGoingDown", "https://www.youtube.com/watch?v=BAyNR4CEPE8", "https://www.youtube.com/watch?v=qQkBeOisNM0", "/pmwiki/pmwiki.php/Main/LyricalColdOpen", "/pmwiki/pmwiki.php/Main/JukeboxMusical", "/pmwiki/pmwiki.php/Main/PerformanceVideo", "/pmwiki/pmwiki.php/Main/BreakupSong"]}