{"title": "Gangplank Galleon", "content": "A pirate-themed area seen in video games, especially in a Platform Game. Has many barrels, usually takes place near the water and a wooden ship, and features tons of pirate enemies in stock costumes. Expect to climb/swing on rope, navigate water, and dodge cannonfire. Was once fairly rare, but skyrocketed in popularity after Pirates of the Caribbean was released (the attraction it was based on can be considered a Real Life version of this). If the character is capable of swimming, expect a diving for treasure sequence.\n\nIn RPGs, adventuring here may be related to the Port Town quest, to get the boat.\n\nNamed for the Final Boss stage of Donkey Kong Country.\n\nFrequently overlaps with Palmtree Panic and Under the Sea. For the Ninja-based counterpart, see Wutai.\n• The SNES version of Animaniacs has the end of the Fantasy Stage fought along pirate ships. Cannons, rope swinging, pirates and the boss being a pirate captain with an eyepatch and pegleg on a giant octopus.\n• Assassin's Creed IV: Black Flag: The entire game is that, as it is deliberately set during The Golden Age of Piracy.\n• Treasure Trove Cove in Banjo-Kazooie includes a ship stranded near the center of the level's mountain, and it's where Captain Bubbler is lamenting that his gold ingots went missing. Downplayed with Jolly Roger's Lagoon in Banjo-Tooie, because only the surface area takes place in a naval port; the remaining 90% is Under the Sea.\n• Bendy in Nightmare Run uses a stage like this in episode \"Bendy Walks the Plank.\"\n• Pirate's Island of Billy Hatcher and the Giant Egg.\n• The Emerald Brine from BIT.TRIP Presents: RUNNER 2: Future Legend of Rhythm Alien.\n• In Castle Crashers, the players sailing ship is attacked by a pirate ship full of ninjas. They board your ship, and you have to fight them off. In keeping with the trope, the player must dodge cannon blasts, and barrels containing health and the like slide around the deck of the ship.\n• Castlevania III: Dracula's Curse has one of the Stage 4s, pictured above. Castlevania: Rondo of Blood has Stage 5, which is the stage you fight Death and has a spooky painting that can kill you in a single hit.\n• The SS Zelbess/SS Invincible (depending on which reality you were in) in Chrono Cross.\n• Most levels of Claw have elements of this, and several are this trope outright, but that is what even new players will expect.\n• Crash Twinsanity has High Seas Hijinks, which takes place on N. Gin's battleship, full of pirates, rats, and missiles.\n• There is such a level in the first Devil May Cry game. Dante must activate the ship and obtain the \"Fire of St Elmo.\" The second boss battle with Griffon takes place here.\n• Donkey Kong Country\n• The Trope Namer from Donkey Kong Country isn't much of an example since it only has one level where you fight the Final Boss on a pirate ship. However, Gangplank Galleon would then return as the first world in both Donkey Kong Land and Donkey Kong Country 2: Diddy's Kong Quest (emphasizing their nature as continuations) and get several pirate and ship-themed levels.\n• Gloomy Galleon in Donkey Kong 64, which may actually contain a sunken Gangplank Galleon.\n• Donkey Kong Country Returns continues the theme, perhaps as homage. It mostly applies to the Beach world, but a handful of pirate levels pop up in later worlds as well. The second level of the last regular world in Donkey Kong Country: Tropical Freeze is set in that same part of Donkey Kong Island, only now it's set in winter.\n• Epic Mickey, taking place in an imitation of Disneyland, has an entire world reminiscent of the Pirates of the Caribbean ride and featuring the pirates from Peter Pan, including a boss battle against a robotic Captain Hook.\n• A good portion of The Fancy Pants Adventure: World 3 takes place around and in a pirate ship, as the protagonist is trying to rescue his sister from the pirates that kidnapped her.\n• Final Fantasy:\n• The pirate town in the original Final Fantasy I.\n• Final Fantasy XI has the hidden town of Norg, and although it's inhabited by Ninja and Samurai, the pirate-speak certainly clues you in to where you are.\n• The Port of Balfonheim in Final Fantasy XII. Described as lawless before the start of the game, but the citizens are kept in check afterwards only because the mayor is an ex-Judge .\n• A ship battle is a staple of Fire Emblem, with the two sides fighting on two or more ships connected by planks. Gaiden, Blazing Sword, Sacred Stones, Path of Radiance, Awakening and Fates all have at least one.\n• Crossbones island of Golden Sun. Complete with an abandoned ship, a rigged treasure chest and a giant pirate ghost.\n• The Pirate Cove theme in Golf With Your Friends takes place on levels that evoke a large wooden sailing ship. There are also cannons, giant wheels, \"sharks\", and a kraken.\n• The final stage of Goof Troop takes place on Keelhaul Pete's pirate ship.\n• The Itchy and Scratchy Game has \"Mutilation on the Bounty\", which serves as the third level of the game. Enemies in this stage include parrots and miniature pirate-like robots of Scratchy. The boss of the stage is Scratchy in a giant pirate-like robot with cannons for arms.\n• Kingdom Hearts:\n• Neverland - especially in the first game, where it consisted entirely of Captain Hook's ship and Big Ben. It got expanded in Days and Birth by Sleep.\n• Port Royal fills the same role in Kingdom Hearts II.\n• Kingdom of Loathing has a zone called, appropriately enough, the Obligatory Pirate's Cove. Get a pirate disguise (or manage to earn your pirate fledges) and you can explore the the pirate's bar and the different parts of the pirate ship.\n• Some levels in the Kirby series.\n• In Kirby's Epic Yarn, the Auto-Scrolling Level Boom Boatyard is based off this theme.\n• In Kirby's Adventure, the third stage of the sixth world, Orange Ocean, is set on a pirate ship.\n• The Legend of Zelda\n• In Majora's Mask, you have to infiltrate the Gerudo Pirate Base to get the Zora Eggs in the Great Bay region.\n• In Phantom Hourglass, the fourth dungeon is the Ghost Ship, which is a haunted pirate ship.\n• In Skyward Sword the Sandship combines it with Shifting Sand Land and Eternal Engine. It is visited in two time periods: the present, when the area is a desert, and the distant past, when the area is an ocean and the ship's advanced technology still works.\n• The third area of The Lost Vikings 2 takes place on a pirate ship fleet.\n• McDonald's Treasure Land Adventure has a pirate ship in the second half of the third world. When Ronald reaches the crow's nest, an enemy ship fires many cannonballs, sinking the ship. The boss of the stage is a pirate captain with giant lips, who has the fourth and final piece of the treasure map.\n• The setting for all of the Monkey Island games.\n• Ōkami features a large, curiously Western-looking shipwreck near one of the beaches. It is also home to many ghost-type enemies, crossing over with Big Boo's Haunt. The sequel, Ōkamiden, lets you explore the same ship before it becomes wrecked and haunted.\n• The setting for the last three levels of the Peter Pan & the Pirates video game.\n• Planet Ardolis, the Ublik Passage, and Kreeli Comet in Ratchet & Clank Future: Tools of Destruction, and a good deal of \"Quest for Booty\". One of the 'vid-comics' in the third game also took place on a sci-fi version of this.\n• In the Game Gear version of Ristar, Planet Terra takes place on a pirate ship.\n• RuneScape has the pirate town/island of Mos'Le Harmless, which is the centre of an entire quest-series focused around the game's pirates and their enemies, and also Braindeath Island (where \"rum\" is made), Harmony Island (monks besieged by zombie pirates), a small group of pirates that have run aground on the north coast of the Mordor-like Wilderness, and some more pirates in a cave near a large port.\n• The Listy Colon, a stage in Scribblenauts Unlimited, is a pirate ship with climbable masts and a cannon that you can fire things with.\n• As you would expect from a game about Sky Pirates Skies of Arcadia has lot of this; but mainly at the start of the game. As you progress through the game the technology gets more advanced, becoming more Wooden Ships and Iron Men in style.\n• Sly Cooper:\n• Raleigh's hideout in Sly Cooper and the Thievius Raccoonus is a mansion sitting on top of a very large pirate ship, but the levels vary from fiery engine rooms to graveyards of downed airplanes, and a couple of rooms inside Raleigh's study.\n• Sonic the Hedgehog:\n• Pirate Storm in Sonic and the Secret Rings.\n• The entire setting for Sonic Rush Adventure is pirate-themed, but the one level the trope describes the best is called - appropriately - Pirates' Island. There is also the Haunted Ship stage.\n• Speedy Gonzales Los Gatos Bandidos has Ye Olde Bounty, which serves as the seventh and final world in the game. The final boss is a pirate cat.\n• In Starbound, you may occasionally come across the Grounded - Avian outcasts who have renounced Kluex, their god, and seek to make their own wings... in the form of big, ponderous flying ships. Not spaceships; just regular ships, kept aloft with big propellers.\n• Streets of Rage 2 has a very brief section in stage 3 that's on a swinging pirate ship ride, filled with ninjas This was before the whole Pirates vs. Ninjas debate .\n• The second level of the platform game Stuntman Seymour.\n• Super Mario Bros.:\n• Super Mario Bros. 3 has the airship levels that take place on large wooden ships (that fly) with lots of cannons, as well as one level that takes place on boats (similar in design to the airship levels except the boats don't fly). If you know what you're doing, you can swim under the boats. You can't do this with the airships (for obvious reasons).\n• Super Mario World features an underwater Ghost Ship as a level, the completion of which reveals the way to the final world.\n• Super Mario 64 has Jolly Roger Bay, which is mostly Under the Sea but includes some sunken pirate ships.\n• New Super Mario Bros. Wii and New Super Mario Bros. U both have airship levels as occasional boss stages.\n• Super Mario Galaxy has Deep Dark Galaxy, which has both sunken ships and one major floating one. Also, the battle against Bowser Jr. takes place on a level revolving around SMB 3-style floating pirate ships.\n• The Sunken Ship in Super Mario RPG has been taken over by pirates.\n• Keelhaul Key in Paper Mario: The Thousand-Year Door has a bunch of similar caves filled with wrecked ships and debris. It doesn't hurt that you sail there with some stock seafaring characters. And the ruler of the island, the undead pirate king Cortez.\n• In Paper Mario: Color Splash Mario sets sail with a group of pirates to find the purple Big Paint Star.\n• The SS Tea Cup in the Wario Land games (Wario Land: Super Mario Land 3 and Wario Land II) is an example of this trope.\n• Tiny Toon Adventures games:\n• In the 1991 NES game of the same name, the third act of the second world takes place on a pirate ship. Enemies include pirates and Roderick Rat clones that toss anvils. The boss is a pirate captain that resembles Captain Hook, though considering what movie came out the same year, this may have been intentional.\n• Buster's Hidden Treasure has a haunted pirate shipwreck in the middle of the game. Naturally, this stage is where you find the titular \"hidden treasure\".\n• The first part of the first level of Wild Woody takes place on a pirate ship.\n• Captain Dragon's ship in Wonder Boy III: The Dragon's Trap.\n• World of Warcraft:\n• Booty Bay and the last part of the Deadmines.\n• Maw of Souls is a dungeon that mostly takes place on a Viking Ghost Ship that ferries souls to hell.\n• Galleon Galaxy from Yooka-Laylee, which also contains a space motif.\n• Zack & Wiki has a level on a ship, where the heroes and the game's initial bad guys get bothered by a titanic squid.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/GangPlankGalleon", "media_links": ["/pmwiki/pmwiki.php/VideoGame/SuperMarioRPG", "/pmwiki/pmwiki.php/VideoGame/SuperMarioWorld", "/pmwiki/pmwiki.php/VideoGame/KirbysAdventure", "/pmwiki/pmwiki.php/VideoGame/SuperSmashBrosBrawl", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaTheWindWaker", "/pmwiki/pmwiki.php/VideoGame/DonkeyKongCountry2DiddysKongQuest", "/pmwiki/pmwiki.php/VideoGame/CastlevaniaIIIDraculasCurse", "/pmwiki/pmwiki.php/VideoGame/PaperMarioTheThousandYearDoor", "/pmwiki/pmwiki.php/Franchise/PiratesOfTheCaribbean", "/pmwiki/pmwiki.php/Ride/PiratesOfTheCaribbean", "/pmwiki/pmwiki.php/VideoGame/DonkeyKongCountry1", "/pmwiki/pmwiki.php/WesternAnimation/Animaniacs", "/pmwiki/pmwiki.php/VideoGame/AssassinsCreedIVBlackFlag", "/pmwiki/pmwiki.php/VideoGame/BanjoKazooie", "/pmwiki/pmwiki.php/VideoGame/BendyInNightmareRun", "/pmwiki/pmwiki.php/VideoGame/BillyHatcherAndTheGiantEgg", "/pmwiki/pmwiki.php/VideoGame/BitTrip", "/pmwiki/pmwiki.php/VideoGame/CastleCrashers", "/pmwiki/pmwiki.php/VideoGame/CastlevaniaIIIDraculasCurse", "/pmwiki/pmwiki.php/VideoGame/CastlevaniaRondoOfBlood", "/pmwiki/pmwiki.php/VideoGame/ChronoCross", "/pmwiki/pmwiki.php/VideoGame/Claw", "/pmwiki/pmwiki.php/VideoGame/CrashTwinsanity", "/pmwiki/pmwiki.php/VideoGame/DevilMayCry1", "/pmwiki/pmwiki.php/VideoGame/DonkeyKongCountry", "/pmwiki/pmwiki.php/VideoGame/DonkeyKongCountry1", "/pmwiki/pmwiki.php/VideoGame/DonkeyKongCountry2DiddysKongQuest", "/pmwiki/pmwiki.php/VideoGame/DonkeyKong64", "/pmwiki/pmwiki.php/VideoGame/DonkeyKongCountryReturns", "/pmwiki/pmwiki.php/VideoGame/DonkeyKongCountryTropicalFreeze", "/pmwiki/pmwiki.php/VideoGame/EpicMickey", "/pmwiki/pmwiki.php/Ride/DisneyThemeParks", "/pmwiki/pmwiki.php/Ride/PiratesOfTheCaribbean", "/pmwiki/pmwiki.php/Disney/PeterPan", "/pmwiki/pmwiki.php/VideoGame/FancyPantsAdventures", "/pmwiki/pmwiki.php/Franchise/FinalFantasy", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyI", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyXI", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyXII", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyV", "/pmwiki/pmwiki.php/VideoGame/FinalFantasyMysticQuest", "/pmwiki/pmwiki.php/Franchise/FireEmblem", "/pmwiki/pmwiki.php/VideoGame/GoldenSun", "/pmwiki/pmwiki.php/VideoGame/GolfWithYourFriends", "/pmwiki/pmwiki.php/VideoGame/GoofTroop", "/pmwiki/pmwiki.php/WesternAnimation/TheItchyAndScratchyShow", "/pmwiki/pmwiki.php/Franchise/KingdomHearts", "/pmwiki/pmwiki.php/Disney/PeterPan", "/pmwiki/pmwiki.php/VideoGame/KingdomHeartsI", "/pmwiki/pmwiki.php/Franchise/PiratesOfTheCaribbean", "/pmwiki/pmwiki.php/VideoGame/KingdomHeartsII", "/pmwiki/pmwiki.php/VideoGame/KingdomOfLoathing", "/pmwiki/pmwiki.php/Franchise/Kirby", "/pmwiki/pmwiki.php/VideoGame/KirbysEpicYarn", "/pmwiki/pmwiki.php/VideoGame/KirbysAdventure", "/pmwiki/pmwiki.php/VideoGame/LaTale", "/pmwiki/pmwiki.php/Franchise/TheLegendOfZelda", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaMajorasMask", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaPhantomHourglass", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaSkywardSword", "/pmwiki/pmwiki.php/VideoGame/TheLostVikings", "/pmwiki/pmwiki.php/VideoGame/MagicalStarsign", "/pmwiki/pmwiki.php/VideoGame/McDonaldsTreasureLandAdventure", "/pmwiki/pmwiki.php/VideoGame/MediEvil", "/pmwiki/pmwiki.php/VideoGame/MonkeyIsland", "/pmwiki/pmwiki.php/VideoGame/MontyMole", "/pmwiki/pmwiki.php/VideoGame/MoonCrystal", "/pmwiki/pmwiki.php/VideoGame/Okami", "/pmwiki/pmwiki.php/VideoGame/Okamiden", "/pmwiki/pmwiki.php/WesternAnimation/PeterPanAndThePirates", "/pmwiki/pmwiki.php/VideoGame/RatchetAndClank", "/pmwiki/pmwiki.php/VideoGame/Ristar", "/pmwiki/pmwiki.php/VideoGame/RuneScape", "/pmwiki/pmwiki.php/VideoGame/Scribblenauts", "/pmwiki/pmwiki.php/VideoGame/SkiesOfArcadia", "/pmwiki/pmwiki.php/VideoGame/SlyCooper", "/pmwiki/pmwiki.php/VideoGame/SlyCooperAndTheThieviusRaccoonus", "/pmwiki/pmwiki.php/VideoGame/SonicTheHedgehog", "/pmwiki/pmwiki.php/VideoGame/SonicAndTheSecretRings", "/pmwiki/pmwiki.php/VideoGame/SonicRushSeries", "/pmwiki/pmwiki.php/VideoGame/SpeedyGonzalesLosGatosBandidos", "/pmwiki/pmwiki.php/VideoGame/StreetsOfRage", "/pmwiki/pmwiki.php/VideoGame/StuntmanSeymour", "/pmwiki/pmwiki.php/Franchise/SuperMarioBros", "/pmwiki/pmwiki.php/VideoGame/SuperMarioBros3", "/pmwiki/pmwiki.php/VideoGame/SuperMarioWorld", "/pmwiki/pmwiki.php/VideoGame/SuperMario64", "/pmwiki/pmwiki.php/VideoGame/NewSuperMarioBrosWii", "/pmwiki/pmwiki.php/VideoGame/NewSuperMarioBrosU", "/pmwiki/pmwiki.php/VideoGame/SuperMarioGalaxy", "/pmwiki/pmwiki.php/VideoGame/SuperMarioRPG", "/pmwiki/pmwiki.php/VideoGame/PaperMarioTheThousandYearDoor", "/pmwiki/pmwiki.php/VideoGame/PaperMarioColorSplash", "/pmwiki/pmwiki.php/VideoGame/WarioLand", "/pmwiki/pmwiki.php/VideoGame/WarioLandSuperMarioLand3", "/pmwiki/pmwiki.php/VideoGame/WarioLandII", "/pmwiki/pmwiki.php/VideoGame/TeenageMutantNinjaTurtlesTurtlesInTime", "/pmwiki/pmwiki.php/WesternAnimation/TinyToonAdventures", "/pmwiki/pmwiki.php/VideoGame/TinyToonAdventures", "/pmwiki/pmwiki.php/Film/Hook", "/pmwiki/pmwiki.php/VideoGame/TinyToonAdventuresBustersHiddenTreasure", "/pmwiki/pmwiki.php/VideoGame/WildWoody", "/pmwiki/pmwiki.php/VideoGame/WonderBoyIIITheDragonsTrap", "/pmwiki/pmwiki.php/VideoGame/WorldOfWarcraft", "/pmwiki/pmwiki.php/VideoGame/YookaLaylee", "/pmwiki/pmwiki.php/VideoGame/ZackAndWiki"], "non_media_links": ["/pmwiki/pmwiki.php/Main/Pirate", "/pmwiki/pmwiki.php/Main/PlatformGame", "/pmwiki/pmwiki.php/Main/DressedToPlunder", "/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/Main/SuperNotDrowningSkills", "/pmwiki/pmwiki.php/Main/PortTown", "/pmwiki/pmwiki.php/Main/GetOnTheBoat", "/pmwiki/pmwiki.php/Main/FinalBoss", "/pmwiki/pmwiki.php/Main/PalmtreePanic", "/pmwiki/pmwiki.php/Main/UnderTheSea", "/pmwiki/pmwiki.php/Main/Wutai", "/pmwiki/pmwiki.php/Main/ShipLevel", "/pmwiki/pmwiki.php/UsefulNotes/SuperNintendoEntertainmentSystem", "/pmwiki/pmwiki.php/UsefulNotes/TheGoldenAgeOfPiracy", "/pmwiki/pmwiki.php/Main/UnderTheSea", "/pmwiki/pmwiki.php/Main/NinjaPirateZombieRobot", "/pmwiki/pmwiki.php/Main/FeatheredFiend", "/pmwiki/pmwiki.php/Main/TropeNamer", "/pmwiki/pmwiki.php/Main/FinalBoss", "/pmwiki/pmwiki.php/Main/DamselInDistress", "/pmwiki/pmwiki.php/Main/Ninja", "/pmwiki/pmwiki.php/Main/Samurai", "/pmwiki/pmwiki.php/Main/NinjaPirateZombieRobot", "/pmwiki/pmwiki.php/Main/AutoScrollingLevel", "/pmwiki/pmwiki.php/Main/HailfirePeaks", "/pmwiki/pmwiki.php/Main/ShiftingSandLand", "/pmwiki/pmwiki.php/Main/EternalEngine", "/pmwiki/pmwiki.php/Main/TimeTravel", "/pmwiki/pmwiki.php/Main/BigBoosHaunt", "/pmwiki/pmwiki.php/Main/TimeTravel", "/pmwiki/pmwiki.php/UsefulNotes/GameGear", "/pmwiki/pmwiki.php/Main/SkyPirates", "/pmwiki/pmwiki.php/Main/WoodenShipsAndIronMen", "/pmwiki/pmwiki.php/Main/EternalEngine", "/pmwiki/pmwiki.php/Main/GhostShip", "/pmwiki/pmwiki.php/Videogame/Starbound", "/pmwiki/pmwiki.php/Main/GhostShip", "/pmwiki/pmwiki.php/Main/UnderTheSea", "/pmwiki/pmwiki.php/UsefulNotes/NintendoEntertainmentSystem", "/pmwiki/pmwiki.php/Main/AnvilOnHead", "/pmwiki/pmwiki.php/Main/GhostShip", "/pmwiki/pmwiki.php/Main/SpaceZone"]}