{"title": "Elite Zombie", "content": "Okay, a Zombie Apocalypse is cool and all, but the audience is getting tired of the usual zombie, shambling and shuffling and moaning with no variation in their tactics or dramatic potential. So, what does a writer do? Why, give the zombies superpowers, of course! Yes, this very specific combination of Our Zombies Are Different and Elite Mook . When regular zombies aren't enough, they give the zombies special abilities.\n\nThese can include strength, stamina, speed, intelligence (from Artificial Stupidity to normal human to Artificial Brilliance) to more esoteric Magic and Powers, such as ranged attacks, usually in the form of bile or acid for the disease and horror theme, the ability to leap huge distances and cling to walls and ceilings for drop scares, and fangs and claws for deadlier melee attacks.\n\nThere are a number of recurring elite zombie types used in various zombie media:\n• Brutes - The Mighty Glacier of the zombie world. These guys usually have increased muscle mass and size, and can dish out much more damage than the other zombie forms. They're usually either extremely slow and lumbering or as fast as regular zombies, though there are exceptions.\n• Armored Zombies - Undead Stone Walls. These types were typically once soldiers or SWATs and are still wearing their old body armor. Unlike brutes, they are practically the same as regulars, only tougher, especially against firearms, and will sometimes act (intentionally or not) as meat shields to other more fragile zombies behind them.\n• Hazmat Zombies - Former doctors and researchers whose protective suits protect them from environmental hazards, most notably fire. Their air tanks will explode under pressure, making them a sort of mini-Boomer.\n• Ferals/Hunters/Stalkers - As the name implies, these zombies act like predators. They love to ambush and pounce on unsuspecting survivors and are usually more quick and agile than their shambling brethren. Due to their predatory nature, they are a bit smarter as well. Sharp claws and teeth mutations seem optional. They are usually seen moving on all fours and acting bestial. Sometimes they can even crawl on walls and ceilings.\n• Runners - In some zombie settings these guys are the norm, but in other, more traditional settings where slow shambling zombies are the norm these guys are pretty much considered a class of elite zombie all their own. They're not as cunning as feral zombies but what they lack in intelligence they make up for in speed. They are especially dangerous in traditional zombie settings as survivors will often be caught off guard as one or a pack of them starts running after them when they're expecting zombies to be slow moving, breaking their routine anti-zombie tactics that they've built up over the years of fighting the undead.\n• Undead Animals - The \"animalistic\" zombie taken to its logical conclusion. Usually restricted to domestic animals such as dogs and cats (see: Resident Evil and Pet Sematary) and the odd household rodent. Of curious note is that this version tends to be limited to animals one might find around the house, meaning that one is more likely to encounter a zombified dog than they are, say, a zombified chimpanzee. If other animal species are allowed, expect it to be predatory or scavenger species such as wolves, bears, and perhaps carrion birds. Note, however, that a zombified bear would be more of a Brute zombie than a Stalker, and a zombified wolf with enough of its instincts intact might also double as a Screamer, howling to draw in other zombies.\n• Screamers - Their specialization is to call out to any other zombies around, usually via screaming or screeching. They are usually less physically threatening than other zombies, having disabilities like the lack of arms or bound ones (usually a straitjacket), thus forcing them to rely on their calls to defend themselves. Their screams can occasionally cause damage.\n• Vomit Zombies - These zombies use their gastric juices as weapons. Sometimes they produce other fluids that cause a different effect, such as slowing survivors down, making them more vulnerable to attack, or attracting more zombies to them. They usually appear with bloated bodies and/or mutated mouths. Sometimes they are also highly contagious and able to spread the zombie virus very quickly. Their remains are usually highly acidic or toxic even post-\"death\", and they may even burst into a cloud of poison when destroyed.\n• Boomers/Bloaters - A subcategory of vomit zombies. These guys are almost always bloated. Instead of using their vomit as as projectile (though they still might within limits), they use their gastric juices to build up pressure, making them (un)living water (acid?) balloons that explode when they take enough damage (sometimes even exploding on contact or close proximity), covering anyone nearby with acid or some other hideous liquid. These will definitely burst when destroyed. Keep your distance.\n• Spitters - A more specialized vomit zombie that can spit their bodily fluids with extreme velocity and range. They usually appear with heavily mutated heads.\n• Regenerators - They usually have the same toughness as regular zombies but they heal wounds incredibly swiftly and regenerate limbs. How fast they regenerate varies. Sometimes they must feed in order to accomplish this. Sometimes other elite zombie types have this ability as well.\n• Mutating Zombies - Regenerators taken Up to Eleven. The longer they survive, the more they feed, the stronger and more dangerous they become, often gaining the properties of the other elite zombie types and more in extreme cases. This is often a sign that these zombies were experimented on.\n• Smart Zombies - These guys are usually very rare but are extremely dangerous. They possess increased problem solving skills (so don't expect a door knob to stymie them for long) and are capable of using tools, usually melee weapons. They sometimes even lead the horde towards survivor camps and help them avoid and overcome traps.\n• Zombie Person - A smart zombie taken Up to Eleven. He or she is just like any other person except for the decaying body and the need to eat people. They can talk, reason and have a sense of morality. Their problem-solving skills and tool-use are almost human, albeit a bit sluggish. Their recall ranges from photographic memory of their human existence to total amnesia. Some of them constantly struggle and fight off the urge to eat humans while others relish it. Depending on the fictional work, their intelligence and memory may or may not gradually deteriorate through time and damage until they become just like the others. Sometimes it's the reverse: a regular zombie becoming smarter and smarter with age and experience.\n• Horde Master - Smart zombies who lead and command a horde. How they accomplish this or how they came to be varies, and is often left ambiguous. You can often see them pointing, moaning and groaning towards things they want the horde to interact with, or alternatively to stop them from doing something. Zombie hordes with a horde master within their ranks are often the most dangerous because they're organized.\n• Soldier Zombie - A cross between the Armored Zombie and the Smart Zombie. Intelligence depends on the work, but they tend to be police or soldiers in origin, and are marked by their ability to use firearms. Their tactical cognizance can range from being just as effective as real soldiers, to mindless zombies holding guns, firing at complete random and usually with no accuracy to speak of. Common in zombie-centric Video Games, providing a ranged variety of zombie to fight, and one that can drop firearms to use as well.\n• Trap Zombies - Zombies that use deception to lure survivors to them or just make themselves seem harmless. There are a number of types depending on what method they use:\n• Possums - The most common one. These zombies like to play dead (very convincingly, since they are technically \"dead\") until a survivor is close enough for them to catch. Players are almost always wise to this tactic now, but there may not be anything they can do about it.\n• \"Help Me\" Zombies - Zombies that lure survivors by mimicking a survivor calling for help, usually by crying or by literally saying \"help me\" over and over again, appealing to compassion to stage an ambush, or outright explode after baiting a survivor to approach them.\n• Pregnants - Pregnant women who have turned into zombies along with the child they're carrying. Killing the mother would often lead to a nasty surprise as the baby will suddenly burst out of the mother's womb and get any unsuspecting survivors. Frequently the smaller zombie moves with unusual speed, or acts similar to a Possum Zombie.\n• Child Zombies - Usually found at playgrounds and schools. They typically move much quicker than their adult counterparts due to their small size and are quite numerous as well. Adding the fact that they're children may cause hesitation in killing them, especially for adult survivors who have just encountered zombies for the first times and/or have children of their own. Sometimes a survivor develops a bond with a child zombie, possibly because it was his/her own child or foster child, and hide them from other survivors. This usually leads to an infestation from inside the camp or the keeper in question going rogue if the other survivors discover their secret.\n• Enhanced Zombies - Regular zombies that have been enhanced by some external means, either artificially (via biological manipulation, cybernetics and/or necromancy), or naturally (via the right environmental conditions or exposure). These types of zombies often overlap with other elite zombie types ability-wise. Sometimes they may even occur naturally due to the nature of the setting in question. These types of elite zombies come in cybernetic, biological, and arcane varieties. A combination of some or all of these aspects may even appear.\n• Cyber-Zombies - A more technological subcategory of the enhanced zombie. Basically a regular zombie put into the chopshop and grafted with various mechanical gadgets, computer implants, bionic limbs, and integrated weaponry. May or may not include machine assisted limbs (or replaced with cybernetics), arm cannons, sharp metal claw blades, chipped brains, bionic eyes (that may or may not shoot lasers) and many other augmentations. Said machinery may be the reason why it's animated in the first place. The operator may have died or was killed, leaving only their mechanical half to drive the body around like a grotesque meat puppet. Other times corporations are responsible for making these abominations (either through captured \"wild\" zombie or intentionally infecting a test subject) for their own nefarious purposes.\n• Bio-Zombies - The other, more biological branch of the enhanced zombie. Instead of relying on tech to further enhance the zombie's capabilities, scientists opted for a more biological approach. Relying on exotic/experimental drugs, compounds and other substances, gene or behavior altering viruses and microbes, invasive parasites and extensive surgical modifications; sometimes even a combination of all of the above for maximum effect. In some settings where there are other extreme biohazards present, these types of zombies may even occasionally occur naturally in the wild. Their rarity depends on the proximity between the local zombie plague and the other biohazard(s). The closer they are the more frequently these zombie types are encountered.\n• And then there are the less common, but equally plentiful Elder Zombies, which are old, very smart like Horde Master types but less inclined to eat or kill living people. However, they will still curb-stomp your face in if you annoy them or don't leave them to their own devices. These ones may end up crossing over with the archetype Revenant Zombies if they have a purpose.\n\nThis is most common in Video Games to add variation in combat.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/EliteZombie", "media_links": ["/pmwiki/pmwiki.php/VideoGame/Left4Dead", "/pmwiki/pmwiki.php/VideoGame/Left4Dead", "/pmwiki/pmwiki.php/Franchise/ResidentEvil", "/pmwiki/pmwiki.php/Literature/PetSematary", "/pmwiki/pmwiki.php/Manga/IAmAHero", "/pmwiki/pmwiki.php/Manga/CellsAtWork", "/pmwiki/pmwiki.php/ComicBook/MarvelZombies", "/pmwiki/pmwiki.php/ComicBook/BlackestNight", "/pmwiki/pmwiki.php/ComicBook/ZombiesChristmasCarol", "/pmwiki/pmwiki.php/ComicBook/JudgeDredd", "/pmwiki/pmwiki.php/ComicBook/Crossed", "/pmwiki/pmwiki.php/Film/Braindead", "/pmwiki/pmwiki.php/Film/Doom", "/pmwiki/pmwiki.php/Film/ReturnOfTheLivingDeadNecropolis", "/pmwiki/pmwiki.php/Franchise/ResidentEvil", "/pmwiki/pmwiki.php/Film/ResidentEvilExtinction", "/pmwiki/pmwiki.php/Film/ResidentEvilApocalypse", "/pmwiki/pmwiki.php/Film/CockneysVsZombies", "/pmwiki/pmwiki.php/Film/FrankensteinsArmy", "/pmwiki/pmwiki.php/Film/DieZombiejager", "/pmwiki/pmwiki.php/Literature/Masques", "/pmwiki/pmwiki.php/Literature/TheDresdenFiles", "/pmwiki/pmwiki.php/Creator/PermutedPress", "/pmwiki/pmwiki.php/Literature/WorldWarZ", "/pmwiki/pmwiki.php/Literature/Warbreaker", "/pmwiki/pmwiki.php/Literature/TheForsakenChildren", "/pmwiki/pmwiki.php/Series/IZombie", "/pmwiki/pmwiki.php/Creator/JohnRomero", "/pmwiki/pmwiki.php/Series/TheWalkingDead", "/pmwiki/pmwiki.php/Series/ZNation", "/pmwiki/pmwiki.php/Series/KamenRider555", "/pmwiki/pmwiki.php/TabletopGame/DungeonsAndDragons", "/pmwiki/pmwiki.php/TabletopGame/ForgottenRealms", "/pmwiki/pmwiki.php/TabletopGame/D20Modern", "/pmwiki/pmwiki.php/TabletopGame/LastNightOnEarth", "/pmwiki/pmwiki.php/TabletopGame/AllFleshMustBeEaten", "/pmwiki/pmwiki.php/TabletopGame/UnhallowedMetropolis", "/pmwiki/pmwiki.php/TabletopGame/MagicTheGathering", "/pmwiki/pmwiki.php/TabletopGame/Nechronica", "/pmwiki/pmwiki.php/TabletopGame/Zombicide", "/pmwiki/pmwiki.php/VideoGame/Doom", "/pmwiki/pmwiki.php/VideoGame/Doom3", "/pmwiki/pmwiki.php/VideoGame/Doom2016", "/pmwiki/pmwiki.php/Franchise/ResidentEvil", "/pmwiki/pmwiki.php/VideoGame/ResidentEvil1", "/pmwiki/pmwiki.php/VideoGame/ResidentEvil6", "/pmwiki/pmwiki.php/VideoGame/ResidentEvil4", "/pmwiki/pmwiki.php/VideoGame/ResidentEvil5", "/pmwiki/pmwiki.php/VideoGame/ResidentEvilRevelations2", "/pmwiki/pmwiki.php/VideoGame/ResidentEvil4", "/pmwiki/pmwiki.php/VideoGame/ResidentEvil6", "/pmwiki/pmwiki.php/VideoGame/ResidentEvilRevelations2", "/pmwiki/pmwiki.php/VideoGame/ResidentEvil0", "/pmwiki/pmwiki.php/VideoGame/HalfLife", "/pmwiki/pmwiki.php/VideoGame/HalfLife2", "/pmwiki/pmwiki.php/VideoGame/HalfLife2", "/pmwiki/pmwiki.php/VideoGame/Left4Dead", "/pmwiki/pmwiki.php/VideoGame/Left4Dead2", "/pmwiki/pmwiki.php/VideoGame/PlantsVsZombies", "/pmwiki/pmwiki.php/VideoGame/PlantsVsZombies2ItsAboutTime", "/pmwiki/pmwiki.php/Franchise/IndianaJones", "/pmwiki/pmwiki.php/VideoGame/WarCraftIII", "/pmwiki/pmwiki.php/VideoGame/WorldOfWarcraft", "/pmwiki/pmwiki.php/VideoGame/DisgaeaHourOfDarkness", "/pmwiki/pmwiki.php/VideoGame/TimeSplittersFuturePerfect", "/pmwiki/pmwiki.php/VideoGame/LandOfTheDeadRoadToFiddlersGreen", "/pmwiki/pmwiki.php/VideoGame/Prototype", "/pmwiki/pmwiki.php/VideoGame/Left4Dead", "/pmwiki/pmwiki.php/VideoGame/Prototype2", "/pmwiki/pmwiki.php/VideoGame/DeadRising2", "/pmwiki/pmwiki.php/VideoGame/DeadIsland", "/pmwiki/pmwiki.php/VideoGame/Diablo", "/pmwiki/pmwiki.php/VideoGame/DeadNation", "/pmwiki/pmwiki.php/VideoGame/Left4Dead", "/pmwiki/pmwiki.php/VideoGame/TeamFortress2", "/pmwiki/pmwiki.php/VideoGame/TheLastOfUs", "/pmwiki/pmwiki.php/VideoGame/Minecraft", "/pmwiki/pmwiki.php/VideoGame/StateOfDecay", "/pmwiki/pmwiki.php/VideoGame/Survivalist", "/pmwiki/pmwiki.php/VideoGame/StarCraft", "/pmwiki/pmwiki.php/VideoGame/StarcraftI", "/pmwiki/pmwiki.php/VideoGame/StarCraftII", "/pmwiki/pmwiki.php/TabletopGame/Alternity", "/pmwiki/pmwiki.php/VideoGame/ZombieTycoon2", "/pmwiki/pmwiki.php/VideoGame/Sonny", "/pmwiki/pmwiki.php/VideoGame/KingdomOfLoathing", "/pmwiki/pmwiki.php/VideoGame/DyingLight", "/pmwiki/pmwiki.php/VideoGame/Cataclysm", "/pmwiki/pmwiki.php/VideoGame/HeroesOfMightAndMagic", "/pmwiki/pmwiki.php/VideoGame/MightAndMagic", "/pmwiki/pmwiki.php/VideoGame/MetalSlug", "/pmwiki/pmwiki.php/Film/TheReturnOfTheLivingDead", "/pmwiki/pmwiki.php/VideoGame/DeadSpace", "/pmwiki/pmwiki.php/VideoGame/WolfensteinTheNewOrder", "/pmwiki/pmwiki.php/VideoGame/TheyAreBillions", "/pmwiki/pmwiki.php/VideoGame/MetroExodus", "/pmwiki/pmwiki.php/Literature/TheZombieKnight", "/pmwiki/pmwiki.php/Website/Subeta", "/pmwiki/pmwiki.php/Webcomic/Comc", "/pmwiki/pmwiki.php/Webcomic/SluggyFreelance", "/pmwiki/pmwiki.php/Webcomic/TheAdventuresOfWiglafAndMordred", "/pmwiki/pmwiki.php/Webcomic/Erfworld", "/pmwiki/pmwiki.php/Webcomic/TheZombieHunters"], "non_media_links": ["/pmwiki/pmwiki.php/Main/DontAskJustRun", "/pmwiki/pmwiki.php/Main/ZombieApocalypse", "/pmwiki/pmwiki.php/Main/OurZombiesAreDifferent", "/pmwiki/pmwiki.php/Main/EliteMook", "/pmwiki/pmwiki.php/Main/SuperStrength", "/pmwiki/pmwiki.php/Main/MadeOfIron", "/pmwiki/pmwiki.php/Main/SuperSpeed", "/pmwiki/pmwiki.php/Main/ArtificialStupidity", "/pmwiki/pmwiki.php/Main/ArtificialBrilliance", "/pmwiki/pmwiki.php/Main/MagicAndPowers", "/pmwiki/pmwiki.php/Main/SuperSpit", "/pmwiki/pmwiki.php/Main/InASingleBound", "/pmwiki/pmwiki.php/Main/CeilingCling", "/pmwiki/pmwiki.php/Main/MightyGlacier", "/pmwiki/pmwiki.php/Main/LightningBruiser", "/pmwiki/pmwiki.php/Main/HeavilyArmoredMook", "/pmwiki/pmwiki.php/Main/StoneWall", "/pmwiki/pmwiki.php/Main/HazmatSuit", "/pmwiki/pmwiki.php/Main/RaisingTheSteaks", "/pmwiki/pmwiki.php/Main/EnemySummoner", "/pmwiki/pmwiki.php/Main/MakeMeWannaShout", "/pmwiki/pmwiki.php/Main/ZombiePukeAttack", "/pmwiki/pmwiki.php/Main/ActionBomb", "/pmwiki/pmwiki.php/Main/DefeatEqualsExplosion", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Main/ItCanThink", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Main/RevenantZombie", "/pmwiki/pmwiki.php/Main/FightingFromTheInside", "/pmwiki/pmwiki.php/Main/EvilTastesGood", "/pmwiki/pmwiki.php/Main/VideoGame", "/pmwiki/pmwiki.php/Main/ActionBomb", "/pmwiki/pmwiki.php/Main/UndeadChild", "/pmwiki/pmwiki.php/Main/PoweredArmor", "/pmwiki/pmwiki.php/Main/ArtificialLimbs", "/pmwiki/pmwiki.php/Main/ArmCannon", "/pmwiki/pmwiki.php/Main/BladeBelowTheShoulder", "/pmwiki/pmwiki.php/Main/BrainComputerInterface", "/pmwiki/pmwiki.php/Main/ElectronicEyes", "/pmwiki/pmwiki.php/Main/EyeBeams", "/pmwiki/pmwiki.php/Main/PlagueZombie", "/pmwiki/pmwiki.php/Main/ParasiteZombie", "/pmwiki/pmwiki.php/Main/RevenantZombie", "/pmwiki/pmwiki.php/Main/VideoGame", "/pmwiki/pmwiki.php/Main/FleshGolem", "/pmwiki/pmwiki.php/Main/CombatTentacles", "/pmwiki/pmwiki.php/Main/ZombieApocalypse", "/pmwiki/pmwiki.php/Main/EliteZombie", "/pmwiki/pmwiki.php/Main/DieselPunk", "/pmwiki/pmwiki.php/Main/TyrannosaurusRex", "/pmwiki/pmwiki.php/Main/AvertedTrope", "/pmwiki/pmwiki.php/Main/TheMasquerade", "/pmwiki/pmwiki.php/Main/HulkingOut", "/pmwiki/pmwiki.php/Main/TheImmune", "/pmwiki/pmwiki.php/Main/MonsterOfTheWeek", "/pmwiki/pmwiki.php/Main/RevenantZombie", "/pmwiki/pmwiki.php/Main/DysfunctionJunction", "/pmwiki/pmwiki.php/Main/PowerOfTheVoid", "/pmwiki/pmwiki.php/Main/DracoLich", "/pmwiki/pmwiki.php/Main/ReviveKillsZombie", "/pmwiki/pmwiki.php/Main/ZombieApocalypse", "/pmwiki/pmwiki.php/Main/Kevlard", "/pmwiki/pmwiki.php/Main/MightyGlacier", "/pmwiki/pmwiki.php/Main/ImmuneToBullets", "/pmwiki/pmwiki.php/Main/GatlingGood", "/pmwiki/pmwiki.php/Main/ExactlyWhatItSaysOnTheTin", "/pmwiki/pmwiki.php/Main/CombatTentacles", "/pmwiki/pmwiki.php/Main/GatlingGood", "/pmwiki/pmwiki.php/Main/ArsonMurderAndJaywalking", "/pmwiki/pmwiki.php/Main/EverythingFades", "/pmwiki/pmwiki.php/Main/TropeCodifier", "/pmwiki/pmwiki.php/Main/DeathOfAThousandCuts", "/pmwiki/pmwiki.php/Main/FragileSpeedster", "/pmwiki/pmwiki.php/Main/GlassCannon", "/pmwiki/pmwiki.php/Main/LeParkour", "/pmwiki/pmwiki.php/Main/InterfaceScrew", "/pmwiki/pmwiki.php/Main/SetAMookToKillAMook", "/pmwiki/pmwiki.php/Main/MolotovCocktail", "/pmwiki/pmwiki.php/Main/BossInMookClothing", "/pmwiki/pmwiki.php/Main/InterfaceScrew", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Main/ItMakesSenseInContext", "/pmwiki/pmwiki.php/Main/FrankensteinsMonster", "/pmwiki/pmwiki.php/Main/GiantSpider", "/pmwiki/pmwiki.php/Main/BlackKnight", "/pmwiki/pmwiki.php/Main/AnIcePerson", "/pmwiki/pmwiki.php/Main/DracoLich", "/pmwiki/pmwiki.php/Main/RefugeInAudacity", "/pmwiki/pmwiki.php/Main/ArsonMurderAndJaywalking", "/pmwiki/pmwiki.php/Main/LeParkour", "/pmwiki/pmwiki.php/Main/DeadlyLunge", "/pmwiki/pmwiki.php/Main/SmartBomb", "/pmwiki/pmwiki.php/Main/FromBadToWorse", "/pmwiki/pmwiki.php/Main/KingMook", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Main/FragileSpeedster", "/pmwiki/pmwiki.php/Main/MightyGlacier", "/pmwiki/pmwiki.php/Main/GlassCannon", "/pmwiki/pmwiki.php/Main/OurZombiesAreDifferent", "/pmwiki/pmwiki.php/Main/StrongerWithAge", "/pmwiki/pmwiki.php/Main/FragileSpeedster", "/pmwiki/pmwiki.php/Main/ZergRush", "/pmwiki/pmwiki.php/Main/MightyGlacier", "/pmwiki/pmwiki.php/Main/MiniBoss", "/pmwiki/pmwiki.php/Main/LightningBruiser", "/pmwiki/pmwiki.php/Main/KillItWithFire", "/pmwiki/pmwiki.php/Main/EnemySummoner", "/pmwiki/pmwiki.php/Main/StandardStatusEffects", "/pmwiki/pmwiki.php/Main/SavageSetpiece", "/pmwiki/pmwiki.php/Main/TheVirus", "/pmwiki/pmwiki.php/Main/ColorCodedForYourConvenience", "/pmwiki/pmwiki.php/Main/ZombieApocalypse", "/pmwiki/pmwiki.php/Main/PlayerCharacter", "/pmwiki/pmwiki.php/Main/UndeadChild", "/pmwiki/pmwiki.php/Main/LightningBruiser", "/pmwiki/pmwiki.php/Main/ExaggeratedTrope", "/pmwiki/pmwiki.php/Main/LeftForDead", "/pmwiki/pmwiki.php/Main/SuperSoldiers", "/pmwiki/pmwiki.php/Main/ScienceFantasy", "/pmwiki/pmwiki.php/Main/ZombieApocalypse", "/pmwiki/pmwiki.php/Main/PlagueZombie", "/pmwiki/pmwiki.php/Main/ZombiePukeAttack", "/pmwiki/pmwiki.php/Main/DeadWeight", "/pmwiki/pmwiki.php/Main/DeadlyLunge", "/pmwiki/pmwiki.php/Main/AndThenJohnWasAZombie", "/pmwiki/pmwiki.php/Main/BloodyMurder", "/pmwiki/pmwiki.php/Main/NinjaPirateZombieRobot", "/pmwiki/pmwiki.php/Main/DeadWeight", "/pmwiki/pmwiki.php/Main/ZombiePukeAttack", "/pmwiki/pmwiki.php/Main/GlassCannon", "/pmwiki/pmwiki.php/Main/TechnicallyLivingZombie", "/pmwiki/pmwiki.php/AudioPlay/WereAlive", "/pmwiki/pmwiki.php/Main/ScrewThisImOutOfHere", "/pmwiki/pmwiki.php/Main/RevenantZombie", "/pmwiki/pmwiki.php/Main/BigBad"]}