{"title": "Plain Jane", "content": "\"I sometimes wished to have rosy cheeks, a straight nose, and small cherry mouth; I desired to be tall, stately and finely developed in figure; I felt it a misfortune that I was so little, so pale, and had features so irregular and so marked.\"\n\nA character, usually female, who describes herself as homely, ugly or unattractive, or is described as such by another character or the author. These types of characters tend to go one of three ways;\n• The character really isn't plain at all and comes to this realization herself or it is pointed out by another character. This type of Plain Jane could have been beautiful all along or grown up nicely as the story progressed.\n• The girl in question really is homely, but compensates for her looks with her skill, smarts or heart. This type seems to acknowledge her unattractiveness, but does nothing to better her appearance and couldn't care less. This type of Jane is usually a tomboy or a working girl. Usually ends with a \"Don't judge a book by its cover\" aesop, but not always.\n• The Jane is very aware of her \"ugliness\" and uses it as a reason to wangst and get attention from others. This more often then not can result in \"I just want to be beautiful\".\n\nThe Jane can also be the butt monkey of the story because of her looks and used for comedy. If the Jane is only considered ugly in canon, then she may suffer from a case of Hollywood Homely.\n\nCompare Blessed with Suck, when Jane's plainness acts as an asset, and Ugly Cute. Contrast The Beautiful Elite and So Beautiful, It's a Curse.\n• Arakawa from Elfen Lied. Illustrated in a flashback only in the manga, where young Arakawa overhears two boys talking about how they wouldn't date her because she wasn't pretty enough.\n• Mattie Ross from the 2010 remake of True Grit, as gently put by Leboeuf.\n• Elizabeth Abbot from The Curious Case of Benjamin Button is described as plain as paper, but is portrayed by Tilda Swinton. So...\n• Ivy Malfoy (a female version of Harry Potter) from . She Cleans Up Nicely, but she usually chooses not to.\n• Jane Eyre:\n• Most likely the Trope Namer. Jane not only tells herself she's unattractive, but most of the other characters do as well. However, later in the story it's hinted she may be too harsh on herself.\n• Mr. Rochester qualifies as a rare male example. His looks are frequently described as plain, if not downright ugly. But he has a captivating personality and is Tall, Dark, and Snarky, so women still find him appealing. Aaand Rochester is wealthy, so there may be elements of golddigging there. Once his wealth is gone, and he's also injured from the fire, there don't seem to be many people interested.\n• Mary from The Secret Garden. She is described as an ugly and stern child, but becomes somewhat prettier as the novel progresses and she becomes happier.\n• Harry Potter's friend Hermione Granger is first described as frizzy-haired, buck-toothed and shrill, but she eventually outgrows it. That is, the teeth and shrill voice. Her hair is still frizzy, unless she tames it with lots and lots of a magical haircare product, which she considers too much of an effort for every day.\n• Caroline Ayres, the female lead in The Little Stranger by Sarah Waters, is repeatedly described as mannish, plain-faced, unkempt and badly dressed. Interestingly, in the Film of the Book she is played by Ruth Wilson, who had played Jane Eyre \u0097 the most famous Plain Jane of all \u0097 over a decade earlier.\n• Catherine Sloper in Washington Square is always described as plain. The narrator and other characters describe her as having the kind of looks that would be better suited to an older woman than a 20 year old, making her perhaps a delayed version of She's All Grown Up.\n• Sonea from The Black Magician Trilogy describes herself as being average looking, but she doesn't lack for male attention, and is regarded as attractive by those same males.\n• Opal Cowan from the Storm books sees herself as plain, especially compared to previous protagonist Yelena, but she proves just as appealing to men, if not more so. The book cover also shows her as being very attractive.\n• Another literal example with Jane Rizzoli from Tess Gerritsen's Rizzoli & Isles series. She's a very good example of Type 2, as it's mentioned in the first book that she went into police work because she knew it was a career where she would be respected for her mind, not her looks. Yet it's also mentioned that she isn't necessarily bad-looking, but seems reluctant to play up whatever attractiveness she might have—wearing unflattering suits, no makeup. And she's clearly NOT okay with not being beautiful, as she often complains about it and resents women who are.\n• Pride and Prejudice:\n• Mary Bennet is the only one plain among her very attractive sisters who are all reputed beauties. She strives to gain as many accomplishments as possible — she reads or plays the piano all the time — to make up for her looks. However, it's also implied she's not that smart either.\n• Charlotte Lucas, Elizabeth Bennet's best friend, is described as plain by several characters, including herself and the narrator. She knows that's why she's dangerously close to becoming an Old Maid, and she happily marries a stupid and obnoxious man because she knows she can't do better.\n• Adela Quested in A Passage to India. She knows she's not attractive and several characters acknowledge it as well. She's on her way to marry a guy who is also not good-looking.\n• In Shades of Milk and Honey, the protagonist, Jane, deems herself homely, especially in comparison to her much prettier sister Melody, who, in turn, envies Jane her prowess in the glamour magic, which is considered an obligatory talent for an accomplished young lady, much like playing the piano is in Jane Austen's works.\n• In Dragon Bones, the noblewoman Tisala of Callis is described as rather plain by the narrator, Ward, who nevertheless is smitten with her. She herself doesn't remark upon her looks. She doesn't seem to consider it important. As she makes up for her looks in badassery and a sense of humor, no one else cares, either.\n• In When Demons Walk, there is Shamera, who considers herself rather average in the looks department, and openly admits that she needs make-up and revealing dresses to attract male attention. As she is undercover as some lord's mistress, and has to look the part, this is rather important. (Her \"day job\" is thief, which she usually does in men's clothes.)\n• The title character of Sarah Plain And Tall, which gets its name from the way she describes herself in a letter.\n• In Kir Bulychev's Those Who Survive, Maryana, one of the main characters, continually broods over her ugliness. She's not strikingly beautiful (the fact that she's in a Wilderness Survival Plot on an extremely unfriendly planet doesn't help matters), but she is quite nice-looking overall. Anyway, the main character Oleg is sure that True Beauty Is on the Inside and chooses Maryana over Dumb Blonde Liz.\n• Lucia from The Betrothed is a type 2, who attracted Renzo (her fiance) with her intelligence and Don Rodrigo because she's a nearly impossible conquest. Lampshaded by many characters who have heard of her plight before meeting her, who then comment they expected someone more beautiful.\n• Cassidy in the Black Jewels novels The Shadow Queen and Shalador's Lady is rather plain by most characters' standards, including her own. (Although her fantasy-Native American love interest considers her red hair and freckles exotically charming.) She's primarily a type two, but she does have some self-esteem issues and insecurities over being abandoned for someone more glamorous.\n• Hazel Shade in Pale Fire, who's a tragic variant. She's overweight, psoriasis-afflicted, and at the age of twenty two has gotten almost no attention from men (worrying given it's The \u009250s). This leaves her unhappy and somewhat mentally unhinged, and is an indirect cause of her tragic death.\n• South African singer-songwriter Ampie explicitly uses this trope in his ballad Plain Jane. The video is an affectionately Up to Eleven parody of reality TV shows of the The Farmer Seeks A Wife type; in which a prosperous, good-natured but somewhat dim farmer called Johannes is presented with two possible wives who contend for his good favours. The glamorous and beautiful Patricia, who just wants to be wife to a farmer, is the fore-runner who gets most of the camera time. Meanwhile the seemingly dowdier Jane - who dresses in veldt-chic and is a farm-girl herself who aspires to be a farmer with a husband - is practically ignored. This tale can only go one way... Jane wins out in the end and gets the rose from Johannes. In Afrikaans; the music begins around 0.39. The video tells a very clear tale laden with tropes!\n• In some versions of bare: a pop opera, Nadia describes herself this way in a song called \"Plain Jane Fat Ass.\"\n• While not implicitly on-screen, Velma on Scooby-Doo is described as a plain girl.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/PlainJane", "media_links": ["/pmwiki/pmwiki.php/Literature/JaneEyre", "/pmwiki/pmwiki.php/Manga/ElfenLied", "/pmwiki/pmwiki.php/Film/TrueGrit", "/pmwiki/pmwiki.php/Film/TheCuriousCaseOfBenjaminButton", "/pmwiki/pmwiki.php/Creator/TildaSwinton", "/pmwiki/pmwiki.php/Literature/HarryPotter", "/pmwiki/pmwiki.php/Literature/JaneEyre", "/pmwiki/pmwiki.php/Literature/TheSecretGarden", "/pmwiki/pmwiki.php/Literature/HarryPotter", "/pmwiki/pmwiki.php/Literature/TheLittleStranger", "/pmwiki/pmwiki.php/Creator/RuthWilson", "/pmwiki/pmwiki.php/Literature/WashingtonSquare", "/pmwiki/pmwiki.php/Literature/TheBlackMagicianTrilogy", "/pmwiki/pmwiki.php/Literature/IxiaAndSitia", "/pmwiki/pmwiki.php/Series/RizzoliAndIsles", "/pmwiki/pmwiki.php/Literature/PrideAndPrejudice", "/pmwiki/pmwiki.php/Literature/APassageToIndia", "/pmwiki/pmwiki.php/Literature/ShadesOfMilkAndHoney", "/pmwiki/pmwiki.php/Creator/JaneAusten", "/pmwiki/pmwiki.php/Literature/DragonBones", "/pmwiki/pmwiki.php/Literature/WhenDemonsWalk", "/pmwiki/pmwiki.php/Literature/SarahPlainAndTall", "/pmwiki/pmwiki.php/Literature/ThoseWhoSurvive", "/pmwiki/pmwiki.php/Literature/TheBetrothed", "/pmwiki/pmwiki.php/Literature/BlackJewels", "/pmwiki/pmwiki.php/Literature/PaleFire", "/pmwiki/pmwiki.php/Theatre/BareAPopOpera", "/pmwiki/pmwiki.php/WesternAnimation/FamilyGuy", "/pmwiki/pmwiki.php/WesternAnimation/ScoobyDoo"], "non_media_links": ["/pmwiki/pmwiki.php/Main/BeautifulAllAlong", "/pmwiki/pmwiki.php/Main/ShesAllGrownUp", "/pmwiki/pmwiki.php/Main/Tomboy", "/pmwiki/pmwiki.php/Main/Aesop", "/pmwiki/pmwiki.php/Main/Wangst", "/pmwiki/pmwiki.php/Main/IJustWantToBeBeautiful", "/pmwiki/pmwiki.php/Main/ButtMonkey", "/pmwiki/pmwiki.php/Main/HollywoodHomely", "/pmwiki/pmwiki.php/Main/BlessedWithSuck", "/pmwiki/pmwiki.php/Main/UglyCute", "/pmwiki/pmwiki.php/Main/TheBeautifulElite", "/pmwiki/pmwiki.php/Main/SoBeautifulItsACurse", "/pmwiki/pmwiki.php/Main/AnimeAndManga", "/pmwiki/pmwiki.php/Main/TearJerker", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/SarcasmMode", "/pmwiki/pmwiki.php/Main/JerkAss", "/pmwiki/pmwiki.php/Main/HollywoodHomely", "/pmwiki/pmwiki.php/Main/Fanfiction", "/pmwiki/pmwiki.php/Main/GenderSwap", "https://www.fanfiction.net/s/7923206/1/Miss-PotterMalfoy", "/pmwiki/pmwiki.php/Main/SheCleansUpNicely", "/pmwiki/pmwiki.php/Main/Literature", "/pmwiki/pmwiki.php/Main/TropeNamer", "/pmwiki/pmwiki.php/Main/BreakTheCutie", "/pmwiki/pmwiki.php/Main/TallDarkAndSnarky", "/pmwiki/pmwiki.php/Main/IceQueen", "/pmwiki/pmwiki.php/Main/DefrostingIceQueen", "/pmwiki/pmwiki.php/Main/SheCleansUpNicely", "/pmwiki/pmwiki.php/Main/FilmOfTheBook", "/pmwiki/pmwiki.php/Main/PlainJane", "/pmwiki/pmwiki.php/Main/ShesAllGrownUp", "/pmwiki/pmwiki.php/Main/OldMaid", "/pmwiki/pmwiki.php/Main/WildernessSurvivalPlot", "/pmwiki/pmwiki.php/Main/TrueBeautyIsOnTheInside", "/pmwiki/pmwiki.php/Main/DumbBlonde", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/ILoveYouBecauseICantControlYou", "/pmwiki/pmwiki.php/Main/Lampshaded", "/pmwiki/pmwiki.php/Main/ExpectingSomeoneTaller", "/pmwiki/pmwiki.php/Main/TheFifties", "/pmwiki/pmwiki.php/Main/Music", "/pmwiki/pmwiki.php/UsefulNotes/SouthAfrica", "https://www.youtube.com/watch?v=ZDGhOc98iFI&index=25&list=PLIa36ETako3MaZaw7-I0qEuflOniBvTWd", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Main/Theatre", "/pmwiki/pmwiki.php/Main/WesternAnimation", "/pmwiki/pmwiki.php/Main/ButtMonkey"]}