{"title": "Plot Immunity", "content": "A special type of spoiler. Since this is a spoiler-fueled trope, consider this your warning; no spoiler text appears below.\n\nCertain characters aren't going to die or move away. They can't, because if they do, the story is over. However, some writers still try to squeeze drama out of this by either:\n• Killing them off and then bringing them back, or\n• Writing a cliffhanger where it seems they might be dead or teasing the departure of a love interest.\n\nIf it's very well written, it can work. If not, it turns bad for Genre Savvy fans. It's a cheap attempt to build tension for a season finale, two-part episode or a sequel. Bonus points if the character whose death they're teasing is the titular character of the show or film franchise.\n\nNot applicable on (most) shows or films where Anyone Can Die, the exception being one of the show's central characters, like Jack Bauer on 24. Not applicable if the show is broadcasting its series finale (especially not a Grand Finale). Not applicable in a medium where Death Is Cheap (like comic books). Not applicable if the work is a biography of a person who famously died in some significant manner (Malcolm X, The Pride of the Yankees). Not applicable when it's done for Character Development or to collect a Plot Coupon.\n\nPlot Immunity applies only when the fan watching or reading the story knows that a character's teased death or departure is done for cheap drama and isn't going to stick. Please list only examples of characters with whom a writer has tried to tease removal; don't just rattle off characters you think their respective stories wouldn't survive losing.\n\nCompare Like You Would Really Do It, I Knew It! and Status Quo Is God. Contrast Put on a Bus and Killed Off for Real.\n\nEntries are sometimes \"incomplete\" because this trope is about people who couldn't be killed/removed.\n\nPlease refrain form adding spoiler text, there is a very clear warning at the top of the page. Spoiler text would make the whole entry unreadable.\n• Burn Notice: One season finale ended with main character Michael Westen apparently blown up by a bomb and his fate left hanging in the balance.\n• Another season's penultimate episode had Fiona planning to return to Ireland.\n• Castle: The first half of a two-part episode in the second season ended with Beckett's apartment blown up, leaving her fate hanging in the balance. The trailers for the next week's episode even went so far as to not show her! However, it's apparent 60 seconds into the episode that she's alive.\n• The season six premiere ends with Castle poisoned and only having a day to live. In the next episode we find out that there is an antidote, which by the end of the episode Beckett has retrieved and Castle is saved.\n• In an example where it was written well enough to get a pass, The Dark Knight had a plot where Commissioner Gordon was allegedly killed by The Joker. He's alive at the end, though.\n• The finale for 24's fifth season ended up with Jack Bauer taken by the Chinese, which would have been great if the next season focused on getting him back, or his escape or something. Instead, the sixth season starts with him being escorted off a boat in cuffs and shackles.\n• The season seven finale has Jack poisoned and dying from some kind of experimental biological weapon and dependent on another experimental procedure to save his life.\n• Koinzell from Ubel Blatt got directly hit by a magical laser beam, fell of a cliff into an ice-cold river, which swept him to a water fall which he fell down and got pierced by rocks and branches. Five chapters later, he's back up again.\n• Star Trek (2009): Subverted. When Spock beams Kirk off the Enterprise. Yes, Kirk wasn't going to stay off for long, but the purpose of this was for him to meet Spock Prime and Scotty, not to make the audience think he was somehow going to rot there.\n• For two seasons running now, Chuck has teased that Sarah would be leaving with another spy on a mission somewhere, in both cases fans didn't buy it for a second.\n• Also at the start of the second season, one of the key sub plots is Casey's order to kill Chuck when the new intersect comes online. It's sure handy that the damn thing blew up. It'd be awkward having to fill out the rest of the season of a show called Chuck without, ya know, Chuck.\n• The fifth season of Buffy the Vampire Slayer ends with Buffy dying. The show ran for two more seasons.\n• Subverted; at the time The WB had canceled the show and UPN hadn't picked it up.\n• The third season of CSI: Miami had a season-long tagline; something along the lines of \"Horatio Caine is a dead man\" and every commercial for the show that season ended with a graphic of his iconic sunglasses with what looked like a bullet hole in the left lens. When the season finale came there was an attempt on his life, but it didn't even come close. Horatio Caine wasn't going out that way... YEEEEEEEEEEEAAAAAAAAAAAAAAAAAAHHHHHHHHHH\n• Season Six of Houses second episode starts with Dr. Gregory House's resignation from the hospital.\n• Subverted with the 80's sitcom The Hogan Family. The show was originally a vehicle for former Mary Tyler Moore and Rhoda star Valerie Harper titled Valerie. However, after a dispute with the show's producers, Harper was fired, her character was Killed Off for Real, and the show was retitled with the father's sister moving in and becoming a surrogate mother.\n• Supernatural. Dean and Sam won't die, and they won't stop hunting.\n• \"Won't die\" is overstating things a bit. They never stay dead, anyway.\n• Flumpty Bumpty from One Night at Flumpty's outright says that he's an Eldritch Abomination who's immune to the plot in his introduction. Unfortunately for you, he's the Big Bad.\n• Played with by The Flash (2014). At the end of the third season, Barry goes into exile in the Speed Force. Under normal circumstances, there's no way the show would go on without its title character, but: A) in the comics, Wally succeeded Barry as the Flash, and could possibly do so here; and B) Arrowverse shows have a habit of writing out characters appearing in the DC Extended Universe, and a version of Barry was going to be in Justice League (2017) later that year. Ultimately played straight, with Barry returning when the next season began; but for once there was an actual possibility that he wouldn't.\n• This is very common in Doctor Who, with a lot of cliffhangers and story endings revolving around how the Doctor/his companions/another series main character was doomed to die and unable to get out of this one. Notable examples include:\n• The Impossible Astronaut/Day of the Moon, or perhaps the entirety of series 6 given the arc was about the Doctor's 'death'. It was pretty obvious how the Doctor wouldn't be permanently killed off here (since it'd end the series), so the whole arc ended up being about which of the various 'cloning'/doppelganger creations methods introduced in the series would be used to solve the issue.\n• The Magician's Apprentice/Witch's Familiar. When a story seemingly kills off the protagonist's Arch-Enemy, sidekick and Cool Ship in the span of five minutes before having him supposedly kill the child form of the villain with a gun on prime time TV, it's clear that something's not going to be played straight there.\n• Beneath the Lake, where the Doctor supposedly dies and gets turned into a ghost.\n• As well as the Zygon Invasion, where the Doctor's plane gets shot down with a rocket launcher right at the end of the episode.\n• Really, the series does this, Like You Would Really Do It, Our Hero Is Dead and other related tropes so often that the fans are likely deeply critical of any shocking relevation or change to the status quo given how likely it is to be undone in the next episode.\n• If the Doctor is the \"doomed\" character, the story may be leading into a regeneration rather than a permanent death, though the debut of a new lead actor is generally well known in advance among the fans.\n• The first episode of Maggie & Bianca: Fashion Friends ends with Maggie kicked out of the school where the series takes place. Given that her name is in the title, it's not exactly surprising when the decision is reversed at the beginning of the second episode.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/PlotImmunity", "media_links": ["/pmwiki/pmwiki.php/Film/MalcolmX", "/pmwiki/pmwiki.php/Film/ThePrideOfTheYankees", "/pmwiki/pmwiki.php/Series/BurnNotice", "/pmwiki/pmwiki.php/Series/Castle", "/pmwiki/pmwiki.php/Film/TheDarkKnight", "/pmwiki/pmwiki.php/ComicBook/TheJoker", "/pmwiki/pmwiki.php/Series/TwentyFour", "/pmwiki/pmwiki.php/Manga/UbelBlatt", "/pmwiki/pmwiki.php/Film/StarTrek2009", "/pmwiki/pmwiki.php/Series/Chuck", "/pmwiki/pmwiki.php/Series/BuffyTheVampireSlayer", "/pmwiki/pmwiki.php/Series/CSIMiami", "/pmwiki/pmwiki.php/Series/House", "/pmwiki/pmwiki.php/Series/TheHoganFamily", "/pmwiki/pmwiki.php/Series/Supernatural", "/pmwiki/pmwiki.php/VideoGame/OneNightAtFlumptys", "/pmwiki/pmwiki.php/Series/TheFlash2014", "/pmwiki/pmwiki.php/Series/Arrowverse", "/pmwiki/pmwiki.php/Franchise/DCExtendedUniverse", "/pmwiki/pmwiki.php/Film/JusticeLeague2017", "/pmwiki/pmwiki.php/Series/DoctorWho"], "non_media_links": ["/pmwiki/pmwiki.php/Main/KilledOffForReal", "/pmwiki/pmwiki.php/Main/PutOnABus", "/pmwiki/pmwiki.php/Main/BackFromTheDead", "/pmwiki/pmwiki.php/Main/GenreSavvy", "/pmwiki/pmwiki.php/Main/AnyoneCanDie", "/pmwiki/pmwiki.php/Main/GrandFinale", "/pmwiki/pmwiki.php/Main/DeathIsCheap", "/pmwiki/pmwiki.php/Main/CharacterDevelopment", "/pmwiki/pmwiki.php/Main/PlotCoupon", "/pmwiki/pmwiki.php/Main/LikeYouWouldReallyDoIt", "/pmwiki/pmwiki.php/Main/IKnewIt", "/pmwiki/pmwiki.php/Main/StatusQuoIsGod", "/pmwiki/pmwiki.php/Main/PutOnABus", "/pmwiki/pmwiki.php/Main/KilledOffForReal", "/pmwiki/pmwiki.php/Main/LoveInterest", "/pmwiki/pmwiki.php/Main/LoveInterest", "/pmwiki/pmwiki.php/Main/LoveInterest", "/pmwiki/pmwiki.php/Main/MemeticMutation", "/pmwiki/pmwiki.php/Main/RealLifeWritesThePlot", "/pmwiki/pmwiki.php/Main/KilledOffForReal", "/pmwiki/pmwiki.php/Main/SuspiciouslySimilarSubstitute", "/pmwiki/pmwiki.php/Main/EldritchAbomination", "/pmwiki/pmwiki.php/Main/FromBadToWorse", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/ArchEnemy", "/pmwiki/pmwiki.php/Main/CoolShip", "/pmwiki/pmwiki.php/Main/LikeYouWouldReallyDoIt", "/pmwiki/pmwiki.php/Main/OurHeroIsDead", "/pmwiki/pmwiki.php/Main/TheNthDoctor"]}