{"title": "Cold Reading", "content": "Often occurs in stuff where Phony Psychics might be involved. One character pretends to be psychic towards another, usually The Watson. In reality, they're just very good at observation, good with broad generalizations, and have probably gone through the other person's bag.\n\nLet's give a hypothetical example — Ziva David and Tony DiNozzo from NCIS.\n\nZiva: I can so read your mind, Tony. \n\nTony: Nah, Ziva. No way you could read my mind. I'll bet you ten bucks that you can't. \n\nZiva: OK, four items. Firstly, you put up a front of confidence, but you're insecure inside. Secondly, you have a fear you don't tell people about. Thirdly, you think you're really attractive. And finally, you really want to see me pole-dancing. \n\nTony: How did you know that? \n\nGibbs: How did she know what, DiNozzo? Come on, get the truck!\n\nThere are a few reasons why this works:\n• People have a tendency to take generalized statements and personalize them, believing that they apply specifically to themselves (this is called the Forer effect ). Everyone has \"a side of themselves that they don't want others to see\", for example. This is the same reason why people believe in horoscopes despite there being twelve predictions for roughly seven billion people. Cold readers often do this in front of a crowd, as well, which jumps the chances up to near-certainty.\n• The mark is usually looking for answers and will latch onto the tiniest detail that will fit their expectations. The fact that they're seeing a psychic in the first place shows that they have some belief in the concept. It's also easy to forget the things the cold reader said that were inaccurate, by virtue of Confirmation Bias.\n• \"Psychics\" use observation and insight to lead on the mark. Age is usually a very good indicator: for example, an older person will be around the age of retirement — so they may be \"thinking about their options in life\" — or may have fought in an armed conflict. (This is technically warm reading, and there's also hot reading, but let's not split hairs.) It doesn't matter if the psychic guesses incorrectly, since it's the correct guesses that the mark will pay attention to.\n• The mark has a pretty good chance of just giving the psychic the information outright once they're on the right track. For instance, if the psychic says they're hearing the voice of someone and starts sounding out the first letter of a name, chances are good the person will then blurt out the name of someone they knew with that letter in their name. After all, once the person is hooked, they're likely to want to \"help\" the psychic, or just hysterical. At that point, all the psychic needs to do is tell them what they want to hear.\n\nThough this sounds easy, it's worth mentioning that this requires a great deal of insight, improvisational ability and force of personality from the \"psychic\" to work in a convincing manner. That said, it seems that people can also do this accidentally in real life, thinking they're really psychic and fooling themselves the same way they fool the mark.\n\nSee also Sherlock Scan, which involves many of the same skills but without the \"psychic\" aspect.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/ColdReading", "media_links": ["/pmwiki/pmwiki.php/Series/NCIS", "/pmwiki/pmwiki.php/Manga/XxxHolic", "/pmwiki/pmwiki.php/LightNovel/NoGameNoLife", "/pmwiki/pmwiki.php/Film/TheBreakfastClub", "/pmwiki/pmwiki.php/Film/LeapOfFaith", "/pmwiki/pmwiki.php/Film/NowYouSeeMe", "/pmwiki/pmwiki.php/Film/PeeWeesBigAdventure", "/pmwiki/pmwiki.php/Film/TheWizardOfOz", "/pmwiki/pmwiki.php/Literature/TheGreatMerlini", "/pmwiki/pmwiki.php/Literature/SecondApocalypse", "/pmwiki/pmwiki.php/Series/YesPrimeMinister", "/pmwiki/pmwiki.php/Series/Monk", "/pmwiki/pmwiki.php/Literature/Worm", "/pmwiki/pmwiki.php/Series/ThirdRockFromTheSun", "/pmwiki/pmwiki.php/Series/Afterlife", "/pmwiki/pmwiki.php/Series/DoctorWho", "/pmwiki/pmwiki.php/Series/Leverage", "/pmwiki/pmwiki.php/Series/TheListener", "/pmwiki/pmwiki.php/Series/ModernFamily", "/pmwiki/pmwiki.php/Series/NewTricks", "/pmwiki/pmwiki.php/Series/PennAndTellerBullshit", "/pmwiki/pmwiki.php/Music/WeirdAlYankovic", "/pmwiki/pmwiki.php/Radio/BleakExpectations", "/pmwiki/pmwiki.php/Ride/UniversalStudios", "/pmwiki/pmwiki.php/VideoGame/FireEmblemAwakening", "/pmwiki/pmwiki.php/Webcomic/ElGoonishShive", "/pmwiki/pmwiki.php/Webcomic/Lackadaisy", "/pmwiki/pmwiki.php/WesternAnimation/FamilyGuy", "/pmwiki/pmwiki.php/WesternAnimation/SouthPark", "/pmwiki/pmwiki.php/Creator/OrsonWelles"], "non_media_links": ["/pmwiki/pmwiki.php/Main/PhonyPsychic", "/pmwiki/pmwiki.php/Main/TheWatson", "http://en.wikipedia.org/wiki/Forer_effect", "/pmwiki/pmwiki.php/Main/ConfirmationBias", "/pmwiki/pmwiki.php/Main/SherlockScan", "/pmwiki/pmwiki.php/Main/PhonyPsychic", "/pmwiki/pmwiki.php/Main/EstablishingCharacterMoment", "/pmwiki/pmwiki.php/Main/PhonyPsychic", "/pmwiki/pmwiki.php/Main/AwesomenessByAnalysis", "/pmwiki/pmwiki.php/Main/FinishingEachOthersSentences", "/pmwiki/pmwiki.php/Main/SherlockScan", "/pmwiki/pmwiki.php/Main/PlayedWith", "/pmwiki/pmwiki.php/Recap/DoctorWhoS28E9TheSatanPit", "/pmwiki/pmwiki.php/Main/MaybeMagicMaybeMundane", "/pmwiki/pmwiki.php/Main/PhonyPsychic", "/pmwiki/pmwiki.php/Main/BerserkButton", "/pmwiki/pmwiki.php/Main/NoSocialSkills", "/pmwiki/pmwiki.php/SugarWiki/MomentOfAwesome", "/pmwiki/pmwiki.php/Main/Telepath", "/pmwiki/pmwiki.php/Main/SherlockScan", "/pmwiki/pmwiki.php/Main/IronicEcho", "/pmwiki/pmwiki.php/Main/SherlockScan", "/pmwiki/pmwiki.php/Main/TriviallyObvious", "/pmwiki/pmwiki.php/Main/TheDitz", "/pmwiki/pmwiki.php/Main/OppositeSexClone", "/pmwiki/pmwiki.php/WebComic/TheOrderOfTheStick", "http://www.giantitp.com/comics/oots0534.html", "/pmwiki/pmwiki.php/Main/VisualPun", "/pmwiki/pmwiki.php/Main/Squick", "https://www.youtube.com/watch?v=IjPsnfysrp8"]}