{"title": "Measuring Day", "content": "Relax, she's just playing sudoku and messing with your head.\n\nA Japanese cultural trope often seen in manga and anime series that take place in a school setting, measuring day is the students' annual full physical examination. This usually takes place during the course of a whole day and is often used for fanservice. Since Most Writers Are Male expect lots of jokes in which certain physical quantities of (female) students get compared — or where one of the girls gets a chance to really freak out about her weight problem, imagined or not. Conversely, a lack of growth, embarrassing or inappropriate underwear or an inappropriate body under the underwear are also sources for potential angst, making measuring day a special trial for a Wholesome Crossdresser or a Sweet Polly Oliver. In addition, there's the usual group of guys that always try to peek on the girls' examinations.\n• Azumanga Daioh. Surprisingly, Kimura-sensei is almost entirely absent from those scenes, despite being an obvious avenue for cheap humor. (He shows up for a single punchline.)\n• Ouran High School Host Club, complete with a mad scramble to conceal the (female) protagonist's actual gender that culminates in the Ohtori family ordering a doctor \"in the next room\" to keep her secret.\n• The Fanservice part gets lampshaded since (barring Haruhi) all the students have their own personal doctors and the examination is \"really popular\" because the girls get to see the Host Club boys with their shirts off.\n• In Marginal #4, they have one of these. The catch? Atom thought Going Commando was required (it isn't) and ends up losing his lucky underwear.\n• Pretty Face has one of these with the protagonist trying wacky schemes to get out of the physical examination, which would reveal that he's not actually a girl. Turns out the doctor giving the examinations is the same one that gave him a girl's face in the first place .\n• Seen as a short intro segment in Sayonara, Zetsubou-Sensei with Maria messing with the other girls' weightings.\n• Lucky Star. Only one of the girls has nothing to be gloomy about, and gets flat-out scolded for it. (Though the others' complaints are hardly earth-shattering stuff: \"I'm still short,\" \"I forgot it's measuring day today and wore my printed pants\" and \"I gained one pound.\")\n• Rosario + Vampire in the anime's Capu 2. Mizore doesn't actually get measured because she's too busy stalking Tsukune again.\n• Happens in Season II of the manga as well... during a \"Freaky Friday\" Flip with Yukari Sendo and Fang-Fang Huang. It's explained in the manga version that measurement day is meant to show how well the students have settled into their human forms. Witch and a Yasha? They might both be magic, but that would all go to hell if they got caught in the wrong body.\n• Hell Teacher Nube, where the doctor is actually Nube's rival (and enemy at the time) Tamamo. When he tries to confront him mid-examination, the girls toss Nube out and call him a pervert.\n• Maria\u0086Holic, where a main character has to resort to subterfuge to keep his crossdressing secret.\n• Hidamari Sketch has an entire chapter on this. If Yuno, who cared more about her height than weight, decided not to have breakfast, then Hiro... Also, is a 2mm difference in height merely due to error?\n• Cromartie High School has a hilarious skit involving a visiting doctor and his reactions when measuring the less... ordinary students of Cromartie.\n• A variant crops up in A Certain Scientific Railgun. It's called \"Measuring Day\" but rather than a physical exam it's measuring the students' special powers. Special precautions have to be taken at Tokiwadai when measuring Mikoto's Railgun, including using the pool as a shock absorber.\n• Measuring day presents a real problem for Makoto in Boku no Futatsu no Tsubasa: Namely, concealing the fact that she's a true Hermaphrodite from her peers.\n• Seikon no Qwaser has this for a filler episode, with the expected focus on breast measurement.\n• Used as a conflict point in I My Me! Strawberry Eggs in which cross-dressing teacher Hibiki is at a loss on how to prevent his status as male from being known after the faculty declares he must undergo a physical as well. His landlady saves the day.\n• Guyver, in the 2005 anime. Gives Sho an Oh, Crap! moment, because at this point, he had no idea what the Guyver was, only that it had implanted something in his back the first time he wore it.\n• Sekirei features an omake built on this concept, Examination Day. All Sekirei in the city are required to report for physical exams, which involves bikinis and competition over bust size. The flat-chested villain ends up leveling the building after the heroes discover her dropped bra and wonder who such a tiny thing could belong to.\n• Beelzebub had this when the Ishiyama High kids were at St. Ishiyama Academy. The main fanservice came from the guys, with the protagonist and his best friend as the only boys in the room (accidentally, they were searching for a baby that was lost in there) when the girls do their examination, which was actually quite matter-of-fact.\n• In Slam Dunk, Aouta tells Sakuragi about a Measuring Day that took place when he and Akagi were children. Akagi is revealed to have been quite the Jerkass to Aouta back then, much to Aouta's Played for Laughs anger - and the focus switches to the eavesdropping Akagi and Kogure, with an extremely embarrassed Akagi pretending that he never was that much of a jerk.\n• School Rumble. Both Tenma and Harima sneak in as personnel, and Hilarity Ensues.\n• And the actual measuring had been cancelled.\n• New Game! has a company-sponsored physical, and it plays out similarly to a school measuring day.\n• Shows up in Accel World in one of its OVAs titled \"Vacation.\" In addition to the usual fanservice, it serves to start the crisis for the episode because protagonist Haruyuki is too overweight to pass his examination.\n• Despite not being a school setting, a measuring day scene is added into the first OVA for Daily Life with Monster Girl. This scene has the obvious amount of fanservice, but also shows how things have to be adapted to accurately measure people who have radically different bodies from humans. It's determined that the girls are starting to put on weight, leading to them going to the gym instead of merely having Ms Smith decide they need more exercise the way it was handled in the manga.\n• The Korean horror movie, Memento Mori has a scene with this.\n• Mayo Chiki!. Again, there's a Sweet Polly Oliver whose Masquerade is threatened by this.\n• In one episode of Infinite Stratos, due to the frequent attacks on the IS Academy, the Academy decides they need to increase the number of prepared defenders, so they have all the students get measured so they can get them into IS Suits of their own. IS Academy happens an all-girls school...except for The One Guy, Ichika. And, of course, it's he who gets roped into measuring the girls. Fearing retribution from his Unwanted Harem, he tries to do the measurements with his eyes closed. Unfortunately, he accidentally gropes the girl he's measuring, whose squeals attracts his harem anyway...cue Oh, Crap! from Ichika.\n• Occurs in both Persona 4 and Devil Survivor 2 by Atlus. In both, the characters have been getting into dangerous situations and one of the characters suggests a full physical examination to check for side effects, and in both the girls compare their cup sizes, declaring a \"winner\". In Devil Survivor 2, there's an option to peep if you choose to skip your own exam, and it graduates to full-blown fanservice in Record Breaker with the girls' undergarments being depicted.\n• The Katamari Damacy series sometimes has scenes like this in its outdoor levels.\n• Karin-dou 4koma: While the other girls compare bust sizes, Ran briefly becomes a skeleton with glowing eyes to terrify some boys trying to peek.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/MeasuringDay", "media_links": ["/pmwiki/pmwiki.php/Manga/DokiDokiSchoolHours", "/pmwiki/pmwiki.php/Manga/DokiDokiSchoolHours", "/pmwiki/pmwiki.php/Manga/AzumangaDaioh", "/pmwiki/pmwiki.php/Anime/Maburaho", "/pmwiki/pmwiki.php/Manga/HighSchoolGirls", "/pmwiki/pmwiki.php/Manga/MahouSenseiNegima", "/pmwiki/pmwiki.php/Manga/OuranHighSchoolHostClub", "/pmwiki/pmwiki.php/Anime/MarginalNumber4", "/pmwiki/pmwiki.php/Manga/PrettyFace", "/pmwiki/pmwiki.php/Manga/SayonaraZetsubouSensei", "/pmwiki/pmwiki.php/Manga/LuckyStar", "/pmwiki/pmwiki.php/Manga/RosarioToVampire", "/pmwiki/pmwiki.php/Manga/HellTeacherNube", "/pmwiki/pmwiki.php/Manga/MariaHolic", "/pmwiki/pmwiki.php/Manga/HidamariSketch", "/pmwiki/pmwiki.php/Manga/CromartieHighSchool", "/pmwiki/pmwiki.php/Manga/ACertainScientificRailgun", "/pmwiki/pmwiki.php/Manga/BokuNoFutatsuNoTsubasa", "/pmwiki/pmwiki.php/Anime/IMyMeStrawberryEggs", "/pmwiki/pmwiki.php/Manga/Guyver", "/pmwiki/pmwiki.php/Manga/Sekirei", "/pmwiki/pmwiki.php/Manga/Beelzebub", "/pmwiki/pmwiki.php/Manga/SlamDunk", "/pmwiki/pmwiki.php/Manga/SchoolRumble", "/pmwiki/pmwiki.php/Manga/NewGame", "/pmwiki/pmwiki.php/LightNovel/AccelWorld", "/pmwiki/pmwiki.php/Anime/DailyLifeWithMonsterGirl", "/pmwiki/pmwiki.php/Film/MementoMori", "/pmwiki/pmwiki.php/LightNovel/MayoChiki", "/pmwiki/pmwiki.php/LightNovel/InfiniteStratos", "/pmwiki/pmwiki.php/VideoGame/Persona4", "/pmwiki/pmwiki.php/VideoGame/DevilSurvivor2", "/pmwiki/pmwiki.php/Creator/Atlus", "/pmwiki/pmwiki.php/VideoGame/KatamariDamacy", "/pmwiki/pmwiki.php/VisualNovel/DaCapo", "/pmwiki/pmwiki.php/Webcomic/KarinDou4koma"], "non_media_links": ["/pmwiki/pmwiki.php/Main/MostWritersAreMale", "/pmwiki/pmwiki.php/Main/GagBoobs", "/pmwiki/pmwiki.php/Main/WeightWoe", "/pmwiki/pmwiki.php/Main/WholesomeCrossdresser", "/pmwiki/pmwiki.php/Main/SweetPollyOliver", "/pmwiki/pmwiki.php/Main/AllMenArePerverts", "/pmwiki/pmwiki.php/Main/ThePeepingTom", "/pmwiki/pmwiki.php/Main/Anime", "/pmwiki/pmwiki.php/Main/Manga", "/pmwiki/pmwiki.php/Main/DirtyOldMan", "/pmwiki/pmwiki.php/Main/FanService", "/pmwiki/pmwiki.php/Main/MrFanservice", "/pmwiki/pmwiki.php/Main/WalkingShirtlessScene", "/pmwiki/pmwiki.php/Main/GoingCommando", "/pmwiki/pmwiki.php/Main/GoodLuckCharm", "/pmwiki/pmwiki.php/Main/OlderThanTheyLook", "/pmwiki/pmwiki.php/Main/GoofyPrintUnderwear", "/pmwiki/pmwiki.php/Main/WeightWoe", "/pmwiki/pmwiki.php/Main/Capu2", "/pmwiki/pmwiki.php/Main/StalkerWithACrush", "/pmwiki/pmwiki.php/Main/FreakyFridayFlip", "/pmwiki/pmwiki.php/Main/CuteWitch", "/pmwiki/pmwiki.php/Main/SummonMagic", "/pmwiki/pmwiki.php/Main/TheRival", "/pmwiki/pmwiki.php/Main/DefeatMeansFriendship", "/pmwiki/pmwiki.php/Main/Obake", "/pmwiki/pmwiki.php/Main/OlderThanTheyLook", "/pmwiki/pmwiki.php/Main/HollywoodPudgy", "/pmwiki/pmwiki.php/Main/PersonOfMassDestruction", "/pmwiki/pmwiki.php/Main/OhCrap", "/pmwiki/pmwiki.php/Main/ACupAngst", "/pmwiki/pmwiki.php/Main/BuxomIsBetter", "/pmwiki/pmwiki.php/Main/JerkAss", "/pmwiki/pmwiki.php/Main/PlayedForLaughs", "/pmwiki/pmwiki.php/Main/HilarityEnsues", "/pmwiki/pmwiki.php/Main/ShaggyDogStory", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/LightNovels", "/pmwiki/pmwiki.php/Main/SweetPollyOliver", "/pmwiki/pmwiki.php/Main/Masquerade", "/pmwiki/pmwiki.php/Main/PoweredArmor", "/pmwiki/pmwiki.php/Main/TheOneGuy", "/pmwiki/pmwiki.php/Main/PervertRevengeMode", "/pmwiki/pmwiki.php/Main/UnwantedHarem", "/pmwiki/pmwiki.php/Main/OhCrap", "/pmwiki/pmwiki.php/Main/VideoGames", "/pmwiki/pmwiki.php/Main/Fanservice", "/pmwiki/pmwiki.php/Main/VideoGameRemake", "/pmwiki/pmwiki.php/Main/VisualNovels", "/pmwiki/pmwiki.php/Main/Webcomic", "/pmwiki/pmwiki.php/Main/CuteGhostGirl"]}