{"title": "The Hilarious Table", "content": "\u0093It is a fair, even-handed, noble adjustment of things that, while there is infection in disease and sorrow, there is nothing in the world so irresistibly contagious as laughter and good humour. When Scrooge\u0092s nephew laughed in this way \u0096 holding his sides, rolling his head and twisting his face into the most extravagant contortions \u0096 Scrooge\u0092s niece, by marriage, laughed as heartily as he. And their assembled friends, being not a bit behindhand, roared out lustily.\u0094\n\nOften a writer will feel the need to show that a group is getting on really well. One way to do this is to have them sit around over dinner or some other private social gathering and just talk, tell jokes and stories, and so on.\n\nOne common shorthand for this is to have the whole group sit or stand around, just laughing, often in a really over-the-top way and generally with no actual laughter heard (though it may fade in at the end just before somebody says something), while the camera pans about. This can be incorporated into a montage of clinking glasses and little snippets of conversation, but this trope is mainly about a slightly rarer variant where the group just sits around laughing hysterically at nothing. This generally comes over as extremely forced and may incorporate an \"Oh, you!\" hand gesture or two. The fact that we are, essentially, seeing a group of people pretending to split their sides at some joke we haven't heard at all, and are essentially falling out of their chairs with laughter, can be more than a bit unsettling or mood-breaking for some viewers, who wonder what could possibly be so funny. They may end up sardonically thinking, \"What a funny table / hearth-rug / fireplace that must be!\". Often ends with two people moving away from the group, possibly to the sofa or fireside, for some cheesy romantic pap-talk or a heart-to heart.\n\nNote: This is not about people sitting around a table laughing at a joke, it's any group of people (sitting or standing) around laughing at NOTHING to which the audience is privy as a way of showing that they are getting on, particularly when it is very over the top.\n\nCompare: Realistic Diction Is Unrealistic. May be a result of a particularly Orphaned Punchline.\n• A static version of this is often used in print advertising, where a group of 18- to 28-year-old people are shown, usually sitting around a table, laughing their heads off in a somewhat unrealistic manner. Pretty much the classic example of this trope in action.\n• Any and all Olive Garden commercials. Makes you wonder if it's something in the food...\n• At the beginning of Men in Black, after K uses the neuraliser on J, the scene cuts to K laughing at a table in a diner with J (explaining the memory loss as being due to drinking). Since the idea was to fool J, it's also an in-universe invoked example.\n• The song \"Varfor är där ingen is till punschen?\" (Why is there no ice for the punsch?) by Swedish comedian and song writer Povel Ramel begins with a big laugh, followed by Ramel saying, \"Skål pa er, pojkar!\" (which means \"Cheers, boys!\") link on Punsch: The Other Wiki link on Punsch: http://en.wikipedia.org/wiki/Punsch\n• Invoked in a Bizarro panel, in which a table of non-hilarious people is sitting quietly around a table at a restaurant with a card that says \"Reserved\", observing a table of hilarious people some distance away, and one of them says, \"I wonder what the sign on their table says?\"\n• Chuck did this with quite a bit of regularity. Examples include Season 5 Episode 8: \"Chuck vs. the Baby\", where the cast sit around laughing at naught. Afterward, Sarah and the baby in question go sit on the sofa for a heart-to-heart.\n• The intro to Roseanne ends with the Conners sitting at the dinner table, laughing at nothing.\n• Ned's Declassified School Survival Guide- In the popularity episode, this is how the popular group acts. Of course, it's lampshaded.\n• In The Order of the Stick, after the group have been arrested by Miko, then spend some time in a cell, they're taken to their trial by Hinjo, who turns out to be a Reasonable Authority Figure, and it cuts to them laughing at this trope as he's leading them to the courtroom.\n• In A Trailer for Every Academy Award Winning Movie Ever, a parody of Oscar Bait movies, the beginning scene has Wealthy, Successful Protagonist at a dinner with everyone saying \"Laugh, laugh, laugh, laugh\"", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/TheHilariousTable", "media_links": ["/pmwiki/pmwiki.php/Literature/AChristmasCarol", "/pmwiki/pmwiki.php/Film/MenInBlack", "/pmwiki/pmwiki.php/Film/GoodNightAndGoodLuck", "/pmwiki/pmwiki.php/Series/Chuck", "/pmwiki/pmwiki.php/Series/Firefly", "/pmwiki/pmwiki.php/Series/Roseanne", "/pmwiki/pmwiki.php/Series/That70sShow", "/pmwiki/pmwiki.php/Series/NedsDeclassifiedSchoolSurvivalGuide", "/pmwiki/pmwiki.php/Webcomic/TheOrderOfTheStick"], "non_media_links": ["/pmwiki/pmwiki.php/Main/TropeNamer", "/pmwiki/pmwiki.php/Main/RealisticDictionIsUnrealistic", "/pmwiki/pmwiki.php/Main/OrphanedPunchline", "/pmwiki/pmwiki.php/Main/Advertising", "/pmwiki/pmwiki.php/Main/Film", "/pmwiki/pmwiki.php/Main/Music", "/pmwiki/pmwiki.php/Wiki/TheOtherWiki", "http://en.wikipedia.org/wiki/Punsch", "/pmwiki/pmwiki.php/Main/NewspaperComics", "/pmwiki/pmwiki.php/ComicStrip/Bizarro", "/pmwiki/pmwiki.php/Main/Television", "/pmwiki/pmwiki.php/Main/LampshadeHanging", "/pmwiki/pmwiki.php/Main/WebComics", "/pmwiki/pmwiki.php/Main/KnightTemplar", "/pmwiki/pmwiki.php/Main/ReasonableAuthorityFigure", "/pmwiki/pmwiki.php/Main/WebOriginal", "/pmwiki/pmwiki.php/WebVideo/ATrailerForEveryAcademyAwardWinningMovieEver", "/pmwiki/pmwiki.php/Main/OscarBait", "/pmwiki/pmwiki.php/Main/WhiteMaleLead", "/pmwiki/pmwiki.php/Main/UnsoundEffect"]}