{"title": "Level in Boss Clothing", "content": "A Boss Battle that doesn't play like a Boss Battle. There's a boss health bar, and the level finishes when it reaches 0, but the boss isn't the focus of the level, instead acting as a timer for the level, Hold the Line-style. The hazards of the level instead consist of mooks and terrain hazards.\n\nRelated to Battleship Raid, Colossus Climb, and Flunky Boss, but is distinct from each - a Battleship Raid or Colossus Climb keeps the focus on the boss, and the things you have to destroy and the parts of the level you have to traverse are generally part of or ejected from the boss, a Flunky Boss generally keeps to one room. There are also the Advancing Boss of Doom and \"Get Back Here!\" Boss tropes, where a boss may be chasing you or you may be chasing the boss, respectively, but in those cases, the boss is often a clear goal (most often in the case of the latter) that must either be avoided or found.\n• The level Aerial Combat from Bugdom is completed by destroying the beehive at its centre, identical to how Queen Bee and King Ant are completed. The beehive cannot actually attack you, however, and the threats in the level consist of flying bees and various terrain hazards on the ground.\n• The final boss of the Octo Expansion of Splatoon 2 is like this. You have to splat an entire statue in ink, before the time runs out. The statue doesn't attack you, and no enemies spawn, so your only threat is the incredibly tight time limit.\n• Dr. Zomboss from Plants vs. Zombies plays almost entirely like a conveyor-belt Plants vs Zombies level, only occasionally attacking and becoming vulnerable.\n• The fight with Ironhead in Cave Story takes up the entire level \"Main Artery\". However, Ironhead itself merely swims back and forth through the screen, occasionally shooting three puny shots at you. The level is mostly about fighting the swarms of Pufferfish that flood the screen, and dodging the blocks flying across the screen that deal Collision Damage.\n• The first boss of Archdragon Peak in Dark Souls 3 is a giant wyvern with a health bar that each of your attacks chips away a few pixels from at most, if you engage it directly. You're instead supposed to dash past it and fight through a gauntlet full of mooks, while avoiding its fire breath attacks, and then it with a plunging attack onto its head from above One-Hit Kill it with a plunging attack onto its head from above .\n• The Final Boss in Aero The Acrobat: A good half of the battle is spent chasing him upwards and upwards through the floors, tiers, and rafters of his laboratory.\n• Sonic the Hedgehog:\n• Sonic & Knuckles, Lava Reef Zone, Act 2. The fight with Robotnik begins with a forced-scrolling segment, then the meat of the fight involves dodging mines while leaping between moving platforms in lava. You don't directly damage Robotnik; you just survive until Robotnik destroys the machine with his own mines.\n• Sonic the Hedgehog CD has the Collision Chaos boss, a pinball machine\n• Sonic the Hedgehog has the Labyrinth Zone boss. While you can hit Robotnik the pre-requisite eight times, it's entirely unnecessary, and the level ends once you reach the top of a vertical shaft filled with obstacles that is slowly flooding with water.\n• In Sonic Rush Adventure, we have the Ghost Whale which you must enter, then work your way through an obstacle course.\n• The first part of the Dark Gaia fight in Sonic Unleashed is half and half this, with Sonic running down to hit Dark Gaia's weak spots.\n• The fights with Captain Jelly and Admiral Jelly in Sonic Colors, though you do still have to hit the boss in between the level-like segments (which can be done in one hit with a yellow Wisp in tow and some good aim).\n• In Sonic Generations, Perfect Chaos plays out this way. Mind you, this is fairly similar to how Perfect Chaos worked in the original Sonic Adventure; despite the fact that you don't have Super Sonic for the fight, the Generations boost mechanic works in almost the same way, so the only real differences are the addition of 2D sections and the method of scoring the final hit.\n• Any of the bosses of the Sonic Riders games, purely by virtue of the fact that it's a racing game. This works out, however, as it doesn't take any wild changes of the mechanics to get the fights to work in the context of the game.\n• Similar to the above, the boss races in Crash Team Racing are simply one-on-one races on a normal track, the only real gameplay addition being the opponent having unlimited items.\n• The boss levels in the first Spyro the Dragon are more-or-less normal levels that happen to have a weak \"Get Back Here!\" Boss in them that only takes a few hits to defeat. None of them are required to beat the game, they only exist for extra collectables. The only reason to defeat the bosses themselves is because they drop gems. This changed in later games, which made bosses a lot stronger and gave them each a Boss-Only Level.\n• The boss levels for the video game version of A Bug's Life are like this, as you have to collect 50 grain, find all the FLIK letters, and kill all the enemies with a gold berry in order to fully complete them, just like any other level. The fights against the Bird and Hopper are particularly good examples, as they take place in level-sized maze/canyon areas that involve a lot of climbing.\n• Speed Buster in No More Heroes plays like this. What makes her different from the other bosses is that she is at the end of the level, and that Travis has to make his way while avoiding her dreaded laser cannon. To win, Travis has to knock down a telephone pole to destroy her BFG , then make his way to Speed Buster herself to win. This break from the normal boss structure apparently causes her to not be included in the game's score attack mode, a Boss Rush mode that allows players to fight a ranking fight of their choosing.\n• Batman: Arkham Asylum:\n• All three encounters with The Scarecrow are this. After a few minutes of horror, you have to navigate a giant, fragmented landscape as a giant Scarecrow tries to spot you. At the end, shining a spotlight on him will dispel the illusion.\n• Killer Croc in the same game. His \"fight\" consists of sneaking around his lair trying to collect plant samples without alerting him to your presence, and knocking him back into the water if he finds you.\n• In Batman: Arkham City, some side character battles can play like this. Folks like The Riddler, Deadshot, or Zsasz can't stand go toe-to-toe with the Bat, but have advantages like hostages or powerful guns, so their battles consist of getting close enough to them to perform an instant takedown without alerting them to your approach.\n• The third Bowser battle in Super Mario 3D World as he transforms into Meowser, and then Double Meowser, running around you and attacking at multiple points. However, getting to the end is really all that's needed.\n• There are quite a few God of War examples, all full of Setpieces, such as the giant living statue at the start of the second game.\n• In Marvel Ultimate Alliance, Galactus is less of an enemy and more of an incentive to move really fast as you fight your way through the rest of the stage he's encountered in.\n• Halo:\n• The level \"The Flood\" from Halo Wars. There's a giant alien brain on the other side of the level that you're supposed to kill, but it has no direct combat ability (although it is surrounded by Flood turret equivalents) and most of the threat to your units is typical Flood units. There are five Flood bases you can kill to weaken it, which eventually respawn, and if all five go down so does the boss without you even touching it.\n• The Scarab Walker from Halo 2, which was more of a platform or level segment than an actual boss. They became legitimate bosses in Halo 3.\n• The Kraken from Halo 5: Guardians, a giant floating squid mecha that you have to board and destroy.\n• The Cydonia alien base on Mars in X-COM: UFO Defense has a big alien brain that needs to be destroyed in order to beat the game, but it doesn't do anything and thus the level is really more like a standard alien base assault mission.\n• Star Fox has its alternate Final Boss, .\n• Star Fox 64 has the Forever Train, which causes trouble for you all throughout the Macbeth stage. Near the end it will deploy its secret weapon, the Mechbeth, for a traditional boss battle, but you can avoid having to deal with Mechbeth by simply switching the track to send the train crashing into the weapons factory.\n• In Syphon Filter's third level, you chase Mara Aramov through a a DC Metro subway tunnel while dodging trains. You can either snipe her while she's running, or you can chase her to the end and take her down there.\n• Boss stages in Jumper games are generally normal levels with additional danger in form an enemy who is usually defeated as result of progressing through the stage. The Boss in Jumper Two, however, gives a genuine boss fight in which he is defeated by reflecting energy orbs back at him.\n• The first, third and final bosses in Super Meat Boy play out like normal levels with a few extra hazards.\n• Unlike in the main Deus Ex: Human Revolution, the only boss in The Missing Link, , has no Contractual Boss Immunity or any abilities that make him fundamentally different than a normal enemy. Your confrontation with him is really about getting through the gauntlet of soldiers to the room he's holed up in.\n• Balrog's stage in Street Fighter X Mega Man has Balrog at the far left side of the screen, occasionally jumping forward to attack. Mega Man can't damage him; he just needs to make his way past all the obstacles until Balrog steps on a shaky bridge and falls.\n• The Xel'naga Temple in the Starcraft II mission \"The Dig\" is presented in this way, with its own nifty health bar frame. Your objective is solely to dig your way through the temple's door with a giant mining laser. Because it's a temple, it can't move or fight you in any way, and the difficulty of the stage lies in its fanatical guardians. Note that in this case, you are encouraged to use the mining laser to help defend your base as well as unlock secondary objectives, which does make tunneling through the door take longer; therefore the mission is slightly shorter if you're confident enough in your base defenses not to need it.\n• The fight against Death in House of the Dead 3 takes place across two full stages, with the boss itself only making sporadic appearances to attack and let you whittle down its health before you return to blasting other zomb- err, mutants.\n• Eschatos's third stage (Areas 12 through 15) is spent fighting against a space station, and you deplete its health over the course of the stage, occasionally pulling away to fight waves of Mooks. The boss music doesn't play until the final area, when the station's been severely damaged leaving only the core and is down to the last of its three health bars.\n• In The Legend of Zelda: Breath of the Wild, the \"battle\" against Divine Beast Vah Rudaniah is actually more of a Stealth-Based Escort Mission. Link must guide Yunobo to the various cannons dotted around Death Mountain, using them to launch Yunobo at Rudania. All while avoiding (or destroying) the search drones that it deployed.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/LevelInBossClothing", "media_links": ["/pmwiki/pmwiki.php/VideoGame/Bugdom", "/pmwiki/pmwiki.php/VideoGame/Splatoon2", "/pmwiki/pmwiki.php/VideoGame/PlantsVsZombies", "/pmwiki/pmwiki.php/VideoGame/CaveStory", "/pmwiki/pmwiki.php/VideoGame/DarkSouls3", "/pmwiki/pmwiki.php/VideoGame/AeroTheAcrobat", "/pmwiki/pmwiki.php/VideoGame/SonicTheHedgehog", "/pmwiki/pmwiki.php/VideoGame/Sonic3AndKnuckles", "/pmwiki/pmwiki.php/VideoGame/SonicTheHedgehogCD", "/pmwiki/pmwiki.php/VideoGame/SonicTheHedgehog1", "/pmwiki/pmwiki.php/VideoGame/SonicRushSeries", "/pmwiki/pmwiki.php/VideoGame/SonicUnleashed", "/pmwiki/pmwiki.php/VideoGame/SonicColors", "/pmwiki/pmwiki.php/VideoGame/SonicGenerations", "/pmwiki/pmwiki.php/VideoGame/SonicAdventure", "/pmwiki/pmwiki.php/VideoGame/SonicRiders", "/pmwiki/pmwiki.php/VideoGame/CrashTeamRacing", "/pmwiki/pmwiki.php/VideoGame/SpyroTheDragon", "/pmwiki/pmwiki.php/WesternAnimation/ABugsLife", "/pmwiki/pmwiki.php/VideoGame/NoMoreHeroes", "/pmwiki/pmwiki.php/VideoGame/BatmanArkhamAsylum", "/pmwiki/pmwiki.php/ComicBook/TheScarecrow", "/pmwiki/pmwiki.php/VideoGame/BatmanArkhamCity", "/pmwiki/pmwiki.php/ComicBook/TheRiddler", "/pmwiki/pmwiki.php/ComicBook/Deadshot", "/pmwiki/pmwiki.php/VideoGame/SuperMario3DWorld", "/pmwiki/pmwiki.php/VideoGame/GodOfWar", "/pmwiki/pmwiki.php/VideoGame/GodOfWarII", "/pmwiki/pmwiki.php/VideoGame/MarvelUltimateAlliance", "/pmwiki/pmwiki.php/Franchise/Halo", "/pmwiki/pmwiki.php/VideoGame/HaloWars", "/pmwiki/pmwiki.php/VideoGame/Halo2", "/pmwiki/pmwiki.php/VideoGame/Halo3", "/pmwiki/pmwiki.php/VideoGame/Halo5Guardians", "/pmwiki/pmwiki.php/VideoGame/XCOMUFODefense", "/pmwiki/pmwiki.php/VideoGame/StarFox1", "/pmwiki/pmwiki.php/VideoGame/StarFox64", "/pmwiki/pmwiki.php/VideoGame/SyphonFilter", "/pmwiki/pmwiki.php/VideoGame/Jumper", "/pmwiki/pmwiki.php/VideoGame/MeatBoy", "/pmwiki/pmwiki.php/VideoGame/DeusExHumanRevolution", "/pmwiki/pmwiki.php/VideoGame/StreetFighterXMegaMan", "/pmwiki/pmwiki.php/VideoGame/HouseOfTheDead", "/pmwiki/pmwiki.php/VideoGame/Eschatos", "/pmwiki/pmwiki.php/VideoGame/TheLegendOfZeldaBreathOfTheWild"], "non_media_links": ["/pmwiki/pmwiki.php/Main/BossBattle", "/pmwiki/pmwiki.php/Main/BossBattle", "/pmwiki/pmwiki.php/Main/HoldTheLine", "/pmwiki/pmwiki.php/Main/BattleshipRaid", "/pmwiki/pmwiki.php/Main/ColossusClimb", "/pmwiki/pmwiki.php/Main/FlunkyBoss", "/pmwiki/pmwiki.php/Main/BattleshipRaid", "/pmwiki/pmwiki.php/Main/ColossusClimb", "/pmwiki/pmwiki.php/Main/FlunkyBoss", "/pmwiki/pmwiki.php/Main/AdvancingBossOfDoom", "/pmwiki/pmwiki.php/Main/GetBackHereBoss", "/pmwiki/pmwiki.php/Main/BossInMookClothing", "/pmwiki/pmwiki.php/Main/CollisionDamage", "/pmwiki/pmwiki.php/Main/BonusDungeon", "/pmwiki/pmwiki.php/Main/DamageSpongeBoss", "/pmwiki/pmwiki.php/Main/OneHitKill", "/pmwiki/pmwiki.php/Main/FinalBoss", "/pmwiki/pmwiki.php/Main/PinballZone", "/pmwiki/pmwiki.php/Main/HumongousMecha", "/pmwiki/pmwiki.php/Main/TookALevelInBadass", "/pmwiki/pmwiki.php/Main/TropesAreNotBad", "/pmwiki/pmwiki.php/Main/GetBackHereBoss", "/pmwiki/pmwiki.php/Main/BossOnlyLevel", "/pmwiki/pmwiki.php/Main/BFG", "/pmwiki/pmwiki.php/Main/BossRush", "/pmwiki/pmwiki.php/Main/VideoGameSetpiece", "/pmwiki/pmwiki.php/Main/FinalBoss", "/pmwiki/pmwiki.php/Main/FanNickname", "/pmwiki/pmwiki.php/Main/SinisterSubway", "/pmwiki/pmwiki.php/Main/CorridorCubbyholeRun", "/pmwiki/pmwiki.php/Main/TennisBoss", "/pmwiki/pmwiki.php/Main/ContractualBossImmunity", "/pmwiki/pmwiki.php/Videogame/StarcraftII", "/pmwiki/pmwiki.php/Main/ExactlyWhatItSaysOnTheTin", "/pmwiki/pmwiki.php/Main/DeathRay", "/pmwiki/pmwiki.php/Main/NotUsingTheZWord", "/pmwiki/pmwiki.php/Main/Mook", "/pmwiki/pmwiki.php/Main/StealthBasedMission", "/pmwiki/pmwiki.php/Main/EscortMission"]}