{"title": "Refusal of the Second Call", "content": "An unassuming protagonist from Humble Beginnings rises up to become The Chosen One, defeats the Eldritch Abomination or the fantasy fascist regime, and prevents The End of the World as We Know It. As the series ends, they settle into a comfortable and well-deserved retirement as the world's greatest hero.\n\nSo that's it, right?\n\nWrong. Because things never seem to stay fixed for very long. Especially not in Cash Cow Franchises.\n\nIt's been ten years, or twenty, or fifty, and now another, unanticipated evil threatens the world. A new hero stumbles into the conflict and rises up against this new threat, and they flounder because saving the world isn't easy. They could obviously benefit from the wisdom of someone Older and Wiser who has been through this before. Surely the now-legendary original hero will resurface to fight alongside their accidental successor. They fixed it last time. It only took them five books or three movies. They can do it again. Even if they want to sit out the fighting, they'll at least be involved as a Badass Teacher.\n\nBut sometimes, they just don't want to. Maybe they feel like they've already done enough for the world. Maybe they feel they're too old to repeat their earlier feats. Maybe all they want to do is hang out on their island or in their secluded swamp and pretend none of it is happening. Sometimes, the former hero is determined to stay out of it.\n\nThis trope occurs when a Sequel installment takes place while the central hero of the previous installment is still alive but features a new hero, and the former hero is absent from the main action. The former hero may appear in the sequel but be unwilling to help or they may have been Put on a Bus, but they must be available. Their absence cannot be because they're physically incapacitated, imprisoned somewhere else, or have become evil. Their lack of involvement must be by their own choice.\n\nAdditionally, this trope requires the original hero to have already completed their Hero's Journey and the narrative that prominently featured them to have ended. If a character takes off halfway through defeating the evil and someone else has to take over, or if another mundane person was originally offered the mantle and turned it down before our hero accepted, it's not the trope.\n\nBecause this trope requires a hero different from the current one to have previously saved the day, media that falls into this category will always be a sequel, except for the rare case where a Prequel retroactively causes this. It is most common in High Fantasy or similar-scale stories and in situations where a completed series gets a Sequel Series that the creator may not have anticipated when the original series was released.\n\nCan be caused by Changing of the Guard when there's no real reason the original hero couldn't have continued to feature instead. Can result in They Changed It, Now It Sucks!, and will often cause a Broken Base between those who like the new hero and those who don't like the new hero or think the original hero ducking out of the limelight was Out of Character, or some going as far as pretending the sequel series doesn't exist. It's a great way to make the previous franchise's hero Unintentionally Unsympathetic, as some of the problems the new heroes have to face are probably to old hero's fault to start with. And just as often, old hero succumbs to Mentor Occupational Hazard, willing new hero nothing more than a mop and bucket to clean up the mess they partially caused.\n\nCompare Passing the Torch, where the original hero intentionally chooses and trains a successor to fight an evil they both know will come, Rogue Protagonist, where the previous hero has outright made a Face\u0096Heel Turn, Screw This, I'm Outta Here!, where a character on The Dark Side decides it's no longer worth it, and We Are Not Going Through That Again, when the hero has finished their adventure, only for something else to immediately go wrong. Contrast with Refusing The Call, where a hero's origin story begins with them refusing to be a hero, only to get pulled into it anyway, and Can't Stay Normal, where the hero does return to save the day a second time.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/RefusalOfTheSecondCall", "media_links": ["/pmwiki/pmwiki.php/WesternAnimation/TheLegendOfKorra", "/pmwiki/pmwiki.php/Franchise/StarWars", "/pmwiki/pmwiki.php/Film/TheForceAwakens", "/pmwiki/pmwiki.php/Film/TheLastJedi", "/pmwiki/pmwiki.php/Franchise/Tremors", "/pmwiki/pmwiki.php/Film/TronLegacy", "/pmwiki/pmwiki.php/WesternAnimation/TronUprising", "/pmwiki/pmwiki.php/Literature/TheThirtyNineSteps", "/pmwiki/pmwiki.php/Literature/TheCourtsOfTheMorning", "/pmwiki/pmwiki.php/Literature/TalesOfTheMagicLand", "/pmwiki/pmwiki.php/Literature/TheWonderfulWizardOfOz", "/pmwiki/pmwiki.php/Franchise/DragonAge", "/pmwiki/pmwiki.php/VideoGame/DragonAgeOrigins", "/pmwiki/pmwiki.php/VideoGame/DragonAgeInquisition", "/pmwiki/pmwiki.php/VideoGame/DragonAgeII", "/pmwiki/pmwiki.php/VideoGame/DragonAgeII", "/pmwiki/pmwiki.php/VideoGame/TheLongestJourney", "/pmwiki/pmwiki.php/VideoGame/DreamfallTheLongestJourney", "/pmwiki/pmwiki.php/Webcomic/Spacetrawler", "/pmwiki/pmwiki.php/WesternAnimation/TheLegendOfKorra"], "non_media_links": ["/pmwiki/pmwiki.php/Main/HumbleBeginnings", "/pmwiki/pmwiki.php/Main/TheChosenOne", "/pmwiki/pmwiki.php/Main/EldritchAbomination", "/pmwiki/pmwiki.php/Main/ANaziByAnyOtherName", "/pmwiki/pmwiki.php/Main/TheEndOfTheWorldAsWeKnowIt", "/pmwiki/pmwiki.php/Main/HappilyEverAfter", "/pmwiki/pmwiki.php/Main/HappyEndingOverride", "/pmwiki/pmwiki.php/Main/CashCowFranchise", "/pmwiki/pmwiki.php/Main/ChangingOfTheGuard", "/pmwiki/pmwiki.php/Main/OlderAndWiser", "/pmwiki/pmwiki.php/Main/LegendaryInTheSequel", "/pmwiki/pmwiki.php/Main/BadassTeacher", "/pmwiki/pmwiki.php/Main/TheHermit", "/pmwiki/pmwiki.php/Main/HermitGuru", "/pmwiki/pmwiki.php/Main/Sequel", "/pmwiki/pmwiki.php/Main/PutOnABus", "/pmwiki/pmwiki.php/Main/ConvenientComa", "/pmwiki/pmwiki.php/Main/PrisonEpisode", "/pmwiki/pmwiki.php/Main/SuddenSequelHeelSyndrome", "/pmwiki/pmwiki.php/Main/TheHerosJourney", "/pmwiki/pmwiki.php/Main/Prequel", "/pmwiki/pmwiki.php/Main/HighFantasy", "/pmwiki/pmwiki.php/Main/EpicMovie", "/pmwiki/pmwiki.php/Main/SequelSeries", "/pmwiki/pmwiki.php/Main/FranchiseZombie", "/pmwiki/pmwiki.php/Main/ChangingOfTheGuard", "/pmwiki/pmwiki.php/Main/TheyChangedItNowItSucks", "/pmwiki/pmwiki.php/Main/BrokenBase", "/pmwiki/pmwiki.php/Main/OutOfCharacter", "/pmwiki/pmwiki.php/Main/FanonDiscontinuity", "/pmwiki/pmwiki.php/Main/UnintentionallyUnsympathetic", "/pmwiki/pmwiki.php/Main/MentorOccupationalHazard", "/pmwiki/pmwiki.php/Main/PassingTheTorch", "/pmwiki/pmwiki.php/Main/RogueProtagonist", "/pmwiki/pmwiki.php/Main/FaceHeelTurn", "/pmwiki/pmwiki.php/Main/ScrewThisImOuttaHere", "/pmwiki/pmwiki.php/Main/TheDarkSide", "/pmwiki/pmwiki.php/Main/WeAreNotGoingThroughThatAgain", "/pmwiki/pmwiki.php/Main/RefusingTheCall", "/pmwiki/pmwiki.php/Main/CantStayNormal", "/pmwiki/pmwiki.php/Main/TheHermit", "/pmwiki/pmwiki.php/Main/Subverted", "/pmwiki/pmwiki.php/Main/ReasonYouSuckSpeech", "/pmwiki/pmwiki.php/Main/YouKeepTellingYourselfThat", "/pmwiki/pmwiki.php/Main/WhatTheHellHero", "/pmwiki/pmwiki.php/Main/LegendaryInTheSequel", "/pmwiki/pmwiki.php/Main/AncientEvil", "/pmwiki/pmwiki.php/Main/PutOnABus", "/pmwiki/pmwiki.php/Main/WhatCouldHaveBeen", "/pmwiki/pmwiki.php/Main/SuddenlyVoiced", "/pmwiki/pmwiki.php/Main/InUniverse", "/pmwiki/pmwiki.php/Main/TheChewToy", "/pmwiki/pmwiki.php/Main/TheTeam", "/pmwiki/pmwiki.php/Main/HermitGuru", "/pmwiki/pmwiki.php/Main/BombThrowingAnarchist", "/pmwiki/pmwiki.php/Main/ItsPersonal"]}