{"title": "Anonymous Band", "content": "A rock band that doesn't advertise the identities of its musicians. How far this goes can vary: Some bands will just use pseudonyms in the album liner notes, but make no effort to disguise themselves in music videos or live shows. Other bands will be complete Reclusive Artists who hide their faces at every live show and only answer to obvious stage names. For the purposes of this trope, either extreme (or anything in between) counts.\n\nReasons for doing this may vary. Some artists do it to keep their musical career and private life completely separate. Others may do it because they want listeners to focus on the music itself, not the person performing it (especially when an already-established musician wants a new album to be judged on its own merits and not in comparison to to prior albums). In the latter case, the strategy almost always backfires: thanks to the Streisand Effect, fans will become obsessed with uncovering the musicians' real identity, and may completely ignore the music itself.\n\nNot to be confused with a Fake Band. In a Fake Band, an anonymous (and often-rotating) group of studio musicians provide the music, while a set of actors or cartoon characters provides the public face. In an Anonymous Band, the band's public face are the people making the music—they just won't tell you their names.\n\nCompare The Invisible Band, which takes this trope to the next level. See also Secret Identity.\n• The Traveling Wilburys would be a \"not fooling anyone\" example. The liner notes list all the musicians as members of the extended Wilbury family, but due to the album photos and music videos , they're better known as \"that Supergroup with George Harrison, Tom Petty, Bob Dylan, Roy Orbison, and Jeff Lynne\".\n• The Swirling Eddies: Had ridiculous pseudonyms like Camarillo Eddy, Gene Pool, and Burger Roy Al. When their first album Let's Spin! was released, they ran a contest encouraging the public to guess their real identities. It's unknown if anyone guessed correctly. The band came clean on their album Zoom Daddy. Actual identities: The members of Daniel Amos , plus friends like Gene Eugene and Mike Roe.\n• Neon Horse: Supposedly a group of anonymous musicians fronted by Norman Horse (who at one point was stated to be Moe, the fictional founder of the Moe's Southwest Grill restaurant chain). Norman was also the only musician to show up in their music videos—he wore wigs and heavy makeup. Actual identities: Norman is Mark Salomon of The Crucified and Stavesacre; the other members are Jason Martin of Starflyer 59 and Stephen Dail of Project 86.\n• Almonzo: Contributed odd tracks to compilations from Southern-California-based indie labels, and went by names from Little House on the Prairie. Actual identities: No one knows, but rumor has it that the band is really Brandon Ebel (founder and head of Tooth & Nail Records) backed by members of Blenderhead.\n• Project 86: A partial example. The album Picket Fence Cartel doesn't give any information about band members, but all their prior albums did. It was known at the time that drummer Alex Albert had left beforehand—and it was later revealed that frontman Andrew Schwab was the only member who hadn't left. Other than him, it is still unknown who actually played any of the instruments on Picket Fence Cartel. (The band has since reincarnated with Schwab and three new members.)\n• Jandek: The label, Corwood Industries, presents the music as if it were the creation of an anonymous collective. The guy who shows up to play live shows, sometimes with non-anonymous locally-recruited backing musicians, is referred to as \"a representative of Corwood Industries\". Actual identity: All evidence points to it being Sterling Smith, who is also the sole employee of Corwood.\n• The Dukes of Stratosphear, a psychedelic band comprising The Red Curtain, Lord Cornelius Plum, Sir John Johns and E.I.E.I. Owen. Actual identity: .\n• TISM (or This Is Serious Mum): An Australian band whose members all conceal their faces and perform under obvious pseudonyms.\n• Slipknot. On-stage, the members wear masks and use numerals as aliases. But their identities are well-known to the public, and their side projects usually don't have the same schtick.\n• Lordi, a Finnish hard rock band who always wear masks when they appear in public and are only known by aliases.\n• GWAR were never seen out of character much of their early career (though, even the pre-internet days a dedicated fan could find out their real names, or you know, just read the credits on their home videos). They eventually dropped it and now give interviews and appearances either way (depending on what the interviewer wants ie, a \"serious\" interview about the band and their history, or Oderus ranting and being wacky).\n• The Swedish band Ghost is completely anonymous. The lead singer, Papa Emeritus, wears heavy makeup and prosthetics covering his face, whereas the other members of the bands are known only as the \"Nameless Ghouls\" and wear robes and masks covering their bodies and faces. Multiple former members' names were revealed in a lawsuit which also revealed Papa Emeritus' name; Tobias Forge\n• The Protomen's members go by code names in all appearances and interviews, including in their liner notes, and most of them wear silver facepaint during concerts.\n• The Residents, who appear for live performances, music videos, and promo photos in masks or other face-concealing costumes (usually four eyeballs in top hats, or more recently three eyeballs in top hats and a skull). They also don't even use specific aliases, although once the vocalist adopted the skull mask he became known as Mr. Skull. As far as autographs go, if all four members sign something, it'll read \"Residents\", \"A Resident\", \"Mr. Resident\" and \"Mr. Skull\".\n• Country Music group Chuck Wagon and the Wheels was formed as a band with a wrestling theme; its members were purported wrestler/singers named Chuck Wagon, Carl \"Cal\" Pyle and Sid Sequin. In Real Life, they were respectively brothers Gordon, Shelby and Wayne Kennedy. Gordon is a country and pop songwriter (Eric Clapton's \"Change the World\") and a former member of the Christian band White Heart, Bryan wrote several songs for Garth Brooks, and Shelby co-wrote Reba McEntire's \"I'm a Survivor\".\n• Trailer Choir referred to its members as Butter, Big Vinny and Crystal. Real names? Mark Fortney, Vinny Hickerson, Crystal Hoyt.\n• Major Organ and the Adding Machine is a super group containing members of the Elephant 6 Collective, led by a possibly fictional character named Major Organ. Among the suspected performers are members or former members of Neutral Milk Hotel, The Olivia Tremor Control, The Apples in Stereo, Elf Power, and Of Montreal. Only one album, a Self-Titled Album, was released.\n• Mr. Bungle used aliases on their first album and their earliest concerts were performed in masks. Eventually they dropped the anonymity (possibly because everybody could tell the singer was Mike Patton anyway).\n• Viral music/visual project iamamiwhoami, although the main participant is Swedish singer-songwriter Jonna Lee. Claes Björklund is probably also involved, and the most likely suspect for \"Captain Underpants\".\n• Man Or Astroman are a borderline example — their real names were never a secret, but they never went by those names on stage or on a record. The three regular members went by the identities of Birdstuff, Starcrunch, and Coco the Electronic Monkey Wizard; other guitarists they played with over the years included Dr. Deleto, Victor Vector, and Cap'n Zeno.\n• Experimental music collective Caroliner are one of these... among other things.\n• Prince's jazz-tinged side project Madhouse would have all songs credited to Madhouse itself. During live performances, Prince and members of his own band would wear large baggy clothing and sunglasses to remain anonymous.\n• The Boomtown Rats experimented with this in their very early days, each member picking a different and increasingly ludicrous stage name for every club gig. They'd abandoned this practice by the time they hit the bigtime, but bassist Patrick \"Pete Briquette\" Cusack and keyboardist John \"Johnny Fingers\" Moylett kept their Stage Names throughout the band's existence.\n• Japanese band Greeeen. They use aliases (like many Japanese band members do) and don't show their faces in public, as all four members are licensed dentists (having formed the band while they were in dental college together) and don't want their fame to interfere with their practices.\n• The faux-Arabian band Gröûp X, best known for their \"Mario Twins\" video.\n• The Vulgar Boatmen were/was a single guy who created/recorded all the music, and hired two separate touring bands to be \"The Vulgar Boatmen\" on the road (while he stayed home). Not a Fake Band because the creator wasn't trying to fool anybody; he was just being postmodern about the whole \"band identity\" thing.\n• There is a Portugese Black Metal band whose members are not only anonymous (which is rather common in Black Metal), but do not even provide pseudonyms; neither have they named the band or its works. They are usually referred to as \"Unknown Artist\".\n• \"Carmen Castro \". She's appeared on tracks by several house musicians, but absolutely nothing is known about her. Weirdly, every single \"Carmen Castro\" track sounds like it's being sung by a different person. Her (their?) collaborator Mr. Oizo confirmed it's a pseudonym, but won't say anything else except \"she's blonde\".\n• The L.A.-based collective Fol Chen wear masks or raccoon-mask makeup in their public appearances, and most of them have pseudonyms to at least make it harder to track their real identities.\n• The Network, who are (pretty obviously) made up of Green Day and Devo. They always wear masks.\n• All the members of Man With A Mission are always wearing wolf masks, and claim that they are artificial life forms created by \"Jimee Hendrixx\" and are part man, part wolf.\n• ClariS don't perform live, go by the aliases \"Clara\" and \"Alice\", and are represented through anime-type characters styled after them. They do this because both girls are in high school, and don't want to get swept into the chaotic celebrity life.\n• Black Moth Super Rainbow are on the milder end of this. Not a lot of autobiographical information is known about the band. Though they don't hide their faces in promotional photos or live performances, they're always The Invisible Band in their music videos. Though some (but not all) of their real names are public knowledge, they're consistently credited under obvious stage names. They've done print interviews, but their only video interview is one where they had someone pretend to be a band member The person being interviewed is an unnamed mascot/\"hype man\" the band was using for a 2009 tour (or at least someone dressed in the same costume) - while Tobacco was doing the real singing in front of a laptop while controlling digital effects on his voice, the masked man would stand up front and mime, engaging the audience in a way the actual singer wasn't in a position to .\n• Burial, the reclusive dubstep producer, kept his identity secret for some years because he wanted people to focus on the music and not him. After people began to obsess over his real identity (at various points it was rumored that he was another alias of Richard D. James or Kieren Hebden), he revealed his real identity. His name is William Bevan.\n• The Tuss, an acid techno band from the UK who released one EP and one album, both in 2007. The liner notes listed Brian and Karen Tregaskin as the band members and composers. However, some compelling evidence suggests that The Tuss is a side project of Richard James from Aphex Twin—but the record label denies James' involvement. Considering all the Tuss tracks are published under James' name in the BMI Repertoire, it's almost certain that he's involved. Whether the Tregaskins exist at all, or are an alias for some other collaborators, remains unknown.\n• Sapphire Bullets, a They Might Be Giants tribute act which has been a supporting band at actual They Might Be Giants concerts. Actual identity: They Might Be Giants. Of course.\n• Almost every second wave Black Metal act was this to a certain extent in the church-burning, Euronymous-murdering days. Darkthrone, for example, used pseudonyms in their album liner notes, and refused entirely to play live. They've now mostly done away with the pseudonyms, but still don't play live.\n• For the longest time, the Doobie Brothers were an Anonymous Band, based on the fact that they were essentially a group of session musicians who got together to occasionally release an album or go on tour. At first they had a regularly rotating circle of about twenty musicians who each took turns, but eventually settled down into a solid lineup. Even to this day, the only Doobie Brother who anyone's ever heard of is Michael McDonald. Hell, the only reason anybody knew that they had a rotating lineup is because all the surviving members showed up to jam together when they were inducted into the Rock and Roll Hall of Fame.\n• Black Metal band Deathspell Omega have never publicised the identities of their members. Their first vocalist is known to be a man who goes by the pseudonym of Shaxul, while the second is commonly believed to be Mikko Aspa (also of Clandestine Blaze, Fleshpress, Stabat Mater and a number of other bands). Beyond that, nothing is known for certain, only rumours. Metal Archives lists the bassist as Khaos, formerly a live member of Barbatos, and the guitarist as \"Hasjarl\", formerly of Hirilorn, but it's not clear what the source on that is. The drummer's identity is even more unclear; the most common rumour is that he's the guitarist's brother. (Some people have speculated that the band employs a drum machine, but professional drummers such as John Longstreth of Origin and Gorguts have dismissed this as impossible, saying that there are no drum machines with samples this convincing.) Another common fan theory is that the band consists of a rotating lineup of musicians, but no one knows any of this for certain.\n• ? and the Mysterians (the One-Hit Wonder behind \"96 Tears\"), as referenced in their name.\n• Swedish cult duo Philemon Arthur and the Dung have remained completely anonymous since their 1971 debut, with their identities allegedly only known to one or two people at their record label.\n• Mac Sabbath, a band who perform Black Sabbath song parodies with lyrics satirizing the fast food industry, and whose stage image is based on McDonald's \"Mcdonaldland\" characters. They always perform in costume, use pseudonyms parodying said Mcdonaldland characters, and don't do interviews - manager Mike Odd speaks on their behalf. Rumor has it that Mike Odd, who fronts the similarly theatrical rock band Rosemary's Billygoat, is more directly involved than that, though there exists a promo photo of him and Mac Sabbath frontman Ronald Osbourne in the same place at the same time.\n• Marshmello is an EDM DJ who's entire shtick is that no one knows who he is, because he wears a marshmallow mask at all times and has never revealed or even hinted at his identity.\n• Tupper Ware Remix Party consists of four masked performers, who go by the names Dr. Sung, Lord Phobos, Commander Meouch, and Havve Hogan. The performers have managed to keep their identities secret for over nine years of being a band, and for now would like to keep it that way.\n• Neckbeard Deathcamp are a satirical black metal band whose lyrics and image focus on mocking the alt-right. As evidenced by stage names like Kriegmeister Hatestorm and Kaiser Wehrwulf VonTolerance, their anonymity adds to the black metal spoof... But they've also said that if their targets learned their real names they'd likely get \"doxxed\" (i.e. have their addresses, phone numbers and other personal information shared online for harassment purposes). All that is known about them is that two members are from Chicago.\n• PC Music is an online music label/art collective that zig-zags this a lot. While the names and histories of some members are public, there are just as many acts who have minuscule or straight-up nonexistent online presence aside from their music and alias, and even the more relatively public ones tend to be somewhat reclusive or surreal. Some anonymous identities have been eventually outed as alternate pseudonyms of one or more PC Music acts, contributing to the label's strange and \"hyperreal\" atmosphere.\n• In the early days of the band I Don't Know How But They Found Me, neither vocalist/bassist Dallon Weekes nor drummer Ryan Seaman advertised or even acknowledged their latest project. They wrote songs in private, and booked shows under their new band name, where they would play to an audience that had no idea who they were. There was no information about them online until people who had gone to the shows started posting about them. For a while, both members would flat-out deny any knowledge of the band when asked. The band is not anonymous anymore, however, as both members are now fully open about their involvement. They've said that their early anonymity was because they didn't want to exploit the fans of the bands they were previously involved with (Panic! at the Disco for Dallon, Falling in Reverse for Ryan) because it would feel disingenuous, and they wanted to be known and judged solely by their music.\n• When the bluegrass band Hot Rize go on tour, their opening act is usually a western swing band called Red Knuckles and the Trailblazers, which is actually the members of Hot Rize themselves playfully denying that they are the same people. .\n• H.E.R. was initially an anonymous solo performer - promotional photos and the first album cover consisted of just her silhouette, there were no live performances, interviews were only held over the phone, and her real name was never mentioned in conjunction with the project. Fans pretty quickly figured out she was Gabi Wilson, in part because her first EP featured a Cover Version of Drake's \"Jungle\" that she previously uploaded to soundcloud under her own name.\n• Three of the five members of Portal have never had their real names identified to the public, though it is known that Omenous Fugue is Brad Loong of Impetuous Ritual, and Ignis Fatuus is Kevin Kevinson of Impetuous Ritual and Grave Upheaval.\n• The Japanese band Kamisama, I have Noticed performs in masks and costumes for all of their performances, and the members go by nicknames officially. While many fans think the vocalist is the utaite and musician Mafumafu, the other members of the band are a mystery.\n• Ubiquitous in Visual Kei. Real names, even for the best-known bands, are rarely ever public knowledge, and the makeup and personas tend to be elaborate enough as to make the person unrecognizable. Occasionally, first names are used as stage names (or minimally modified) or slip during interviews or band banter, but anything beyond that is speculation\u0097even for someone as genre-famous as Kyo. Pretty much the only famous VK musicians to have their names revealed are founding fathers of the genres like Buck Tick or X Japan, as well as Gackt (who achieved some level of mainstream respectability with his solo career).\n• Even more glaring when someone (such as the aforementioned Kyo) has distinctive features beyond makeup (e.g. very tall or very short, difficult-to-conceal tattoos, visible piercings, or even just extremely long hair) that should make them recognizable even out of makeup. Especially when they make absolutely no effort to conceal their first names", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/AnonymousBand", "media_links": ["/pmwiki/pmwiki.php/Music/GeorgeHarrison", "/pmwiki/pmwiki.php/Music/TheBeatles", "/pmwiki/pmwiki.php/Music/TomPetty", "/pmwiki/pmwiki.php/Music/BobDylan", "/pmwiki/pmwiki.php/Music/RoyOrbison", "/pmwiki/pmwiki.php/Music/ElectricLightOrchestra", "/pmwiki/pmwiki.php/Music/DanielAmos", "/pmwiki/pmwiki.php/Music/Starflyer59", "/pmwiki/pmwiki.php/Literature/LittleHouseOnThePrairie", "/pmwiki/pmwiki.php/Music/Jandek", "/pmwiki/pmwiki.php/Music/XTC", "/pmwiki/pmwiki.php/Music/TISM", "/pmwiki/pmwiki.php/Music/Slipknot", "/pmwiki/pmwiki.php/Music/Lordi", "/pmwiki/pmwiki.php/Music/GWAR", "/pmwiki/pmwiki.php/Music/Ghost", "/pmwiki/pmwiki.php/Music/TheProtomen", "/pmwiki/pmwiki.php/Music/TheResidents", "/pmwiki/pmwiki.php/Music/EricClapton", "/pmwiki/pmwiki.php/Music/GarthBrooks", "/pmwiki/pmwiki.php/Music/RebaMcEntire", "/pmwiki/pmwiki.php/Music/NeutralMilkHotel", "/pmwiki/pmwiki.php/Music/OfMontreal", "/pmwiki/pmwiki.php/Music/MrBungle", "/pmwiki/pmwiki.php/Music/MikePatton", "/pmwiki/pmwiki.php/Music/Iamamiwhoami", "/pmwiki/pmwiki.php/Music/ManOrAstroman", "/pmwiki/pmwiki.php/Music/Prince", "/pmwiki/pmwiki.php/Music/TheBoomtownRats", "/pmwiki/pmwiki.php/Music/GreenDay", "/pmwiki/pmwiki.php/Music/Devo", "/pmwiki/pmwiki.php/Music/ManWithAMission", "/pmwiki/pmwiki.php/Music/ClariS", "/pmwiki/pmwiki.php/Music/Burial", "/pmwiki/pmwiki.php/Music/AphexTwin", "/pmwiki/pmwiki.php/Music/FourTet", "/pmwiki/pmwiki.php/Music/AphexTwin", "/pmwiki/pmwiki.php/Music/TheyMightBeGiants", "/pmwiki/pmwiki.php/Music/Mayhem", "/pmwiki/pmwiki.php/Music/Darkthrone", "/pmwiki/pmwiki.php/Music/DeathspellOmega", "/pmwiki/pmwiki.php/Music/Origin", "/pmwiki/pmwiki.php/Music/Gorguts", "/pmwiki/pmwiki.php/Music/PhilemonArthurAndTheDung", "/pmwiki/pmwiki.php/Music/BlackSabbath", "/pmwiki/pmwiki.php/Music/TupperWareRemixParty", "/pmwiki/pmwiki.php/Music/PCMusic", "/pmwiki/pmwiki.php/Music/IDontKnowHowButTheyFoundMe", "/pmwiki/pmwiki.php/Music/PanicAtTheDisco", "/pmwiki/pmwiki.php/Music/FallingInReverse", "/pmwiki/pmwiki.php/Music/HotRize", "/pmwiki/pmwiki.php/Music/Drake", "/pmwiki/pmwiki.php/Music/Portal", "/pmwiki/pmwiki.php/Music/Kyo", "/pmwiki/pmwiki.php/Music/BuckTick", "/pmwiki/pmwiki.php/Music/XJapan", "/pmwiki/pmwiki.php/Music/Gackt"], "non_media_links": ["/pmwiki/pmwiki.php/Main/ExactlyWhatItSaysOnTheTin", "/pmwiki/pmwiki.php/Main/ReclusiveArtist", "/pmwiki/pmwiki.php/Main/StreisandEffect", "/pmwiki/pmwiki.php/Main/FakeBand", "/pmwiki/pmwiki.php/Main/TheInvisibleBand", "/pmwiki/pmwiki.php/Main/SecretIdentity", "https://www.youtube.com/watch?v=L8s9dmuAKvU", "/pmwiki/pmwiki.php/Main/Supergroup", "/pmwiki/pmwiki.php/Main/CountryMusic", "/pmwiki/pmwiki.php/Main/RealLife", "/pmwiki/pmwiki.php/Main/SelfTitledAlbum", "/pmwiki/pmwiki.php/Main/FanNickname", "/pmwiki/pmwiki.php/Main/MindScrew", "/pmwiki/pmwiki.php/Main/TrueArtIsIncomprehensible", "/pmwiki/pmwiki.php/Main/PunnyName", "/pmwiki/pmwiki.php/Main/StageNames", "/pmwiki/pmwiki.php/Main/FakeBand", "/pmwiki/pmwiki.php/Main/BlackMetal", "https://www.youtube.com/watch?v=ECzouL0_zZ8", "/pmwiki/pmwiki.php/Main/TheInvisibleBand", "/pmwiki/pmwiki.php/Main/StageName", "http://youtu.be/XZDMw1ePPwk", "/pmwiki/pmwiki.php/Main/BlackMetal", "/pmwiki/pmwiki.php/Main/ReclusiveArtist", "/pmwiki/pmwiki.php/Main/BlackMetal", "/pmwiki/pmwiki.php/Main/OneHitWonder", "/pmwiki/pmwiki.php/Main/SongParody", "/pmwiki/pmwiki.php/Main/ZigZaggingTrope", "/pmwiki/pmwiki.php/Main/PoesLaw", "/pmwiki/pmwiki.php/Main/SecretIdentity", "/pmwiki/pmwiki.php/Main/CollectiveIdentity", "/pmwiki/pmwiki.php/Main/Bluegrass", "/pmwiki/pmwiki.php/Main/CoverVersion", "/pmwiki/pmwiki.php/Main/VisualKei"]}