{"title": "Spotting the Thread", "content": "\n• The climax of The Godfather Part II is a famous example. During a meeting in a Havana nightclub, Michael introduces Hyman Roth's lieutenant Johnny Ola to his brother Fredo, and Fredo casually says \"We haven't met\". A few moments later, while the guys are gushing over a lurid live show at the club, Fredo gets excited and accidentally mentions that he took Johnny to see the show a few days previously. Turns out that Fredo and Johnny have met before, but Fredo lied and claimed that they hadn't. From this tiny slip-up, Michael is able to figure out that Fredo has betrayed the family, and is working with Hyman Roth to bring him down .\n• In Inglourious Basterds, a Nazi notices an impostor by which fingers he holds up when he asks for three of something: he does \"index-middle-ring\" and not \"thumb-index-middle\", as Germans usually do it. An honest mistake usually, but this is Quentin Tarantino, so there's a bloodbath over it.\n• He already noticed the impostor by his unplaceable accent (the Nazi is an accent buff of Henry-Higgins-like extremes), the drinks gesture only confirmed his suspicions. In fact, he intentionally manipulates the spy into placing that order. (To be fair, the impostors accent isn't perfect - it definitely sounds off to a native speakers ears. There are regions where accents like these exist, but they use dialect-specific grammar and vocabulary; even if you can't pinpoint exactly what the problem is with his accent, you notice him trying too hard with pronunciation and the unease with German grammar)\n• The ending of Primal Fear has Martin Vail realize something is off when his client, Aaron, said \"I hope her neck is okay.\" The injury he refers to happened during an attack made by his split-personality, during which Aaron allegedly has no memory - and yet he apparently knew about where \"Roy\" had attacked the prosecutor\n• Zigzagged in Scream (1996): Billy Loomis, who has been suspected of being the killer for the entire movie, and even taken into custody at one point (although he was later cleared) is asked by his girlfriend Sidney who he called with his \"One Phone Call\" when he was arrested. He tells her that he called his father, but Sidney points out that the station called his father. Not thirty seconds later, he is killed, exonerating him from suspicion. However, it turns out that he actually was the killer (or one of them anyway) and had faked his death, and the thread Sidney had spotted earlier was probably correct.\n• This happens at near the end of Scream 4. After it seems like the latest Ghostface Sidney's cousin, Jill, got away with the perfect crime in murdering Sidney, and replacing her as the Final Girl , she makes a fatal mistake. She tells Dewey about her arm injury pointing out how it was the same injury Gale Weathers had. When Dewey mentioned this to his on-again, off-again life mate, she points out that Jill could only have gotten the same injury if she was the Ghostface who attacked her at the annual Stab party. Before they can expose Jill, Sidney fights and kills her after Jill found out she was still alive and tried to finish the job.\n• in Stalag 17, the Germans have planted a spy, Price, in a POW camp posing as an American flier from Cleveland. Sefton (William Holden) suspects the ruse, and in the climactic scene confronts Price: Sefton: When was Pearl Harbor, Price, or don't you know that? \n\nPrice: December 7th, '41. \n\nSefton: What time? \n\nPrice: 6:00. I was having dinner. \n\nSefton: 6:00 in Berlin. [To the other barrack members:] They were having lunch in Cleveland.\n• In Star Trek IV: The Voyage Home, Kirk and party are within seconds of successfully bluffing their way out of the hospital with the wounded Chekov in tow when this exchange occurs. Guard: How's the patient, Doctor? \n\nKirk: He's going to make it. \n\nGuard: He? They went in with a she. \n\nKirk: (to himself) One little mistake... [they run]\n• In Star Trek V: The Final Frontier, Kirk finds something off in \"God's\" demands for his followers: \"God\": This... starship... could it carry my... wisdom beyond the Barrier? \n\nSybok: It could! Yes! \n\n\"God\": Then I shall make use of this starship. \n\nSybok: It will be your chariot! \n\nKirk: Excuse me... \n\n\"God\": It will carry my power through every corner of Creation... \n\nKirk: Excuse me, I'd just like to ask a question... : This... starship... could it carry my... wisdom beyond the Barrier?: It could! Yes!: Then I shall make use of this starship.: It will be your chariot!: It will carry my power through every corner of Creation...: Excuse me, I'd just like to ask a question... What does God need with a Starship?\n• xXx:\n• Xander Cage spotting the fake diner hold-up and critiquing everyone in on it due to all the dangling threads he spotted within a minute: Xander: You know, you almost had me going there for a while. I was a bit groggy before, then I started noticing things. Like, you got a stockbroker over here, all dressed up, reading the Financial Times on a Sunday morning when the market's closed. Unlikely, but okay, I can go with that. I can even go with the stick-up man packing a cop-issue Beretta. But you want to know where you blew it? With her. [points to the waitress] My aunt was in the restaurant business all her life. There's no way in hell a career waitress comes to work in high heels. She'd have blisters the size of pancakes before lunch. And if she ain't real, then this whole thing ain't real. That's how I knew this bozo over here wouldn't get a shot off even if we waited till St. Patrick's Day. Because there's nothing but blanks in these guns. Oh, and no offense, but their performances were terrible.\n• Subverted in the next scene when Xander assumes they are still playing with him after dumping him in Columbian drug cartel territory. He figures it out just before Danny Trejo goes to work on him with a machete.\n• In the sequel, Xander is at a market square when a man comes up, strikes up a talk and leaves a bag behind. Xander looks in to find a ticking bomb seconds before a SWAT team runs in to arrest him. Rolling his eyes, Xander takes down a cop and spins around, firing his machine gun, showing it's full of blanks. He relates how he knew it was a test: A teen is listening to expensive headphones rather than the cheaper knock-offs; a woman is running to catch a bus that won't leave for two hours; a \"cop\" is paying for a drink with foreign currency; and the old man struck up a talk somehow knowing Xander spoke English.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/SpottingTheThread", "media_links": ["/pmwiki/pmwiki.php/Film/AttackOfTheKillerTomatoes", "/pmwiki/pmwiki.php/Film/ABeautifulMind", "/pmwiki/pmwiki.php/Film/BigEyes", "/pmwiki/pmwiki.php/Film/BladeRunner", "/pmwiki/pmwiki.php/Film/DeltaForce2TheColombianConnection", "/pmwiki/pmwiki.php/Film/DieHardWithAVengeance", "/pmwiki/pmwiki.php/Film/DoubleIndemnity", "/pmwiki/pmwiki.php/Film/Dredd", "/pmwiki/pmwiki.php/Film/GhostShip", "/pmwiki/pmwiki.php/Film/TheGodfatherPartII", "/pmwiki/pmwiki.php/Film/Godzilla2014", "/pmwiki/pmwiki.php/Film/GodzillaVSMechagodzilla", "/pmwiki/pmwiki.php/Film/TheGreatEscape", "/pmwiki/pmwiki.php/Film/HangmenAlsoDie", "/pmwiki/pmwiki.php/Film/HarryPotter", "/pmwiki/pmwiki.php/Film/HarryPotterAndTheChamberOfSecrets", "/pmwiki/pmwiki.php/Film/HarryPotterAndTheGobletOfFire", "/pmwiki/pmwiki.php/Film/TheHatefulEight", "/pmwiki/pmwiki.php/Film/HotPursuit", "/pmwiki/pmwiki.php/Film/Inception", "/pmwiki/pmwiki.php/Film/InglouriousBasterds", "/pmwiki/pmwiki.php/Creator/QuentinTarantino", "/pmwiki/pmwiki.php/Film/TheItalianJob2003", "/pmwiki/pmwiki.php/Film/TheLastWitchHunter", "/pmwiki/pmwiki.php/Franchise/MarvelCinematicUniverse", "/pmwiki/pmwiki.php/Film/CaptainAmericaTheFirstAvenger", "/pmwiki/pmwiki.php/Film/CaptainAmericaTheWinterSoldier", "/pmwiki/pmwiki.php/Film/CaptainMarvel2019", "/pmwiki/pmwiki.php/Film/MissionImpossibleGhostProtocol", "/pmwiki/pmwiki.php/Film/OurManFlint", "/pmwiki/pmwiki.php/Film/Paycheck", "/pmwiki/pmwiki.php/Film/PrimalFear", "/pmwiki/pmwiki.php/Film/Scream1996", "/pmwiki/pmwiki.php/Film/Scream4", "/pmwiki/pmwiki.php/Film/SherlockHolmesAGameOfShadows", "/pmwiki/pmwiki.php/Film/Stalag17", "/pmwiki/pmwiki.php/Creator/WilliamHolden", "/pmwiki/pmwiki.php/Film/StarTrekIVTheVoyageHome", "/pmwiki/pmwiki.php/Film/StarTrekVTheFinalFrontier", "/pmwiki/pmwiki.php/Film/SuckerPunch", "/pmwiki/pmwiki.php/Film/JamesBond", "/pmwiki/pmwiki.php/Film/TomorrowNeverDies", "/pmwiki/pmwiki.php/Film/TheTakingOfPelhamOneTwoThree", "/pmwiki/pmwiki.php/Film/TransformersAgeOfExtinction", "/pmwiki/pmwiki.php/Film/TheTrumanShow", "/pmwiki/pmwiki.php/Film/Truth2015", "/pmwiki/pmwiki.php/Film/WarCraft2016", "/pmwiki/pmwiki.php/Film/WildWildWest", "/pmwiki/pmwiki.php/Film/Wishmaster", "/pmwiki/pmwiki.php/Film/X2XMenUnited", "/pmwiki/pmwiki.php/Film/XXx", "/pmwiki/pmwiki.php/Film/XxXReturnofXanderCage", "/pmwiki/pmwiki.php/Film/YouOnlyLiveTwice"], "non_media_links": ["/pmwiki/pmwiki.php/Main/PullTheThread", "/pmwiki/pmwiki.php/Main/LackOfEmpathy", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/ChekhovsGun", "/pmwiki/pmwiki.php/Main/CowboyCop", "/pmwiki/pmwiki.php/Main/TruthInTelevision", "/pmwiki/pmwiki.php/Main/SubvertedTrope", "/pmwiki/pmwiki.php/Main/Retirony", "/pmwiki/pmwiki.php/Main/TruthInTelevision", "/pmwiki/pmwiki.php/Main/BlackMagic", "/pmwiki/pmwiki.php/Main/GlamourFailure", "/pmwiki/pmwiki.php/Main/Shapeshifting", "/pmwiki/pmwiki.php/Main/INeverSaidItWasPoison", "/pmwiki/pmwiki.php/Main/OnePhoneCall", "/pmwiki/pmwiki.php/Main/FinalGirl", "/pmwiki/pmwiki.php/Main/PullingTheThread", "/pmwiki/pmwiki.php/Main/ArmorPiercingQuestion", "/pmwiki/pmwiki.php/Main/TheReveal", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/OhCrap", "/pmwiki/pmwiki.php/Main/INeverToldYouMyName", "/pmwiki/pmwiki.php/Main/BreakingTheFourthWall", "/pmwiki/pmwiki.php/Main/LyingFingerCross", "/pmwiki/pmwiki.php/Main/ObfuscatingDisability", "/pmwiki/pmwiki.php/Main/CuttingCorners", "/pmwiki/pmwiki.php/Main/SayingTooMuch"]}