{"title": "Description Porn", "content": "\n• In Aliens, Private Hudson really gets into his description of his squad's armament: Check it out. Independently targeting particle-beam phalanx. WHAP! Fry half a city with this puppy. We got tactical smart missiles, phase plasma pulse rifles, RPGs. We got sonic, electronic ball breakers! We got nukes, we got knives, we got sharp sticks.\n• Later on, there's also this exchange: Ripley: Lieutenant, what do those pulse rifles fire?\n• Ash in Army of Darkness uses this for this boomstick: \"This... is my boomstick! The twelve-gauge double-barreled Remington. S-Mart's top of the line. You can find this in the sporting goods department. That's right, this sweet baby was made in Grand Rapids, Michigan. Retails for about a hundred and nine, ninety five. It's got a walnut stock, cobalt blue steel, and a hair trigger. That's right. So shop smart. Shop S-Mart. You got that?\n• The Blues Brothers, talking about the Bluesmobile: Jake: Car's got a lot of pickup. \n\nElwood: It's got a cop motor, a 440 cubic inch plant, it's got cop tires, cop suspensions, cop shocks. It's a model made before catalytic converters so it'll run good on regular gas. What do you say, is it the new Bluesmobile or what? \n\nJake: Fix the cigarette lighter.\n• Blue Thunder: Sgt. Short: This ship is equipped with a forward-mounted, twenty-millimeter electric cannon. Its six barrels are capable of firing four thousand rounds of ammunition per minute. And that, gentlemen, is one hell of a shit-storm in anybody's language!\n• Dirty Harry: Harry Callahan: I know what you're thinking, punk. You're thinking 'Did he fire six shots or only five?' Now, to tell you the truth, I forgot myself in all this excitement. But being this is a .44 Magnum, the most powerful handgun in the world and will blow your head clean off, you've gotta ask yourself a question: \"Do I feel lucky?\" Well, do ya, punk?\n• Ferris Bueller's Day Off: Cameron: 1958 Ferrari 250 GTS California. Less than a hundred were made. It has a market value of $265,000. My father spent three years restoring it. It is joy, it is his love, it is his passion.\n• It is his fault he didn't lock the garage.\n• From The Fifth Element: Zorg: Voila, the ZF-1. [activates a ZF-1 and holds it] It's light; handle's adjustable for easy carrying; good for righties and lefties; breaks down into four parts; undetectable by X-ray; ideal for quick discreet interventions. A word on firepower. Titanium recharger; 3000-round clip with bursts of 3 to 300. With the replay button, another Zorg invention, it's even easier. [lights reveal a mannequin in police gear] One shot...[shoots mannequin]...and replay sends every following shot to the same location. [turns around, shooting in the direction of the Mangalores; Voila, the ZF-1. [activates a ZF-1 and holds it] It's light; handle's adjustable for easy carrying; good for righties and lefties; breaks down into four parts; undetectable by X-ray; ideal for quick discreet interventions. A word on firepower. Titanium recharger; 3000-round clip with bursts of 3 to 300. With the replay button, another Zorg invention, it's even easier. [lights reveal a mannequin in police gear] One shot...[shoots mannequin]...and replay sends every following shot to the same location. [turns around, shooting in the direction of the Mangalores; bullets curve their trajectory and hit the mannequin instead ] And to finish the job, all the Zorg oldies but goldies. [fires every weapon at the mannequin as he mentions them] Rocket launcher...arrow launcher with exploding or poisonous gas heads, very practical...our famous net launcher...the always-efficient flamethrower. My favorite. [winks at the Mangalores] And for the grand finale, the all-new 'Ice-cube System'. [fires a cloud of liquid nitrogen which freezes the remains of the mannequin. Mangalores applaud politely for the carnage.]\n• Indiana Jones and the Last Crusade. Invoked when the local sultan, unimpressed with the Nazis' monetary bribes, asks for their Rolls Royce. Sultan: \"Rolls-Royce Phantom II. 4.3 litre, 30 horsepower, six cylinder engine, with Stromberg downdraft carburetor. Can go from zero to 100 kilometres an hour in 12.5 seconds. And I even like the color.\" \n\nDonovan: \"The keys are in the ignition, your Highness.\"\n• Iron Man 2, with an I Call It \"Vera\" thrown in for good measure: Justin Hammer: \"These are the Cubans, baby. This is the Cohibas, the Montecristos. This is a kinetic-kill, side-winder vehicle with a secondary cyclotrimethylenetrinitramine RDX burst. It's capable of busting a bunker under the bunker you just busted. If it were any smarter, it'd write a book, a book that would make Ulysses look like it was written in crayon. It would read it to you. This is my Eiffel Tower. This is my Rachmaninoff's Third. My Pieta. It's completely elegant, it's bafflingly beautiful, and it's capable of reducing the population of any standing structure to zero. I call it \"The Ex-Wife.\"\n• It should be noted, the thing he describes doesn't work. At all.\n• Lord of War is full of this. Yuri Orlov: \"Of all the weapons in the vast soviet arsenal, nothing was more profitable than Avtomat Kalashnikova model of 1947. More commonly known as the AK-47, or Kalashnikov. It's the world's most popular assault rifle. A weapon all fighters love. An elegantly simple 9 pound amalgamation of forged steel and plywood. It doesn't break, jam, or overheat. It'll shoot whether it's covered in mud or filled with sand. It's so easy, even a child can use it - : \"Of all the weapons in the vast soviet arsenal, nothing was more profitable than Avtomat Kalashnikova model of 1947. More commonly known as the AK-47, or Kalashnikov. It's the world's most popular assault rifle. A weapon all fighters love. An elegantly simple 9 pound amalgamation of forged steel and plywood. It doesn't break, jam, or overheat. It'll shoot whether it's covered in mud or filled with sand. It's so easy, even a child can use it - and they do. The Soviets put the gun on a coin. Mozambique put it on their flag. Since the end of the Cold War, the Kalashnikov has become the Russian people's greatest export.\"\n• Occurs in True Lies with a MIRV missile, only after Harry attempts Obfuscating Stupidity by calling said missile an espresso maker and a water heater. Harry: \"This is a Soviet MIRV-Six from an SS-22N launch vehicle. The warhead contains 14.5 kilos of enriched uranium with a plutonium trigger. The nominal yield is 10 kilotons.\"\n• Wayne's World: Wayne: There it is — Excalibur. \n\nCassandra: Wow! '64 Fender Stratocaster in classic white with triple single coil pickups and a whammy bar. \n\nWayne: Pre-CBS Fender corporate buy-out. \n\nCassandra: I'd raise the bridge, file down the nut, and take the buzz out of the low E. \n\nWayne: God, I love this woman.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/DescriptionPorn", "media_links": ["/pmwiki/pmwiki.php/Film/Aliens", "/pmwiki/pmwiki.php/Film/ArmyOfDarkness", "/pmwiki/pmwiki.php/Film/BackToTheFuturePartIII", "/pmwiki/pmwiki.php/Film/BigGame", "/pmwiki/pmwiki.php/Film/DeathRace", "/pmwiki/pmwiki.php/Film/TheBluesBrothers", "/pmwiki/pmwiki.php/Film/BlueThunder", "/pmwiki/pmwiki.php/Film/ConAir", "/pmwiki/pmwiki.php/Film/DirtyHarry", "/pmwiki/pmwiki.php/Film/FerrisBuellersDayOff", "/pmwiki/pmwiki.php/Film/TheFifthElement", "/pmwiki/pmwiki.php/Film/GoldenEye", "/pmwiki/pmwiki.php/Film/JamesBond", "/pmwiki/pmwiki.php/Film/IndianaJonesAndTheLastCrusade", "/pmwiki/pmwiki.php/Film/IronMan2", "/pmwiki/pmwiki.php/Film/LordOfWar", "/pmwiki/pmwiki.php/Film/MissionImpossible", "/pmwiki/pmwiki.php/Film/MoulinRouge", "/pmwiki/pmwiki.php/Film/PhoneBooth", "/pmwiki/pmwiki.php/Film/TrueLies", "/pmwiki/pmwiki.php/Film/WaynesWorld", "/pmwiki/pmwiki.php/Film/XMenFirstClass"], "non_media_links": ["/pmwiki/pmwiki.php/Main/BadassCrew", "/pmwiki/pmwiki.php/Main/NowBuyTheMerchandise", "/pmwiki/pmwiki.php/Main/BlatantLies", "/pmwiki/pmwiki.php/Main/OhCrap", "/pmwiki/pmwiki.php/Main/Thememobile", "/pmwiki/pmwiki.php/Main/Roboteching", "/pmwiki/pmwiki.php/Main/BadassBoast", "/pmwiki/pmwiki.php/Main/ICallItVera", "/pmwiki/pmwiki.php/Main/ChildSoldiers", "/pmwiki/pmwiki.php/Main/ObfuscatingStupidity"]}