{"title": "Took a Level in Badass", "content": "So, you're flipping channels looking for something to watch and you come across a battle scene in a familiar show. One character in particular is making a very good showing, doing at least as much as the main character to save the day. But, who is this mysterious person in the Badass Longcoat? Did you miss the episode where he was introduced? Why the nagging feeling of familiarity? Then it hits—you know this kid. It's just that last time you saw him, he was a nebbishy wisecracker with the constitution of a glass-jawed squirrel. What happened to transform him so completely? Simple: last time he leveled up, he took a level in badass.\n\nSince this is about Character Development, that means it doesn't genuinely apply when comparing a character in different adaptations. See Adaptational Badass.\n\nIf the change is a result of a Face\u0096Heel Turn, see Superpowered Evil Side and Redemption Demotion. If it's a result of a Heel\u0096Face Turn, then it's a case of Redemption Promotion. If the change is due to time travel, see Future Badass. If it is the result of finding a powerful object, see Amulet of Concentrated Awesome. This can also happen because Prisons Are Gymnasiums.\n\nThere is also the Super Hero Origin, where the first story gives some explanation for why they became the badass hero.\n\nThe reference comes from roleplaying, where it's sometimes possible to \"take a level\" in a completely different class. For instance: a level ten Fighter could take a level in Wizard, therefore being both a level ten Fighter and a level one Wizard. The joke is presumably that if badass was a class and you could take a level in it, you would thereby become badass where you weren't before. Actual RPG classes are, of course, supposed to be balanced so that literally taking one level in something doesn't normally make you greatly more powerful. Blending this with modern gaming, however, one can achieve what is known as \"badass grinding\", where one takes multiple levels in badass.\n\nIf they were already badass to begin with and notched it Up to Eleven by imbuing the previously unpowered character with superpowers, it's Empowered Badass Normal.\n\nCompare Obfuscating Stupidity, Let's Get Dangerous!, Cowardly Lion, and Not-So-Harmless Villain, where actually competent characters who have been hiding their powers finally reveal their abilities. Xenafication is when this happens to The Chick. Magikarp Power is when this is achieved through lots of Level Grinding. Look What I Can Do Now! is when a character demonstrates this after an extended absence. From Nobody to Nightmare is the Evil Counterpart of this trope.\n\nAdrenaline Makeover is when the love interest does this, along with becoming much more attractive. Also see Misfit Mobilization Moment, when a group of losers collectively take a level in badass. Related to Dumbass No More, when the character gains a level in intelligence.\n\nBadass Decay is for the subjective situation where a character seems less badass than they were due to Characterization Marches On. That is not to be confused with a situation where a character becomes weaker as a plot point, as then it's simply an Inversion of this trope.\n\nNot to be confused with Took a Level in Jerkass, where a normally nice person becomes a bad seed. Also not to be confused with taking a British A-Level exam in Badassery (or Badarsery), or taking any kind of level test leading to an official promotion in (or formal acknowledgment of) Badassery.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/TookALevelInBadAss?from=Main.TakesALevelInBadAss", "media_links": ["/pmwiki/pmwiki.php/ComicBook/FantasticFour", "/pmwiki/pmwiki.php/ComicBook/InvisibleWoman", "/pmwiki/pmwiki.php/VideoGame/PlayStationAllStarsBattleRoyale"], "non_media_links": ["/pmwiki/pmwiki.php/Main/CharacterDevelopment", "/pmwiki/pmwiki.php/WebVideo/TwoBestFriendsPlay", "/pmwiki/pmwiki.php/Main/BadassLongcoat", "/pmwiki/pmwiki.php/Main/LevelUp", "/pmwiki/pmwiki.php/Main/TitleDrop", "/pmwiki/pmwiki.php/Main/CharacterDevelopment", "/pmwiki/pmwiki.php/Main/AdaptationalBadass", "/pmwiki/pmwiki.php/Main/FaceHeelTurn", "/pmwiki/pmwiki.php/Main/SuperpoweredEvilSide", "/pmwiki/pmwiki.php/Main/RedemptionDemotion", "/pmwiki/pmwiki.php/Main/HeelFaceTurn", "/pmwiki/pmwiki.php/Main/RedemptionPromotion", "/pmwiki/pmwiki.php/Main/FutureBadass", "/pmwiki/pmwiki.php/Main/AmuletOfConcentratedAwesome", "/pmwiki/pmwiki.php/Main/PrisonsAreGymnasiums", "/pmwiki/pmwiki.php/Main/SuperHeroOrigin", "/pmwiki/pmwiki.php/Main/DareToBeBadass", "/pmwiki/pmwiki.php/Main/SerialEscalation", "/pmwiki/pmwiki.php/Main/UpToEleven", "/pmwiki/pmwiki.php/Main/BadassNormal", "/pmwiki/pmwiki.php/Main/EmpoweredBadassNormal", "/pmwiki/pmwiki.php/Main/ObfuscatingStupidity", "/pmwiki/pmwiki.php/Main/LetsGetDangerous", "/pmwiki/pmwiki.php/Main/CowardlyLion", "/pmwiki/pmwiki.php/Main/NotSoHarmlessVillain", "/pmwiki/pmwiki.php/Main/Xenafication", "/pmwiki/pmwiki.php/Main/TheChick", "/pmwiki/pmwiki.php/Main/MagikarpPower", "/pmwiki/pmwiki.php/Main/LevelGrinding", "/pmwiki/pmwiki.php/Main/LookWhatICanDoNow", "/pmwiki/pmwiki.php/Main/FromNobodyToNightmare", "/pmwiki/pmwiki.php/Main/EvilCounterpart", "/pmwiki/pmwiki.php/Main/AdrenalineMakeover", "/pmwiki/pmwiki.php/Main/MisfitMobilizationMoment", "/pmwiki/pmwiki.php/Main/DumbassNoMore", "/pmwiki/pmwiki.php/Main/BadassDecay", "/pmwiki/pmwiki.php/Main/CharacterizationMarchesOn", "/pmwiki/pmwiki.php/Main/Inversion", "/pmwiki/pmwiki.php/Main/TookALevelInJerkass", "/pmwiki/pmwiki.php/TookALevelInBadass/AnimeAndManga", "/pmwiki/pmwiki.php/TookALevelInBadass/CardGames", "/pmwiki/pmwiki.php/TookALevelInBadass/ComicBooks", "/pmwiki/pmwiki.php/TookALevelInBadass/FanWorks", "/pmwiki/pmwiki.php/TookALevelInBadass/AnimatedFilms", "/pmwiki/pmwiki.php/TookALevelInBadass/LiveActionFilms", "/pmwiki/pmwiki.php/TookALevelInBadass/Literature", "/pmwiki/pmwiki.php/TookALevelInBadass/LiveActionTV", "/pmwiki/pmwiki.php/TookALevelInBadass/ProfessionalWrestling", "/pmwiki/pmwiki.php/TookALevelInBadass/TabletopGames", "/pmwiki/pmwiki.php/TookALevelInBadass/Theatre", "/pmwiki/pmwiki.php/TookALevelInBadass/VideoGames", "/pmwiki/pmwiki.php/TookALevelInBadass/Webcomics", "/pmwiki/pmwiki.php/TookALevelInBadass/WebOriginal", "/pmwiki/pmwiki.php/TookALevelInBadass/WesternAnimation", "/pmwiki/pmwiki.php/TookALevelInBadass/Other", "/pmwiki/pmwiki.php/TookALevelInBadass/RealLife"]}