{"title": "Voluntary Vassal", "content": "The standard mode of territorial expansion of The Empire is steamrolling all opposition in the targeted neighbor land and claiming it as its new vassal state-slash-province. However, some places and people prove too troublesome to conquer and the empire leaves them alone. And then some of them decide to swear allegiance to The Emperor, anyway, for the benefits that a large centralized state brings with it — minus all the inconveniences of being forcefully subjugated by a foreign invader.\n\nCharacters coming from such a region commonly enjoy privileges and personal freedoms that the rest of The Empire's citizens (except the metropolitans) no longer have.\n\nCompare/contrast Hegemonic Empire, where The Empire doesn't expand through conquest, but instead incites other states to voluntarily become its vassals by peaceful means (in effect, making this trope a norm instead of exception). Compare also Puppet State, Les Collaborateurs, and The Quisling. Vichy Earth may or may not be an example as well.\n• Several small island nations in the Pacific have entered into such associations with other countries, mostly the US (e.g. Micronesia), Australia (e.g. Nauru) and New Zealand (e.g. the Cook Islands). While the precise details are usually sui generis, they often entail a common defense taken care of by the large nation and somewhat laxer immigration rules.\n• During the Spanish conquest of Mexico several tributaries of the Aztec Empire sided with the Spaniards, converted to Catholicism, and became willing subjects of Spain. Figuring that it would be better than continuing to provide the Aztecs with Human Sacrifices.\n• In the 13th century a few of Iceland's chiefs became vassals of the King of Norway, then they started a 44-year civil war that ended with the entire island becoming vassal to Norway.\n• The Falkland Islands are a voluntary colony, even though this term is now not applied any more. In several referenda, overwhelming majorities of the inhabitants of the islands have voted to keep the status quo (being governed by Great Britain with some limited home rule) over any other alternative, including both independence and being annexed by Argentina. The fact that the islands have no economic activity besides tourism sheep and fisheries Oil was discovered recently, but as of 2016 no major drilling has taken place and Argentina tried to conquer the islands - while governed by a brutal military dictatorship - may help in keeping the Kelpers loyal to the crown.\n• Some US states were (or at least claimed to be) sovereign nations before becoming another star on the American flag.\n• The most well known example is Texas, which broke away from Mexico and ultimately joined the US.\n• Vermont also spent a short time as a self proclaimed independent Republic.\n• Whether or not the weird limbo state of the current US territories, Puerto Rico being the most widely known of them, is entirely voluntary on their part is an interesting question best discussed elsewhere, but the fact of the matter is that some votes have been held on this, at least in Puerto Rico. There being more than two options, it is not all that easy to say what \"the people\" want. That being said, none of the referenda have been so conclusive as to provide a definitive basis for changing the status quo. They also show that of the various options, outright independence has for decades been one of the less-favored options (never getting more than about 10-15% in the polls) even though the federal government is unlikely to deny PR its independence if its people express a clear intent to take it. This means that for the foreseeable future, whatever situation the Puerto Rican people choose for themselves, it more or less falls into this trope for lack of any other classification.\n• The Commonwealth realms are the closest major 21st century countries come to feudalism. Basically Australia, Canada, New Zealand and a couple of others have a monarch an ocean away as their head of state who comes to visit only once every couple of years and they are apparently quite happy with that. Some countries have even tried joining the Commonwealth (though not the Commonwealth realms, a country can be member of the Commonwealth without having the English monarch as head of state) despite never having been a British/English/Scottish colony. The \"protection\" thing mentioned above may play a role in this as may \"soft power\" and development aid.\n• The Costa Rican province of Guanacaste invokes this trope in its coat of arms where the official motto reads \"De la patria por nuestra voluntad\" - of the fatherland by our [own] will. This is due to Guanacaste being disputed in the 19th century between the emerging nations of Costa Rica and Nicaragua that arose from the rubble of the United Provinces of Central America. Ultimately Guanacaste ended up with Costa Rica and the Rio San Juan, which separates the two countries in the East was awarded to Nicaragua in its entirety. This of course solved all border disputes between the two countries... Nah, just kidding. Since 2000 alone the two countries have clashed over a road, a few cut down trees, an unpopulated island that google maps claimed to be Nicaraguan before claiming it was Costa Rican and Nicaraguan President Ortega even questioned whether Guanacaste should belong to Costa Rica. Given that Costa Rica is the wealthiest nation in Central America and has dramatically less crime than its neighbors, the people of Guanacaste unsurprisingly prefer their current status.\n• If you subscribe to the belief that the European Union is a Hegemonic Empire (which would then raise the question who the hegemon is, but let's not get sidetracked), each member would be a Voluntary Vassal, because they joined entirely voluntarily and as the referendum now known as \"Brexit\" has shown, there is an open door if anyone wants to leave. The complications regarding \"Brexit\" are exclusively a result of internal disagreement among the British people about whether they actually should go through with leaving the EU, whether they should wait until after a trade deal with the EU has already been negotiated, and what sort of deal would actually be acceptable. The EU has placed no obstacles in the way of the UK's departure, and in fact seems to be getting frustrated by the UK's inability to decide whether they're actually leaving. Playing the trope even straighter are a handful of non-members of the EU (Iceland, Switzerland and Norway mostly) who of their own free choosing adopt a lot of EU legislation in which they have no say in exchange for free trade and open borders as well as some considerations on the fields of fishery (Norway and Iceland) and/or foreign policy (Switzerland).\n• Before World War II, Nazi Germany invaded and annexed Austria in a process known as Anschluss (German for \"joining\"). In a subsequent plebiscite, the vast majority of Austrians voted in favor of Anschluss. This was undoubtedly due in large part to pressure on the populace by Those Wacky Nazis, but many Austrians did genuinely support union with Germany (though how many is still a matter of debate).\n• Much of The Raj consisted of \"princely states\" led by native rulers (with titles like nawab, nizam, sultan, raja, maharaja, etc.) who joined The British Empire in exchange for protection and cementation of their local authority.\n• Quite used during the unification of Italy, both during the Wars of Italian Independence and later: and have this kind of relationship with Italy, though for vastly different reasons:\n• After the Second War, the Expedition of the Thousands, the Third War (actually the southern front of the Austro-Prussian War of 1866) and the capture of Rome, the various territories occupied first by the Kingdom of Sardinia and then the Kingdom of Italy voted for unification.\n• San Marino was not occupied by the Kingdom of Sardinia during the Expedition of the Thousands, partly because it was out of way and partly due offering sanctuary to the leaders of the unification movement. After most of the rest of the peninsula became the Kingdom of Italy, San Marino signed a treaty of friendship that guaranteed its independence and established important commercial relationship but also put San Marino in a situation of effective subordination (most notably, the adoption of EU-related legislation in the wake of Italy doing the same and the use of currencies that are effectively the same of Italy (first the Lira Sammarinese, that was minted in Italy, pegged to the Italian Lira and was legal tender in Italy and Vatican too just as the Italian and Vatican Lira were in San Marino, and then the Euro).\n• Vatican City's relation to Italy is complicated, but the treaties between the nations, Vatican City being effectively a largish neighbourhood of Rome and Italy needing an independent state for The Pope makes it this. Both countries would prefer a different situation, but this is the best they can hope for and are in no hurry to change things. Too many examples to count, really. Prior to the Thirty Years' War , which established the \"Westphalian theory of sovereignty\", most rulers were at least de jure in some sort of vassal-overlord relationship to other rulers and preeminence in such relationships was immensely important, on the other hand, those relations usually included at least nominal \"protection\" and for some smaller territories it was highly desirable to become the vassal of a powerful faraway lord in order to be left alone by less powerful local lords with designs on conquering them. The mess this created is one of the reasons why the Holy Roman Empire had the name it did, as it was basically the medieval equivalent of Calling your People's Republic of Tyranny the Democratic People's Democratic Shiny Happy People's Republic of the People today.", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/VoluntaryVassal", "media_links": ["/pmwiki/pmwiki.php/Literature/ASongOfIceAndFire", "/pmwiki/pmwiki.php/LightNovel/CrestOfTheStars", "/pmwiki/pmwiki.php/Anime/Overlord2012", "/pmwiki/pmwiki.php/Anime/SpaceBattleshipYamato", "/pmwiki/pmwiki.php/Franchise/StarTrek", "/pmwiki/pmwiki.php/Franchise/MassEffect", "/pmwiki/pmwiki.php/Literature/ASongOfIceAndFire", "/pmwiki/pmwiki.php/Literature/Gor", "/pmwiki/pmwiki.php/Literature/ReflectionsOfEterna", "/pmwiki/pmwiki.php/Literature/TheWitchlands", "/pmwiki/pmwiki.php/Literature/TheElenium", "/pmwiki/pmwiki.php/Series/StarTrekDeepSpaceNine", "/pmwiki/pmwiki.php/Series/GameOfThrones", "/pmwiki/pmwiki.php/TabletopGame/Warhammer", "/pmwiki/pmwiki.php/VideoGame/StarWarsTheOldRepublic", "/pmwiki/pmwiki.php/Franchise/TheElderScrolls", "/pmwiki/pmwiki.php/VideoGame/TheElderScrollsAdventuresRedguard", "/pmwiki/pmwiki.php/VideoGame/MountAndBlade", "/pmwiki/pmwiki.php/VideoGame/CrusaderKings", "/pmwiki/pmwiki.php/VideoGame/EuropaUniversalis", "/pmwiki/pmwiki.php/VideoGame/SwordOfTheStars", "/pmwiki/pmwiki.php/VideoGame/Civilization", "/pmwiki/pmwiki.php/VideoGame/Stellaris", "/pmwiki/pmwiki.php/Franchise/MassEffect"], "non_media_links": ["/pmwiki/pmwiki.php/Main/TheEmpire", "/pmwiki/pmwiki.php/Main/TheEmperor", "/pmwiki/pmwiki.php/Main/WhatTheRomansHaveDoneForUs", "/pmwiki/pmwiki.php/Main/TheEmpire", "/pmwiki/pmwiki.php/Main/HegemonicEmpire", "/pmwiki/pmwiki.php/Main/TheEmpire", "/pmwiki/pmwiki.php/Main/PuppetState", "/pmwiki/pmwiki.php/Main/LesCollaborateurs", "/pmwiki/pmwiki.php/Main/TheQuisling", "/pmwiki/pmwiki.php/Main/VichyEarth", "/pmwiki/pmwiki.php/Fanfic/RainbowDoubleDashsLunaverse", "/pmwiki/pmwiki.php/Fanfic/EarthsAlienHistory", "/pmwiki/pmwiki.php/Fanfic/AThingOfVikings", "/pmwiki/pmwiki.php/Characters/ASongOfIceAndFireDorneHouses", "/pmwiki/pmwiki.php/Main/NonindicativeName", "/pmwiki/pmwiki.php/Main/FantasyCounterpartCulture", "/pmwiki/pmwiki.php/Main/ProudWarriorRaceGuy", "/pmwiki/pmwiki.php/Main/HonorBeforeReason", "/pmwiki/pmwiki.php/Main/TheEmpire", "/pmwiki/pmwiki.php/Main/TheEmperor", "/pmwiki/pmwiki.php/Main/FantasticRacism", "/pmwiki/pmwiki.php/Main/PhysicalGod", "/pmwiki/pmwiki.php/Main/ArtifactOfDoom", "/pmwiki/pmwiki.php/Main/BigBad", "/pmwiki/pmwiki.php/Main/DeityOfHumanOrigin", "/pmwiki/pmwiki.php/Main/HumongousMecha", "/pmwiki/pmwiki.php/Main/TheClan", "/pmwiki/pmwiki.php/Main/PuppetKing", "/pmwiki/pmwiki.php/Main/CorruptChurch", "/pmwiki/pmwiki.php/Main/ActionAdventure", "/pmwiki/pmwiki.php/Main/AntiHumanAlliance", "/pmwiki/pmwiki.php/Main/ANaziByAnyOtherName", "/pmwiki/pmwiki.php/Main/BlatantLies", "/pmwiki/pmwiki.php/Main/WeirdMoon", "/pmwiki/pmwiki.php/Main/GunboatDiplomacy", "/pmwiki/pmwiki.php/Main/TechnologyUplift", "/pmwiki/pmwiki.php/Main/PretextForWar", "/pmwiki/pmwiki.php/Main/SpaceRomans", "/pmwiki/pmwiki.php/Main/ProudMerchantRace", "/pmwiki/pmwiki.php/Main/BadassArmy", "/pmwiki/pmwiki.php/Main/HumanSacrifice", "/pmwiki/pmwiki.php/UsefulNotes/TheFalklandIslands", "/pmwiki/pmwiki.php/Main/MoneyDearBoy", "https://commons.wikimedia.org/wiki/File:Escudo_de_la_Provincia_de_Guanacaste.svg", "/pmwiki/pmwiki.php/UsefulNotes/EuropeanUnion", "/pmwiki/pmwiki.php/Main/HegemonicEmpire", "/pmwiki/pmwiki.php/Main/VoluntaryVassal", "/pmwiki/pmwiki.php/UsefulNotes/WorldWarII", "/pmwiki/pmwiki.php/UsefulNotes/NaziGermany", "/pmwiki/pmwiki.php/UsefulNotes/Austria", "/pmwiki/pmwiki.php/UsefulNotes/GermanLanguage", "/pmwiki/pmwiki.php/Main/ThoseWackyNazis", "/pmwiki/pmwiki.php/UsefulNotes/Germany", "/pmwiki/pmwiki.php/UsefulNotes/TheRaj", "/pmwiki/pmwiki.php/Main/LesCollaborateurs", "/pmwiki/pmwiki.php/UsefulNotes/TheBritishEmpire", "/pmwiki/pmwiki.php/UsefulNotes/WarsOfItalianIndependence", "/pmwiki/pmwiki.php/UsefulNotes/AustroPrussianWar", "/pmwiki/pmwiki.php/UsefulNotes/SanMarino", "/pmwiki/pmwiki.php/UsefulNotes/VaticanCity", "/pmwiki/pmwiki.php/UsefulNotes/ThePope", "/pmwiki/pmwiki.php/UsefulNotes/ThirtyYearsWar", "/pmwiki/pmwiki.php/Main/PeoplesRepublicOfTyranny"]}